[{"theme":"architecture","themeUrl":"https://www.lego.com/en-us/themes/architecture","productUrl":"https://www.lego.com/en-us/product/empire-state-building-21046","description":"Elevate your LEGO® building skills to a higher level with this LEGO Architecture 21046 Empire State Building set. Located at the heart of New York City, the Empire State Building towers above the surrounding skyscrapers. Construction of the building began on March 17, 1930 and just one year and 45 days later, on May 1, 1931 it was opened for business. The height of the structure was increased in 1950 with the addition of the iconic antenna tower. At 21” (55cm), the tallest LEGO Architecture model to date (July 2019), this highly detailed, collectible replica accurately recreates the symmetrical lines of the building’s 4 curtain wall facades and art deco antenna tower. The tiled baseplate depicts Fifth Avenue and surrounding roads complete with yellow cabs, and the model is finished with a decorative nameplate. This 360°-displayable model delivers an interesting and rewarding building experience and makes a truly iconic centerpiece for the home and office. It has been developed for all with an interest in travel, architectural culture, history and design.\n\nLEGO® Architecture interpretation of the real-world New York landmark, the Empire State Building.\nThis 360°-displayable model features 4 highly detailed facades, a silver-colored antenna tower and a tiled baseplate depicting Fifth Avenue and the surrounding roads, complete with 6 yellow cabs.\nAt 21” (55cm) high, this Empire State Building model is the tallest LEGO® Architecture model to date (July 2019).\nThe included booklet contains information about the designer, architecture and history of the structure, as well as historical facts about the Empire State Building and its architectural heritage. (English language only. Other languages available for download at LEGO.com/architecture).\nIncludes a decorative Empire State Building nameplate.\nLEGO® Architecture celebrates the world of architecture through the medium of the LEGO brick, and is developed for all with an interest in travel, architecture, history and design.\nThis set includes over 1,750 pieces.\nEnjoy a pleasantly challenging and rewarding building experience with this LEGO® Architecture set.\nMeasures over 21” (55cm) high, 7” (20cm) wide and 4” (12cm) deep."},{"theme":"architecture","themeUrl":"https://www.lego.com/en-us/themes/architecture","productUrl":"https://www.lego.com/en-us/product/statue-of-liberty-21042","description":"Celebrate a monumental blend of architecture and sculpture with this LEGO® Architecture 21042 The Statue of Liberty set. America’s iconic symbol of freedom stands more than 305 feet above Liberty Island in New York harbor, welcoming seafarers from around the globe. This impressive LEGO interpretation faithfully reproduces the monument's harmonious blend of sculpture and architecture with its intricately detailed shield-lined pedestal, brick detailing and columned balconies. The beautifully crafted Lady Liberty statue features a flowing robe, broken shackles, 7-ray crown, iconic tablet and an upraised arm bearing a golden torch. Finished with an authentic sand-green and beige color scheme, and a decorative nameplate, this model delivers a highly satisfying building experience to all with an interest in architecture, travel, history and design, and makes a truly symbolic centerpiece for the home or office.\n\nLEGO® Architecture interpretation of the real-world architectural landmark, the Statue of Liberty.\nFeatures an intricately detailed pedestal with shield & brick detailing, columned balconies, and a Lady Liberty statue with a flowing robe, 7-ray crown, iconic tablet and golden torch.\nThe included booklet contains information about the design, architecture and history of the building (English and French languages only. Other languages available for download at LEGO.com/architecture).\nLEGO® Architecture celebrates the world of architecture through the medium of the LEGO brick, and is developed for all with an interest in travel, architecture, history and design.\nThis set includes over 1,685 LEGO® pieces.\nEnjoy a pleasantly challenging and rewarding building experience with this LEGO® Architecture set.\nMeasures over 17” (44cm) high, 5” (14cm) wide and 5” (14cm) deep."},{"theme":"architecture","themeUrl":"https://www.lego.com/en-us/themes/architecture","productUrl":"https://www.lego.com/en-us/product/the-white-house-21054","description":"You’re busy. It feels like you’re always on the go. So when you do get some free time, you like to recharge your batteries by focusing on a fun, creative challenge. That’s what building The White House with LEGO® bricks is all about.\n\nRevel in the details\nWith this hands-on, minds-on craft project, you'll recreate details from the neoclassical columns of the president's Executive Residence and colonnades connecting the East and West Wings to the surrounding gardens and fountain. This LEGO Architecture White House model (21054) can be divided into 3 sections for closer inspection and includes a LEGO brick inscribed ‘The White House’ to complete an inspiring display piece.\n\nLEGO sets for your lifestyle\nEscape the daily grind and click your stress away creating this stylish model that will look great in your home or office. Part of a collection of LEGO building sets for adults interested in art, design, architecture and pop culture, it makes the best gift for you or the hobbyist inyour life.\n\nThis LEGO® Architecture display model of The White House (21054) beautifully captures the neoclassical design and splendor of this world-famous residence occupied by every United States president since 1800.\nEnjoy this LEGO® building set for adults, featuring details like the Executive Residence, West Wing, East Wing and connecting colonnades of The White House, plus the Rose Garden and Jacqueline Kennedy Garden.\nThe model can easily be divided into 3 sections for closer inspection of the architectural details. It also has a LEGO® brick inscribed ‘The White House’ to complete a conversation-starting display piece.\nIf you’ve been to or dream of visiting The White House, 1600 Pennsylvania Avenue, Washington DC, or you just love travel, architecture, history and design, this is the creative building kit for you.\nMeasuring 4” (11cm) high, 18” (47cm) wide and 7” (20cm) deep, this buildable LEGO® Architecture model is a super display item for your home or office. It's also makes the best gift for creative friends.\nNo batteries required – this stylish DIY project is all about recreating The White House with LEGO® bricks and immersing yourself in a focused activity that leaves you feeling relaxed and refreshed when you’re finished.\nIncludes clear instructions so even LEGO® newcomers can build with confidence, plus a coffee-table-style booklet telling The White House story (English language only. Download other languages at LEGO.com/architecture).\nThis construction set for adults is part of a collection of inspiring LEGO® model kits designed for you, the discerning hobbyist, as you look for your next creative project.\nLEGO® building bricks meet the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and pieces are rigorously tested, ensuring that every construction set meets the highest safety and quality standards, which means this White House miniature model is as robust as it is beautiful."},{"theme":"architecture","themeUrl":"https://www.lego.com/en-us/themes/architecture","productUrl":"https://www.lego.com/en-us/product/trafalgar-square-21045","description":"Capture the essence of a historical London landmark with the LEGO® Architecture 21045 Trafalgar Square set. Named in honor of Lord Horatio Nelson following his 1805 naval victory over Napoleon, the square has since become a popular tourist attraction and preferred location for political and community gatherings. This detailed LEGO interpretation depicts the domed National Gallery complete with columned facade, Nelson's Column flanked by 4 lions, the square's famous fountains and 4 sculpture plinths. The sections at the rear of the National Gallery structure can be removed for access to a detailed interior with brick-built statue and paintings. Tree-lined borders, ornate lampposts, 2 London buses, 2 black cabs and a tiled baseplate depicting the square and surrounding roads complete the model. Finished with a decorative nameplate, this collectible building set delivers a highly satisfying building experience to all with an interest in architecture, travel, history and design, and makes a truly iconic centerpiece for the home or office.\n\nLEGO® Architecture interpretation of the real-world London landmark, Trafalgar Square.\nFeatures the National Gallery, Nelson’s Column flanked by 4 lions, 2 fountains, 4 sculpture plinths, 10 trees, 6 lampposts, and a tiled baseplate depicting the square and road areas complete with 2 London buses and 2 black cabs.\nThe included booklet contains information about the architecture and history of each structure, as well as historical facts about Trafalgar Square and its architectural heritage. (English language only. Other languages available for download at LEGO.com/architecture).\nIncludes a decorative Trafalgar Square nameplate.\nLEGO® Architecture celebrates the world of architecture through the medium of the LEGO building brick and is developed for all with an interest in travel, architecture, history and design.\nThis set includes over 1,190 pieces.\nEnjoy a pleasantly challenging and rewarding building experience with this LEGO® Architecture set.\nMeasures over 4” (12cm) high, 9” (24cm) wide and 7” (20cm) deep."},{"theme":"architecture","themeUrl":"https://www.lego.com/en-us/themes/architecture","productUrl":"https://www.lego.com/en-us/product/dubai-21052","description":"Dubai boasts some of the most spectacular buildings in the world. Now residents, tourists and all admirers of this futuristic city can recreate its iconic landmarks with this LEGO® Architecture Skyline Collection 21052 Dubai model kit.Stunning structures!This building set for adults includes scale models of Burj Khalifa, the world’s tallest building on completion in 2010, the 7-star Burj Al Arab Jumeirah hotel, the Jumeirah Emirates Towers Hotel, plus The Dubai Fountain and the extraordinary Dubai Frame. With easy-to-follow instructions, even LEGO newbies will be able to build the detailed miniatures. And when displayed together on the base, this cool, collectible desk toy is sure to grab people’s attention.Introducing LEGO Architecture…From iconic landmarks to city skyline models, LEGO Architecture sets capture the essence of the world’s best-known buildings, monuments and cities, so they make ideal creative gifts for anyone interested in architecture, travel, history and design.\nThis spectacular LEGO® Architecture building set for adults brings together highly detailed models of iconic Dubai buildings and landmarks to inspire all admirers of this exciting, modern city.\nThe Burj Khalifa, Jumeirah Emirates Towers Hotel, Burj Al Arab Jumeirah hotel, Dubai Frame and The Dubai Fountain are featured in this architecture model kit, a charming souvenir for anyone with an affinity for Dubai.\nIncludes a base with a ‘Dubai’ nameplate for display. And discover interesting facts about Dubai and the model designer in the booklet (English language only. Download other languages at LEGO.com/architecture.)\nThis easy-to-build construction set is suitable even for first-time LEGO® architects. It makes a cool creative gift for adults aged 16+ who live or have lived in Dubai, holidayed there or dream of visiting one day.\nThis compact Dubai skyline model measures over 12” (33cm) high, 10” (27cm) wide and 2” (7cm) deep – it might not take up much space, but it will make a bigvisual impact wherever you choose to display it!\nBuilding this battery-free construction kit for adults is an immersive, peaceful way to relieve stress. So relax, find your building Zen and create an awesome architecture model!\nThinking of buying this collectible Dubai souvenir as a gift for a budding architect who is new to LEGO® building bricks? No worries. It comes with easy-to-follow, printed instructions in the box.\nLEGO® Architecture construction sets of iconic landmarks and city skyline models deliver rewarding building experiences for anyone interested in architecture, travel, history and design.\nEver since 1958, LEGO® building bricks have met the highest industry standards, which means that they are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks are rigorously tested to ensure that every LEGO Architecture building set meets the highest safety and quality standards, so your beautiful Dubai souvenir will stand the test of time."},{"theme":"architecture","themeUrl":"https://www.lego.com/en-us/themes/architecture","productUrl":"https://www.lego.com/en-us/product/new-york-city-21028","description":"Celebrate the architectural diversity of New York City with this detailed LEGO® brick model. The LEGO Architecture Skyline Collection offers models suitable for display in the home and office, and has been developed for all with an interest in travel, architectural culture, history and design. Each set is scaled to give an accurate representation of the comparative size of each structure, with true-to-life color depiction. This set features the Flatiron Building, Chrysler Building™, Empire State Building, One World Trade Center and the Statue of Liberty, and is finished with a decorative “New York City” nameplate.\n\nBuild a detailed model of the New York City Skyline, including the Statue of Liberty!\nModel features the Flatiron Building, Chrysler Building, Empire State Building, and the One World Trade Center\nIncludes collectible booklet containing information about the design, architecture and history of the building\nLEGO Architecture building toys are compatible with all LEGO construction sets for creative building\nNew York City Skyline measures 10 inches high, 9 inches wide, and 1 inch deep\n598 pieces – For boys and girls over the age of 12 years old"},{"theme":"architecture","themeUrl":"https://www.lego.com/en-us/themes/architecture","productUrl":"https://www.lego.com/en-us/product/tokyo-21051","description":"Recreate some of Tokyo’s most famous buildings with this detailed LEGO® Architecture Skyline Collection 21051 desk toy. It’s a great souvenir for Tokyo visitors and an ideal gift for adults who live or have lived in Japan’s capital city or who dream of visiting. Even LEGO newcomers can zone out from busy lives and enjoy this relaxing building experience.Iconic buildingsThis toy construction set includes scale models of TOKYO SKYTREE, the world’s tallest freestanding tower, Tokyo Tower, Mode Gakuen Cocoon Tower and Tokyo Big Sight. The cherry-tree-filled Chidorigafuchi Park, a classic pagoda tower and Shibuya Crossing are also featured. Together on the baseplate with a ‘Tokyo’ nameplate, they create a compact, impactful display piece.Introducing LEGO Architecture…LEGO Architecture sets capture the essence of the world’s best-known buildings, monuments and cities. From iconic landmarks to city skyline models, there’s something for anyone interested in architecture, travel, history and design.\nBuild this striking LEGO® Architecture Tokyo skyline souvenir for adults, featuring authentically detailed models of iconic buildings and landmarks, and display your passion for this vibrant city.\nThis collectible construction set features buildable models of the Tokyo Tower, Mode Gakuen Cocoon Tower, Tokyo Big Sight, TOKYO SKYTREE, Chidorigafuchi Park, Shibuya Crossing and more to evoke nostalgic memories.\nThis home or office desk model includes a base with a Tokyo nameplate. And learn more about Tokyo and the model designer in the booklet (English language only. Download other languages at LEGO.com/architecture.)\nEven new LEGO® architects can enjoy this easy-to-build architecture model kit, and it makes a cool creative Japanese gift for adults aged 16+ who have been to Tokyo, dream of visiting, or live/have lived there.\nThis buildable skyline measures over 11” (28cm) high, 10” (27cm) wide and 3” (10cm) deep – you don’t need a lot of space to display it, but its vibrant colors and authentic details will catch the eye of every passerby!\nNo batteries required – this architecture construction set for adults offers a stress-relieving, relaxing build with LEGO® bricks only. So, forget your worries, zone out and create a beautiful display model!\nThinking of buying this unique Tokyo gift for someone new to LEGO® building kits? No problem. It comes with easy-to-follow, printed building instructions. Open the box and away they go!\nIdeal for display, collectible LEGO® Architecture models of iconic landmarks and city skylines offer a variety of rewarding building experiences for anyone interested in architecture, travel, history and design.\nLEGO® building bricks meet the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks are tested in every way you can imagine to ensure that every LEGO Architecture building set meets the highest safety standards and your Tokyo souvenir model is as robust as it is beautiful."},{"theme":"architecture","themeUrl":"https://www.lego.com/en-us/themes/architecture","productUrl":"https://www.lego.com/en-us/product/paris-21044","description":"Bring together iconic Paris landmarks with this magnificent Paris skyline model. The 21044 LEGO® Architecture Skyline Collection set features the Arc de Triomphe, Champs-Elysées, Tour Montparnasse, Grand Palais, Eiffel Tower and the Louvre, and is finished with grass and tree areas and a decorative Paris nameplate. This set has been designed to deliver a rewarding and relaxing building experience to all with an interest in architecture, travel, history and design, and makes a truly “magnifique” centerpiece for the home or office. Each skyline model is scaled to give an accurate representation of the comparative size of the featured structures, with realistic color depiction.\n\nLEGO® Architecture interpretation of Paris.\nFeatures a selection of Paris’s famous landmarks, including the Arc de Triomphe, Champs-Elysées, Tour Montparnasse, Grand Palais, Eiffel Tower and the Louvre, plus grass and tree areas.\nThe included booklet contains information about the designer, architecture and history of each structure, as well as historical facts about Paris and its architectural heritage. (French and English languages only. Other languages available for download at LEGO.com/architecture.)\nIncludes a 4x32 tiled base with decorative Paris nameplate.\nRecreate the world's most dynamic cities with the LEGO® Architecture Skyline Collection.\nLEGO® Architecture sets celebrate the world of architecture through the medium of the LEGO brick, and are developed for all with an interest in travel, design, architecture and history.\nThis set includes over 694 pieces.\nMeasures over 8” (22cm) high, 11” (28cm) wide and 4” (11cm) deep."},{"theme":"architecture","themeUrl":"https://www.lego.com/en-us/themes/architecture","productUrl":"https://www.lego.com/en-us/product/san-francisco-21043","description":"Recreate the magnificence of San Francisco’s architecture with this awesome 21043 LEGO® Architecture Skyline Collection model. This LEGO brick collectible features iconic San Francisco attractions and landmarks, including the city’s famous “painted ladies” buildings, 555 California Street, the Transamerica Pyramid, Salesforce Tower, Coit Tower, Fort Point, Golden Gate Bridge and Alcatraz Island. A blue-tiled baseplate representing the Golden Gate strait and a San Francisco nameplate add the finishing touch to this amazing model. LEGO Architecture Skyline Collection models are perfect for display in the home or office and have been developed for all with an interest in travel, architectural culture, history and design. Each skyline building set is scaled to give an accurate representation of the comparative size of the featured structures, with realistic color depiction.\n\nLEGO® Architecture interpretation of San Francisco.\nFeatures iconic San Francisco sights and famous landmarks, including the city’s famous “painted ladies” buildings, 555 California Street, the Transamerica Pyramid, Salesforce Tower, Coit Tower, Fort Point, Golden Gate Bridge and Alcatraz Island.\nAlso features a blue-tiled baseplate depicting the Golden Gate strait.\nThe included booklet contains information about the designer, architecture and history of each attraction, as well as historical facts about San Francisco and its architectural heritage. (English language only. Other languages available for download at LEGO.com/architecture.)\nIncludes a 4x34 tiled base with a decorative San Francisco nameplate.\nRecreate the world's most vibrant cities with the LEGO® Architecture Skyline Collection.\nLEGO® Architecture sets celebrate the world of architecture through the medium of the LEGO brick, and are developed for all with an interest in travel, design, architecture and history.\nThis set includes over 565 pieces.\nMeasures over 6” (16cm) high, 11” (28cm) wide and 2” (7cm) deep."},{"theme":"architecture","themeUrl":"https://www.lego.com/en-us/themes/architecture","productUrl":"https://www.lego.com/en-us/product/london-21034","description":"Celebrate the architectural diversity of London with this detailed LEGO® brick model. The LEGO Architecture Skyline Collection offers models suitable for display in the home and office, and has been developed for all with an interest in travel, architectural culture, history and design. Each set is scaled to give an accurate representation of the comparative size of each structure, with true-to-life color depiction. This set features the National Gallery, Nelson’s Column, London Eye, Big Ben (the Elizabeth Tower) and Tower Bridge, and is finished with a decorative “London” nameplate.\n\nBuild a detailed model of the London skyline!\nModel features the National Gallery, Nelson’s Column, London Eye, Big Ben and Tower Bridge\nIncludes collectible booklet containing information about the design, architecture and history of the building\nLEGO Archiecture models are compatible with all LEGO construction sets for creative building\nMeasures over 5” high, 11” wide and 3” deep\n468 pieces – For boys and girls ages 12 and older"},{"theme":"architecture","themeUrl":"https://www.lego.com/en-us/themes/architecture","productUrl":"https://www.lego.com/en-us/product/shanghai-21039","description":"Recreate Shanghai in China's blend of historical and modern architecture with this realistic LEGO® Architecture 21039 Shanghai Skyline Collection model. This LEGO brick collectible toy features the city's iconic points of interest, including Chenghuang Miao Temple, Longhua Temple and Pagoda, Radisson Blu Hotel, Bund area, Oriental Pearl, World Financial Center, the Shanghai Tower and Huangpu River, and is finished with a decorative Shanghai nameplate. The LEGO Architecture Skyline Collection offers models suitable for display in the home and office, and has been developed for all with an interest in travel, architectural culture, history and design. Each set is scaled to give an accurate representation of the comparative size of each structure, with realistic color depiction.\n\nLEGO® Architecture interpretation of Shanghai, China.\nFeatures iconic Shanghai attractions, including the Chenghuang Miao Temple, Longhua Temple and Pagoda, Radisson Blu Hotel, Bund area, Oriental Pearl, World Financial Center and the Shanghai Tower.\nThe Huangpu River is represented in the tiled baseplate.\nThe included booklet contains information about the designer, architecture and history of each structure, as well as historical facts about Shanghai and its architectural heritage (English language only. Other languages available for download at LEGO.com/architecture. Ask your parents before going online.\nIncludes a 4x32 tiled base with decorative Shanghai nameplate.\nRecreate the world's most dynamic cities with the LEGO® Architecture Skyline Collection.\nLEGO® Architecture celebrates the world of architecture through the medium of the LEGO brick, and is developed for all with an interest in travel, design, architecture and history.\nMeasures over 9” (25cm) high, 11” (28cm) wide and 2” (7cm) deep."},{"theme":"architecture","themeUrl":"https://www.lego.com/en-us/themes/architecture","productUrl":"https://www.lego.com/en-us/product/las-vegas-21047","description":"Recreate the architectural magnificence of Las Vegas, Nevada, with this realistic 21047 LEGO® Architecture Skyline Collection model. This LEGO brick collectible features iconic attractions located on and around the Las Vegas Strip, including the Bellagio Hotel, Luxor Hotel, Encore Hotel, Stratosphere Tower and the downtown Fremont Street Experience, and is finished with a decorative “Las Vegas” nameplate. LEGO Architecture Skyline Collection models are suitable for display in the home and office, and have been developed for all with an interest in travel, architectural culture, history and design. Each souvenir toy is scaled to give an accurate representation of the comparative size of each structure, with realistic color depiction.\n\nLEGO® Architecture interpretation of Las Vegas.\nFeatures attractions located on and around the Las Vegas Strip, including the Bellagio Hotel, Luxor Hotel, Encore Hotel, Stratosphere Tower and the Fremont Street Experience.\nAlso features the famous Welcome to Las Vegas sign with the desert and road depicted in the tiled baseplate.\nThe included booklet contains information about the designer, architecture and history of each structure, as well as historical facts about Las Vegas and its architectural heritage (English language only. Other languages available for download at LEGO.com/architecture. Ask your parents before going online).\nIncludes a 4x34 tiled base with decorative Las Vegas nameplate.\nRecreate the world's most vibrant cities with the LEGO® Architecture Skyline Collection.\nLEGO® Architecture celebrates the world of architecture through the medium of the LEGO brick, and is developed for all with an interest in travel, design, architecture and history.\nThis set includes over 500 pieces.\nMeasures over 7” (19cm) high, 10” (27cm) wide and 2” (7cm) deep."}]