[{"theme":"art","themeUrl":"https://www.lego.com/en-us/themes/art","productUrl":"https://www.lego.com/en-us/product/marvel-studios-iron-man-31199","description":"If you’re a Super Hero fan, we have a thrilling set for you. Build 1 of 3 portraits of the iconic Iron Man suits of armor with this LEGO® Art Marvel Studios Iron Man (31199) set, while you relish a creative escape from everyday life.\n\nIngenious project\nBuild 1 of 3 detailed portraits of Iron Man’s armor, the MARK III, the HULKBUSTER MARK I or the MARK LXXXV. If you want more, buy and combine 3 sets into an ultimate Iron Man piece. As part of this new LEGO building experience, listen to the included Soundtrack for stories and cool details about the set as you build. Finish the project with a Marvel Studios signature plate, then display it on a wall or shelf.\n\nArtistic mindfulness\nYou don’t need to be an artist or have loads of LEGO models to enjoy the satisfaction of completing this wall art kit. This LEGO Art set is part of a collection of building kits focused on music, art, design and architecture, which make great gifts for anyone (including yourself) seeking a new project.\n\nBuild this LEGO® Art Marvel Studios Iron Man (31199) set, featuring a model with 3 build options. Display your favorite version of Iron Man’s armor on your wall or shelf after you spend quality time making it.\nSet your creative side free with this 3,156-piece LEGO® set that includes 9 canvas wall decor plates, a Marvel Studios signature plate, brick-built LEGO frame, new hanging element and piece separator for easy rebuilding.\nRelieve stress while you create a unique LEGO® portrait of the MARK III, the HULKBUSTER MARK I or the MARK LXXXV armored Iron Man suits. With the immersive Soundtrack, you can learn unexpected details as you build.\nRevel in your love of Super Heroes while building this unique LEGO® kit. To really push your creativity, buy and combine 3 of the sets to create an ultimate Iron Man wall piece to display in your home or office.\nThis 3in1 LEGO® Art set measures over 15.5” (40cm) square. Display it on a wall or shelf, where its details help it stand out. It makes a great gift for you or another creative builder who’s into Super Heroes or Iron Man.\nNo batteries needed. This art set for adults offers an immersive build with LEGO® pieces and a unique Soundtrack. Escape your daily routine and create an incredible display piece.\nThe coffee-table-quality instructions guide you through the project, starting with a deep dive into Iron Man before you begin building. Enjoy the Soundtrack made for this LEGO® set while you assemble the piece.\nPerfect to display on a wall or shelf, LEGO® Art models of iconic artworks, musicians, Super Heroes and Sith Lords offer you a rewarding building experience while you explore your passion for creative arts and crafts.\nLEGO® building pieces meet exacting quality standards, which ensures they are consistent, compatible and work every time – it’s been that way since 1958.\nLEGO® pieces are tested to ensure that every LEGO Art building set meets strict safety standards, making this Marvel Studios Iron Man wall decor piece as robust as it is beautiful."},{"theme":"art","themeUrl":"https://www.lego.com/en-us/themes/art","productUrl":"https://www.lego.com/en-us/product/andy-warhol-s-marilyn-monroe-31197","description":"If you’re an Andy Warhol or Marilyn Monroe fan, this is the set for you. Recreate iconic art with this LEGO® Art Andy Warhol’s Marilyn Monroe (31197) set. Escape from everyday life with a relaxing activity and some focused me time.\n\nCreative project\nReimagine Andy Warhol’s famous pop art portrait of Marilyn Monroe. As you build, listen to the included Soundtrack and immerse yourself in a world of art and creativity as you hear unexpected details and audio stories linked to the set. Finish the build with an exclusive signature tile and display your art on a wall or shelf.\n\nHands on, minds on\nYou don’t need to be an artist or have a collection of LEGO models to enjoy the satisfaction of completing this wall art kit. Once it’s complete, you’ll have a piece to display with pride. This LEGO Art set is part of a collection of inspiring building kits for adults interested in pop culture, art, design and architecture. The sets make a great gift for anyone (including yourself) seeking a new project.\n\nYou can create this special LEGO® Art Andy Warhol’s Marilyn Monroe (31197) set, featuring an iconic art piece with 4 unique build options. Display the finished work on your wall after spending quality time building it.\nIndulge your creativity with a 3,332-piece LEGO® set that includes 9 canvas wall decor plates, an exclusive signature tile, brick-built LEGO frame, unique new hanging element and piece separator for easier rebuilding.\nThis kit is a way to immerse yourself in your passion for creativity while building a unique piece of art. With the included Soundtrack, you can dive deeper into the art set and learn new details about it.\nExplore your love of Andy Warhol or Marilyn Monroe while you build and display this appealing set. It also makes a captivating gift for yourself or other builders in your life who love engaging, creative projects.\nThis 4in1 art piece measures over 15.5” (40cm) square. It displays beautifully on a wall or shelf, while its authentic details will ensure it stands out in any collection. This LEGO® set comes with 4 different building options.\nYou don’t need batteries – this art set for adults offers a stress-relieving, immersive build with LEGO® pieces and a unique Soundtrack. Escape your daily routine and create a gorgeous wall display piece.\nThe coffee-table-quality instructions help guide you through the project, starting with a deep dive into the art before you commence building. Once you begin, enjoy the set’s customized Soundtrack experience.\nPerfect for display, LEGO® Art models of iconic artworks, musicians, Super Heroes and Sith Lords offer you a rewarding building experience while you take some me time and follow your passion for creative arts and crafts.\nLEGO® building pieces meet exacting quality standards, which ensures they are consistent, compatible and work every time – it’s been that way since 1958.\nLEGO® pieces are tested to ensure that every LEGO Art building set meets strict safety standards, making this Andy Warhol’s Marilyn Monroe wall decor piece as robust as it is beautiful."},{"theme":"art","themeUrl":"https://www.lego.com/en-us/themes/art","productUrl":"https://www.lego.com/en-us/product/star-wars-the-sith-31200","description":"If you’re a Star Wars™ fan, this is a great set for you. Create an iconic art piece with this LEGO® Art Star Wars The Sith (31200) set. Enjoy a well-earned break as you make a special display piece for your home or office.\n\nCreative building project\nCelebrate the Sith Lords, Darth Maul, Kylo Ren and Darth Vader, with this 3in1 portrait set. If you want more, you can buy and combine 3 sets into an ultimate Darth Vader wall piece. While you build, listen to the included Soundtrack to enjoy details and audio stories linked to the set. Finish the build with the Star Wars signature plate, then display on a wall or shelf.\n\nHands-on, minds on\nYou don’t need to be a painter or have lots of LEGO models to enjoy building this portrait kit. Once you’re done, you’ll have a piece you can be proud to display. This LEGO set is part of a collection of inspiring building kits for adults interested in pop culture, art, design and architecture. The sets also make a great gift for anyone – including yourself.\n\nImmerse yourself in this LEGO® Art Star Wars™ The Sith (31200) canvas art set for adults, featuring a model with 3 build options. Display iconic Star Wars Sith Lords on your wall or shelf after you create it.\nExplore your creative ‘dark side’ with a 3,395-piece LEGO® set that includes 9 canvas wall decor plates, a Star Wars™ signature plate, brick-built LEGO frame, unique new hanging element and piece separator.\nReimagine these epic Sith Lords and relieve stress as you create a unique LEGO® portrait. With the complementary Soundtrack, you can dive deep into the build with fun Star Wars™-related stories and interviews.\nEnjoy the appeal of iconic Sith Lords while building this unique LEGO® kit. To really push your creativity, buy and combine 3 of the sets to create an ultimate Darth Vader wall piece to display in your home or office.\nThis 3in1 LEGO® Art set measures over 15.5” (40cm) square. Display it on a wall or shelf, where its details help it stand out. It also makes a great gift for you or another creative builder who may be a Star Wars™ fan.\nNo batteries needed. This art set for adults offers an immersive build with LEGO® pieces and the informative Soundtrack. Escape your daily routine, have some creative fun and make an incredible display piece.\nThe coffee-table-quality instructions guide you through the project, starting with a deep dive into Darth Vader before you begin building. Enjoy the Soundtrack, made for this LEGO® set, while you assemble the piece.\nPerfect for display on a wall or shelf, this LEGO® Art portrait of iconic Sith Lords offers you a rewarding building experience while you explore your passion for creative arts and crafts.\nLEGO® building pieces meet exacting quality standards, which ensures they are consistent, compatible and work every time – it’s been that way since 1958.\nLEGO® pieces are tested to ensure that every LEGO Art building set meets strict safety standards, helping to ensure that this Star Wars™ The Sith wall decor piece is as robust as it is beautiful."},{"theme":"art","themeUrl":"https://www.lego.com/en-us/themes/art","productUrl":"https://www.lego.com/en-us/product/the-beatles-31198","description":"If you’re a Beatles fan, we have the perfect set for you. Build 1 of 4 unique portraits of the iconic band members with this LEGO® Art The Beatles (31198) set and relish a creative escape from everyday life.\n\nRelaxing project\nCreate 1 of 4 detailed wall art portraits of your favorite Beatle, whether it’s John Lennon, Paul McCartney, George Harrison or Ringo Starr, with this 2,933-piece set. While building, listen to the included Soundtrack and let it immerse you in stories and unexpected details about the band. Finish the build with a ‘The Beatles’ signature tile and display it on a wall or shelf.\n\nArtistic mindfulness\nYou don’t need to be an artist or have a collection of LEGO models to enjoy the satisfaction of completing this wall art kit. Once done, you’ll have a piece to display with pride. This LEGO Art set is part of a collection of building kits focused on music, art, design and architecture. The sets also make a great gift for anyone (including yourself) seeking a new project.\n\nBuild this stunning LEGO® Art The Beatles (31198) canvas art set, featuring a model with 4 build options. You can display your passion for The Beatles on your wall or shelf after creating any 1 of the 4 portraits.\nEscape the daily grind with this 2,933-piece LEGO® set for adults, which includes 9 canvas wall decor plates, a ‘The Beatles’ signature tile, a brick-built LEGO frame, unique new hanging element and piece separator.\nThis set immerses you in your passion for arts and crafts while you make a creative piece of art. With the included Soundtrack, you can really dive into the set and learn unexpected details as you build.\nCelebrate your love of music and The Beatles by building and displaying this unique set. It also makes an imaginative birthday present for yourself or other DIY enthusiasts in your life who love creative projects.\nThis 4in1 art piece measures over 15.5” (40cm) square. It displays beautifully on a wall or shelf and its details will ensure it stands out in your collection. This clever LEGO® set offers 4 different building options.\nYou don’t need batteries – this art set for adults offers a stress-relieving, immersive build with LEGO® pieces and a unique Soundtrack. Escape your daily routine and create a gorgeous wall display piece.\nThe coffee-table-quality instructions help guide you through the project and start with a deep dive into the art before you start building. Once you begin, enjoy the Soundtrack experience that’s customized for this set.\nPerfect for display on a wall or shelf, LEGO® Art models of iconic artworks, musicians, Super Heroes and Sith Lords offer you a rewarding building experience while you explore your passion for creative arts and crafts.\nLEGO® building pieces meet exacting quality standards, which ensures they are consistent, compatible and work every time – it’s been that way since 1958.\nLEGO® pieces are tested to ensure that every LEGO Art building set meets strict safety standards, which helps ensure The Beatles wall decor piece is as robust as it is beautiful."},{"theme":"art","themeUrl":"https://www.lego.com/en-us/themes/art","productUrl":"https://www.lego.com/en-us/product/disney-s-mickey-mouse-31202","description":"If you’re a fan of classic Disney characters, we have a project just for you! You can build 1 of 2 wall decor portraits with this LEGO® Art ǀ Disney’s Mickey Mouse (31202) set and enjoy a creative mosaic project that offers active stress relief as you build.\n\nLEGO relaxation for adults\nSpend some rejuvenation time assembling a tile picture of either Disney's Mickey Mouse or Minnie Mouse with this 2,658-piece set. As you build, listen to the included Soundtrack and learn more about the iconiccharacters. Up for a change? Rebuild it or collect 2 sets and create a united Mickey Mouse and Minnie Mouse wall decoration.\n\nCreative possibilities\nYou don’t have to be an artist or LEGO collector to appreciate the creativity of this set. Once finished, display it on a wall or shelf in your home or office. This LEGO Art set is part of a unique collection of building kits focused on art, music, design and architecture that also make a great gift for anyone (including yourself) seeking a new project.\n\nShow off your love of Disney’s Mickey Mouse or Minnie Mouse with this stunning mosaic LEGO® Art ǀ Disney’s Mickey Mouse (31202) set. You can display the piece on your wall or shelf after creating it.\nEnjoy a relaxing break with this LEGO® set, featuring over 2,650 pieces, including 9 canvas wall decor plates, Disney signature tile, brick-built LEGO frame, unique hanging element and a tile tool.\nThis set lets you relax and recharge while you focus on your appreciation for Disney's MickeyMouse through art. With the included Soundtrack, you can learn new details as you build.\nTo push your creativity further, combine 2 of the craft hobby sets to create a special united piece, featuring Disney’s Mickey Mouse and Minnie Mouse on a distinctive background.\nA portrait measures over 15.5 in. (40 cm) square and offers 2 building options. It makes a meaningful gift for yourself or other Disney enthusiasts in your life who also love DIY projects.\nThe coffee-table-quality instructions guide you through the project and offer a stress-relieving road map through the art along with some creative LEGO®-inspired relaxation.\nPerfect to display on a wall or shelf, LEGO® Art sets offer adults like you a rewarding building experience while you explore your passion for creative arts-and-crafts-related hobbies.\nLEGO® components meet rigorous industry standards to ensure they are consistent, compatible and connect and pull apart consistently every time – it's been that way since 1958.\nLEGO® components are dropped, squashed, twisted, heated, bent, scratched and stretched, ensuring that this Disney’s Mickey Mouse wall decor piece meets stringent global safety standards."},{"theme":"art","themeUrl":"https://www.lego.com/en-us/themes/art","productUrl":"https://www.lego.com/en-us/product/harry-potter-hogwarts-crests-31201","description":"Harry Potter™ fans seeking a project to reflect their passion can build 1 of 4 crests with this LEGO® Art Harry Potter Hogwarts™ Crests (31201) wall art set and enjoy a relaxing escape into an iconic world.\n\nStress reliever\nBuild a tile mosaic picture of the Hogwarts crest of your choice – Gryffindor™, Slytherin™, Hufflepuff™ or Ravenclaw™ – with this 4,249-piece wall art set. As you build, listen to the included Soundtrack and learn more about the houses and the world of Harry Potter. Readyfor a change? Rebuild it into a new crest or collect all 4 sets to create the ultimate Hogwarts crest.\n\nCreative hobbies for adults\nYou don’t have to be an artist or LEGO collector to appreciate the beauty and creativity of this set. Once it’s complete, you can display it with pride in your home or office. This LEGO Art set is part of a collection of building kits focused on art, music, design and architecture, which make great gifts for any adult (including yourself) seeking a new hobby or project.\n\nReflect your love of all things Hogwarts™ with this stunning LEGO® Art Harry Potter™ Hogwarts Crests (31201) set, which lets you build and display 1 of 4 detailed house crests.\nEscape the daily grind with this LEGO® set, featuring 4,249 pieces, including 9 canvas wall decor plates, exclusive Harry Potter™ logo tile, brick-built frame, unique hanging element and tile tool.\nThis set immerses you in your passion for both arts and crafts and the Harry Potter™ series while you relax and recharge. With the included Soundtrack, you learn more about the houses as you build.\nCelebrate your love of magic and adventure by building and displaying this unique mosaic wall art. To extend the stress relief, combine 4 of the sets to create the ultimate Hogwarts™ crest.\nThis piece measures over 15.5 in. (40 cm) square, has 4 building options and makes a relaxing activity for you or any other Harry Potter™ enthusiasts in your life who also love DIY art projects.\nThe coffee-table-qualityinstructions guide you through the project and offer a stress-relieving road map through the art, along with some creative LEGO® relaxation.\nPerfect for adults to display on a wall or shelf, LEGO® Art kits offer you a rewarding building experience while you explore your passion for creative arts and crafts.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it's been that way since 1958.\nLEGO® components are dropped, squashed, twisted, heated, bent, scratched and stretched to make sure this Hogwarts™ Crests wall decor piece meets stringent global safety standards."}]