[{"theme":"boost","themeUrl":"https://www.lego.com/en-us/themes/boost","productUrl":"https://www.lego.com/en-us/product/boost-creative-toolbox-17101","description":"Bring your LEGO® creations to life with the new LEGO BOOST Creative Toolbox—a fun and easy way for your 7+ builder to learn the basics of coding, engineering and robotics. Simply choose one of the 5 models available with the BOOST set, download the free, easy-to-use app and you’re ready to go! Choose between Vernie the Robot—a moving, talking robot; the M.T.R.4 (Multi-Tooled Rover 4)—a robust, versatile rover with 4 different tool attachments including a spring-loaded shooter; the Guitar4000—a musical instrument with pitch bend and sound effects; Frankie the Cat—an interactive robot pet that plays, purrs and expresses its mood; or the AutoBuilder—an automated production line that really builds miniature LEGO models! Then bring your creation to life with the app’s intuitive, icon-based coding interface and complete an array of exciting activities designed for each model. With LEGO BOOST, children learn about loops and variables, improve STEM and creative-problem solving skills and develop their imagination as they toggle between guided and open-ended play. The more activities you complete, the more coding blocks you unlock! The LEGO BOOST app is available for selected iOS, Android and Kindle smart devices. Please go to LEGO.com/devicecheck for a list of all compatible devices. The app offers regular updates with new challenges and coding options designed to encourage social play.\n\nIncludes a LEGO® Motorized Hub, additional Motor and a Color & Distance Sensor, plus more than 840 LEGO pieces for building and rebuilding any of 5 multifunctional models.\nCode Vernie the Robot to dance, shoot the target, beatbox, use his hockey stick or even play a game.\nBuild the M.T.R.4 (Multi-Tooled Rover 4) and choose from a selection of tools and customization attachments to complete missions or battle against other rovers.\nLearn how to play a song and rock out with the Guitar4000.\nLook after your own pet with Frankie the Cat. Be sure to feed it the right food, or it might get upset!\nConstruct, code and operate the AutoBuilder to produce real miniature LEGO® models.\nBuild and code robots and models, and complete over 60 exciting activities included in the LEGO® BOOST App. Building instructions for all 5 models are only available with the free LEGO BOOST app, available for selected iOS, Android and Kindle smart devices. The app offers regular updates that include new challenges and coding options, and encourages social play.\nReal coding transformed into an intuitive and easy to use drag-and-drop coding interface, suitable for all aged 7+. Learn about loops and variables, and develop your STEM skills, creative-problem solving and imagination by toggling between guided and open-ended play.\nStep-by-step challenges suitable for starting levels that help you progress and increase your coding skills.\nCombine with the LEGO® City 60194 Arctic Scout Truck to control and drive the vehicle! Use the LEGO BOOST app to operate the forklift, examine samples with the color sensor, help the whale back into the water and much more, for an interactive experience like never before!\nCombine with LEGO® NINJAGO® 70652 Stormbringer and set the Lightning Dragon free! Use the LEGO BOOST app to control the fearsome beast, fire the shooters, create a color-sensing ejector seat and much more!\nThis product requires batteries (not included).\nGo to LEGO.com/devicecheck for a list of compatible devices.\nThis set features Digital Building Instructions. Now it’s easy to follow the steps on your mobile device or download a PDF of the printed building guide. Click the Building Instructions button at the bottom of this page to find and download the instructions."},{"theme":"boost","themeUrl":"https://www.lego.com/en-us/themes/boost","productUrl":"https://www.lego.com/en-us/product/droid-commander-75253","description":"Introduce your Star Wars™ fan to a rich LEGO® brick galaxy of lovable droids, exciting missions and coding fun for kids with the LEGO Star Wars BOOST Droid Commander set. This interactive robot toy puts your child in command of 3 app-controlled Star Wars LEGO droids: R2-D2, a Gonk Droid and a Mouse Droid, each with their own personalities and skills. Using the free LEGO BOOST Star Wars app, your young commander builds the droids, inserts the Bluetooth-controlled Move Hub into the one that will solve each mission, and brings it to life using the intuitive drag-and-drop coding environment (visit LEGO.com/devicecheck for a list of compatible devices). Your youngster then constructs tools, weapons, targets, obstacles and lots more as they progress through over 40 exciting missions – they’ll love it! This set makes a great birthday or Christmas gift or just a gift for any occasion. It also helps youngsters develop their critical thinking and creative problem-solving skills, introduces them to basic engineering and robotics, and, just as importantly, lets them play in a rich and expansive galaxy filled with unforgettable icons like Luke Skywalker, X-wings, the Death Star and many more.\n\nKids will learn to code and develop creative problem-solving skills as they play with this interactive STEM toy, featuring 3 buildable LEGO® Star Wars™ droids and over 40 interactive missions.\nThis fun LEGO® Star Wars™ tech toy for kids includes a color & distance sensor, interactive motor, Move Hub and 1,177 pieces – enough to build all 3 lovable R2-D2, Gonk Droid and Mouse Droid LEGO figures. Please note that only one robot can be brought to life at a time using the included Bluetooth-controlled Move Hub.\nBuildable props include rocket boosters, a catapult, a cake shooter, a target, color decoder, obstacles and many more.\nKids aged 8+ will love building the robot toys using the free LEGO® BOOST Star Wars™ app, attaching the tools and weapons, and bringing them to life to solve fun, challenging missions with the easy-to-use coding environment. Visit LEGO.com/devicecheck for a list of compatible devices.\nThis great Christmas, birthday or gift idea for any occasion features unforgettable characters, locations, sounds and music from episodes I-VI of the Star Wars™ movie saga, which kids and adults will love to interact with.\nLEGO® brick R2-D2 measures over 7” (20cm) high, 3” (10cm) long and 5” (14cm) wide. LEGO Gonk Droid measures over 7” (18cm) high, 6” (16cm) long and 3” (9cm) wide. LEGO Mouse Droid measures over 5” (14cm) high, 6” (17cm) long and 3” (9cm) wide.\nFree LEGO® BOOST Star Wars™ Droid Commander app is available for selected iOS, Android and Fire smart devices. Ask your parents’ permission before going online.\nIncludes LEGO® Light Brick.\nThis set features digital building instructions. Now it’s easy to follow the steps on your mobile device or download a PDF of the printed building guide. Click the Building Instructions button at the bottom of this page to find and download the instructions."}]