[{"theme":"brick-sketches","themeUrl":"https://www.lego.com/en-us/themes/brick-sketches","productUrl":"https://www.lego.com/en-us/product/batman-40386","description":"Fans of the Caped Crusader™ can build and display their own LEGO® Batman™ illustration with this LEGO Brick Sketches™ Batman (40386). Hang it on the wall using the built-in hook – the 12x16 baseplate holds the LEGO bricks firmly in place. A great gift for birthdays and holidays, and an impressive addition to any collection of LEGO Brick Sketches character portraits.\nYoung LEGO® builders and Batman™ fans will love to build and display this cool, collectible Brick Sketches™ portrait of the famous crime fighter of GOTHAM CITY™.\nAn awesome gift for kids aged 8 and up, this 115-piece construction set is part of the LEGO® Brick Sketches™ theme, which features collectible, buildable, 3D illustrations of iconic characters on 12x16 baseplates.\nMeasuring over 5” (13cm) high, 3” (9cm) wide and 1” (3cm) deep, this LEGO® Brick Sketches™ Batman™ makes an eye-catching addition to any kid’s room, whether standing alone or hanging on the wall from the built-in hook."},{"theme":"brick-sketches","themeUrl":"https://www.lego.com/en-us/themes/brick-sketches","productUrl":"https://www.lego.com/en-us/product/brick-sketches-bb-8-40431","description":"Create an awesome 3-D illustration of BB-8 with this cool LEGO® Brick Sketches™ construction set (40431) for youngsters and all fans of the astromech droid. Built on a 12x16 baseplate, the portrait looks great displayed freestanding or the built-in hook can be used to hang it on a wall. An awesome birthday or holiday gift or surprise any-time present, it makes a great addition to any builder's collection of LEGO Brick Sketches character artworks.\nStar Wars™ fans young and old will enjoy creating and displaying a LEGO® brick-built artwork of the lovable Stars Wars droid BB-8 with this LEGO Brick Sketches™ construction model kit.\nA great gift idea for ages 8 and up, this 171-piece building set is part of the LEGO® Brick Sketches™ theme which features collectible, buildable, 3-D illustrations of iconic characters on 12x16 baseplates.\nLEGO® Brick Sketches™ BB-8 measures over 5” (13cm) high, 3” (9cm) wide and 1” (3cm) deep. It makes a striking display piece freestanding on the mantelpiece or hung by the built-in hook on a wall."},{"theme":"brick-sketches","themeUrl":"https://www.lego.com/en-us/themes/brick-sketches","productUrl":"https://www.lego.com/en-us/product/first-order-stormtrooper-40391","description":"Show off the strength of the First Order with this LEGO® Brick Sketches™ First Order Stormtrooper (40391) construction set. This collectible, brick-built illustration of an iconic Star Wars character is created on a 12x16 baseplate and can be displayed standing up or hung by its built-in hook on a wall. An awesome birthday or holiday gift for kids and Star Wars fans, it makes a great addition to any builder's collection of LEGO Brick Sketches character portraits.\nYoung builders and any Star Wars™ fan will love creating and displaying a LEGO® brick-built portrait of a Stars Wars First Order Stormtrooper, with this LEGO Brick Sketches™ construction set.\nA super gift idea for ages 8 and up, this 151-piece construction kit is part of the LEGO® Brick Sketches™ theme, which features collectible, buildable, 3-D illustrations of iconic characters on 12x16 baseplates.\nThe LEGO® Brick Sketches™ First Order Stormtrooper measures over 5” (13cm) high, 3” (9cm) wide and 1” (3cm) deep. It will grab people’s attention whether hung by the built-in hook on a wall or displayed freestanding."},{"theme":"brick-sketches","themeUrl":"https://www.lego.com/en-us/themes/brick-sketches","productUrl":"https://www.lego.com/en-us/product/mickey-mouse-40456","description":"Fans of Disney’s iconic characters can build and display their own Mickey Mouse illustration with this LEGO® Brick Sketches™ Mickey Mouse (40456) kit. Hang it on the wall using the built-in hook – the 12x16 baseplate holds the LEGO bricks firmly in place – or stand it on a shelf. A great treat for holidays, birthdays or other celebrations, and an impressive addition to any collection of LEGO Brick Sketches character portraits.\nYoung LEGO® builders and Disney Mickey Mouse fans will love to create and display this cool, collectible Brick Sketches™ portrait of the well-known Disney character.\nA great gift idea for ages 8 and up, this 118-piece building set is part of the LEGO® Brick Sketches™ theme, which features collectible, buildable, 3D illustrations of iconic characters on 12x16 baseplates.\nMeasuring over 5 in. (13 cm) high, 3 in. (9 cm) wide and 1 in. (3 cm) deep, this LEGO® Brick Sketches™ Mickey Mouse picture makes a striking piece displayed on the mantelpiece or hung by its built-in hook on a wall."},{"theme":"brick-sketches","themeUrl":"https://www.lego.com/en-us/themes/brick-sketches","productUrl":"https://www.lego.com/en-us/product/minnie-mouse-40457","description":"Fans of Disney’s iconic characters can build and display their own Minnie Mouse illustration with this LEGO® Brick Sketches™ Minnie Mouse (40457) kit. Hang it on the wall using the built-in hook – the 12x16 baseplate holds the LEGO bricks firmly in place – or stand it on a shelf. It’s a perfect gift for birthdays, holidays or other celebrations and an impressive addition to any collection of LEGO Brick Sketches character portraits.\nYoung LEGO® builders and Disney Minnie Mouse fans will love to create and display this cool, collectible Brick Sketches™ portrait of the well-known Disney character.\nA great gift idea for ages 8 and up, this 140-piece building set is part of the LEGO® Brick Sketches™ theme, which features collectible, buildable, 3D illustrations of iconic characters on 12x16 baseplates.\nMeasuring over 5 in. (13 cm) high, 3 in. (9 cm) wide and 1 in. (3 cm) deep, this LEGO® Brick Sketches™ Minnie Mouse picture makes a striking piece displayed on the mantelpiece or hung by its built-in hook on a wall."},{"theme":"brick-sketches","themeUrl":"https://www.lego.com/en-us/themes/brick-sketches","productUrl":"https://www.lego.com/en-us/product/the-joker-40428","description":"Fans of Batman™ can build and display their own portrait of The Joker™ with this LEGO® Brick Sketches™ The Joker (40428). Made entirely from LEGO bricks on a 12x16 baseplate to hold the LEGO bricks firmly in place, kids can even hang it on the wall using the built-in hook. A cool gift for kids’ birthdays and holidays, and an impressive addition to any collection of LEGO Brick Sketches character portraits.\nYoung LEGO® builders and fans of Batman™ will enjoy constructing and displaying this awesome, collectible Brick Sketches™ portrait of the most notorious villain of GOTHAM CITY™.\nA great gift for kids aged 8 and up, this 170-piece construction set is part of the LEGO® Brick Sketches™ theme, which features collectible, buildable, 3D illustrations of iconic characters on 12x16 baseplates.\nMeasuring over 5” (13cm) high, 3” (9cm) wide and 1” (3cm) deep, this LEGO® Brick Sketches™ The Joker™ willlook amazing in any kid’s room, whether on a shelf, bedside table or hanging on the wall from the built-in hook."}]