[{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/chinese-new-year-pandas-40466","description":"Help kids mark a special occasion with these charming LEGO® BrickHeadz™ Chinese New Year Pandas (40466). This set contains a mother panda and her 2 cubs, one sitting, the other lying down. Each bear has its own sturdy baseplate so they can either be displayed together or separately around a bedroom. The set also comes with bamboo stalks, a lantern and a buildable mandarin orange tree, which is a symbol for good luck.\nWish a LEGO® fan good luck with the gift of these cute LEGO BrickHeadz™ Chinese New Year Pandas (40466). Each panda comes with its own baseplate so they can be displayed together or on their own.\nThis set includes 3 LEGO® BrickHeadz™ pandas – a mother bear and her 2 cubs – as well as a lantern and a buildable mandarin orange tree.\nMother panda stands over 3 in. (8 cm) tall and the two cubs each measure over 1.5 in. (5 cm) tall."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/budgie-40443","description":"Bird fans will flock to this BrickHeadz™ Budgie (40443) build-and-display set. The budgie (also known as a parakeet) and chick both sit on iconic BrickHeadz stands designed to look like wooden bird perches. The stands fit into a sturdy brown base that resembles the bottom of a birdcage and comes with 2 stickers – 1 with feathers, 1 with footprints – for decorating the base. This buildable pet set is a perfect gift for all kids, BrickHeadz collectors and anyone who loves birds.\nCollectible construction set featuring cute LEGO® BrickHeadz™ models of a budgie (also known as a parakeet) and chick together on brick-built stands that fit into a cage bottom-style base.\nMakes a great gift for LEGO® fans, BrickHeadz™ collectors and pet lovers aged 8 and up.\nStanding over 3 in. (9 cm) high, this 261-piece model features brick-built, wood-effect stands, plus 2 stickers – 1 with feathers, 1 with footprints – for decorating the base."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/goldfish-40442","description":"Kids who love animals will adore this BrickHeadz™ Goldfish (40442) build-and-display set. The goldfish and fry both sit on iconic BrickHeadz stands and look as if they’re ready to blow bubbles underwater. The stands fit into a sturdy, blue base that includes coral and plants and comes with 2 stickers – 1 with bubbles, 1 with corals – for decorating the base. This buildable pet set is a perfect gift for all kids, BrickHeadz collectors and pet lovers.\nCollectible construction set featuring fun LEGO® BrickHeadz™ models of a goldfish and fry together in a water environment.\nMakes a great gift for LEGO® fans, BrickHeadz™ collectors and pet lovers aged 8 and up.\nStanding over 3.5 in. (10 cm) high, this 186-piece model features coral and plants, plus 2 stickers – 1 with bubbles, 1 with corals – for decorating the base."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/goofy-pluto-40378","description":"Collectors of LEGO® BrickHeadz™ will love Goofy & Pluto (40378), featuring 2 classic Disney characters. Goofy, wearing his familiar turtleneck sweater and tall green hat, stands alongside the playful Pluto. The 2 lovable Disney friends come with sturdy baseplates that make them easy to display, either individually or alongside other BrickHeadz models. Collectors of LEGO BrickHeadz can combine elements of different sets to create fun, mashed-up characters of their own.\nThis collectible building set lets kids construct fun LEGO® BrickHeadz™ models of 2 of Disney’s most recognizable characters: Goofy and Pluto.\nA great gift for LEGO® and Disney fans, this set provides an age-appropriate build-and-play experience for kids aged 10 and up.\nWith Goofy standing over 3” (8cm) tall and Pluto over 1” (5cm) tall, this 214-piece buildable toy delivers creative fun on a big scale as kids build, play and display."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/wedding-groom-40384","description":"Celebrate a friend’s, family member’s or your own upcoming marriage with a LEGO® BrickHeadz™ Wedding Groom (40384) building kit. The fun model comes with a pair of glasses, hat, suit decorations, a ring and other optional pieces to personalize the facial expression, hair and skin color. With at least 11 possible looks, there's plenty of creative construction to enjoy before the big day!\nThis collectible LEGO® BrickHeadz™ buildable model of a smartly dressed gentleman with customizable facial expression, hair and skin color makes a great gift for a groom on or before his wedding day.\nSimple and fun to build, the set is suitable for anyone aged 10 and up.\nWith 255 pieces and standing more than 3” (8cm) tall, this buildable Wedding Groom looks great combined with the corresponding LEGO® BrickHeadz™ Wedding Bride (40383) or in pairs!"},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/birthday-clown-40348","description":"Make anyone’s day even more special with this LEGO® BrickHeadz™ 40348 Birthday Clown. This cute construction character has all the details you would expect in a festive clown, including colorful clothing, iconic orange hair and tall hat, 2 balloons, birthday gift, happy birthday flag and a cake with a candle. This fun set also comes with a sticker sheet with “HAPPY BIRTHDAY!” in a selection of languages.\n\nBuildable LEGO® BrickHeadz™ interpretation of a Birthday Clown features BrickHeadz eyes and real-life clown detailing, including colorful clothing, iconic orange hair and tall hat, 2 balloons, birthday gift, happy birthday flag and a cake with a candle.\nSticker sheet message available in English, German, French, Italian, Spanish, Portuguese, Japanese, Chinese, Korean and Hungarian.\nHave fun growing your LEGO® BrickHeadz™ collection with a great range of characters from your favorite movies, TV series, games and comics.\nMash up your LEGO® BrickHeadz™ construction characters to create super-cool hybrids or your own amazing characters.\nBirthday Clown toy stands over 4” (12cm) tall."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/donald-duck-40377","description":"Fans of LEGO® BrickHeadz™ and classic Disney characters will love this model of Donald Duck (40377). Check out Donald’s cute sailor shirt, cap and bow tie – and his orange bill, legs and feet. The adorable duck also comes with a sturdy baseplate that makes him easy to display, either by himself or alongside other classic BrickHeadz models. Collectors of LEGO BrickHeadz can also have fun combining different elements of the models to create crazy hybrid characters of their own.\nThis collectible building set lets kids construct a fun LEGO® BrickHeadz™ model of Donald Duck in all his iconic detail.\nA great gift for LEGO® and Disney fans, this set provides an age-appropriate, build-and-play experience for kids aged 10 and up.\nWith 90 pieces and standing over 3” (8cm) tall, this Donald Duck buildable toy will inspire creative construction on a large scale as kids build, play and display."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/lady-liberty-40367","description":"Celebrate freedom with the LEGO® Brickheadz™ 40367 Lady Liberty. This LEGO brick interpretation of the Statue of Liberty comes in a sand-green color with a gold-colored torch element and makes a great gift for LEGO fans to build and proudly display.\n\nFeatures a buildable LEGO® Brickheadz™ version of the Statue of Liberty in sand-green color with a gold-colored torch element.\nLady Liberty stands over 4” (11cm) tall."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/monkey-king-40381","description":"LEGO® Monkie Kid™ fans will love building their own brilliant LEGO BrickHeadz™ version of the Monkey King (40381). This awesome little model of a legendary character from the classic Chinese novel Journey to the West is fun to build solo or with friends and family. It comes with step-by-step, illustrated instructions so even LEGO newcomers can build with confidence. A fun gift idea for creative kids aged 10 and up, this collectible toy includes a baseplate to create an eye-catching display.\nLEGO® Monkie Kid™ fans will love building their own LEGO BrickHeadz™ version of the Monkey King (40381), recreating details of this legendary character from the classic Journey to the West novel to create a cool display.\nThis 175-piece LEGO® toy building set makes an awesome birthday present, holiday gift or anytime surprise for kids aged 10 and up. It comes with illustrated instructions so even LEGO beginners can build independently.\nThis LEGO® brick-built Monkey King toy figure includes a baseplate for display and measures 5” (12.8cm) tall – it won’t take up too much space but it’s sure to grab the attention of any passerby wherever it is displayed."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/the-mandalorian-the-child-75317","description":"Inspire memories of epic Star Wars: The Mandalorian stories with this fun building toy for creative kids, featuring LEGO® BrickHeadz™ versions of The Mandalorian and the Child (75317). Fans will appreciate authentic details such as The Mandalorian’s signature weapons – a blaster rifle and a blaster pistol. The Child has adjustable ears to create happy and sad expressions, and it sits in a hoverpram ‘floating’ on 4 transparent LEGO elements.\n\nRewarding build, cool display\nA great addition to any Star Wars™ fan’s collection, this awesome construction toy is fun to build solo or with friends and family, and each of the buildable LEGO figures has a baseplate to create an eye-catching display.\n\nTop gifts\nThe LEGO Group has been recreating iconic starships, vehicles, locations and characters from the legendary Star Wars universe since 1999. LEGO Star Wars is now its most successful theme offering a huge variety of birthday, holiday and surprise gift ideas to delight all ages.\n\nStar Wars: The Mandalorian fans and creative kids will love building their own LEGO® BrickHeadz™ versions of the Child and The Mandalorian (75317), recreating authentic details to create a cool display.\nThe Mandalorian buildable LEGO® figure has signature weapons – a blaster rifle clipped on the back and a blaster pistol in hand – to spark memories of thrilling Star Wars: The Mandalorian scenes.\nYoungsters will love the Child building toy with adjustable ears for different expressions, and its hoverpram ‘floating’ on a transparent LEGO® element. Both construction models have baseplates for display.\nThis 295-piece LEGO® BrickHeadz™ Star Wars™ building toy makes an awesome birthday present, holiday gift or anytime surprise for Star Wars: The Mandalorian fans and LEGO builders aged 10 and up.\nThe Mandalorian measures 3” (8cm) tall and the Child and hoverpram building toy measures 3” (8cm) high – they won’t take up too much space but are sure to make a big impression wherever they are displayed.\nThis battery-free construction toy offers a fun building experience, so fans can enjoy time alone or with family and friends creating LEGO® BrickHeadz™ versions of 2 popular Star Wars: The Mandalorian characters.\nThinking of buying this building set for a Star Wars™ fan new to LEGO® sets? No problem. It comes with step-by-step, illustrated instructions so they can take on the construction project with Jedi-level confidence. v The exciting LEGO® Star Wars™ range of building toys includes collectible, build-and-display models and construction playsets to recreate epic scenes from the Star Wars saga. There’s something for fans of all ages.\nNo need to use the Force to connect or pull apart LEGO® bricks in this building set! The bricks meet the highest industry standards to ensure consistency and a perfect, easy connection.\nLEGO® bricks and pieces are dropped, crushed, twisted, heated and analyzed to ensure that every building set meets the highest safety standards here on Earth – and in any galaxy you travel to!"},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/wedding-bride-40383","description":"This LEGO® BrickHeadz™ Wedding Bride (40383) is a fun way to celebrate an impending marriage – whether a friend’s, a family member’s or your own! The buildable model comes with a pair of glasses, flowers, dress decorations, a ring and other optional pieces to personalize the bride's facial expression, hair and skin color. With at least 14 possible looks, there's plenty of opportunity to get creative before the big day!\nThis collectible LEGO® BrickHeadz™ buildable model of a beautiful bride with customizable facial expression, hair and skin color makes a great gift for a bride to be.\nSimple and fun to build, the set is suitable for anyone aged 10 and up.\nWith 306 pieces and standing more than 3” (8cm) tall, this buildable Wedding Bride looks great combined with the corresponding LEGO® BrickHeadz™ Wedding Groom (40384) or in pairs!"},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/easter-sheep-40380","description":"Looking for a unique gift for Easter Sunday 2020? Then check out this lovable LEGO® BrickHeadz™ Easter Sheep (40380). With a colorful tulip growing at one side and 2 Easter eggs at the other, the super-cute sheep is using a paint pot and brush to color the eggs. No wonder there are paint splashes on its wool! Standing on a sturdy baseplate, the Easter Sheep is a fun, lasting gift idea for him, her, kids, boyfriend, girlfriend, husband, wife… at any time of year!\nThis collectible LEGO® BrickHeadz™ buildable model of a cute sheep painting Easter eggs makes a perfect gift for Easter and looks adorable all year round.\nA fun way to wish a friend or family member ‘Happy Easter’, this set is a suitable building toy for anyone aged 10 and up.\nWith 192 pieces and standing more than 3” (8cm) tall, this is a great buildable BrickHeadz™ sheep gift for kids, him, her, boyfriend, girlfriend, husband, wife… anyone who deserves a fun start to their Easter!"},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/frankenstein-40422","description":"LEGO® BrickHeadz™ Frankenstein (40422) is a fun recreation of the famous fictional character. As part of the LEGO BrickHeadz collection, the figure comes with its own character ID and a sturdy baseplate for easy display, either individually or alongside other BrickHeadz models. Great gift for kids, BrickHeadz collectors and any Frankenstein fan!\nThis collectible building set lets kids construct a fun LEGO® BrickHeadz™ model of one of the most recognizable characters from the horror genre: Frankenstein’s monster.\nA great gift for fans of LEGO® bricks and fun monsters, this building set provides an age-appropriate build-and-play experience for kids aged 10 and up.\nCombine with other LEGO® BrickHeadz™ models to create an impressive collection.\nStanding over 3” (9cm) tall, this 108-piece buildable toy delivers monster fun for kids at any time of the year."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/thanksgiving-turkey-40273","description":"Give thanks and prepare for fun celebrations with this cute LEGO® BrickHeadz™ 40273 Thanksgiving Turkey. Check out its yellow beak, brown wings and detachable carrot, plus buildable garden scene with white picket fences, carrots and a pumpkin. This fun construction character also comes with a buildable collector's baseplate with a seasonal calendar and BrickHeadz logo for easy display in the home, office or anywhere you like.\n\nBuildable LEGO® BrickHeadz™ Thanksgiving Turkey construction character features a yellow beak, brown wings and a detachable carrot.\nAlso includes a buildable garden scene with 2 white picket fences, 2 carrots and a pumpkin.\nEach LEGO® BrickHeadz™ construction character comes with its own buildable collector's baseplate featuring a seasonal calendar and BrickHeadz logo.\nHave fun growing your LEGO® BrickHeadz™ collection with other characters from your favorite films, TV series, games and comics.\nMash up your LEGO® BrickHeadz™ construction characters to create supercool hybrids or your own amazing characters.\nStands over 3” (8cm) tall without baseplate.\nBaseplate measures over 4” (11cm) wide and 3” (9cm) deep."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/shorthair-cats-40441","description":"This BrickHeadz™ cat and kitten, build-and-display set will have cat fans purring with delight. The adult shorthair cat wears a bow tie, has a movable tail and sits next to a cute kitten on a sturdy baseplate in a decorated basket. This buildable pet set is a great gift for all kids, BrickHeadz collectors and anyone who loves cats.\nCollectible construction set featuring fun LEGO® BrickHeadz™ models of a shorthair cat and kitten sitting together in a basket.\nStanding over 3” (8cm) tall, this 250-piece model features a bow tie, movable tail and a decorated basket.\nA great gift for LEGO® fans, BrickHeadz™ collectors and pet lovers aged 8 and up."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/lucky-cat-40436","description":"This adorable LEGO® BrickHeadz™ Lucky Cat (40436) is a great gift for kids at Chinese New Year. The model has long whiskers, a cute pink nose and incorporates a lever at the back that moves the cat’s paw up and down. Displayed on a sturdy baseplate, the Lucky Cat is a fun, lasting gift that delivers a message of good fortune all year round.\n\nThis collectible LEGO® BrickHeadz™ buildable model of a traditional Chinese Lucky Cat sits on a sturdy base, making it ideal for play or display.\nA great way to wish anyone ‘Happy New Year’, this set is suitable for anyone aged 10 and up.\nWith 134 pieces and standing more than 3” (8cm) tall, this buildable Lucky Cat is a fun, traditional way to wish the recipient good luck at any time of the year."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/nutcracker-40425","description":"LEGO® BrickHeadz™ Nutcracker (40425) recreates the Nutcracker Prince from the famous Christmas story. This special BrickHeadz toy incorporates an open-and-close mouth and, in keeping with the Christmas theme, comes complete with Christmas tree and presents. The model has its own character ID and a sturdy baseplate for easy display, either individually or alongside other BrickHeadz models. Great gift for BrickHeadz collectors and any kid at Christmas.\nThis collectible building set lets kids construct a fun LEGO® BrickHeadz™ model of the prince who was turned into a nutcracker in the famous Christmas story.\nA great gift for kids, fans of LEGO® bricks and anyone at Christmas, this building set provides an age-appropriate build-and-play experience for ages 10 and up.\nCombine with other LEGO® BrickHeadz™ models to create an impressive collection.\nStanding over 3” (9cm) tall, this 180-piece buildable toy delivers magical fun for kids at Christmas and any other time of the year."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/valentine-s-bear-40379","description":"The adorable LEGO® BrickHeadz™ Valentine's Bear (40379) is the perfect way to let someone know how much they’re loved. Holding a large red heart, the cute brown bear sits on a picnic blanket together with his little bee friend, a honey jar and colorful flowers. Displayed on a sturdy baseplate, the Valentine's Bear is a fun, lasting gift idea for him, her, boyfriend, girlfriend, husband, wife… at any time of year, whether Valentine's, birthday, Christmas or just because.\n\nThis collectible LEGO® BrickHeadz™ buildable model of a cute brown bear holding a large red heart, sits on a picnic blanket together with his little bee friend, a honey jar and colorful flowers.\nA great way to let someone know how much they’re loved; this set is suitable for anyone aged 10 and up.\nWith 150 pieces and standing more than 3” (8cm) tall, this is a great buildable Valentine's Bear gift for him, her, boyfriend, girlfriend, husband, wife… anyone who deserves to feel loved, at any time of year."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/german-shepherd-40440","description":"Kids who love pets will adore this BrickHeadz™ dog and puppy, build-and-display set. The German shepherd wears a bandanna and has a movable tail, and the puppy looks very cute with his little red tongue sticking out. The dogs sit together on a sturdy baseplate in a decorated basket, making this buildable pet set a great gift for all kids, BrickHeadz collectors and pet lovers.\nCollectible construction set featuring fun LEGO® BrickHeadz™ models of a German shepherd dog and a puppy sitting together in a basket.\nStanding over 3” (8cm) tall, this 247-piece model features a bandanna, movable tail and a decorated dog basket.\nA great gift for LEGO® fans, BrickHeadz™ collectors and pet lovers aged 8 and up."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/kylo-ren-sith-trooper-75232","description":"Build and display legendary Star Wars™ villains Supreme Leader Kylo Ren and a Sith Trooper. This LEGO® BrickHeadz™ 75232 set features brick-built versions of the characters from the blockbuster Star Wars: The Rise of Skywalker movie, plus fun details like Kylo's signature Lightsaber and helmet, and the Sith Trooper's weapon and unique red armor. Fans can also mount these LEGO Star Wars building toy construction characters on the included baseplates to show their devotion to the mighty First Order.\n\nSupreme Leader Kylo Ren & Sith Trooper LEGO® BrickHeadz™ Star Wars™ building toys feature lots of authentic details from the blockbuster Star Wars: The Rise of Skywalker movie, including Kylo’s signature Lightsaber, cape and helmet, and the Sith Trooper's weapon and unique red armor.\nLEGO® BrickHeadz™ construction characters come with their own buildable collector's baseplate.\nEach LEGO® Star Wars™ figure stands over 2” (7cm) tall.\nBaseplates each measure over 1” (4cm) square."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/mr-mrs-claus-40274","description":"Invite LEGO® BrickHeadz™ 40274 Mr. & Mrs. Claus into your home for some festive fun. Check out Mr. Claus’ bobbled hat, bushy white beard, brown buckle and detachable sack, plus buildable tree and pile of gifts. Mrs. Claus has a buildable candy stick plus assorted cakes and cookie elements. Each construction character comes with a buildable collector's baseplate with a seasonal calendar and BrickHeadz logo for easy display by the fireplace, in your office or anywhere you like.\n\nBuildable LEGO® BrickHeadz™ Mr. & Mrs. Claus construction characters feature decorated eyes, festive red and white outfits, detachable gift sack and assorted cake and cookie elements.\nAlso includes a buildable tree and a pile of gifts.\nEach LEGO® BrickHeadz™ construction character comes with its own buildable collector's baseplate featuring a seasonal calendar and BrickHeadz logo.\nHave fun growing your LEGO® BrickHeadz™ collection with other characters from your favorite films, TV series, games and comics.\nMash up your LEGO® BrickHeadz™ construction characters to create supercool hybrids or your own amazing characters.\nEach character stands over 3” (8cm) tall without baseplate.\nEach baseplate measure over 4” (11cm) wide and 2” (7cm) deep."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/dragon-dance-guy-40354","description":"Mark a memorable moment in the Chinese calendar with this LEGO® BrickHeadz™ 40354 Dragon Dance Guy. This colorful construction character is dressed in a traditional dragon costume, complete with a dragon head and golden dragon tail. This wonderful, authentic set signifying luck and power also includes a base decorated with 2 lanterns representing the annual Lantern Festival.\n\nBuildable LEGO® BrickHeadz™ interpretation of a Dragon Dancer features BrickHeadz eyes and authentic dragon head and tail detailing, plus a Lantern Festival scene for the perfect Chinese New Year gift.\nHave fun growing your LEGO® BrickHeadz™ collection with a great range of characters from your favorite movies, TV series, games and comics.\nMash up your LEGO® BrickHeadz™ construction characters to create super-cool hybrids or your own amazing characters.\nDragon Dance Guy construction toy stands over 3” (9cm) tall."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/valentine-s-puppy-40349","description":"Give the perfect valentine gift with this LEGO® BrickHeadz™ 40349 Valentine’s Puppy. Holding a matching red heart and rose, this lovable construction character features BrickHeadz eyes, posable ears and tail, and stands in a nature scene lined by flowers. What more could your lucky valentine wish for!\n\nBuildable LEGO® BrickHeadz™ Valentine’s Puppy holding a heart and rose features BrickHeadz eyes and posable ears and tail.\nHave fun growing your LEGO® BrickHeadz™ collection with a great range of characters from your favorite movies, TV series, games and comics.\nMash up your LEGO® BrickHeadz™ construction characters to create super-cool hybrids or your own amazing characters.\nValentine's Puppy buildable toy stands over 3” (8cm) tall."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/reindeer-elf-and-elfie-40353","description":"Get into the holiday spirit with these adorable, brick-built LEGO® Brickheadz™ 40353 Reindeer, Elf and Elfie characters. A fun gift for LEGO fans to build and display, the reindeer comes with a buildable North Pole scene, featuring a signpost and Santa's mailbox with 2 letter elements.\n\nFeatures buildable LEGO® Brickheadz™ Reindeer, Elf and Elfie characters on LEGO baseplates.\nReindeer’s baseplate comes with an attached, buildable North Pole scene, featuring a signpost with directions to LEGOLAND® in Billund, Denmark, and to the US town of Brick, plus Santa's mailbox with 2 letter elements.\nMakes a fun seasonal gift for LEGO® fans.\nReindeer stands over 4” (12cm) tall."},{"theme":"brickheadz","themeUrl":"https://www.lego.com/en-us/themes/brickheadz","productUrl":"https://www.lego.com/en-us/product/easter-chick-40350","description":"Bring a smile to anyone’s face this Easter with this LEGO® BrickHeadz™ 40350 Easter Chick. This adorable construction character with iconic BrickHeadz eyes is surrounded by a colorful scene featuring Easter flowers and leaves… and hidden eggs!\n\nBuildable LEGO® BrickHeadz™ interpretation of an Easter Chick with BrickHeadz eyes stands in a scene featuring colorful Easter flowers and leaves, and 2 eggs.\nHave fun growing your LEGO® BrickHeadz™ collection with a great range of characters from your favorite movies, TV series, games and comics.\nMash up your LEGO® BrickHeadz™ construction characters to create super-cool hybrids or your own amazing characters.\nEaster Chick construction character stands over 3” (8cm) tall."}]