[{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/town-center-60292","description":"Kids get to dive into the LEGO® City Adventures TV series with this premium-quality LEGO City Town Center (60292) playset. There’s a toy pizza restaurant, recycling station, car wash, EV charging station, martial arts dojo and a park with a kids’ ride, plus fun LEGO City minifigure characters. And with the included LEGO City Road Plates, kids can connect to other playsets to expand their city – just the way they like it! A great gift for kids aged 6 and up. This playset comes with a simple building guide and Instructions PLUS – an interactive building guide with amazing zoom and rotate viewing tools that quickly help kids become master builders. Instructions PLUS is part of the free LEGO Building Instructions app for smartphones and tablets. The creative world of LEGO City! LEGO City playsets deliver an enjoyable build-and-play experience with feature-rich buildings, realistic vehicles and fun characters that stimulate imaginative, open-ended role play based on real-life events.\n\nThe premium-quality LEGO® City Town Center (60292) playset comes with detailed buildings, cool vehicles and fun characters from the LEGO City Adventures TV series. A treat for kids aged 6 and up!\nIncludes LEGO® Road Plates and all kids need to build a toy pizzeria, car wash, dojo, park, recycling station, truck, EV, motorcycle and bicycle, plus 8 minifigures and baby and guide dog figures.\nThis LEGO® set is packed with realistic functions. Kids can drive vehicles through the car wash to spin the washer brushes, collect the recycling containers with the truck’s crane and lots more.\nThe LEGO® City Town Center playset makes an impressive Christmas, birthday or any-other-day gift for kids who love creative play and for fans of the LEGO City Adventures TV series.\nWhen built, the LEGO® City Town Center construction toy measures over 9.5 in. (24 cm) high, 16 in. (41 cm) wide and 17.5 in. (44 cm) deep.\nAccessory elements include pizza boxes and a pizza serving bat. There’s also a set of LEGO® Road Plates, so kids can connect to other LEGO playsets to build their own city!\nIncludes a printed building guide and Instructions PLUS – part of the free LEGO® Building Instructions app for smart devices. This interactive construction guide helps kids become master builders!\nLEGO® City playsets come with colorful buildings, cool toy vehicles and fun characters that stimulate imaginative role play as kids create open-ended adventures in realistic settings.\nAll LEGO® bricks and piecesare produced to strict industry quality standards to ensure they are consistent, compatible and fun to build with – it’s been that way since 1958.\nLEGO® City building toys are thoroughly tested to ensure every playset meets stringent safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/shopping-street-60306","description":"This premium multi-model LEGO® City Shopping Street (60306) playset is bursting with exciting features and functions. There’s a bakery, bike shop and park with an outdoor training center. Kids also get a toy cargo bike, sports car and a service truck with a cherry picker, plus 6 fun minifigures. And with the included LEGO City Road Plates, kids can connect to other playsets to expand their city – just the way they like it!\n\nMulti-model playset for kids aged 6 and up\nThe LEGO City Shopping Street playset comes with an easy-to-follow building guide that helps youngsters experience the pride of constructing their own LEGO toys. Kids, friends and families can join for a fun building experience and endless hours of imaginative play.\n\nInspirational LEGO toys for boys and girls\nLEGO City building sets stimulate open-ended role play based on real-life events, with feature-rich buildings, realistic vehicles and fun characters that deliver an enjoyable, fun-filled, build-and-play experience.\n\nThe premium-quality LEGO® City Shopping Street (60306) playset comes with detailed buildings, cool vehicles and fun characters with exciting accessories. A treat for kids aged 6 and up!\nIncludes LEGO® Road Plates with car and bike lanes and a crosswalk, plus a toy bakery, bike shop, outdoor training center, cargo bike, service truck with cherry picker, sports car and 6 minifigures.\nThis LEGO® set is packed with realistic features for imaginative play. And with the included LEGO Road Plates,kids can connect to other playsets to expand their city – just the way they like it!\nThe high-quality LEGO® City Shopping Street playset makes an impressive Christmas, birthday or any-other-day gift for boys and girls 6 and up.\nWhen built, the LEGO® City Shopping Street model measures over 5 in. (13 cm) high, 16 in. (40 cm) wide and 11 in. (28 cm) deep.\nLEGO® accessory elements include a croissant, bread, pretzel, banana, water bottle, a leaking fire hydrant, toy light bulb, glow-in-the-darkstreetlight elements and a dog poop.\nThis toy playset comes with an easy-to-follow building guide that provides younger LEGO builders with a satisfying, independent build-and-play experience.\nLEGO® City My City sets come with colorful buildings, cool toy vehicles and fun characters that stimulate imaginative role play as kids create open-ended adventures in realistic settings.\nAll LEGO® bricks and pieces are produced to strict industry quality standards to ensure they are consistent, compatible and fun to build with – it’s been that way since 1958.\nLEGO® City building toys are thoroughly tested to ensure every playset meets stringent safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/family-house-60291","description":"The LEGO® City Family House (60291) has a lounge, kitchen, hobby room, bedroom, bathroom and lots of green-living features, including toy solar panels, charging station and a cool EV. Kids can expand this playset using the included Road Plates to create their own city. And with a family of minifigures, plus a Labrador retriever figure, there’s everything they need for hours of imaginative role play.A great build-and-play experience for kids aged 5 and upThis playset includes an easy-to-follow building guide and Instructions PLUS – part of the free LEGO Building Instructions app for smartphones and tablets. This interactive construction guide with zoom and rotate viewing tools quickly helps young LEGO builders become master builders.Awesome toys for boys and girlsLEGO City building sets stimulate open-ended role play based on real-life events, with feature-rich buildings, realistic toy vehicles and fun characters that deliver an enjoyable, fun-filled, build-and-play experience.\n\nThis impressive LEGO® City Family House (60291) playset is home to lots of fun features and details that will inspire endless hours of imaginative play for boys and girls aged 5 and up.\nWhat’s in the box? All kids need to create a 3-level toy eco-house with solar panels, charging station, toy EV and more, plus mom, dad, daughter and son minifigures and a Labrador retriever figure.\nThe family house is overflowing with realistic details that kids will love. And with the included LEGO® City Road Plate system, kids can connect to other playsets to create their own city!\nThe LEGO® City Family House playset makes a great Christmas, birthday or any-other-day gift for LEGO City fans and kids aged 5 and up who love creative play.\nWhen built, the Family House measures over 8 in. (22 cm) high, 10 in. (25 cm) wide and 10 in. (25 cm) deep, while the EV measures over 2 in. (5 cm) high, 4 in. (11 cm) long and 1.5 in. (4 cm) wide.\nLEGO® accessory elements include a toy sword, guitar and speaker, paintbrush and pot, radio, trophy, hockey sticks, games console and a flat-screen TV.\nIncludes a printed building guide and Instructions PLUS – part of the free LEGO® Building Instructions app for smart devices. This interactive construction guide helps kids become master builders!\nLEGO® City playsets come with colorful buildings, cool toy vehicles and fun characters that stimulate creative role play as kids act out open-ended adventures in realistic settings.\nAll LEGO® bricks and pieces are produced to strict industry quality standards to ensure they are consistent, compatible and fun to build with – it’s been that way since 1958.\nLEGO® City building toys are thoroughly tested to ensure every playset meets stringent safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/fire-command-unit-60282","description":"This exciting LEGO® City Fire Command Unit (60282) playset includes a classic fire truck with a functioning cherry picker arm. Kids also get a host of LEGO City TV characters, including Bob, Feldman and Toastie the firefighter robot complete with a water cannon that shoots water elements. Transport your little hero to the heart of the LEGO City Adventures TV series, where they get to decide the script!\n\nIdeal building toy for kids aged 5 and up\nYou'll find easy-to-follow building instructions for this LEGO City playset in the box. Or you can download Instructions PLUS, part of the free LEGO Building Instructions app for smartphones and tablets. This interactive construction guide, with amazing zoom and rotate viewing tools, quickly turns kids into master builders!\n\nCreative play for kids\nLEGO City fire playsets deliver a world of fun where creativity can thrive, with feature-rich buildings, realistic vehicles and exciting characters that inspire imaginative play based on real-life scenarios.\n\nKids can play out stories from the popular LEGO® City Adventures TV series with the LEGO City Fire Command Unit (60282) playset, featuring realistic vehicles and fun characters from the TV show.\nWhat’s in the box? A cool toy fire truck with functioning cherry picker, a science lab setting with stackable LEGO® flames, plus LEGO City TV characters Toastie the firefighter robot, Bob and Feldman.\nKids can elevate the fire truck's cherry picker, shoot water elements from Toastie the firefighting robot to knock out the LEGO® flames, and play out stories featuring fun LEGO City TV characters.\nThis high-quality playset makes an impressive Christmas, birthday or any-other-day gift for fans of the LEGO® City Adventures TV series and for kids who love creative play.\nWhen built, the fire truck (with cherry picker retracted) measures over 4 in. (10 cm) high, 13 in. (33 cm) long and 2.5 in. (6 cm) wide.\nThe fire truck has a compartment for storing the firefighting accessories, plusa trailer with a ramp for transporting Toastie the firefighter robot. Includes 3 firefighter minifigures with helmets.\nComes with easy-to-follow building instructions and Instructions PLUS – an interactive guide for budding builders that’s part of the free LEGO® Building Instructions app for smart devices.\nLEGO® City fire sets nurture imaginative role play and open-ended adventures in realistic settings with detailed buildings, cool vehicles and fun characters loved by kids.\nHave you ever wondered how LEGO® bricks connect and pull apart so consistently? It’s because LEGO components are produced to meet strict industry standards for quality.\nLEGO® pieces are rigorously tested to make sure all LEGO building playsets meet stringent global standards for safety."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/police-patrol-boat-60277","description":"This floating LEGO® City Police Patrol Boat (60277) toy is packed with impressive features, including a detailed control station and surveillance drone. Kids can flick a lever to release the diver and scuba scooter and fire the net shooter to entangle the crooks' minisub. With 5 minifigures, including Gracie Goodhart, Frankie Lupelli and Hacksaw Hank from the LEGO City Adventures TV series, onboard, there's plenty of inspiration for creative role play.\n\nFun and easy to build\nIncludes an easy-to-follow building guide and Instructions PLUS – part of the free LEGO Building Instructions app for smartphones and tablets. This interactive construction guide, with zoom and rotate viewing tools, quickly helps budding LEGO builders become master builders!\n\nCool toys for kids\nLEGO City police playsets deliver exciting play scenarios that depict real life in a fun and imaginative way, with realistic vehicles and inspiring characters that kids love.\n\nKids can play out scenes from the LEGO® City Adventures TV series with this floating police patrol boat toy. It’s packed with cool features and comes with fun LEGO City TV minifigure characters.\nWhat’s in the box? All kids need to build a floating toy police boat with a cool control station and prison hold, plus a drone, scuba scooter, minisub, LEGO® City TV characters and a toy shark figure.\nKids can sail the toy boat on water, fire the net shooter to entangle the crooks, flick a leverto launch the scuba scooter and create stories featuring the included LEGO® City TV characters.\nThis LEGO® City Police Patrol Boat (60277) playset makes a great Christmas, birthday or any-other-day gift for kids aged 5 and up. Requires only very basic building skills.\nThe police patrol boat toy measures over 5 in. (13 cm) high, 13 in. (33 cm) long and 5 in. (12 cm) wide.\nLEGO® accessories include a bank safe with gold bar elements and equipment for the police diver minifigure.\nIncludes a printed construction guide and Instructions PLUS – an interactive guide for budding builders. Part of the free LEGO® Building Instructions app, available for smartphones and tablets.\nLEGO® City police sets inspire open-ended creativity with feature-rich buildings, cool vehicles and fun characters, helping youngsters develop physical skills and confidence as they build and play.\nAll LEGO® bricks and pieces are produced according to strict industry quality standards to ensure they are consistent, compatible and fun to build with – it’s been that way since 1958.\nLEGO® City building toys are thoroughly tested to ensure every playset meets strict safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/fire-rescue-helicopter-60281","description":"A treat for fans of the LEGO® City Adventures TV series, this exciting LEGO City Fire Rescue Helicopter (60281) playset includes a toy helicopter, motorbike and a power plant setting with stackable LEGO flames for big blazes! Kids can shoot the helicopter's water cannons to knock out the fire and enjoy role-play fun with 3 minifigures, including a worker, helicopter pilot and LEGO City TV hero Clemmons.\n\nCool LEGO set for kids aged 5 and up\nYou'll find building instructions for this LEGO City set in the box. Or you can download Instructions PLUS, part of the free LEGO Building Instructions app for smartphones and tablets. This interactive building guide, with amazing zoom and rotate viewing tools, turns budding LEGO builders into master builders!\n\nA great gift for creative kids\nLEGO City fire playsets deliver an enjoyable build-and-play experience with feature-rich buildings, realistic vehicles and fun characters that stimulate imaginative, open-ended role play based on real-life events.\n\nA treat for everyday heroes aged 5 and up, this Fire Rescue Helicopter (60281) playset is perfect for kids who love cool firefighting vehicles and for fans of the LEGO® City Adventures TV series.\nWhat’s in the box? Everything kids need to build a toy helicopter, motorbike, power station setting and LEGO® fires, plus 3 minifigures, including Clemmons from the LEGO City Adventures TV series.\nKids can stack the LEGO® flames to create big fires, then shoot the helicopter's water cannon elements to put them out and create LEGO City Adventures TV series stories with 3 fun minifigures.\nA great gift idea for any occasion, this firefighter playset delivers endless hours of fun for LEGO® City fans and kids aged 5 and up who love imaginative play. Requires only basic building skills.\nWhen built, the fire rescue helicopter toy measures over 3.5 in. (10 cm) high, 10 in. (26 cm) long and 3.5 in. (9 cm) wide.\nLEGO® accessories include a stretcher (stored in the helicopter's cargo hold), firefighter helmet, wrench and safety helmet.\nComes with an easy-to-follow, printed building guide and Instructions PLUS – an interactive building guide for budding builders. Part of the free LEGO® Building Instructions app for smart devices.\nLEGO® City fire sets nurture imaginative role play with detailed buildings, cool vehicles, fun characters and settings that depict real life in a fun and imaginative way.\nAll LEGO® City components meet strict industry standards to ensure they are compatible and connect and pull apart consistently every time.\nAll LEGO® pieces are rigorously tested to make sure every building set meets stringent global safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/skate-park-60290","description":"This LEGO® City Skate Park (60290) toy has everything kids need to stage exciting skating events, including a quarter pipe, ramp, seesaw and grind rail. Kids can also expand this playset to create their own city, via the included Road Plate. And with BMX rider, wheelchair athlete and skateboarder minifigures in the mix, endless hours of crowd-thrilling fun are guaranteed!Ideal for boys and girls aged 5 and upThis toy building set comes with an easy-to-follow building guide and Instructions PLUS– part of the free LEGO Building Instructions app for smartphones and tablets. This interactive construction guide with zoom and rotate viewing tools helps young LEGO builders become master builders.The creative world of LEGO CityLEGO City playsets deliver an exciting build-and-play experience. Kids play out stories that depict real life in a fun and imaginative way with feature-rich buildings, realistic vehicles and inspiring characters.\n\nThis action-packed LEGO® City Skate Park (60290) playset will send kids’ creativity soaring. Perfect for boys and girls aged 5 and up, it inspires open-ended play based on real-life scenarios.\nWhat’s in the box? All kids need to make a pop-up toy skate park, including a LEGO® Road Plate, barriers, flags, ramps, a seesaw, plus a truck and BMX rider, wheelchair athlete and skater minifigures.\nKids get to host cool skating events and perform crowd-thrilling stunts and tricks. And with the included Road Plate, they can connect to other Road Plate playsets to expand their city.\nThis LEGO® City Skate Park playset makes a great Christmas, birthday or any-other-day gift for kids who love imaginative role play.\nWhen built, the Skate Park measures over 4.5 in. (12 cm) high, 7.5 in. (19 cm) wide and 8.5 in. (22 cm) deep, while the truck measures over 2 in. (5 cm) high, 4 in. (11 cm) long and 1.5 in. (4 cm) wide.\nLEGO® accessories in the set include helmets for the skater minifigures, a mobile phone and Vita Rush soda elements.\nIncludes a printed building guide and Instructions PLUS – part of the free LEGO® Building Instructions app for smart devices. This interactive guide helps budding builders become master builders!\nLEGO® City My City sets come with feature-rich buildings, cool toy vehicles and exciting characters that depict life in a fun and exciting way. Kids develop key life skills as they build and play.\nAll LEGO® bricks and pieces are produced according to strict industry quality standards to ensure they are consistent, compatible and fun to build with – it’s been that way since 1958.\nLEGO® City building toys are thoroughly tested to ensure every playset meets strict safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/airshow-jet-transporter-60289","description":"Send kids’ imaginations soaring with this LEGO® City Airshow Jet Transporter (60289) playset, including an articulated transporter truck and a cool toy jet airplane with adjustable tail fins and a tinted cockpit. Add the pilot and driver minifigures and an array of cool accessories for supersonic role-play adventures.\n\nExciting building set for kids aged 5 and up\nThis LEGO City playset comes with an easy-to-follow building guide and Instructions PLUS! Part of the free LEGO Building Instructions app for smartphones and tablets, this interactive construction guide, with zoom and rotate viewing tools, takes kids through the building process step by step.\n\nLEGO City Great Vehicles – Cool toys for kids\nKids grow up surrounded by amazing vehicles and machines, and with LEGO City Great Vehicles building sets they get to explore them up close with realistic models and fun characters that inspire open-ended, imaginative play.\n\nTreat your everyday hero to this impressive LEGO® City Airshow Jet Transporter (60289) building set, with cool vehicles and fun characters that send imaginative role play skyward.\nWhat's in the box? Everything kids need to create a toy articulated transporter with a trailer for carrying the supercool jet, plus pilot and driver minifigures and fun accessories.\nThis impressive building set features an articulated transporter with seating for the driver minifigure, plus an awesome jet withadjustable tail fins and a tinted minifigure cockpit.\nMakes a great Christmas, birthday or any-other-day treat for boys and girls aged 5 and up.\nWhen built, the LEGO® City Airshow Jet Transporter (with jet onboard) measures over 3 in. (8 cm) high, 13.5 in. (34 cm) long and 6.5 in. (17 cm) wide.\nAccessory elements include a coffee cup, toolbox, wrench, hammer, 2 marshaling wands, flight helmet and an air mask.\nIncludes a printed building guide and Instructions PLUS – an interactive construction guide with zoom and rotate viewing tools for young builders. Part of the free LEGO® Building Instructions app.\nLEGO® City Great Vehicles sets nurture kids’ physical skills and confidence with feature-rich models and fun characters that inspire open-ended creative play.\nAll LEGO® components meet strict industry standards to ensure they are consistent, compatible and fun to build with – it's been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global standards for safety."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/car-transporter-60305","description":"Kids can transport up to 3 LEGO® City Great Vehicles toy cars with the LEGO City Car Transporter (60305). This articulated transporter features a double-decker trailer with a raisable upper deck and working rear ramp. Kids also get a cool muscle car to transport, plus truck driver and motorist minifigures to kickstart the fun.\n\nExciting building set for kids aged 5 and up\nThis car transporter playset comes with easy-to-follow building instructions that provide younger LEGO builders with a satisfying, independent build-and-play experience – so your little truck driver will be on the road in no time!\n\nLEGO City Great Vehicles – Cool toys for kids\nKids grow up surrounded by amazing vehicles and machines, and with LEGO City Great Vehicles building sets they get to explore them up close, with realistic models and fun characters that inspire open-ended, imaginative play.\n\nTreat your everyday hero to this exciting LEGO® City Car Transporter (60305) building set, with cool toy vehicles and fun characters that will take imaginative role play into the fast lane.\nWhat's in the box? All kids need to create a toy car transporter and a cool muscle car with a removable roof, plus truck driver and motorist minifigures.\nKids can raise and lower the trailer's upper deck and rear ramp to load and transport up to 3 LEGO® City Great Vehicles cars, including the cool muscle car included with this set.\nMakes a great Christmas, birthday or any-other-day treat for boys and girls aged 5 and up.\nWhen built, the LEGO® City car transporter toy measures over 4.5 in. (11 cm) high, 12 in. (31 cm) long and 3 in. (8 cm) wide.\nLEGO® accessory elements in this set include a broom and a wrench.\nIncludes a printed building guide and Instructions PLUS – an interactive construction guide with zoom and rotate viewing tools for young builders. Part of the free LEGO® Building Instructions app.\nLEGO® City Great Vehicles playsets nurture kids’ physical skills and confidence with feature-rich models and fun characters that inspire open-ended creative play.\nAll LEGO® components meet strict industry standards to ensure they are consistent, compatible and fun to build with – it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global standards for safety."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/fire-ladder-truck-60280","description":"A treat for kids who love action toys, this LEGO® City Fire Ladder Truck (60280) playset features an iconic fire truck with a raisable extinguisher ladder, plus a water hydrant and stackable LEGO flames for bigger blazes! Bring on the included firefighter and LEGO City TV character Freya McCloud minifigures and the scene is set for endless LEGO City Adventures TV series action!\n\nGreat building toy for kids\nThis 4+ set includes a simple printed building guide and a Starter Brick that gives youngsters a partly constructed base from which to begin their creative building. And, with the free LEGO Building Instructions app for smartphones and tablets, kids get Instructions PLUS – an interactive construction guide that really makes building child's play!\n\nThe creative world of LEGO City\nLEGO City playsets deliver an enjoyable build-and-play experience with feature-rich buildings, realistic vehicles and fun characters that stimulate imaginative, open-ended role play based on real-life events.\n\nTreat an everyday hero to the excitement of LEGO® City with this 4+ Fire Ladder Truck (60280) playset, including an iconic fire truck toy and a popular LEGO City Adventures TV series character.\nWhat’s in the box? There’s a toy fire truck with a ladder and extinguisher, a water hydrant and stackable LEGO® flames, plus firefighter and LEGO City TV fire chief Freya McCloud minifigures.\nKids can raise the extinguisher ladder, stow firefighter tools in the truck's storage compartment and create stories starring LEGO® City Adventures TV series fire chief Freya McCloud.\nA treat for kids aged 4 and up, this firefighter playset makes a perfect birthday, Christmas or any-other-day gift for fans of LEGO® City and role-play action. Requires only basic building skills.\nWhen built, the fire ladder truck measures over 3.5 in. (9 cm) high, 6 in. (16 cm) long and 2.5 in. (7 cm) wide.\nLEGO® accessories include a firefighter axe and helmet, plus a fire extinguisher.\nIncludes a simple4+ building guide and Instructions PLUS – part of the free LEGO® Building Instructions app for smart devices. This interactive construction guide helps kids become master builders.\nLEGO® City 4+ sets let kids and grown-ups discover the joy of building and playing together, nurturing kids' creativity and imagination with realistic buildings, cool vehicles and fun characters.\nLooking for a high-quality children's toy? All LEGO® City components meet strict industry standards to ensure they are compatible and connect and pull apart consistently every time.\nPutting safety in the spotlight. LEGO® City bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/police-prisoner-transport-60276","description":"This LEGO® City Police Prisoner Transport (60276) toy comes with characters from the LEGO City Adventures TV series. Kids can reenact scenes and create their own exciting stories featuring police hero Duke DeTain and notorious crooks Snake Rattler and Clara The Criminal. A prisoner transport truck with jailbreak function, crook's souped-up tow truck and Duke's cool black motorcycle set the scene for explosive action.\n\nCool police playset for kids\nThis fun police toy comes with an easy-to-follow construction guide and Instructions PLUS – an interactive building guide with zoom and rotate viewing tools that help young LEGO builders become master builders. Instructions Plus is part of the free LEGO Building Instructions app for smartphones and tablets.\n\nThe inspiring world of LEGO City\nLEGO City police sets deliver an enjoyable build-and-play experience. The realistic vehicles, detailed buildings and fun characters stimulate imaginative, open-ended role play for children of all ages.\n\nKids aged 5+ can create their own LEGO® City TV action with this multi-model playset, featuring an iconic prisoner transporter and fun characters from the awesome LEGO City Adventures TV series.\nWhat’s in the box? All kids need to build a toy prisoner transporter, tow truck and police motorcycle, plus 4 minifigures including LEGO® City TV's Duke DeTain, Snake Rattler and Clara The Criminal.\nKids can explode the prison cell free from the truck, hook it up to the crook's souped-up tow truck, and give chase with the cool police motorcycle.\nThis action-packed LEGO® City Police Prisoner Transport (60276) playset makes an impressive Christmas, birthday or any-other-day gift for boys and girls aged 5 and up.\nWhen built, the prisoner transporter measures over 3 in. (8 cm) high, 5 in. (13 cm) long and 2.5 in. (6 cm) wide.\nLEGO® accessories include handcuffs, a motorbike helmet, safety helmet and 2 sticks of dynamite.\nComes with printed building instructions and InstructionsPLUS – part of the free LEGO® Building Instructions app, with zoom, rotate and visualization tools to bring the construction process to life.\nLEGO® City police playsets help kids grow physical skills and confidence with feature-rich buildings, realistic vehicles and fun characters that inspire open-ended creative play.\nAll LEGO® bricks and pieces are produced according to strict industry quality standards to ensure they are consistent, compatible and fun to build with – it's been that waysince 1958.\nLEGO® City building toys are thoroughly tested to ensure every playset meets strict safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/holiday-camper-van-60283","description":"Boys and girls can travel wherever their imaginations take them with this LEGO® City Holiday Camper Van (60283) playset. The toy RV is packed with realistic features for imaginative role play, including a furnished interior with kitchenette and sleeping facilities. And with mom and dad minifigures and a cute baby figure, the scene is set for endless family camping adventures.\n\nCreative build-and-play fun for kids aged 5 and up\nThis toy playset comes with a simple, printed building guide and Instructions PLUS. Part of the free LEGO Building Instructions app for smartphones and tablets, this interactive construction guide, with zoom and rotate viewing tools, really does make LEGO building child’s play!\n\nThe creative world of LEGO City\nLEGO City Great Vehicles building sets make great gifts for boys and girls. Children get to explore all kinds of cool vehicles and create stories and scenarios that depict real life in a fun and exciting way.\n\nKids can travel wherever their imaginations take them with this classic LEGO® City Holiday Camper Van (60283) playset, packed with realistic features to inspire fun, real-life role play.\nWhat’s inside the box? Everything a kid needs to create an awesome camper van with lots of cool features, plus mom and dad minifigures and a cute baby figure.\nThe holiday camper van has a furnished interior, which includes a table, kitchenette and sleeping area. And with an opening side panel and removable roof there’s plenty of room for hands-on play.\nA top Christmas, birthday or any-other-day gift for kids aged 5 and up who love model vehicles and role-play toys. This toy RV requires only very basic building skills.\nWhen built, the holiday camper van measures over 3.5 in. (9 cm) high, 6 in. (16 cm) long and 2 in. (5 cm) wide.\nAccessories include a cool baby carrier for the minifigures, camping stove and pan, plus fried egg and croissant food elements.\nIncludes a printed building guide and Instructions PLUS – part of the free LEGO® Building Instructions app for smart devices. This interactive construction guide helps kids become master builders.\nLEGO® City Great Vehicles adventure playsets feature realistic vehicles and fun characters to inspire open-ended creative play while helping youngsters improve physical skills and develop confidence.\nAll LEGO® City components meet strict industry standards to ensure they are compatible and connect and pull apart consistently every time.\nLEGO® City bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/race-buggy-transporter-60288","description":"Everything is awesome about this LEGO® City Race Buggy Transporter (60288) playset, featuring a toy SUV off-roader with a trailer for transporting the steerable Baja race buggy. And with 2 racing driver minifigures on standby, it’s all set for high-speed racing adventures! A great building set for boys and girls aged 5 and up With this LEGO playset you get a simple building guide and Instructions PLUS. Part of the free LEGO Building Instructions app for smartphones and tablets, this interactive construction guide, with zoom and rotate viewing tools, really does make LEGO building child’s play. Cool toy playsets for kids LEGO City Great Vehicles playsets put creativity into kids’ hands with feature-rich, land, air and water toys that spark the imagination. Children get to explore all kinds of realistic vehicles and create stories and scenarios that depict real life in a fun and imaginative way.\nPut kids’ creativity in the fast lane with this multi-model playset – an impressive introduction to the exciting LEGO® City Great Vehicles universe.\nWhat’s in the box? Everything kids need to create a toy SUV off-roader and trailer with fold-down ramps for transporting the steerable Baja race buggy, plus 2 driver minifigures and cool accessories.\nThe SUV off-roader seats the 2 minifigures. Kids can steer the Baja race buggy by tilting it left and right and can also combine this playset with other original LEGO® sets for even more action!\nThis LEGO® City Race Buggy Transporter (60288) playset makes a great Christmas, birthday or any-other-day surprise for boys and girls aged 5 and up.\nWhen built, the race buggy transporter (including the trailer and Baja race buggy) measures over 2.5 in. (7 cm) high, 11.5 in. (30 cm) long and 2.5 in. (6 cm) wide.\nLEGO® accessories include a toy race helmet, fire extinguisher, wrench and a hammer.\nIncludes a printed building guide and Instructions PLUS – an interactive construction guide with zoom and rotate viewing tools for young builders. Part of the free LEGO® Building Instructions app.\nLEGO® City Great Vehicles playsets nurture kids’ creativity, physical skills and confidence with feature-rich land, air and water vehicles and fun characters that inspire open-ended creative play.\nAll LEGO® components meet stringent industry standards to ensure they are consistent, compatible and fun to build with – it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global standards for safety."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/road-plates-60304","description":"This LEGO® City Road Plates (60304) building set adds a realistic backdrop to kids’ imaginative play, with glow-in-the-dark toy streetlights, traffic lights, road signs, traffic lane markings, speed bumps, a crosswalk, trees and greenery. Kids can place the Road Plates their way, build a city around them and connect to other LEGO Road Plate building sets to expand their city creations!A great gift for LEGO City fans aged 5 and upThe LEGO City Road Plates toy playset comes with an easy-to-followbuilding guide and Instructions PLUS – part of the free LEGO Building Instructions app for smartphones and tablets. This interactive construction guide with zoom and rotate viewing tools quickly helps young LEGO builders become master builders.Inspirational toys for boys and girlsLEGO City building sets stimulate open-ended, creative role play with feature-rich buildings, realistic toy vehicles and fun characters that deliver an enjoyable, fun-filled play experience based on real-life events.\n\nKids can add a realistic backdrop to their LEGO® play with this LEGO City Road Plates (60304) building set. The perfect starting point for an awesome build-and-play experience.\nWhat’s in the box? Kids get 5 LEGO® Road Plates featuring traffic lane markings, speed bumps and a crosswalk, plus glow-in-the-dark streetlights, toy traffic lights, road signs, trees and greenery.\nKids can create a realistic LEGO® road layout with lots of authentic details and connect to other LEGO City Road Plate building sets to expand their city creations.\nThis LEGO® City Road Plates playset makes a great Christmas, birthday or any-other-day gift for kids aged 5 and up.\nWhen built, the primary Road Plate layout measures over 5 in. (13 cm) high, 17.5 in. (44 cm) wide and 15 in. (38 cm) deep.\nLEGO® City Road Plates make a great backdrop to kids’ LEGO play and creations.\nIncludes a printed building guide and Instructions PLUS – part of the free LEGO® Building Instructions app for smart devices. This interactive guide helps budding builders become master builders!\nLEGO® City My City sets come with colorful buildings, cool toy vehicles and fun characters that stimulate imaginative role play as kids create open-ended adventures in realistic settings.\nAll LEGO® bricks and pieces are produced to strict industry quality standards to ensure they are consistent, compatible and fun to build with – it’s been that way since 1958.\nLEGO® City building toys are thoroughly tested to ensure every playset meets stringent safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/tractor-60287","description":"Power up kids’ creativity with the LEGO® City Tractor (60287) playset. This cool tractor toy comes with lots of realistic features, including large rear tires, tipping loader bucket and a raisable boom. With farmer and daughter minifigures, a rabbit figure, 2 hay bales and a crate of veggies, the scene is set for fun farm adventures.\n\nA treat for boys and girls aged 5 and up\nYou'll find easy-to-follow building instructions for this LEGO set in the box. Or you can hop online and download Instructions PLUS, part of the LEGO Building Instructions app for smartphones and tablets. This interactive construction guide, with amazing zoom and rotate viewing tools, helps budding builders become master builders.\n\nThe great vehicles of LEGO City\nLEGO City Great Vehicles playsets deliver realistic vehicles and machines along with fun characters to inspire imaginative role play. Kids get to explore their favorite land, air and sea vehicles, developing physical skills and confidence as they build and play.\n\nHelp creativity gain traction with this iconic LEGO® City Tractor (60287) playset, an impressive introduction to the exciting world of LEGO City. Ideal for boys and girls aged 5 and up.\nWhat’s in the box? Everything kids need to create a cool toy tractor with lots of realistic features, plus 2 hay bales, a crate of veggie elements, farmer and daughter minifigures and a rabbit figure.\nThis LEGO® City Tractor (60287) toy has huge rear tires, a tipping loader bucket, raisable boom and a minifigure cab. Kids can combine it with other LEGO toy playsets for fun play and cool displays.\nThe LEGO® City Great Vehicles tractor toy makes a great Christmas, birthday or any-other-day surprise for boys and girls aged 5 and up.\nWhen built, the tractor measures over 4 in. (10 cm) high, 6.5 in. (17 cm) long and 2.5 in. (7 cm) wide.\nAccessory elements include a crate with a pumpkin, apple and carrots, plus 2 hay bales.\nIncludes a printed building guide and Instructions PLUS – an interactive building guide for kids. Part of the free LEGO® Building Instructions app for smart devices.\nLEGO® City Great Vehicles toys inspire creative play that helps kids grow physical skills and confidence as they explore all kinds of vehicles and scenarios that reflect life in a fun, exciting way.\nAll LEGO® components meet strict industry standards to ensure they are consistent, compatible and fun to build with – it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/police-mf-accessory-set-40372","description":"Kids can ramp up the action with this LEGO® City Police MF Accessory Set (40372), including LEGO City Adventures TV series hero Duke DeTain, a police officer and 2 crook minifigures. Fans of the TV series can enjoy creating and reenacting scenes from the show. And with a bank ATM setting, crook's sack truck, plus walkie-talkie, crowbar and dynamite accessories, the scene is set for hours of imaginative, crook-catching fun.\nKids aged 6 and up can boost the crook-catching action with this LEGO® Police MF Accessory Set. An exciting addition to any LEGO playset and an ideal introduction set for budding police officers.\nIncludes LEGO® City TV hero Duke DeTain, police officer and 2 crook minifigures, plus a bank setting, crook's sack truck and walkie-talkie, crowbar and dynamite accessories.\nATM setting measures over 1” (5cm) high, 1” (3cm) wide and 1” (3cm) deep."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/beach-rescue-atv-60286","description":"Treat your everyday hero to hours of imaginative fun with this LEGO® City Beach Rescue ATV (60286) playset, featuring a toy ATV with an opening roll cage and a trailer for transporting the included water scooter. Kids also get a lifeguard minifigure and a shark figure, setting the scene for heroic seashore adventures.\n\nDesigned for boys and girls aged 5 and up\nThis fun beach playset includes an easy-to-follow building guide and Instructions PLUS. Part of the free LEGO Building Instructions app for smartphones and tablets, this interactive building guide, with zoom and rotate viewing tools, really does make LEGO building child’s play.\n\nThe great vehicles of LEGO City\nLEGO City Great Vehicles playsets deliver feature-rich, land, air and water toys that spark the imagination. Children get to explore all kinds of realistic machines and vehicles, developing physical skills and confidence as they build and play.\n\nIntroduce boys and girls aged 5 and up to the exciting world of LEGO® City with this LEGO City Beach Rescue ATV (60286) toy playset. The fun starts the moment kids open the box.\nThis building set includes a toy ATV with a trailer for transporting the included water scooter, plus a lifeguard minifigure and a shark figure. Everything kids needs for hours of creative play!\nThe toy ATV features an opening roll cage. Both the ATV and the water scooter can accommodate the lifeguard minifigure.\nThe LEGO® City Beach Rescue ATV toy playset makes a great Christmas, birthday or any-other-day treat for kids aged 5 and up.\nWhen built, the beach rescue ATV, with trailer and water scooter, measures over 2.5 in. (7 cm) high, 6.5 in. (17 cm) long and 1.5 in. (5 cm) wide.\nLEGO® accessories in the set include a toy walkie-talkie and binocular elements.\nIncludes a printed construction guide and Instructions PLUS – an interactive building guide that really does make LEGO® building child's play. It’s part of the free LEGO Building Instructions app.\nLEGO® City Great Vehicles playsets nurture kids’ physical skills and confidence with feature-rich land, air and water vehicles and fun characters that inspire open-ended creative play.\nAll LEGO® components meet stringent industry standards to ensure they are consistent, compatible and fun to build with – it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meetstringent global safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/fire-hazard-truck-60279","description":"Bring excitement to kids’ play any day with this LEGO® City Fire Hazard Truck (60279) playset. They can steer the fire truck by tilting it left and right, sweep away the burning LEGO logs using its front plow and shoot water elements to put out the fire. With a LEGO City firefighter on the scene, this construction toy really ignites children's imaginations.\n\nFun and easy to build\nThis fire truck toy comes with both printed building instructions and Instructions PLUS – part of the free LEGO Building Instructions app for smartphones and tablets. This interactive building guide, with amazing zoom and rotate viewing tools, quickly helps budding LEGO builders become master builders.\n\nMobilizing kids’ creativity\nWith LEGO City fire sets, kids get to enjoy open-ended adventures and action-packed scenarios that reflect real-life situations. The wide range of feature-rich buildings, realistic vehicles and fun characters lets kids enter a world where creativity and imagination can thrive.\n\nThis fire truck toy is a great introduction to the exciting world of LEGO® City, where kids become everyday heroes as they play out realistic firefighting adventures. Suitable for kids aged 5 and up.\nWhat’s in the box? The LEGO® City Fire Hazard Truck (60279) playset includes a steerable fire truck with a plow and fire hose, blazing LEGO logs, and a firefighter minifigure with a cool helmet.\nKids can steer the toy fire truck by tilting it left and right, sweep away the LEGO® flames using its front plow and shoot water elements from the stud-shooter fire hose to knock out the fire.\nThis LEGO® firefighter playset makes a great little gift for any occasion. It’s perfect for boys and girls aged 5 and up and requires only basic building skills.\nWhen built, the Fire Hazard Truck measures over 2 in. (6 cm) high, 4 in. (10 cm) long and 2 in. (5 cm) wide.\nLEGO® accessories include a megaphone, fire helmet and logs with flame elements.\nIncludes a printed building guide and Instructions PLUS – part of the free LEGO® Building Instructions app for smart devices. This interactive construction guide helps kids become master builders!\nLEGO® City fire toys come with colorful buildings, cool vehicles and fun characters that stimulate imaginative role play as kids create open-ended adventures in settings that resemble real life.\nLooking for a high-quality children's toy? All LEGO® City components meet strict industry standards to ensure they are compatible and connectand pull apart consistently every time.\nPutting safety in the spotlight. LEGO® City bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/police-helicopter-60275","description":"Kids with a passion for role play will love this LEGO® City Police Helicopter (60275) playset, featuring a sturdy police helicopter toy with spinnable rotors and a cool water scooter. Just add the police officer and crook minifigures, handcuffs, toy banknotes and a touch of imagination for endless crook-catching adventures.\n\nCreative fun for boys and girls aged 4 and up\nThis durable 4+ building set includes a simple printed building guide and a special Starter Brick element to help even first-time builders experience the pride of constructing their own LEGO toys. And with the free LEGO Building Instructions app for smartphones and tablets, kids get Instructions PLUS – an interactive construction guide with amazing zoom and rotate viewing tools that really make LEGO building child's play.\n\nThe awesome world of LEGO City\nLEGO City police sets deliver an exciting build-and-play experience with realistic models and fun characters that depict real life in a fun and imaginative way.\n\nThis easy-to-build Police Helicopter (60275) playset makes a great introduction to the awesome LEGO® City universe, where boys and girls aged 4 and up can immerse themselves in endless creative play.\nWhat’s in the box? There’s a robust toy police helicopter, crook's water scooter and 2 banknote elements, plus police officer and crook minifigures. Just add a touch of imagination for endless fun!\nThe police helicopter toy has a minifigure cockpit, spinnable rotors and an opening fuselage for the captured crook. Kids can attach the crook and her stolen banknote elements to the water scooter.\nMakes an awesome Christmas, birthday or any-other-day gift for fans of LEGO® City and a great introduction to the LEGO City universe for boys and girls aged 4 and up.\nThe helicopter measures over 3 in. (8 cm) high, 5 in. (12 cm) long and 2 in. (5 cm) wide – so there's plenty of room for the LEGO® City police pilot.\nHelicopter comes with a decorative police tile and pretend search light.\nThis 4+ playset includes simple printed and digital building instructions, plus a special Starter Brick element, so even first-time builders can take pride in constructing their own LEGO® toys.\nLEGO® City police playsets come with colorful buildings, cool toy vehicles and fun characters for hours of creative building fun and imaginative play.\nAll LEGO® bricks and pieces are produced according to strict industry quality standards to ensure they are consistent, compatible and fun to build with – it’s been that way since 1958.\nLEGO® City building toys are thoroughly tested to ensure every playset meets strict safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/roadwork-truck-60284","description":"Here’s a fun treat to get kids’ imaginations working! This LEGO® City Roadwork Truck (60284) toy features a front-end loader with a tipping bucket, a wheelbarrow, traffic cones, roadworks sign and a shovel. Just add the included LEGO City road worker minifigure and rat figure for hours of imaginative play.\n\nBuild-and-play fun for boys and girls aged 4 and up\nThis 4+ toy construction set includes an easy-to-follow building guide and a Starter Brick element – a partly constructed base from which to start building. And with the free LEGO Building Instructions app for smartphones and tablets, kids also get Instructions PLUS – an interactive construction guide with amazing zoom and rotate viewing tools that make LEGO building child’s play.\n\nAbout LEGO City Great Vehicles\nLEGO City Great Vehicles playsets deliver feature-rich, land, air and water toys that spark the imagination. Kids get to explore classic vehicles and create stories and scenarios that depict real life in a fun, imaginative way.\n\nHere’s an ideal introduction to the exciting world of LEGO® City. Perfect for boys and girls aged 4 and up, this playset is designed to inspire creative, independent play based on real-life scenarios.\nThis LEGO® City Roadwork Truck (60284) playset includes a front-end loader, wheelbarrow, traffic cones, roadworks sign and a shovel, plus a worker minifigure and rat figure.\nKids can cordon off areas with the roadworks sign and traffic cones, fill and tip the front-end loader's bucket and play out fun scenarios featuring the road worker minifigure and rat figure.\nLEGO® City 4+ sets let kids and grown-ups discover the joy of building and playing together. With special Starter Bricks and simple building guides, they help kids grow key life skills step by step.\nWhen built, the truck measures over 3 in. (8 cm) high, 3 in. (8 cm) long and 2.5 in. (6 cm) wide.\nAccessories in the set include a worker's safety helmet.\nIncludes a simple 4+ building guide and Instructions PLUS – part of the free LEGO® Building Instructions app for smart devices. This interactive construction guide helps kids become master builders.\nLEGO® City Great Vehicles sets help kids grow physical skills and confidence with feature-rich buildings, realistic vehicles and fun characters that inspire open-ended, independent play.\nLEGO® components meet stringent industry standards to ensure they are compatible and connect and pull apart consistently every time – it's been that way since 1958.\nLEGO® City bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure every playset meets stringent global safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/sports-car-60285","description":"Kids with a passion for cool cars will love the LEGO® City Sports Car (60285). This vehicle is bursting with awesome design details, including aerodynamic bodywork, a removable roof for open-top driving, an adjustable rear spoiler, sporty black rims with ground-gripping tires and a detailed cockpit for the minifigure driver. Just add a touch of imagination and head for the highway!\n\nA LEGO treat for boys and girls aged 5 and up\nYou'll find building instructions for this LEGO City sports car toy in the box. Or you can download Instructions PLUS, part of the LEGO Building Instructions app for smartphones and tablets. This interactive construction guide, with amazing zoom and rotate viewing tools, quickly turns budding LEGO builders into master builders.\n\nThe Great Vehicles of LEGO City\nBoys and girls get to explore all kinds of realistic machines and vehicles with LEGO City Great Vehicles playsets, developing physical skills and confidence as they build and play.\n\nIntroduce boys and girls aged 5 and up to the exciting world of LEGO® City with this impressive sports car construction set – an inspiring vehicle for imaginative role play.\nWhat’s in the box? All kids need to create the impressive LEGO® City Great Vehicles sports car, with room behind the steering wheel for the driver minifigure. A treat for kids who love cool cars.\nAwesome design with eye-catching bodywork, an adjustable rear toy spoiler, sporty black rims with ground-gripping tires and a detailed tinted cockpit with seating for the included minifigure driver.\nThis LEGO® City Sports Car (60285) building set makes a great Christmas, birthday or any-other-day surprise for boys and girls aged 5 and up.\nWhen built, the LEGO® City sports car measures over 1.5 in. (4 cm) high, 4.5 in. (12 cm) long and 2 in. (5 cm) wide.\nPowered by kids with big imaginations – simply open the bags of bricks and the play can start right away.\nIncludes a simple printed building guide and Instructions PLUS – an interactive construction guide for budding builders. Available in the free LEGO® Building Instructions app for smart devices.\nMove kids’ creativity up a gear with LEGO® City Great Vehicles sets – feature-rich vehicles and characters inspire imaginative play while helping youngsters develop physical skills and confidence.\nLEGO® components meet strict industry standards to ensure they are compatible and connect and pull apart consistently every time – it's been that way since 1958.\nLEGO® City bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure every building set meets stringent global safety standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/main-square-60271","description":"Youngsters can dive right into the LEGO® City Adventures TV series with the amazing LEGO® City Main Square (60271) playset. There’s a city hall, city square, concert stage, classic diner and a tram station, plus cool toy vehicles including Mayor Fleck's stretch limousine, Snake Rattler's motorbike and Harl Hubbs' handyman wagon. Add 14 minifigures, including an awesome lineup of LEGO City TV characters, and the scene is set for endless play.\n\nCity center playset for kids\nThe LEGO City Main Square playset comes with an easy-to-follow building guide and Instructions PLUS – part of the free LEGO Building Instructions app for smartphones and tablets. This interactive building guide with zoom and rotate viewing tools quickly helps young LEGO builders become master builders.\n\nInspirational toys for boys and girls\nLEGO City building sets stimulate open-ended, creative role play with feature-rich buildings, realistic toy vehicles and fun characters that deliver an enjoyable, fun-filled build and play experience.\n\nThis amazing LEGO® City Main Square (60271) playset is a great introduction to the exciting world of LEGO® City. Perfect for kids aged 5 and up, it inspires open-ended, imaginative role play based on real-life scenarios.\nWhat’s in the box? Buildings include a city hall, concert stage and diner. Vehicles include Snake Rattler's motorbike and Harl Hubbs' handyman wagon. There's also an array of LEGO® City Adventures TV series minifigures.\nKids get to create and recreate scenes from the LEGO® City Adventures TV series with this amazing building set. It’s bursting with realistic features, functions, details and characters that inspire fun, imaginative play.\nLooking for a cool toy kids aged 5 and up? This LEGO® City Main Square playset makes a great Christmas, birthday or any-other-day gift for LEGO City TV fans and kids who love to play. Requires only basic building skills.\nWhen built, the city hall building measures over 12” (32cm) high, 10” (27cm) wide and 5” (15cm) deep, while the tram measures over 4\" (12cm) high, 14\" (37cm) long and 1\" (5cm) wide.\nBuild together! The vehicles, buildings and characters in this set are divided into separate brick bags – each with its own construction guide. So kids, friends and families can enjoy building together.\nIncludes a printed building guide and Instructions PLUS – an interactive building guide that helps budding builders become master builders! Available as part of the free LEGO® Building Instructions app for smartdevices.\nLEGO® City Town sets come with colorful buildings, cool toy vehicles and fun characters that stimulate imaginative role play as kids create open-ended adventures in realistic settings.\nAll LEGO® City playsets meet the highest industry standards and quality criteria to ensure that all LEGO bricks and pieces are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure every kid's building set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/passenger-train-60197","description":"Climb aboard the LEGO® City 60197 Passenger Train! This fun set features a motorized engine with 10-speed Bluetooth remote control and opening nose cone, driver’s cabin with opening window, 2 cars with removable roofs, seats and tables, a full circular track with 16 curved and 4 straight rails, plus a buildable platform with 2 seats and train service map, train signal and 4 LEGO minifigures.\n\nIncludes 4 LEGO® minifigures: 2 passengers, a train conductor and a train attendant.\nFeatures a motorized engine with 10-speed Bluetooth remote control and opening nose cone, pantograph on the roof and driver’s cabin with opening window and control panel, plus a café car with removable roof and tables, and a passenger car with removable roof, seats and tables.\nAlso includes a platform with 2 seats and train services map, a full circular track with 16 curved rails and 4 straight rails, plus a buildable train signal pole.\nAccessory elements include 3 mugs, 3 muffins, a hot dog, croissant, messenger bag and a suitcase with LEGO® box inside.\nLift off the roof to access the passenger train cabins filled with cool details.\nOperate the train with the 10-speed Bluetooth remote control.\nDrive to the platform and pick up or unload passengers.\nSet the rails in different ways to fit your city's style.\nThis product requires batteries (not included). Please refer to the product packaging for types and quantities.\nThe included Bluetooth remote is not compatible with older infrared remote-controlled LEGO® train sets.\nPassenger Train with cars measures over 4” (11cm) high, 27” (69cm) long and 1” (5cm) wide.\nEngine section measures over 4” (11cm) high, 10” (26cm) long and 1” (5cm) wide.\nPlatform measures over 2” (7cm) high, 4” (11cm) wide and 2” (6cm) deep."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/ocean-exploration-ship-60266","description":"Fun and adventure is on the horizon with the mighty LEGO® City Ocean Exploration Ship (60266). This super-long ship not only floats on water, it has everything kids need for endless ocean exploration. There’s a shark cage, working crane, research submarine, helicopter and even a pirate shipwreck with hidden treasure! And with 8 explorer minifigures, including LEGO City TV character Harl Hubbs, the scene is set for action-packed escapades.\n\nGreat building set for kids\nThis toy playset includes simple building instructions and Instructions PLUS – part of the free LEGO Building Instructions app for smartphones and tablets. This interactive building guide, with amazing zoom and rotate viewing tools, quickly helps budding LEGO builders become master builders.\n\nCool construction sets for kids\nLEGO City is proud to support the work of National Geographic Explorers. And with feature-rich buildings, realistic vehicles and fun characters, our Ocean playsets deliver an exciting, open-endedworld of undersea exploration and adventure for budding explorers.\n\nThis multi-model LEGO® City Ocean Exploration Ship (60266) playset is a perfect gift for little explorers and has all kids need for a fun and rewarding play experience.\nWhat’s In the box? A floating toy exploration ship with working crane, shark cage, dinghy, submarine and helicopter, 8 minifigures, including the LEGO® City TV character Harl Hubbs, plus shark and stingray figures.\nKids can use the floating toy ship's crane to lower the sub and shark cage, pilot the helicopter and sub, explore the treasure-filled shipwreck or take the play inside the captain’s bridge with sleeping and research areas.\nLooking for cool toys for kids aged 5 and up? This building set makes a great Christmas, birthday or any-other-day gift for kids with a passion for ocean exploration and for fans of the LEGO® City Adventures TV series.\nWhen built, the toy exploration ship measures over 7\" (18cm) high, 24\" (63cm) long and 6\" (17cm) wide, while the pirate shipwreck measures over 6\" (16cm) high,5\" (13cm) long and 3\" (8cm) wide.\nNo batteries required. This exciting multi-model playset, including a toy boat that floats, is powered by little kids with big imaginations!\nThis construction set comes with a simple printed building guide and Instructions PLUS – an interactive building guide for budding builders. Available as part of the free LEGO® Building Instructions app for smart devices.\nLEGO® City is proud to support the groundbreaking work of National Geographic Explorers, who help build a better world for us all. LEGO City Ocean playsets introduce kids to the exciting world of underwater exploration.\nLEGO® City Ocean building sets are designed to the highest industry standards and criteria. This ensures that the LEGO bricks and pieces are consistent, compatible and connect and pull apart easily every time.\nAll LEGO® City bricks and pieces are tested to the extreme to create toy building sets that meet the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/downtown-fire-brigade-60216","description":"Protect the citizens of LEGO® City with the incredible 60216 Downtown Fire Brigade set, featuring a large fire ladder truck with new-for-January-2019 working light and sound brick, extending swivel ladder and fire hose with new-for-January-2019 pump with ‘water jet' function. This thrilling set also includes a 3-level building with roof, construction area with fence, falling lamppost and a porta-toilet with removable top and front, plus a free-standing crane with rotating arm and functioning winch. There’s also a fire helicopter with opening cockpit and R.O.S.-T3 the ROV, both with a new-for-January-2019 multi shooter, and a motorbike with space for warning lights, and 7 minifigures.\n\nIncludes 7 LEGO® City minifigures: 2 construction workers, a pilot and 4 firefighters.\nThis creative toy set features a 3-level building with roof, attached construction area with fence, tool holders, falling lamppost and a porta-toilet with removable top and front, plus a free-standing crane with rotating arm and functioning winch with hook.\nThe building toy set also features a large fire ladder truck with new-for-January-2019 working light and sound brick, extending stabilizers, opening storage space on the side and front, extending/swiveling turntable ladder and a fire hose with new-for-January-2019 pump system with ‘water jet’ function.\nThis great set also includes a fire rescue helicopter with opening cockpit, spinning rotors and new-for-January-2019 multi shooter, R.O.S.-T3 the remote-operated vehicle (ROV) with extending claws and new-for-January-2019 multi shooter, plus a fire motorbike.\nAccessory elements include 2 warning lights, a radio, 2 sets of smoke gear, 12 water elements, jackhammer, sandwich, 2 water bottles, remote-control element for the crane, 2 new-for-January-2019 fire axes and a remote-control element for R.O.S.-T3 the ROV, plus 9 toppling, buildable fire elements.\nSwing the crane around and lift the porta-toilet into the air with the winch.\nPress the fire ladder truck light and sound brick as you race the firefighters to the scene.\nRaise the ladder and squeeze the bellows to launch the water elements and knock the fire elements down.\nLoad and push the plungers on the multi shooter of the helicopter and R.O.S.-T3 the ROV to help battle the blaze.\nThis amazing set includes over 900 pieces.\nBuilding with construction area, incl. lamppost and porta-toilet, measures over 10” (27cm) high, 8” (22cm) wide and 4” (12cm) deep.\nFire ladder truck measures over 3” (8cm) high, 15” (39cm) long and 2” (6cm) wide.\nCrane measures over 9” (24cm) high, 8” (21cm) long and 4” (11cm) wide.\nHelicopter measures over 3” (8cm) high, 7” (19cm) long and 1” (4cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/passenger-airplane-60262","description":"Children can launch creative play skyward with this LEGO® City Passenger Airplane (60262) building set, featuring a huge aircraft with seating for the pilot and passenger minifigures, including singer Poppy Starr from the LEGO City Adventures TV series. There's even room onboard for Poppy's red convertible automobile! Kids also get a terminal building complete with luggage conveyor and control tower, plus an airport truck with a vehicle elevator.\n\nA cool airplane toy for kids\nThe LEGO City Passenger Airplane playset comes with an easy-to-follow building guide and Instructions PLUS – part of the free LEGO Building Instructions app for smartphones and tablets. This interactive building guide with zoom and rotate viewing tools helps budding LEGO builders become master builders.\n\nThe creative world of LEGO City\nLEGO City Airport sets deliver an enjoyable, fun-filled build and play experience with realistic buildings, cool airport vehicles and awesome aircraft models, plus detailed accessories and fun characters that stimulate open-ended, creative role play.\nThis passenger airplane toy makes and an ideal introduction to the exciting world of LEGO® City. Perfect for kids aged 6 and up, it is designed to inspire creative, independent play based on real-life events.\nWhat’s in the box? This passenger plane toy includes a large airplane, airport truck with a with car elevator, airstair, airport terminal setting, a red convertible automobile, 8 minifigures and a baby figure.\nIncludes a large model airplane with seating for the pilot and passengerminifigures – including Poppy Starr from the LEGO® City Adventures TV series – plus a terminal building with luggage conveyor and a control tower.\nThe LEGO® City Passenger Airplane (60262) building set makes a great birthday or any-other-day gift for kids aged 6 and up, and for boys and girls who love toy planes and the excitement of flying to far-off lands.\nWhen built, the Passenger Airplane measures over 7\" (18cm) high, 21\" (54cm) long and 17\" (44cm) wide, while the terminal building measures over 8” (21cm) high, 11” (28cm) wide and 4” (12cm) deep.\nNo batteries required – this aircraft building toy is powered by small kids with big imaginations, so the play can start right away!\nFind instructions for this building set in the box. Or hop online to download Instructions PLUS – part of the free LEGO® Building Instructions app. Zoom, rotate and visualize the model to bring the building process to life.\nLEGO® City Airport toys help kids grow physical skills and confidence with feature-rich buildings, realistic vehicles and fun characters that inspire open-ended, independent play.\nAll LEGO® City Airport playsets meet the highest industry standards and quality criteria to ensure that all LEGO bricks and pieces are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure every kid's building set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/police-station-60246","description":"Everything is awesome about the LEGO® City Police Station (60246) playset. Little law enforcers and fans of the LEGO City TV series will love creating stories with a host of fun characters, including Duke DeTain, Chief Wheeler and Daisy Kaboom. This exciting set includes a police station with a light-brick searchlight and a police car with sound-brick siren, plus a cool truck, motorcycle and surveillance drone. A building toy with a little extra With this toy playset you get a simple building guide and Instructions PLUS! Part of the free LEGO Life app for smartphones and tablets, this interactive building guide features zoom and rotate viewing tools that help budding LEGO builders become master builders. LEGO City – Cool toys for kids LEGO City police playsets deliver an exciting build-and-play experience. With realistic vehicles, detailed buildings and fun characters, kids can create stories and scenarios that depict real city life in a fun and imaginative way.\nHere’s a great building set for kids who love action-packed building toys. This LEGO® City Police Station (60246) playset has an exploding cell, cool vehicles and fun characters. The fun starts the moment you open the box.\nWhat’s in the box? A toy police station, 2 trucks, a motorcycle and a drone. You also get 6 minifigures, including Duke DeTain, Chief Wheeler and Daisy Kaboom from the LEGO® City TV series, plus 2 dog figures.\nChildren can have fun with the feature-rich police headquarters model with jailbreak explosion function and light-brick searchlight, plus a police car with a sound-brick siren – a delight for LEGO® City police fans.\nThis LEGO® City Police Station playset is ideal for children aged 5 and up. It makes a great Christmas, birthday or any-other-day gift for kids who love role-play toys, model vehicles and action toys.\nWhen built, the toy police station building measures over 9” (24cm) high, 18” (48cm) wide, and 5” (15cm) deep, while the police truck measures over 2\" (6cm) high, 4\" (12cm) long and 2\" (7cm) wide.\nBoth the sound brick and light brick in this playset require a 1xCR1216 coin cell battery. The good news? They’re included! So the sound and light play can start right away.\nYou’ll find a simple building guide in the box. Or you can download Instructions PLUS – part of the free LEGO® Life app. This interactive building guide with zoom-and-rotate viewing tools makes building child's play!\nLEGO® City police sets nurture kids' physical skills and confidence with feature-rich buildings, realistic vehicles and fun characters that inspire open-ended creative play.\nLEGO® building bricks meet the highest industry standards as well as The LEGO Group's rigorous quality criteria, so they're consistent, compatible and easily click together and apart – every time.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces to make sure every playset meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/tuning-workshop-60258","description":"Kids who love toy cars, and fans of the hit LEGO® City TV series will adore this fun-packed LEGO City Tuning Workshop (60258) playset. There’s a repair shop, a tow truck and even a small car-dealership selling dodgy cars at bargain prices! And the fun doesn't end there! Kids also get a selection of fun characters with cool vehicles, including Tread Octane and his prize hot rod, and Harl Hubbs with his crazy, rocket-powered motorcycle. A perfect combination for hilarious role-play adventures. Great building set for kids This toy playset includes simple building instructions that will help your budding LEGO builder become a master builder. Cool construction toys for kids LEGO City vehicle playsets give kids the chance to let their inner turbo loose with an awesome range of superfast, supercool toys on wheels. These feature-rich building sets, with detailed buildings and fun characters, inspire open-ended, independent play, where children can recreate scenarios that reflect real-life in a fun and exciting way.\nThis multi-model LEGO® City Tuning Workshop (60258) playset is a perfect gift for car lovers and comes with a workshop and an array of cool vehicles, and fun characters for imaginative independent play.\nComes with a toy garage, camping trailer and cool vehicles, including a tow truck, hot rod and rocket-powered motorbike, plus 7 minifigures, including LEGO® City TV characters Tread Octane and Harl Hubbs.\nKids can operate the engine hoist in the workshop, lift cars with the jack, rescue broken-down vehicles with the tow truck and much more. Kids can also combine this set with other LEGO® playsets for fun play and displays.\nLooking for cool toys for kids aged 5 and up? This tuning workshop building set makes a great Christmas, birthday or any-other-day gift for kids who love toy vehicles and for fans of the hit LEGO® City TV series.\nWhen built, Tread Octane's workshop measures over 5” (14cm) high, 6” (17cm) wide and 5” (13cm) deep, while the tow truck measures over 2\" (7cm) high, 7\" (18cm) long and 2\" (6cm) wide.\nNo batteries required – this awesome playset is powered by small kids with big imaginations, so the play can start right away!\nIt's easy to get started with this LEGO® City construction toy. Inside the box you'll find easy-to-follow building instructions – so tear open the brick bags and let the fun begin!\nLEGO® City playsets come with cool vehicles, feature-rich buildings and fun characters that stimulate imaginative play while helping youngsters grow physical skills and confidence.\nLEGO® bricks and pieces meet the highest industry standards to ensure that LEGO City building toys are consistent, compatible and connect and pull apart easily every time.\nAt The LEGO Group, we thoroughly test LEGO® City building sets to ensure that every one of these unique toys meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/ocean-exploration-base-60265","description":"Kids who love the sea and its wildlife will love this LEGO® City Ocean Exploration Base (60265) playset. There’s lots of fun to be had exploring the coral-covered ocean or chilling out inside the base with its interchangeable living and research modules. And with a cool toy crane, docking submarine and underwater drone, plus shark and stingray figures and a 5 strong team of explorer minifigures, there's plenty of excitement for kids to discover!\n\nAn immersive building experience\nYou'll find easy to follow building instructions for this 5+ LEGO® City toy in the box. Or you hop online and download Instructions PLUS, part of the LEGO Building Instructions app for smartphones and tablets. This interactive building guide, with amazing zoom and rotate viewing tools, quickly turns budding LEGO builders into master builders!\n\nCool exploration toy for kids\nLEGO City is proud to support the work of National Geographic Explorers. And with feature-rich buildings, cool vehicles and fun characters our Ocean playsets inspire realistic play scenarios for budding explorers.\n\nKids can dive deep into imaginative underwater adventures with this amazing LEGO® City (60265) Ocean Exploration Base playset. It has all kids need for a fun and rewarding play experience.\nWhat’s In the box? A toy ocean exploration base with interchangeable living and research modules, plus a docking submarine, underwater drone, 5 researcher minifigures and shark and stingray figures.\nThe LEGO® City Ocean Exploration Base features interchangeable living and research modules and a docking submarine with movable inspection arms, spinning propeller and opening cockpit with room for two minifigures.\nLooking for cool toys for kids aged 5+? This playset makes a great Christmas, birthday or any-other-day present for LEGO® City fans and kids who love to role-play. Requires only very basic building skills.\nWhen built, the exploration base measures over 7” (20cm) high, 10” (27cm) wide and 5” (15cm) deep, while the underwater drone measures over 1\" (3cm) high, 2\" (6cm) long and 1\" (3cm) wide.\nDoes it need batteries? No, this construction set is powered by small kids with big imaginations – simply open the bags of LEGO® bricks and the play can start right away!\nThis building set comes with a printed building guide and Instructions PLUS – an interactive construction guide for budding builders. Available as part of the free LEGO® Building Instructions app for smart devices.\nLEGO® City is proud to support the groundbreaking work of National Geographic Explorers, who help build a better world for us all. LEGO City Ocean playsets introduce kids to the exciting world of underwater exploration.\nEvery LEGO® City Ocean playset is designed to the highest industry standards and criteria. This ensures that the LEGO bricks and pieces are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure every kid's building set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/fire-station-60215","description":"Protect the citizens of LEGO® City with the action-packed 60215 Fire Station, featuring a 3-level fire station with office, relaxation room and scout tower, small waterside dock and a separate garage with large opening front door and a landing pad for the detachable scouting drone with spinning rotors and camera. This cool set also features a fire off-road vehicle with a stud-shooting fire hose and new-for-January-2019 working light and sound brick, plus a water scooter, 4 minifigures and a fire station dog figure.\n\nIncludes 4 LEGO® City minifigures: a fire chief and 3 firefighters, plus a fire dog figure.\nFeatures a 3-level fire station with office, relaxation room and scout tower, small waterside dock and a separate garage with large opening front door and a landing pad for the included buildable drone. Also includes a small build with a trash can, newspaper stack and buildable flame elements.\nThis cool set also features a fire department off-road vehicle with new-for-January-2019 working light and sound brick, working fire hose with lever and storage compartments, plus a water scooter with space for a stud-shooting fire extinguisher and a scouting drone with spinning rotors and a rotating camera.\nAccessory elements include a stud shooting fire extinguisher, 6 water elements, bucket, telephone, television, popcorn and a remote-control element for the drone.\nSpin the rotors to launch the drone and rotate the camera to search for fires.\nPress the light and sound brick on the off-road vehicle to clear the way as you speed to the fire.\nLoad a water element into the fire hose and extinguisher and push the levers to shoot them at the fire and ‘put’ them out.\nFire station garage is compatible with fire vehicles from other LEGO® City Fire sets.\nThis creative building toy set includes over 500 pieces.\nFire station measures over 11” (28cm) high, 8” (21cm) wide and 10” (27cm) deep.\nFire off-road vehicle measures over 2” (6cm) high, 4” (12cm) long and 1” (5cm) wide.\nWater scooter measures over 2” (6cm) long and 1” (3cm) wide.\nScouting drone measures over 1” (3cm) high, 2” (7cm) long and 2” (7cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/central-airport-60261","description":"Kids will love the vacation vibe given by this inspiring LEGO City Central Airport (60261) playset. Not only does it have a detailed terminal building, fuel tanker and baggage truck. Kids also get an awesome charter plane with room for the pilot and passenger minifigures! And with an organized ground crew to keep things running, children can enjoy inspiring air-travel adventures every day of the year.\n\nGreat building toy for kids\nThis 4+ set includes a simple printed building guide and a special Starter Brick element to help youngsters experience the pride of constructing their own LEGO sets. And with the free LEGO Building Instructions app for smartphones and tablets, kids get Instructions PLUS – an interactive building guide with amazing zoom and rotate viewing tools that really make LEGO building child's play.\n\nThe creative world of LEGO City\nLEGO City Airport sets deliver an enjoyable build and play experience with realistic vehicles, detailed accessories and fun characters that stimulate imaginative, open-ended role play.\n\nThis toy airport building set is an ideal introduction to the exciting world of LEGO® City. Perfect for children aged 4+, it is designed to inspire creative, independent play based on real-life scenarios.\nWhat’s in the box? There’s a toy charter plane, detailed airport terminal, fuel tanker and luggage truck, plus pilot, 2 ground crew and 3 passenger minifigures. Just add a sprinkle of imagination for endless fun!\nThis airport toy features a terminal building with check-in area, charterplane with room for a pilot and 3 passenger minifigures, plus a fuel tanker and luggage truck – a great gift for kids who love pretend play.\nThe LEGO® City Central Airport (60261) building toy makes a great Christmas, birthday or any-other-day gift for kids aged 4 and up and for boys and girls who love toy planes. Requires only basic building skills.\nWhen built, the LEGO® City Central Airport terminal building measures over 6” (16cm) high, 9” (24cm) wide and 3” (9cm) deep, while the toy charter plane measures over 3\" (10cm) high, 8\" (21cm) long and 7\" (20cm) wide.\nDoes this playset require batteries? No, this construction toy is powered by little kids with big imaginations. Simply open the brick bags and let the play begin!\nYou’ll find a building guide for this 4+ set in the box. Or you can download Instructions PLUS – part of the free LEGO® Building Instructions app – with zoom and rotate viewing tools that help kids become master builders.\nUnleash the fun and excitement of LEGO® City Airport sets – with feature-rich buildings, cool vehicles and fun characters that inspire open-ended creative play, while helping kids develop physical skills and confidence.\nAll LEGO® City Airport playsets meet the highest industry standards and quality criteria to ensure that all LEGO bricks and pieces are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure every kid's building set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/police-monster-truck-heist-60245","description":"Mini action heroes and fans of the awesome LEGO® City TV series will love this LEGO City Police Monster Truck Heist (60245) action set, featuring police hero Tom Bennett and notorious crook Big Betty. The easy-to-follow building guide ensures that even budding LEGO builders can enjoy an immersive build-and-play experience. Kids' toy with lots of cool features If you're looking for feature-packed action toys that kids will love, this playset has it all. With 5 minifigures, a bank-busting monster truck toy armed with a huge magnet, a bank building with a magnetic safe and a police surveillance truck and motorcycle – the scene is set for action-packed fun. Building sets for kids Children love the open-ended role-play opportunities that LEGO City police sets provide. With a wide selection of realistic vehicles, detailed buildings and fun characters, kids can create realistic scenarios that depict real city life in a fun and imaginative way.\nBring LEGO® City action home with this multi-model LEGO City police (60245) building set, featuring a crooks’ monster truck with a magnetic lifting arm, 2 LEGO City TV series characters and much more.\nBuilding set for kids featuring a crooks’ monster truck with magnetic arm, a toy bank building with magnetic safe, a police surveillance van and motorbike, plus police hero Tom Bennett and crook Big Betty minifigures.\nThe police surveillance van and bank building have detailed interiors, and kids can pull the safe from the bank wall with the monster truck’s magnetic arm. This set can be combined with other original LEGO® sets.\nIdeal for children aged 5 and up, this set requires only basic building skills. It makes a great Christmas, birthday or any-other-day gift for kids who love action toys and for fans of the LEGO® City TV series.\nWhen built, the monster truck measures over 3\" (8cm) high, 6\" (17cm) long and 3\" (9cm) wide, while the police surveillance van measures over 3\" (8cm) high, 4\" (12cm) long and 2\" (6cm) wide.\nYou’re in luck! No batteries required – the vehicles in this LEGO® City police playset are powered by small kids with big imaginations, so the play can start right away.\nIt’s easy to get started with this LEGO® toy. Inside the box you'll find easy-to-follow building instructions – so simply tear open the brick bags and let the fun begin!\nLEGO® City police playsets feature realistic toy buildings, cool vehicles and fun characters that inspire open-ended creative play, while helping youngsters improve physical skills and grow confidence.\nLEGO® building sets meet the highest industry standards to ensure that LEGO City playsets are consistent and compatible, and that all LEGO pieces easily connect and pull apart – every time.\nAt The LEGO Group, we put all LEGO® pieces through rigorous tests to ensure every one of our toy playsets meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/mobile-command-center-60139","description":"Be part of the action with the LEGO® City police as they stop the crook’s escape from the jail cell in the Mobile Command Center, featuring a detachable truck cab, room for two minifigures, monitoring room with screens, satellite dish, opening roof, side doors and rear ramp, storage area for the motorbike and tools and a jail cell breakout feature, plus the crooks’ ATV. Includes four minifigures and a police dog figure.\n\nBuild a truck that opens into a police mobile command center, with a detachable cab, jail cell, monitoring room, satellite dish, and more cool features!\nPull off the jail door for a breakout, and then chase down the crooks’ buildable ATV with the police motorbike!\nIncludes male and female police officers and male and female crook minifigures, plus police dog figure and accessories\nLEGO City building toys are compatible with all LEGO construction sets for creative building\nMobile command center is over 4” high, 9” long, and 2” wide. Truck cab is over 3” high, 5” long, and 2” wide. ATV is over 1” high, 2” long, and 1” wide. Motorbike is over 1” high, 2” long, and under 1” wide\n374 pieces – For boys and girls between the ages of 6 and 12 years old"},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/police-helicopter-transport-60244","description":"A fantastic building set for kids who love action toys, this LEGO® City Police Helicopter Transport (60244) set includes a ripcord helicopter that really flies. Young crimefighters will have plenty of fun assisting police officer Rooky Partnur in her bid to put infamous crook Frankie Lupelli back behind bars. This exciting set also includes a police helicopter transporter truck and motorbike, a mobile police cell and a crooks' ATV. Cool police playset toy for kids This fun police toy comes with an easy-to-follow construction guide and Instructions PLUS – an interactive building guide with zoom and rotate viewing tools that help young LEGO builders become master builders. Instructions Plus is included in the free LEGO Life app for smartphones and tablets. The captivating world of LEGO City police LEGO City police sets deliver an enjoyable build and play experience. The realistic vehicles, detailed buildings and fun characters stimulate imaginative, open-ended role-play for children of all ages.\nBring the excitement of LEGO® City to young action fans with this multi-vehicle police set featuring a ripcord helicopter, transporter truck and more. The fun starts the moment kids open the box.\nThis police toy includes a transporter truck, ripcord helicopter, motorcycle and ATV. Add the included LEGO® TV characters Rooky Partnur and Frankie Lupelli, police officer and crook minifigures for action-packed play.\nKids can launch the new-for-January-2020 ripcord police helicopter into the air. The transporter truck has a detailed driver’s cab, mobile prison cell, computer and road barriers – a delight for LEGO® City police fans.\nThis action-packed LEGO® City Police Helicopter Transport (60244) building set makes a great gift for kids aged 5 and up. It's also brilliant for kids who love toy trucks, helicopters, motorcycles and action toys.\nWhen built, the helicopter transporter truck and trailer measures over 3\" (9cm) high, 15\" (39cm) long and 2\" (6cm) wide, while the ripcord helicopter measures over 2\" (6cm) high, 7\" (19cm) long and 4\" (12cm) wide.\nNo batteries required – this playset is powered by small kids with big imaginations, so play can start right away!\nFind instructions for this building set in the box. Or hop online to download Instructions PLUS – available as part of the free LEGO® Life app. Zoom, rotate and visualize the model to bring the building process to life.\nLEGO® City police sets help kids grow physical skills and confidence with feature-rich buildings, realistic vehicles and fun characters that inspire open-ended creative play.\nLEGO® bricks are designed to the highest industry standards so that LEGO City building toys are consistent, compatible and connect and pull apart easily every time.\nAt The LEGO Group, we thoroughly test LEGO® City playsets to make sure every one of these unique toys meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/air-race-60260","description":"Send kids’ imaginations skyward with this LEGO® City Air Race (60260) playset, featuring a cool toy propeller stunt plane, 2 ripcord helicopters and 2 course pylons. Boys and girls can have fun launching the helicopters into the air and enjoy action-packed adventures with 3 minifigure characters, including LEGO City TV's ace pilot Rivera, plus Xtreme and Vitarush helicopter pilots.\n\nGreat building set for kids\nThe LEGO City Air Race playset comes with an easy-to-follow building guide and Instructions PLUS – part of the free LEGO Building Instructions app for smartphones and tablets. This interactive building guide with zoom and rotate viewing tools helps young LEGO builders become master builders.\n\nInspiring creative, imaginative play\nLEGO City Airport toys deliver an enjoyable build and play experience with realistic vehicles, detailed accessories and fun characters that stimulate open-ended, fun-filled role play.\n\nSend Kids’ imaginations skyward with this multi-vehicle LEGO® City Air Race playset, featuring 2 toy flying ripcord helicopters, 3 minifigures, including LEGO City Adventures TV series character Rivera, and more.\nWhat’s in the box? The LEGO® City Air Race set includes 2 toy ripcord helicopters, a stunt plane, 2 course pylons and 3 minifigures, including LEGO City TV character Rivera and LEGO City Xtreme and Vitarush pilots.\nKids can launch the ripcord helicopters into the air. The toy stunt plane and helicopters also have opening cockpits with room for any 1 of the 3 minifigure pilots included with this airport building set.\nThis LEGO® City Air Race (60260) playset makes a great Christmas, birthday or any-other-day gift for kids aged 5 and up and for boys and girls who love toy vehicles. Requires only very basic building skills.\nStunt plane toy measures over 3\" (8cm) high, 7\" (20cm) long and 7\" (20cm) wide, while each ripcord helicopter measures over 2\" (7cm) high, 7\" (18cm) long and 4\" (12cm) wide.\nNo batteries required for this air race building set – it’s powered by kids’ imaginations. Need help launching the ripcord helicopters? Scan the QR code in the building instruction to view the video guide.\nThis air race set comes with a simple building guide, and instructions PLUS – an interactive building guide that helps kids become master builders. Part of the free LEGO® Building Instructions app for smart devices.\nLEGO® City Airport sets stimulate imaginative role play with realistic, feature-rich buildings, cool vehicles and fun characters.\nAll LEGO® City Airport playsets meet the highest industry standards and quality criteria to ensure that all LEGO bricks and pieces are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure every kid's building set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/burger-bar-fire-rescue-60214","description":"Defend the local burger shop with the awesome LEGO® City 60214 Burger Bar Fire Rescue set, featuring a burger bar with sign and toppling fire elements, sliding service window and trash can. This fun set also features a fire truck with minifigure cab, 2 storage compartments, rotating back end and new-for-January-2019 directional pump with ‘water jet' function. There's also a motorbike with room for a fire extinguisher, new-for-January-2019 fire axe and 3 minifigures.\n\nIncludes 3 LEGO® City minifigures: 2 firefighters and a grill chef.\nFeatures a fire truck toy with a minifigure cab, rotating back end, new-for-January-2019 directional pump with ‘water jet’ function and 2 storage compartments, plus a motorbike.\nAlso includes a burger bar with burger sign, opening service window and a trash can.\nAccessory elements include a new-for-January-2019 fire axe, 2 helmets with opening visors, oxygen tank, trash can, motorbike helmet, small fire extinguisher and 5 buildable fire elements.\nRaise one or all sets of flames on the burger bar sign and trash can to put out a small fire or battle a raging inferno!\nRotate the back end of the fire truck and squeeze the bellows on the water pump to launch the water elements and knock down the flames.\nBurger Bar with sign measures over 6” (17cm) high, 4” (12cm) wide and 2” (6cm) deep.\nFire truck toy with water pump retracted measures over 3” (8cm) high, 5” (15cm) long and 2” (6cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/mars-research-shuttle-60226","description":"You were born to explore the universe! Build and inspire the next generation of astronauts with LEGO® Space rockets and vehicles – Let’s Go!\n\nGive young space adventurers a treat with a NASA-inspired research shuttle and rover toy set. This cool LEGO® City 60226 Mars Research Shuttle playset features a space shuttle toy with opening cockpit, 2 opening cargo doors and space inside for the storage drone, rover with new-for-June-2019 articulated grappling arm, laser and tilting solar panels, storage drone with opening compartment and a helidrone with spinning rotor blade and scanner, plus a Mars scenery build with secret symbol. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This exciting exploration playset also includes 2 astronaut minifigures.\n\nIncludes 2 LEGO® City astronaut minifigures.\nThis building set for kids features a space research shuttle with opening cockpit, 2 large opening doors and space inside for the storage drone, plus a NASA-inspired Mars rover with new-for-June-2019 articulated grappling arm, laser and tilting solar panels, storage drone with opening compartment, plus a helidrone with spinning rotor blade and scanner to read a secret symbol discovered on Mars!\nAccessory elements include a helmet with blue visor, Extra Vehicular Activity suit with golden visor, scanner and 2 new-for-June-2019 geodes with blue crystals.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nDownload LEGO® Life the app at the iOS or Android app store. Ask your parents' permission before going online.\nThis fun construction toy makes a great gift for kids.\nResearch shuttle measures over 3” (9cm) high, 9” (23cm) long and 8” (21cm) wide.\nMars rover measures over 1” (5cm) high, 2” (7cm) long and 2” (6cm) wide.\nHelidrone measures over 1” (4cm) long and 1” (3cm) wide.\nStorage drone measures over 1” (3cm) high and 1” (3cm) long.\nMars scenery build measures over 1” (3cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/ocean-exploration-submarine-60264","description":"Kids can play out exciting sea exploration adventures with this LEGO City Ocean Exploration Submarine (60264) playset, featuring an awesome toy submarine, underwater drone and a seabed-cave setting. And with 4 explorer minifigures, including Jessica Sharpe from the popular LEGO City Adventures TV series, a glowing anglerfish and hidden treasure, the scene is set for endless fun and adventure!\n\nGreat building set for kids\nThis building set comes with simple building instructions and Instructions PLUS – part of the free LEGO Building Instructions app for smartphones and tablets. This interactive building guide, with amazing zoom and rotate viewing tools, quickly helps budding LEGO builders become master builders.\n\nCool toys for kids\nLEGO City is proud to support the work of National Geographic Explorers. Our Ocean playsets bring an exciting and open-ended world of undersea exploration and adventure, where kids get to enjoy lifelike role-play scenarios with realistic ocean vehicles, lifelike settings and fun characters.\nHere’s a great toy for boys and girls who love the ocean and its wildlife. This LEGO® City Ocean Exploration Submarine (60263) playset has all kids need for imaginative underwater adventures.\nWhat's in the box? A toy submarine, underwater drone and a coral-covered seabed setting, plus 4 minifigures, including LEGO® City TV's Jessica Sharpe and 2 divers with cool accessories, and a glowing anglerfish figure.\nKids can combine the vehicles and characters included in this set with other original LEGO® toy playsets for even more creative play or to make awesome display pieces.\nThis LEGO® City Ocean Exploration Submarine playset makes a great Christmas, birthday or any-other-day gift for kids aged 5 and up. Requires only very basic building skills.\nWhen built, the LEGO® Ocean Toy Exploration Submarine measures over 3\" (9cm) high, 5\" (14cm) long and 4\" (11cm) wide, while the ROV sub measures in at over 2\" (6cm) long and 1\" (4cm) wide.\nNo need for batteries – this exciting ocean exploration toy is powered by kids with big imaginations!\nThis kids’ toy comes with an easy-to-follow printed building guide and Instructions PLUS – a digital construction guide for young builders. Available as part of the free LEGO® Building Instructions app for smart devices.\nLEGO® City is proud to support the groundbreaking work of National Geographic Explorers, who help build a better world for us all. LEGO City Ocean playsets introduce kids to the exciting world of underwater exploration.\nLEGO® City Ocean playsets are designed to the highest industry standards and criteria. This ensures that the LEGO bricks and pieces are consistent, compatible and connect and pull apart easily every time.\nAll LEGO® City bricks and pieces are tested to the extreme to create toy building sets that meet the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/police-helicopter-chase-60243","description":"Kids with a passion for role-play will love this LEGO® City Police Helicopter Chase (60243) playset, featuring a police helicopter with a working magnet chain. Young law enforcers can join LEGO City TV hero Sam Grizzled in his bid to protect the city from master crook Snake Rattler. And with a toy getaway truck, motorcycle and police ATV in the mix, the scene is set for action-packed adventures! Cool toy for kids You'll find building instructions for this LEGO City building toy in the box. Or you can hop online and download Instructions PLUS, part of the LEGO Life app for smartphones and tablets. This interactive building guide, with amazing zoom and rotate viewing tools, quickly turns budding LEGO builders into master builders! Realistic role-play adventures LEGO City police sets deliver an exciting build and play experience with models and characters that depict real city life in a fun and imaginative way.\nThis multi-vehicle LEGO® City police (60243) set features a toy helicopter with a powerful magnet for lifting magnetic objects, including the crooks’ getaway vehicle! A cool toy for kids who enjoy fun car-chase action.\nTake LEGO® City TV hero Sam Grizzled, an ATV rider, crook Snake Rattler and his accomplice. Add a toy helicopter with a lifting magnet, a getaway truck and motorbike and the scene is set for endless independent play!\nMini crimefighters can lift and transport the crooks' getaway vehicle by attaching the helicopter’s magnet to the stolen safe on the back of the truck. The helicopter also has room for all 4 minifigures.\nLooking for cool toys for kids aged 5+? This set makes a great Christmas, birthday or any-other-day gift for LEGO® City fans and boys and girls who love action-packed role-play. Requires only very basic building skills.\nWhen built, Sam Grizzled's Helicopter measures over 4\" (11cm) high, 11\" (30cm) long and 10\" (26cm) wide, while Snake Rattler's getaway truck measures over 1\" (5cm) high, 3\" (10cm) long and 1\" (5cm) wide.\nDoes it need batteries? No, this construction toy is powered by small kids with big imaginations – simply open the bags of bricks and the play can start right away!\nThis building toy comes with an easy-to-follow printed building guide and Instructions PLUS – an interactive building guide for budding builders. Available in the free LEGO® Life app for smart devices.\nUnleash the fun and excitement of LEGO® City police sets featuring buildings, vehicles and characters that inspire open-ended creative play while helping youngsters develop physical skills and confidence.\nLEGO® building bricks are designed to the highest industry standards to ensure that LEGO City playsets are consistent, compatible and connect and pull apart easily every time.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® City pieces to make sure every building set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/elite-police-boat-transport-60272","description":"Youngsters love to role-play everyday heroes, and with this LEGO® City Police Boat Transport (60272) playset they can do just that! There’s a cool police armored off-roader with detachable boat trailer, a police dinghy and a cool speedboat. Add to that the popular LEGO City Adventures TV series characters lieutenant Duke DeTain and Clara the Criminal, and the scene is set for action-packed LEGO fun.\n\nFun and easy to build\nThis awesome building toy comes with simple building instructions,but you also get Instructions PLUS – part of the free LEGO Building Instructions app for smartphones and tablets. This interactive building guide, with amazing zoom and rotate viewing tools, quickly helps budding LEGO builders become master builders.\n\nCool toys for kids\nLEGO City Police playsets deliver exciting play scenarios that reflect real life in a fun and imaginative way. The realistic vehicles and fun characters stimulate imaginative, open-ended role play and creativity for children aged 5 and up.\n\nBring the excitement of the LEGO® City Adventures TV series home with this multi-vehicle LEGO City Police set. Perfect for kids who love action-packed hands-on play.\nWhat’s in the box? An armored police off-roader with detachable boat trailer, a police dinghy and a speedboat, plus LEGO® City TV characters Duke DeTain, Clara the Criminal and lots of cool accessories.\nKids can combine the vehicles and characters included in this set with other original LEGO® toy playsets for even more fun play and awesome displays.\nThis LEGO® City Police Boat Transport (60272) playset makes a great Christmas, birthday or any-other-day gift for kids aged 5 and up. Requires only very basic building skills.\nMeasuring over 2\" (6cm) high, 4\" (12cm) long and 2\" (6cm) wide the toy police car has room for the Duke DeTain minifigure, while the dinghy measures in at over 1\" (3cm) high, 4\" (11cm) long and 1\" (5cm) wide.\nNo batteries required. This LEGO® City toy construction set is powered by children’s imaginations, so the play can start right away!\nIncludes a printed building guide and Instructions PLUS – part of the free LEGO® Building Instructions app for smart devices. This interactive construction guide helps budding builders become master builders!\nLEGO® City police sets come with feature-rich accessories, cool vehicles and fun characters that stimulate imaginative role play as kids create open-ended adventures in lifelike settings.\nLEGO® City playsets meet the highest industry standards and quality criteria to ensure that all LEGO bricks and pieces are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure every kid's building set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/elite-police-driller-chase-60273","description":"Kids who love toy vehicles, and fans of the hit LEGO® City Adventures TV series, will adore this fun-packed LEGO City Police Driller Chase (60273) playset. Featuring an armored police car and a bank-busting mine driller, plus LEGO City TV characters Sam Grizzled and crook Hacksaw Hank, non-stop action is guaranteed.\n\nGreat building kit for kids\nThis LEGO playset comes with an easy-to-follow building guide and Instructions PLUS – part of the free LEGO Building Instructions app for smartphones and tablets. This interactive building guide, with amazing zoom and rotate viewing tools, quickly helps younger LEGO builders become master builders.\n\nWelcome to LEGO City!\nAs part of the LEGO City universe, Police playsets deliver an exciting build-and-play experience. Children love to create thrilling scenarios with models and characters that depict real life in a fun and imaginative way.\n\nThis Police Driller Chase (60273) playset is an ideal introduction to the exciting world of LEGO® City. Perfect for kids aged 5 and up, it inspires open-ended, imaginative role play based on real-life scenarios.\nWith LEGO® City Adventures TV series hero Sam Grizzled and crook Hacksaw Hank minifigures, a cool toy police car, bank busting mine driller and a stolen bank safe, the scene is set for action-packed crook-catching fun!\nKids can combine the characters and cars in this set with other original LEGO® toy playsets to form their own unique creations for play or display.\nThis LEGO® building kit makes a great Christmas, birthday or any-other-day gift for boys and girls aged 5 and up who love imaginative role play. Requires only very basic building skills.\nWhen built, Sam Grizzled's police car measures over 1\" (4cm) high, 4\" (11cm) long and 1\" (5cm) wide, while Hacksaw Hank's mine driller measures in at over 1\" (5cm) high, 6\" (17cm) long and 2\" (6cm) wide.\nNo need for batteries! This cool toy is powered by kids’ imaginations – so play can start right away!\nThis toy police set comes with a printed building guide and Instructions PLUS – an interactive building guide that helps kids become master builders. Part of the free LEGO® Building Instructions app for smart devices.\nLEGO® City Police playsets come with feature-rich buildings, cool vehicles and fun characters that stimulate imaginative role play as kids create exciting, lifelike scenarios.\nAll LEGO® City playsets meet the highest industry standards and quality criteria to ensure that all LEGO bricks and pieces are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure every kid's building set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/elite-police-lighthouse-capture-60274","description":"Kids with a passion for role play will love this LEGO® City Police Lighthouse Capture (60274) playset, featuring a toy lighthouse, police reconnaissance helicopter and makeshift raft. And with LEGO TV characters Rooky Partnur and Vito, plus a snappy shark, the scene is set for action-packed adventures!\n\nCool toy for kids\nYou'll find building instructions for this LEGO City building toy in the box. Or you can hop online and download Instructions PLUS, part of the free LEGO Building Instructions app for smartphones and tablets. This interactive building guide, with amazing zoom and rotate viewing tools, quickly turns budding LEGO builders into master builders!\n\nRealistic role-play adventures\nLEGO City Police sets deliver an exciting build and play experience with cool toy vehicles and fun characters that depict real life in a fun and imaginative way.\n\nKids aged 5 and up get to enjoy open-ended, imaginative role play based on real-life scenarios with this LEGO® City police (60274) set. An ideal introduction to the exciting world of the LEGO City.\nA feature-rich lighthouse, toy helicopter and makeshift raft set the scene for fun and adventure with LEGO® City Adventures TV series characters Rooky Partnur and Vito, plus a snappy shark.\nKids can combine the characters and models in this set with other LEGO® toy playsets to form their own unique creations for play or display.\nLooking for cool toys for kids aged 5+? This set makes a great Christmas, birthday or any-other-day present for LEGO® City fans and boys and girls who love action-packed role play. Requires only very basic building skills.\nWhen built, the lighthouse measures over 5” (14cm) high, 3” (9cm) wide and 1” (4cm) deep, while Rooky Partnur's helicopter measures over 3\" (9cm) high, 8\" (21cm) long and 6\" (16cm) wide.\nDoes it need batteries? No, this LEGO® construction toy is powered by small kids with big imaginations – simply tear open the brick bags and the build and play fun can start right away!\nThis building set comes with an easy-to-follow printed building guide and Instructions PLUS – an interactive building guide for budding builders. Part of the free LEGO® Building Instructions app for smart devices.\nUnleash the fun and excitement of LEGO® City Police sets with settings, vehicles and characters that inspire open-ended creative play while helping youngsters develop physical skills and confidence.\nAll LEGO® City building sets meet the highest industry standards and quality criteria to ensure that all LEGO bricks and pieces are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure every kid's building set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/fire-helicopter-response-60248","description":"An awesome building set for kids who love action toys, this LEGO® City Fire Helicopter Response (60248) set features a ripcord helicopter that really flies, plus a response ATV and a fire setting. Kids can enjoy role-play fun with 3 minifigures, including a worker with a cool welding mask, a firefighter helicopter pilot and LEGO City TV hero fire chief Freya McCloud. Cool building toy for kids If you're looking for an ideal Christmas, birthday or any-other-day gift for kids who love action toys, look no further. With easy-to-follow building instructions, even budding LEGO builders can dive straight into an immersive and independent build-and-play experience, role-playing fun characters and launching the new-for-January-2020 ripcord police helicopter into the air! LEGO City fire sets LEGO City fire playsets come with a wide range of feature-rich buildings, realistic vehicles and fun characters that take kids to a world where creativity and imagination can thrive.\nGift your everyday hero the high-action excitement of LEGO® City with this Fire Helicopter Response (60248) playset, featuring a ripcord helicopter toy, ATV and much more. The play starts the moment kids open the box.\nAction-packed fun awaits, with a cool flying ripcord helicopter, rescue ATV and a burning pipe, plus 3 minifigures, including an ace firefighter pilot, accident-prone worker and LEGO® City TV fire chief Freya McCloud.\nKids can launch the new-for-January-2020 ripcord helicopter toy, with pilot minifigure, into the air and play out LEGO® City TV scenes with fire chief Freya McCloud. This set is compatible with all original LEGO sets.\nLooking for cool toys for kids aged 5 to 8 years? This firefighter playset makes a great gift for LEGO® City fans and kids who love action-packed role play. Requires only very basic building skills.\nWhen built, the toy ripcord helicopter measures over 2\" (6cm) high, 7\" (19cm) long and 4\" (12cm) wide, while the ATV measures over 1\" (4cm) high, 3\" (8cm) long and 1\" (4cm) wide.\nThere’s no need for batteries! This LEGO® toy is powered by a ripcord and by kids’ imaginations. So simply open the LEGO brick bags and the firefighting action can begin right away!\nIt's easy to get started with building this LEGO® City construction toy. It comes with a simple building guide that helps new LEGO builders enjoy the benefits of independently creating the models.\nLEGO® City fire sets nurture imaginative role play and open-endedadventures in settings that resemble real life, with detailed buildings, cool vehicles and fun characters that kids just love.\nHave you wondered how LEGO® bricks continue to connect and pull apart easily time after time? It’s because every LEGO City playset is developed to meet the highest industry standards and our strict quality criteria.\nEvery LEGO® piece is rigorously tested to make sure it meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/police-highway-arrest-60242","description":"With 2 cool cars, LEGO® City hero Duke DeTain and notorious crook Vito minifigures, this LEGO City Police Highway Arrest (60242) building toy sets the scene for awesome car-chase adventures. A great gift for kids who love action-packed role-play and for fans of the truly awesome LEGO City TV series. Great building set for kids This toy playset comes with a simple building guide and Instructions PLUS – part of the free LEGO Life app for smartphones and tablets. This interactive building guide, with amazing zoom and rotate viewing tools, quickly turns budding LEGO builders into master builders! Welcome to LEGO City! As part of the LEGO City universe, police playsets deliver an exciting build-and-play experience. Children love to create thrilling scenarios with models and characters that depict real life in a fun and imaginative way.\nTreat youngsters to the excitement of high-action LEGO® City car chases with this cool (60242) police set, designed to inspire open-ended, imaginative role-play based on real-life scenarios.\nWith LEGO® City TV hero lieutenant Duke DeTain and crook Vito minifigures, a cool toy police car, sporty getaway car, plus a stolen safe and a crate of fish, the scene is set for fun and exciting car-chase action!\nKids can combine the characters and cars in this set with other original LEGO® toy playsets to form their own unique creations for play or display.\nThis action-packed construction toy makes a great Christmas, birthday or any-other-day gift for boys and girls aged 5 and up who love imaginative play. Requires only very basic building skills.\nWhen built, Duke's police car measures over 1\" (4cm) high, 4\" (12cm) long and 1\" (5cm) wide, while Vito's convertible measures in at over 1\" (3cm) high, 4\" (11cm) long and 1\" (5cm) wide.\nNo need for batteries! This cool toy is powered by kids’ imaginations – so play can start right away!\nThis toy police set comes with a printed building guide and Instructions PLUS – an interactive building guide that helps budding builders become master builders! Available in the free LEGO® Life app for smart devices.\nLEGO® City police sets come with feature-rich buildings, cool vehicles and fun characters that stimulate imaginative role-play as kids create open-ended adventures in settings that resemble real city life.\nAll LEGO® City playsets meet the highest industry standards, ensuring these fun kids’ toys continue to connect and pull apart easily.\nAt The LEGO Group, we drop, squash, twist, heat, scratch and stretch LEGO® City building bricks to make sure every set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/race-boat-transporter-60254","description":"Everything is truly awesome about this LEGO® City Race Boat Transporter (60254) playset, featuring a powerful transporter truck and a sporty aerodynamic, jet-powered speed boat that really floats! And with truck driver and Xtreme racing driver minifigures, the scene is set for high-speed racing competition and adventure! Kids will love building a toy boat that floats With this toy playset you get a simple building guide and Instructions PLUS! Part of the free LEGO Life app for smartphones and tablets, this interactive building guide, with zoom and rotate viewing tools, really does make LEGO building child’s play! LEGO City – Cool toys for kids LEGO City Great Vehicles playsets deliver feature-rich, land, air and water toys that spark the imagination. With these realistic building kits, kids get to explore all kinds of vehicles and create stories and scenarios that depict real city life in a fun and imaginative way.\nHere’s an ideal building set for kids who love action-packed building toys. This LEGO® City Race Boat Transporter, comes with a cool truck and a boat that floats. The action starts the moment kids open the box.\nThis building kit includes a toy truck with trailer, a race boat that floats on water and truck and racing driver minifigures. In fact, there's everything a kid needs for creative independent play.\nKids will love the cool truck with cab, opening doors, removable roof and transport restraining bars. The sporty speed boat has an opening cockpit with room for the Xtreme racing driver – and it floats on water!\nThis LEGO® City Speed Boat Transporter (60254) playset makes a great Christmas, birthday or any-other-day gift for kids aged 5 and up who love action role-play toys and model vehicles.\nWhen built, the transporter, with onboard toy speed boat, measures over 3\" (9cm) high, 14\" (36cm) long and 2\" (6cm) wide, while the speed boat itself measures over 2\" (6cm) high, 9\" (24cm) long and 2\" (6cm) wide.\nNo batteries required – this floating speed boat set is powered by small kids with big imaginations!\nIncludes a simple printed building guide. Or you can download Instructions PLUS – part of the free LEGO® Life app. With this interactive building guide's zoom and rotate viewing tools, building really is child's play.\nLEGO® City Great Vehicles playsets nurture kids' physical skills and confidence with feature-rich land, air and water vehicles and fun characters that inspire open-ended creative play.\nLEGO® building bricks meet the highest industry standards as well as The LEGO Group's rigorous quality criteria, so they’re consistent, compatible and easily click together and apart every time.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces to make sure every set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/racing-cars-60256","description":"Fantastic building set for kids who love action toys. Your little racing driver will enjoy endless high-speed action with this (60256) LEGO® City Racing Cars building set. These pretend electric- and gasoline-powered LEGO race cars with minifigure drivers set the scene for the ultimate race challenge – gasoline vs. electric. Great building set for kids Kids can enjoy a fun learning experience with this toy playset. Why? Because it comes with a simple building guide that will help your budding LEGO builder become a master builder. Cool construction toys for kids LEGO City vehicle playsets give kids the chance to let their inner turbo loose with an awesome range of superfast, supercool building toys on wheels. These feature-rich building sets, with fun characters, inspire open-ended, independent play, where children can recreate scenarios that reflect real life in a fun and exciting way.\nTreat youngsters to the excitement of LEGO® City with this cool racing cars set, designed to inspire open-ended, independent role-play based on real-life scenarios. Perfect for kids who love race car toys.\nWhat's in the box? Kids get 2 cool LEGO® race cars with awesome detailing, 2 cones for the start or finish line, plus 2 driver minifigures with racing helmets – all a kid needs for action-packed, independent play.\nKids can combine the vehicles and characters included in this set with other original LEGO® toy playsets for even more creative play or to make awesome display pieces.\nThis LEGO® City Racing cars (60256) construction toy makes a great Christmas, birthday or any-other-day gift for boys and girls aged 5 and up who love imaginative play. Requires only very basic building skills.\nWhen built, the red LEGO® race car measures over 1\" (4cm) high, 5\" (13cm) long and 1\" (5cm) wide, while the yellow LEGO race car measures in at over 1\" (4cm) high, 4\" (12cm) long and 1\" (5cm) wide.\nNo need for batteries – this cool race-car set is powered by kids with big imaginations, so play can start right away!\nIt's easy to get started with this LEGO® race car set. Inside the box you'll find easy-to-follow building instructions – so simply tear open the brick bags and let the fun begin!\nLEGO® City buildable toys come with feature-rich buildings, cool vehicles and fun characters that stimulate imaginative play while helping youngsters grow their physical skills and confidence.\nAll LEGO® City playsets meet the highest industry standards and The LEGO Group's strict quality criteria, ensuring these fun kids toys continue to connect and pull apart easily.\nAt The LEGO Group, we drop, squash, twist, heat, scratch and stretch LEGO® City building toys to make sure every set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/construction-bulldozer-60252","description":"Youngsters who love to role-play everyday heroes will love this LEGO® City Construction Bulldozer (60252) set. There’s a cool bulldozer with rubber tracks and working bucket, a toy crane with a wrecking ball, a cement mixer and a warning sign – everything a child needs to enjoy hours of imaginative play. A cool toy for kids This 4+ toy playset includes a simple printed building guide and a special Starter Brick element to help youngsters experience the pride of constructing their own LEGO toys. And with the free LEGO Life app for smartphones and tablets, kids get Instructions PLUS – an interactive building guide with amazing zoom and rotate viewing tools that really make LEGO building child’s play. The creative world of LEGO City With LEGO City sets, kids get to immerse themselves in open-ended adventures and scenarios that reflect real life. And with a wide range of realistic, feature-rich vehicles and machines, kids' imaginations are free to soar!\nThis construction bulldozer set for kids is an ideal introduction to the exciting world of LEGO® City. Perfect for children aged 4+, it is designed to inspire creative, independent play based on real-life scenarios.\nWhat’s in the box? This (60252) construction site playset features a bulldozer with working bucket, a toy crane with a wrecking ball, a cement mixer, 2 minifigures and more. Just add a sprinkle of imagination for endless fun!\nKids can cordon off the site with the sign and cones, swing the wrecking ball to knock down the wall, scoop up bricks with the bulldozer, spin the cement mixer and more – a great gift for kids who love pretend play.\nLEGO® City 4+ sets are a fun way for youngsters to learn the art of LEGO building. With special starter bricks and simple printed building guides they help kids grow their confidence and abilities step by step.\nWhen built, the construction bulldozer measures over 3\" (8cm) high, 4\" (12cm) long and 2\" (6cm) wide, while its trailer measures over 1\" (4cm) long, 3\" (9cm) high and 1\" (4cm) wide.\nNo batteries required – this building toy is powered by small kids with big imaginations, so the play can start right away!\nFind instructions to build this 4+ set in the box. Or hop online to download Instructions PLUS – available as part of the free LEGO® Life app. Zoom, rotate and visualize the model to bring the building process to life.\nLEGO® City Great Vehicles sets help kids grow physical skills and confidence with feature-rich buildings, realistic vehicles and fun characters that inspire open-ended independent play.\nLEGO® bricks are designed to the highest industry standards to ensure that LEGO® City building toys are consistent, compatible and connect and pull apart easily every time.\nAt The LEGO Group, we thoroughly test LEGO® City playsets to make sure every one of these unique toys meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/diving-yacht-60221","description":"Explore the underwater world with the LEGO® City 60221 Diving Yacht! This awesome luxury Diving Yacht features a sun deck, removable roof, turning searchlight and storage/sleeping space inside, plus a sea floor scene with seaweed and an opening treasure chest with gem element. This fun toy boat set also includes a buoy, 2 LEGO diver minifigures, and swordfish and crab figures.\n\nIncludes 2 LEGO® City diver minifigures, plus swordfish and crab figures.\nFeatures a large leisure diving yacht boat toy with sun deck, removable roof, turning searchlight and storage/sleeping space inside.\nAlso includes a sea floor scene with an opening treasure chest.\nAccessory elements include diving gear, a camera, gem element, video camera, oxygen mask, fish figure and a buildable buoy.\nRemove the yacht's roof to access the lower deck and take a nap.\nOpen the treasure chest to discover the gem element and crab.\nSwim back to the surface and head to the yacht with your treasure!\nDiving yacht toy boat measures over 3” (8cm) high, 9” (23cm) long and 2” (6cm) wide.\nSea floor scene measures over 1” (5cm) high, 1” (4cm) wide and 1” (4cm) deep."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/garbage-truck-60220","description":"Help your child keep LEGO® City clean with the neat 60220 Garbage Truck. This industrious LEGO 4+ vehicle set is made to be fun and easy for preschoolers and younger children, featuring a sturdy garbage truck with 2-minifigure cab and tilting container, plus a Starter Brick base that helps even first-time builders discover the pride of construction on their own. The included simple guide to building and play will help your young waste collector understand the purpose of the building steps, while growing their imagination and confidence, as the perfect start to LEGO brick building toys in a familiar LEGO City setting. This fun set also includes a toy dumpster, garbage elements and 2 minifigures.\n\nLEGO® 4+ sets are designed to be fun and easy for young children, with simple building steps that give a great start to LEGO building and help grow their confidence.\nIncludes 2 LEGO® City waste collector minifigures.\nFeatures an easy-to-build garbage truck toy with an opening 2-minifigure cab, tilting container and a Starter Brick base to help your child get to build and play quickly in the busy LEGO® City universe.\nAlso includes a dumpster with wheels.\nAccessory elements include a garbage can, shovel, broom, banana, fish, small branch and 7 LEGO® brick elements.\nTip the garbage truck container, hook up the dumpster, and tip them both to empty the garbage.\nLEGO® 4+ introduces your child to an unlimited world of their everyday heroes.\nLEGO® 4+ play sets were originally known as LEGO Juniors and are compatible with all LEGO construction sets for creative building.\nMakes an excellent gift for preschoolers and youngsters.\nGarbage truck measures over 3” (9cm) high, 5” (14cm) long and 2” (7cm) wide.\nDumpster measures over 1” (4cm) high, 2” (6cm) wide and 1” (3cm) deep."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/ice-cream-truck-60253","description":"Children can become everyday heroes with this fun LEGO® City Ice-Cream Truck (60253) playset. Kids get to save the day by serving cool ice-cream cones and popsicles to sweltering LEGO City citizens! And with room inside the truck for the ice-cream lady to work and drive, plus a skateboarding customer with a cute dog, there's plenty of scope for independent role-play fun. A supercool building set for kids You'll find building instructions for the LEGO City Ice-Cream Truck toy in the box. Or you can hop online and download Instructions PLUS, part of the LEGO Life app for smartphones and tablets. This interactive building guide, with amazing zoom and rotate viewing tools, quickly turns budding LEGO builders into master builders. LEGO City Great Vehicles kids' toys With LEGO City Great Vehicles playsets, kids get to explore their favorite land, air and sea vehicles and machines up close. These realistic construction toys inspire imaginative play that reflects real life in a fun and exciting way.\nKnow a child who loves visiting ice-cream carts? Kids can enjoy sunny, summer-day fun with this LEGO® City Ice-Cream Truck building set toy – designed to inspire creative, independent role-play based on everyday life.\nBuilding set for kids featuring a brightly colored ice-cream truck with ice-cream lady and skateboarder minifigures, plus a dog figure. Perfect for imaginative, independent play.\nKids can help the ice-cream lady drive the truck, serve ice-cream cones and popsicles from theserving hatch and help the skateboarder perform cool tricks. This colorful ice-cream truck is also a great display piece.\nThe LEGO® City Ice-Cream Truck (60253) toy makes a great Christmas, birthday or any-other-day gift for kids aged 5 and up and for boys and girls who love toy vehicles. Requires only basic building skills.\nWhen built, the ice-cream truck measures over 4\" (11cm) high, 5\" (15cm) long and 2\" (6cm) wide. Plenty of room for the ice-cream lady to drive the truck and serve customers.\nThis supercool LEGO® City Ice-Cream Truck playset doesn’t need batteries – it’s powered by small kids with big imaginations, so the play can start right away.\nBuilding really is child’s play with this building set. It comes with a printed building guide and Instructions PLUS – an interactive building guide for kids. Available in the free LEGO® Life app for smart devices.\nLEGO® City Great Vehicles toys inspire creative play, help kids improve physical skills and grow confidence. Kids get to explore all kinds of vehicles and create play scenarios that reflect life in a fun, exciting way.\nLEGO® building sets meet the highest industry standards to ensure that LEGO City playsets are consistent and compatible, and that all LEGO pieces easily connect and pull apart – every time.\nAt The LEGO Group, we put our LEGO® pieces through rigorous tests to ensure every one of our toy playsets meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/safari-off-roader-60267","description":"Kids will go wild for this LEGO® City Safari Off-Roader (60267) adventure playset, featuring a tough, zebra-patterned, all-terrain safari vehicle, with a camera mount, removable roof rack and cool accessories. Young imaginations can run free as they help the explorers set up camp for the ultimate wild-animal photo shoot. Packed with lots of cool features If you're looking for an action-toy playset that kids will love, this set has it all. With an awesome off-roader, toy lioness and parrot figures and 2 explorer minifigures armed with a pair of binoculars, a camera and a funny tree costume, the scene is set for exciting safari adventures. Build-and-play fun for kids aged 5 and up This LEGO City Great Vehicles playset delivers an enjoyable, independent build-and-play experience and includes a simple building guide for budding LEGO builders. The realistic vehicles, accessories and fun characters stimulate imaginative, open-ended role-play for children aged 5 and up.\nUnleash the wild fun of LEGO® City with this safari off-roader playset – designed to inspire open-ended, independent role-play based on real-life scenarios.\nWhat’s inside the box? Everything a kid needs to go on safari! There’s a sturdy, zebra-patterned, all-terrain vehicle, photographer's tree costume, 2 explorer minifigures and toy lioness and parrot figures.\nThe safari off-roader has a removable roof rack for storing the photographer's tree costume and a camera mount for the perfect photo. Kids can also combine it with other original LEGO® sets for fun play or cool displays.\nThis LEGO® City Safari Off-Roader (60267) playset makes an ideal Christmas, birthday or any-other-day gift for kids aged 5 and up who love model vehicles and role-play toys. Requires only very basic building skills.\nWhen built, the safari off-roader measures over 3\" (10cm) high, 6\" (16cm) long and 2\" (6cm) wide. That's enough room to store all the gear kids need for a successful safari.\nDoes this building set require batteries? No – it’s powered by small kids with big imaginations, so the play can start right away!\nIt’s easy for kids to get started with this LEGO® toy construction set. Inside the box there’s a set of easy-to-follow printed building instructions. Simply tear open the brick bags and let the fun begin!\nLEGO® City Great Vehicles adventure playsets feature realistic vehicles and fun characters that inspire open-ended creative play, while helping youngsters improve physical skills and grow confidence.\nLEGO® bricks are designed to the highest industry standards to ensure that LEGO City building toys are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are put through rigorous tests to ensure every playset meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/tracks-60205","description":"Extend your passenger train’s range with this LEGO® City 60205 Tracks set. This set of 8 straight tracks, 4 curved tracks and 8 flexible tracks is the perfect supplement to your existing LEGO City train sets.\n\nFeatures 8 straight, 4 curved and 8 flexible tracks.\nAdd flexible tracks to your LEGO® City train system to get around obstacles and awkward shapes.\nConnect the tracks to your existing sets, including the 60197 LEGO® Passenger Train toy set, to extend your play and fun."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/monster-truck-60251","description":"Kids with a passion for high-speed vehicles will love this LEGO® City Monster Truck (60251) playset. Young racers can show off their driving skills performing sliding turns, huge jumps and awesome landings at breakneck speed. And, with its cool fanged-monster decoration, kids will love to put this colorful Monster Truck toy on display. Cool building toy for kids You'll find building instructions for this LEGO City Monster Truck toy in the box. Or you can hop online and download InstructionsPLUS, part of the LEGO Life app for smartphones and tablets. This interactive building guide, with amazing zoom and rotate viewing tools, quickly turns budding LEGO builders into master builders! The Great Vehicles of LEGO City Kids grow up surrounded by amazing vehicles that travel on land, air and water. With LEGO City Great Vehicles playsets, they get to explore their favorite vehicles up close. These realistic construction toys inspire imaginative play that reflects real life in a fun and exciting manner.\nIntroduce youngsters aged 5 and up to the excitement of LEGO® City with this toy monster truck construction set – designed to inspire imaginative role-play that reflects real life in a fun and exciting manner.\nWhat’s in the box? A sturdy LEGO® City Great Vehicles Monster Truck toy building set with room behind the steering wheel for the driver minifigure. Perfect for high-speed independent play.\nWith big chunky tires and colorful fanged-monster decoration, this sturdy monster truck toy is perfect for both play and display! Kids can also combine this set with other original LEGO® playsets for extra fun.\nThis LEGO® City Monster Truck (60251) building set makes a great Christmas, birthday or any-other-day gift for kids aged 5 and up and for boys and girls who love toy cars. Requires only basic building skills.\nWhen built, the LEGO® City Monster Truck measures over 2\" (6cm) high, 3\" (10cm) long and 2\" (6cm) wide, so there's plenty of room for the driver minifigure inside thecab.\nDoes it need batteries? No, this construction toy is powered by small kids with big imaginations – simply open the bags of bricks and the play can start right away!\nThis kids’ toy comes with an easy-to-follow printed building guide and Instructions PLUS – an interactive building guide for budding builders. Available in the free LEGO® Life app for smart devices.\nUnleash the fun and excitement of LEGO® City Great Vehicles sets – feature-rich vehicles and characters that inspire open-ended creative play while helping youngsters develop physical skills and confidence.\nLEGO® building bricks are designed to the highest industry standards to ensure that LEGO City playsets are consistent, compatible and connect and pull apart easily every time.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® City pieces to make sure every building set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/ocean-mini-submarine-60263","description":"Kids can dive into creative play with this LEGO® City Ocean Mini-Submarine (60263) playset. There’s a toy submarine with a bubble cockpit and inspection arms, a pirate treasure chest with gems and a cool hammerhead shark figure. In fact, this building kit has all kids need for imaginative underwater adventures.\n\nA perfect playset for budding builders\nThis 4+ toy playset includes a simple printed building guide and a special Starter Brick element, so youngsters can take pride in constructing their own LEGO toys. And with the free LEGO Building Instructions app for smartphones and tablets, kids get Instructions PLUS – an interactive building guide with zoom and rotate viewing tools that really do turn LEGO building into child’s play.\n\nCool toys that energize kids' creativity\nLEGO City is proud to support the work of National Geographic Explorers. Our Ocean playsets introduce kids to the exciting world of undersea exploration, where they get to enjoy lifelike role-play scenarios with realistic ocean vehicles, authentic settings and fun characters.\n\nThis LEGO® City Ocean Mini-Submarine (60263) playset makes an ideal gift for children aged 4 and up and is designed to encourage creative, independent role play.\nWhat’s in the box? A cool toy exploration submarine, a seabed setting with pirate treasure chest and gem elements, a pilot minifigure and a hammerhead shark figure. All kids need for imaginary play beneath the waves.\nKids will love this toy submarine with opening bubble cockpit, spinning propeller and posable inspection arms. The treasure chest comes with gem elements and the hammerhead shark has opening jaws.\nLEGO® 4+ sets are a fun way for youngsters to learn the art of LEGO building. With special starter bricks and simple printed building guides they help kids grow their confidence and abilities step by step.\nWhen built, the submarine toy (with inspection arms extended) measures over 2\" (6cm) high, 7\" (20cm) long and 2\" and (6cm) wide. And there's plenty of room in the bubble cockpit for the pilot minifigure!\nNo batteries required – this Ocean Mini-Submarine building toy is powered by kids’ imaginations, so the exploration fun can begin right away!\nThis 4+ toy playset comes with a printed building guide and Instructions PLUS – an interactive building guide for kids. Available as part of the free LEGO® Building Instructions app for smart devices.\nLEGO® City is proud to support the groundbreaking work of National Geographic Explorers, who help build a better world for us all. LEGO City Ocean playsets introduce kids to the exciting world of underwater exploration.\nLEGO® City Ocean playsets are designed to the highest industry standards and criteria. This ensures that the LEGO bricks and pieces are consistent, compatible and connect and pull apart easily every time.\nAll LEGO® City bricks and pieces are thoroughly tested to make sure every building set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/police-dog-unit-60241","description":"Youngsters love to role-play everyday heroes, and with this LEGO® City Police Dog Unit (60241) set they can do just that! There’s a cool toy police car with room for the police officer and his faithful police dog, a jewelry shop with gems, plus a crowbar-wielding crook. The perfect scenario for small crimefighters with big imaginations. Fun police playset for kids This 4+ toy playset includes a simple printed building guide and a special Starter Brick element so youngsters can take pride inconstructing LEGO toys. And with the free LEGO Life app for smartphones and tablets, kids get Instructions PLUS – an interactive building guide with zoom and rotate viewing tools that really do turn LEGO building into child’s play. LEGO City – Cool toys for kids With LEGO City police sets, kids get to immerse themselves in open-ended adventures and action-packed scenarios that reflect real-life situations. And, with a wide range of feature-rich buildings and vehicles, kids' imaginations arefree to soar!\nThis Police Dog Unit toy is an ideal introduction to the exciting world of LEGO® City. Perfect for kids aged 4+, it is designed to inspire open-ended, imaginative role-play based on real-life scenarios.\nWhat’s in the box? A cool toy police car with room for the police officer and his faithful police dog, a jewelry shop setting with 2 gems, and a crowbar-wielding crook with a sack for stashing his haul.\nKids can combine the characters and models in this LEGO® City Police Dog Unit (60267)building set with other LEGO toy playsets to form their own unique creations for play or display.\nLEGO® 4+ sets are a fun way for youngsters to learn the art of LEGO building. With special starter bricks and simple printed building guides they help kids grow their confidence and abilities step by step.\nMeasuring over 1\" (5cm) high, 3\" (9cm) long and 1\" (5cm) wide the police car toy has room for the police officer and his dog, while the jewelry shop measures in at over 2” (6cm) high, 1” (4cm) wide and 1” (3cm) deep.\nThe Police Dog Unit building set for kids doesn't require batteries, so the play can start right away!\nThis toy police set has a printed building guide and Instructions PLUS – an interactive construction guide to help budding builders become master builders! Available in the free LEGO® Life app for smart devices.\nLEGO® City police sets come with feature-rich buildings, cool vehicles and fun characters that stimulate imaginative role play as kids create open-ended adventures in lifelike settings.\nLEGO® City toy construction sets meet the highest industry standards, which ensures these fun toys continue to connect and pull apart easily time after time.\nAt The LEGO Group, we drop, squash, twist, heat, scratch and stretch LEGO® City bricks and pieces to make sure every set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/police-patrol-car-60239","description":"Help keep the streets of LEGO® City flowing with this cool LEGO City 60239 Police Patrol Car with removable roof, minifigure cab and iconic decorations, plus 2 traffic cones and a minifigure.\n\nIncludes a LEGO® police officer minifigure.\nFeatures a LEGO® police car with removable roof, space inside for a minifigure and iconic decorations.\nAlso includes 2 police traffic cone accessory elements.\nPatrol car measures over 1” (4cm) high, 4” (12cm) long and 1” (5cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/street-sweeper-60249","description":"Youngsters will love to role-play everyday heroes with the LEGO® City Street Sweeper (60249). This awesome toy truck features realistic brushes that spin when it’s pushed along, plus a garbage can, shovel and minifigure driver. Just add a budding builder with a big imagination and let the play begin. Great building set for kids This cool construction toy comes with Instructions PLUS – part of the free LEGO Life app for smartphones and tablets. This interactive building guide, with amazing zoom and rotate viewing tools, quickly helps younger LEGO builders become master builders. LEGO City Great Vehicles – Cool toys for kids Kids grow up surrounded by amazing vehicles and machines on land, air or water – and with LEGO City Great Vehicles sets, they get to explore them up close! These fun building sets inspire open-ended, imaginative play, where children can recreate scenarios that reflect real life in a fun and exciting way.\nThis street sweeper toy is an ideal introduction to the exciting world of LEGO® City. Perfect for kids aged 5 and up, it is designed to inspire open-ended, imaginative role-play based on real-life scenarios.\nWhat’s in the box? A cool LEGO® City Street Sweeper toy with room for the minifigure driver, plus a garbage can, shovel and banana. Everything a kid needs for fun, independent play.\nThis street sweeper toy has realistic brushes that spin when it's pushed along. Kids can also combinethis set with other original LEGO® toy playsets for fun play and cool displays.\nThis LEGO® City (60249) playset makes a great Christmas, birthday or any-other-day gift for kids aged 5 and up and for boys and girls who love toy vehicles. Requires only very basic building skills.\nMeasuring over 2\" (6cm) high, 3\" (10cm) long and 2\" (7cm) wide, the Street Sweeper toy has room in the cab for the driver and room in the back for the slippery banana!\nThe street sweeper building set for kids doesn't require batteries – so the play can start right away!\nThis street sweeper truck comes with Instructions PLUS – an interactive building guide that helps budding builders become master builders! Available in the free LEGO® Life app for smart devices.\nLEGO® City Great Vehicles sets come with feature-rich vehicles and fun characters that stimulate imaginative role-play as kids create open-ended adventures in lifelike settings.\nLEGO® City toy construction sets meet the highest industrystandards, which ensures these fun toys continue to connect and pull apart easily time after time.\nAt The LEGO Group, we drop, squash, twist, heat, scratch and stretch LEGO® City building toys to make sure every set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/cargo-train-60198","description":"Load up the powerful LEGO® City 60198 Cargo Train and deliver the goods on time! This cool LEGO City set features a motorized engine with 10-speed Bluetooth remote control, accessible driver’s cabin, a crane wagon with rotating and extendable boom arm, container wagon with 2 containers, and a log wagon, plus an armored truck with opening doors, and a forklift with opening roll cage and lifting forks. This cool LEGO train set also includes a full circular track with 16 curved rails, 16 straight rails and a railroad switch with lever, plus a control center with ladder and 2 buildable pallets with money bills, gold bar elements, a snow scooter and 6 LEGO minifigures.\n\nIncludes 6 LEGO® minifigures: 4 train workers, a security officer and a crook.\nFeatures a motorized engine with 10-speed Bluetooth remote control, pantograph on the opening roof, and driver’s cabin with control panel.\nAlso features a log wagon, crane wagon with rotating and extendable boom arm, and a container wagon with 2 containers with hooks on the roof for loading and space for pallets.\nIncludes a control center with ladder and signal lights, a full circular toy train track with 16 curved rails, 16 straight rails and a railroad switch with lever, a money transport truck with opening doors, and a working forklift with opening roll cage.\nAccessory elements include a wrench, 12 gold bar elements and 4 money bills, plus 2 buildable pallets, 3 logs and snow scooter.\nOpen the roof to access the engine car filled with cool details.\nOperate the cargo train with the 10-speed Bluetooth remote control.\nLift and load logs onto the log wagon with the crane's rotating arm and hook.\nPush the lever on the railroad switch to drive the train to a different track for loading or unloading.\nLoad pallets into the containers with the forklift before lifting them onto the container wagon with the crane.\nSet up the tracks in different configurations to load or offload cargo around your city.\nThis product requires batteries (not included). Please refer to the product packaging for type and quantities.\nThe included Bluetooth remote is not compatible with older infrared remote-controlled LEGO® train sets.\nCargo Train in total measures over 4” (11cm) high, 32” (82cm) long and 2” (6cm) wide.\nEngine measures over 4” (11cm) high, 10” (27cm) long and 2” (6cm) wide.\nLog wagon measures over 1” (5cm) high, 5” (15cm) long and 2” (6cm) wide.\nCrane wagon measures over 4” (10cm) high, 8” (22cm) long and 1” (5cm) wide.\nContainer wagon measures over 3” (9cm) high, 7” (18cm) long and 1” (5cm) wide.\nArmored truck measure over 2” (6cm) high, 6” (15cm) long and 2” (6cm) wide.\nControl center measures over 8” (21cm) high, 3” (8cm) wide and 4” (12cm) deep.\nForklift measures over 2” (7cm) high, 2” (5cm) wide and 4” (12cm) deep."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/police-brick-box-60270","description":"Kids will love this LEGO® City Brick Box (60270). Not only does it look cool, but inside there’s everything a child needs for hours of action-packed play. And, because this set offers 2 alternative builds with easy-to-follow building instructions, kids get double the creative fun. Young imaginations can run free as they help LEGO City TV series hero Duke DeTain in his bid to rid the streets of those pesky crooks! A playset packed with lots of cool features If you're looking for an action toy that kids will love, this set has it all. With 4 minifigures, a police station with jail, a toy ATM, crooks’ getaway truck and a cool police vehicle, the scene is set for action and adventure. Fun building sets for kids LEGO City police sets deliver an enjoyable build-and-play experience. The realistic vehicles, detailed buildings and fun characters stimulate imaginative, open-ended role-play and creativity for children aged 5 and up.\nUnleash the fun of LEGO® City with this police playset. Delivered in a smart, brick-styled box, this set offers 2 alternative builds, both with structures, vehicles and characters that set the scene for creative play.\nWhat’s inside the LEGO® Brick Box? Everything kids need to get started. A toy police station with jail, a police vehicle, crooks' truck and an ATM setting, plus 4 minifigures including LEGO City TV hero Duke DeTain.\nThis police toy offers 2 alternative builds, so kids can rebuild it to change the scenario for more creative crook-catching fun. It can also be combined with other original LEGO® toy playsets for extended play.\nThis LEGO® City Brick Box (60270) building set makes an ideal Christmas, birthday or any-other-day gift for kids aged 5 and up who love toy trucks, motorcycles and action toys. Requires only very basic building skills.\nWhen built, the toy police station measures over 7” (18cm) high, 5” (14cm) wide and 1” (5cm) deep, while the police truckmeasures over 1\" (4cm) high, 4\" (11cm) long and 1\" (5cm) wide.\nDoes this playset require batteries? No – it’s powered by small kids with big imaginations, so play can start right away!\nIt’s easy for kids to get started with this LEGO® toy. Inside the smart, brick-styled box you'll find easy-to-follow instructions for 2 different builds. Simply tear open the brick bags and let the fun begin.\nLEGO® City police sets feature realistic buildings, cool vehicles and fun characters that inspire open-ended creative play, while helping youngsters improve physical skills and grow confidence.\nLEGO® bricks are designed to the highest industry standards to ensure that LEGO City building toys are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are put through rigorous tests to ensure every LEGO toy playset meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/switch-tracks-60238","description":"Build up your cargo train tracks with the LEGO® City 60238 Switch Tracks set, to help make hauling or carrying passengers even more exciting. This set, comprised of 4 curved tracks, a right-facing switch track and a left-facing switch track, is compatible with your existing train sets.\n\nFeatures 4 curved tracks, 1 right switch track and 1 left switch track.\nConnect the tracks to your existing sets, including the 60198 LEGO® Cargo Train toy set, to extend your play and fun."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/forest-fire-60247","description":"Youngsters can become firefighting heroes with this awesome LEGO® City Forest Fire (60247) playset. There’s a cool firefighter buggy with a minifigure cockpit and toy water cannon fire extinguisher, plus a tree with flames and a sleepy owl on its branches. And, with LEGO City TV hero Clemmons on the scene, this set can really fire kids' imaginations! Fun firefighting playset for kids This playset makes a great Christmas, birthday or any-other-day gift for kids who love action toys. The easy-to-follow building guide ensures that even budding LEGO builders can enjoy an immersive and independent build-and-play experience. Cool firefighter toys for kids With LEGO City fire sets, kids get to enjoy open-ended adventures and action-packed scenarios that reflect real-life situations. The wide range of feature-rich buildings, realistic vehicles and fun characters put kids into a world where creativity and imagination will thrive.\nThis forest fire toy is a great introduction to the exciting world of LEGO® City. Perfect for kids aged 5 to 8 years, it is designed to inspire open-ended, imaginative role play based on real-life scenarios.\nWhat’s in the box? This (60247) playset includes a cool buggy with a water cannon and room for the firefighter driver, a toy tree with flames and a sleepy owl figure. Provides plenty of opportunity for imaginative play.\nKids can become everyday heroes with this smart little buildingtoy, featuring a cool firefighter buggy with water cannon, a tree with flames and a cute owl figure. This set is compatible with other LEGO® toy playsets.\nLooking for cool toys for kids aged 5 to 8 years? This firefighter playset makes a great little gift for LEGO® City fans and kids who love action-packed role play. Requires only very basic building skills.\nWhen built, the firefighter buggy measures over 1\" (4cm) high, 4\" (12cm) long and 1\" (5cm) wide, while the tree measures over 1” (3cm) high, 2” (6cm) wide and 1” (5cm) deep.\nNo need for batteries! This LEGO® toy is powered by kids’ imaginations – so the firefighter play can start right away.\nIt's easy to get started with this LEGO® City construction toy. Inside the box you'll find easy-to-follow building instructions – so simply tear open the brick bags and let the fun begin!\nLEGO® City fire sets come with colorful buildings, cool vehicles and fun characters that stimulate imaginative role play as kids create open-ended adventures in settings that resemble real life.\nLEGO® City toy construction sets meet the highest industry standards, which ensures these fun toys continue to connect and pull apart easily time after time.\nAt The LEGO Group, we drop, squash, twist, heat, scratch and stretch LEGO® City building bricks to make sure every playset meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/mail-plane-60250","description":"Kids’ imaginations are free to soar with this LEGO® City Mail Plane (60250) building toy. Youngsters can become everyday heroes, delivering mail to snow-covered landscapes where perfect piloting skills are a must. This cool little airplane comes with a spinning propeller, snow skis and a postal pilot minifigure. Fun airplane building set for kids This airmail playset toy comes with easy-to-follow building instructions that provide budding LEGO builders with a satisfying, independent build and play experience – so your little postal pilot will be up and flying in no time! LEGO City Great Vehicles – Cool toys for kids Kids grow up surrounded by amazing vehicles and machines on land, air and water. That’s why LEGO City Great Vehicles sets make great gifts for kids. With these fun building sets, kids get to explore their favorite vehicles up close. The feature-rich models inspire open-ended, imaginative play that reflects real life in a fun and exciting manner.\nTreat youngsters to the excitement of LEGO® City with this cool Great Vehicles mail plane building set – designed to inspire open-ended, imaginative role-play based on real-life scenarios.\nWhat's in the box? A cool LEGO® City Mail Plane toy with room in the cockpit for the postal pilot minifigure, plus a mailbox and letter and a toy bird figure. Everything a child needs for fun, independent play.\nThis mail plane toy has a spinning propeller, open minifigure-cockpit, snow skis and cool decoration on the tail. Kids can also combine this set with other original LEGO® playsets for fun play and cool displays.\nThis LEGO® City (60250) playset makes a great Christmas, birthday or any-other-day gift for kids aged 5 and up and for boys and girls who love model airplane kits. Requires only very basic building skills.\nThis action-packed construction toy makes a great any-day or birthday gift for boys and girls aged 5 and up who love imaginative play. Requires only very basic building skills.\nWhen built, the LEGO® City Mail Plane measures over 1\" (5cm) high, 6\" (16cm) long and 6\" (17cm) wide.\nNo need for batteries! This cool airplane toy is powered by kids’ imaginations – so play can start right away!\nThis toy airplane set comes with a printed building guide that will have your little postal pilot up and flying in no time!\nLEGO® City Great Vehicles sets inspire open-ended, imaginative play, where children can explore all kinds of vehicles and create play scenarios that reflect real-life in a fun and exciting way.\nAll LEGO® City Great Vehicles playsets meet the highest industry standards, ensuring these fun kids’ toys continue to connect and pull apart easily.\nAt The LEGO Group, we drop, squash, twist, heat, scratch and stretch LEGO® City building toys to make sure every playset meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/space-satellite-30365","description":"Head into LEGO® City space to repair the damaged Space Satellite! This cool toy features a satellite with movable solar panels and a minifigure with EVA space suit with light and helmet with golden visor."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/duke-detain-key-chain-854005","description":"Kids and fans of the LEGO® City Adventures TV series will love this LEGO City Duke DeTain Key Chain (854005), featuring a Duke DeTain minifigure attached to a durable metal ring and chain. A fun way to keep keys safe and handy, or to add some LEGO City Adventures style to bags, lunchboxes and more.\nFeatures a Duke DeTain minifigure, permanently attached to a durable metal ring and chain.\nA great Christmas, birthday or surprise gift for kids ages 6+ and for fans of the LEGO® City Adventures TV series. This LEGO City Duke DeTain Key Chain can be securely fastened to keys, backpacks, lunchboxes and more.\nKeep your belongings under a watchful eye with this LEGO® City Duke DeTain Key Chain. Measures over 5” (15cm) long."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/city-police-vest-853919","description":"Youngsters can gear up for crime-fighting, role-play fun in the LEGO® City 853919 Police Vest. This highly detailed garment features printed graphics, a sewn-in police badge, hook-and-loop closure and a foam belt buckle.\n\nFeatures a one size, white poly twill and gray felt police vest, decorated with printed graphics and a heat-compressed, PVC-free vinyl and EVA police badge that is sewn onto the vest, with a hook-and-loop closure down the front and a foam belt buckle.\nVest measures over 18” (46cm) long and 15” (40cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/rocket-assembly-transport-60229","description":"You were born to explore the universe! Build and inspire the next generation of astronauts with LEGO® Space rockets and vehicles – Let’s Go!\n\nGive young space adventurers a treat with a NASA-inspired rocket launch set, which is great for independent play. This incredible LEGO® City 60229 Rocket Assembly & Transport kids’ toy features a large multi-stage rocket with opening 2-minifigure cockpit and rover payload module, launch control room with rotating satellite dish and a rocket assembly crane with winch. There's a rover lab with rotating arm tool, opening doors and raising platform, plus a large crawler with track wheels and a tilting launch pad, truck with articulated, new-for-June-2019 grappling arm and flatbed, and a rover with extending arm and drill. This cool construction toy also includes a ground build with 2 new-for-June-2019 geodes and a light pole, 7 minifigures and a robot figure.\n\nIncludes 7 LEGO® City minifigures: 2 astronauts, 2 ground crew technicians, a Launch Director, scientist and a lab mechanic, plus a robot figure.\nThis building set for kids features a large multi-stage rocket with opening 2-minifigure cockpit module and rover payload module, large rocket transport crawler with opening cab, tracks, tilting rocket cradle support and launchpad, rover transport truck with new-for-June-2019 articulated grappling arm and flatbed, and a rover with extending arm and drill bit.\nThis independent play space set also includes a rocket assembly frame building with crane, rover lab with opening door, raising platform and rotating arm tool, toy launch control room with rotating satellite dish, computer and rotating screen, plus a ground build with geodes, rock and a light pole.\nAccessory elements include 2 new-for-June-2019 geodes, a shovel, lab tools, laptop, walkie-talkie and a mug.\nThe mobile launchpad and rocket cradle on the crawler can be tilted into position to launch the rocket.\nThis cool construction toy makes a great gift for kids.\nRocket laying down measures over 3” (8cm) high, 16” (43cm) long and 5” (13cm) wide.\nTransport crawler measures over 4” (12cm) high, 11” (29cm) long and 5” (15cm) wide.\nTruck measures over 3” (8cm) high, 6” (17cm) long and 2” (6cm) wide.\nRover measures over 1” (3cm) high, 1” (5cm) long and 1” (3cm) wide.\nAssembly frame building measures over 8” (21cm) high, 11” (28cm) wide and 4” (12cm) deep.\nRover lab measures over 4” (12cm) high, 7” (18cm) wide and 7” (19cm) deep.\nLaunch control tower room measures over 4” (12cm) high, 5” (15cm) wide and 2” (6cm) deep."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/deep-space-rocket-and-launch-control-60228","description":"You were born to explore the universe! Build and inspire the next generation of astronauts with LEGO® Space rockets and vehicles – Let’s Go!\n\nGive young space adventurers a treat with a NASA-inspired toy rocket launch set. This awesome LEGO® City 60228 Deep Space Rocket and Launch Control kids’ toy features a modular, multi-stage rocket with cockpit, booster and payload storage modules, and a monorail system with stops at the rocket, research area with geode retrieval training and launch control tower. There’s also a launchpad with opening tower arms, rover with articulated, new-for-June-2019 grappling arm and launch control tower with detachable window section, fold-out function and a countdown function. Kids can use a mobile device as a screen for interactive play opportunities with the City Explorers app. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets.\n\nIncludes 6 LEGO® City minifigures: 2 astronauts, 2 scientists, Launch Director and a ground crew technician, plus a robot figure.\nFeatures a modular, multi-stage NASA-inspired rocket that can be customized in different ways with the booster, payload storage and 2-minifigure cockpit modules, rover with articulated, new-for-June-2019 grappling arm, space telescope with folding solar panels and magnifying glass, plus a monorail system with multi-stop track and 2 cars.\nThe detailed toy playset includes an opening launch control tower with removable window, 2 desks with small screens, large screens for countdown and monitoring of the telescope and space to insert a mobile device, as well as a launchpad with opening tower arms to launch the rocket, plus a ground research area with a tile with secret symbol\nAccessory elements include 2 new-for-June-2019 geodes, 2 helmets with blue visors, a magnifying glass, scanner element, tile with secret symbol, circular saw, wrench, cell phone, 4 water elements and a camera, plus a brick separator.\nLower the gates to stop the monorail cars along the route and help climb aboard or exit a car.\nAim the robot’s scanner over the tile in the research area to see the secret symbol.\nSet a mobile device into the launch control tower to experience the interactive play options available when connected to the LEGO® City Explorers app.\nDrop the tower arms on the launchpad to launch the rocket and head to space.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nDownload the LEGO® Life app at the iOS or Android app store. Ask your parents’ permission before going online.\nRocket standing measures over 16” (42cm) high, 4” (11cm) wide and 2” (6cm) deep.\nSpace telescope with wings closed measures over 3” (9cm) long and 1 (3cm) wide.\nRover with arm retracted measures over 1” (5cm) high, 3” (9cm) long and 2” (7cm) wide.\nLaunch Control closed measures over 7” (18cm) high, 5” (13cm) wide and 5” (13cm) deep.\nLaunchpad with closed tower arms measures over 9” (24cm) high, 4” (12cm) wide and 4” (12cm) deep.\nMonorail measures over 1” (3cm) high, 3” (10cm) long and 1” (3cm) wide.\nMonorail track measures over 3” (8cm) high,14” (36 cm) deep and 18” (47cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/donut-shop-opening-60233","description":"Give young urban explorers a treat with an action-filled set inspired by the LEGO® City animated TV series. This cool 60233 Donut Shop Opening toy town playset features a truck and crane trailer with an extending boom arm, platform and extendable stabilizing legs, news van with opening roof and satellite dish, taxi, police motorbike and a new-for-June-2019 coffee cargo bike. This fun set also includes a toy shop and a donut shop with ATM and release trigger to launch the giant donut from the top of the building. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This cool construction playset toy includes 10 minifigures.\n\nIncludes 10 LEGO® City minifigures: police officer Duke DeTain, a crook, toy store owner, 2 baristas, truck driver, reporter, cameraman, taxi driver and a child.\nThis construction toy features a donut shop with coffee machine, opening door, trigger function to release the giant donut on top of the building and an ATM on the side, plus a toy shop with balloons and shelves for toys.\nThis detailed toy playset also includes a truck and crane trailer with knob to lift the crane and an extending boom arm with chain, a platform to hold the giant donut and extendable stabilizing legs, a police motorbike, taxi with removable roof, news van with opening roof, satellite dish, TV screens and production equipment inside, plus a new-for-June-2019 cargo bike with umbrella.\nAccessory elements include a new-for-June-2019 whirly hat, teddy bear, toy guitar, skateboard, toy train, fishing net, camera, microphone, crowbar, 5 donuts, 5 muffins, 4 cookies, 1 money bill, and 5 coffee cups.\nMove the crane to lift the giant donut by turning the knob, then extend the boom arm by pulling it out to move the donut into place.\nSend the giant donut rolling away by pressing the trigger on the shop roof.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nDownload the LEGO® Life app at the iOS or Android app store. Ask your parents’ permission before going online.\nKids can reimagine exciting scenes from the LEGO® City animated TV series with this toy playset.\nTruck with crane trailer measures over 3” (9cm) high, 11” (28cm) long and 2” (7cm) wide.\nNews van measures over 3” (8cm) high, 4” (11cm) long and 2” (6cm) wide.\nCoffee cargo bike measures over 2” (6cm) high, 3” (8cm) long and 1” (4cm) wide.\nTaxi measures over 1” (5cm) high, 4” (11cm) long and 1” (5cm) wide.\nPolice motorbike measures over 1” (3cm) high and 2” (7cm) long.\nDonut shop with donut on top measures over 6” (17cm) high, 5” (14cm) wide and 2” (6cm) deep.\nToy shop measures over 5” (13cm) high, 4” (12cm) wide and 2” (6cm) deep."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/service-station-60257","description":"Kids with a passion for toy cars will love this LEGO® City Service Station (60257) playset, featuring a service station for electric and gasoline-powered vehicles. You can plug in the SUV to recharge with Octan E, fill up the camper van at the pump and visit the shop. And with station clerk, driver and 2 surfer minifigures, plus a chihuahua dog figure, kids can enjoy endless independent play. An enjoyable building experience Find building instructions for this LEGO City toy in the box. Or hop online and download Instructions PLUS, part of the LEGO Life app for smartphones and tablets. This interactive building guide, with amazing zoom and rotate viewing tools, quickly turns budding LEGO builders into master builders! Cool toys for kids LEGO City vehicle playsets offer a range of supercool buildable toys on wheels! These feature-rich building sets, with fun characters, inspire open-ended, independent play where children can recreate scenarios that reflect real life in a fun andexciting way.\nHere’s a great building set for kids who love pretend play. This multi-model LEGO® City (60257) playset features a toy service station for electric and gasoline-powered vehicles, plus fun characters and a pet chihuahua.\nWhat’s in the box? A toy service station with shop, Octan E charging point and gas pump, plus an SUV, a camper van with surfboards, 4 minifigures and a chihuahua dog figure. All a kid needs for fun, independent play.\nThis building set has lots of cool features. The toy charging point and gas pump have flexible hoses for connecting to the vehicles and kids can remove the roof from the SUV and camper to put the minifigures inside.\nLooking for cool toys for kids aged 5+? This service station set makes a great Christmas, birthday or any-other-day gift for LEGO® City fans and kids who love to role-play. Requires only very basic building skills.\nWhen built, the camper van measures over 2\" (7cm) high, 4\" (12cm) long and 2\" (6cm) wide, while the store measures over 3” (8cm) high, 4” (12cm) wide and 2” (7cm) deep.\nDoes it need batteries? No, this construction toy is powered by small kids with big imaginations – simply open the bags of LEGO® bricks and the play can start right away!\nThis building toy comes with an easy-to-follow printed building guide and Instructions PLUS – an interactive building guide for budding builders. Available in the free LEGO® Life app for smart devices.\nUnleash the fun and excitement of LEGO® City playsets featuring buildings, vehicles and characters that inspire open-ended creative play while helping youngsters develop physical skills and confidence.\nLEGO® building bricks are designed to the highest industry standards to ensure that LEGO City playsets are consistent, compatible and connect and pull apart easily every time.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® City pieces to make sure every building set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/ski-resort-60203","description":"Adventure awaits your young sports lover with this winter-themed set full of possibilities. This cool LEGO® City 60203 Ski Resort toy set features a 2-level rescue base, ski shop with big screen TV and snowboard and ski rack, hot drinks and cupcake stand and an awesome snow park with light pole, half-pipe and separate grind rail. This great construction toy set for kids also includes a rescue 4x4 truck with movable snowplow, snowmobile with attached trailer, plus a helicopter with opening cockpit, spinning rotors and a camera, 11 minifigures, a dog figure and buildable snowman figure.\n\nIncludes 11 LEGO® City minifigures: 3 ski patrol members, a ski shop clerk, helicopter pilot, skier, snowboarder, 2 kids, hot drinks stand clerk and a customer, plus dog and buildable snowman figures.\nThis fun-filled construction toy set features a 2-level rescue base with communication antennas on the roof, ski shop with big screen TV and snowboard and ski rack, hot drink and cupcake stand and an awesome snow park with a light pole, half-pipe with stair access and a separate grind rail.\nIn addition, this building set for kids includes a rescue 4x4 toy truck with movable snowplow and roof rack, snowmobile with attached trailer, plus a helicopter with opening cockpit, spinning rotors and a camera.\nAccessory elements include 4 pairs of skis, 3 pairs of ski poles, 4 snowboards, 4 mugs, 2 cupcakes, a syringe element, hand cast, 2 ice picks, pair of binoculars, 2 walkie-talkies, 2 shovels, toolbox/first aid box, wrench, axe, circular saw, broom, snow shoes, helmet with ski goggles, warm hat and a stretcher, plus a brick separator and a buildable sign.\nSpin the rotors on the helicopter to hover over the snow park and pretend to film the snowboarders.\nLoad up an injured skier on the snowmobile’s stretcher and bring them back to the rescue base for help.\nUse the 4x4 truck's snowplow to clear the way so the snowmobile can make it back to base!\nThis cool toy for kids makes a great independent play gift!\nHelicopter with camera measures over 2” (7cm) high, 7” (20cm) long and 2” (7cm) wide.\nSnowmobile with trailer measures over 1” (5cm) high, 7” (18cm) long and 1” (3cm) wide.\n4x4 truck with snowplow measures over 3” (9cm) high, 5” (14cm) long and 2” (7cm) wide.\nHot drinks and cupcake stand measures over 3” (10cm) high, 2” (6cm) wide and 1” (3cm) deep.\nSnow park with half-pipe measures over 4” (12cm) high, 6” (16cm) wide and 4” (12cm) deep.\nRescue base measures over 7” (20cm) high, 7” (19cm) wide and 2” (7cm) deep.\nSki shop with big screen measures over 5” (15cm) high, 4” (12cm) wide and 2” (7cm) deep.\nGrind rail measures over 4” (11cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/sky-police-air-base-60210","description":"Patrol the LEGO® City streets from above with the highly detailed 60210 Sky Police Air Base toy set, featuring a 3-level police station control tower with jetpack storage, office on the ground floor, attached tool storage area and a jail cell with bed and breakaway wall. This fantastic set also includes a police plane with removable nose cone and hatch underneath to drop the parachute toy, a jetpack with foldable wings, a police motorbike, a getaway car with chain and hook, and 6 minifigures.\n\nIncludes 6 LEGO® City minifigures: 2 Sky Police officers, 2 police officers and 2 crooks.\nFeatures a 3-level police station control tower with jetpack storage, office, rotating satellite dish on the roof, attached tool storage and a jail cell with bed and breakaway wall.\nAlso includes a Sky Police airplane toy with removable nose cone and a hatch underneath to launch the included thin, coated cloth parachute, Sky Police toy jetpack with foldable wings, police motorbike toy and a toy getaway car with chain and hook for the crooks.\nAccessory elements include a coffee machine and mug, PC screen, 2 control tower screens, 3 pairs of handcuffs, 2 walkie-talkies, 3 helmets with opening visors, a police hat and a security camera.\nSpin the radar dish on top of the station to monitor air traffic for the Sky Police force.\nAttach the hook from the crook's toy getaway car to the jail cell wall and pull it away from the building to help the crook escape.\nLoad the parachute with attached Sky Police officer minifigure into the bottom of the toy airplane and push the lever to launch him at the escaping crooks.\nGrab the toy jetpack, open the wings and chase down the crooks.\nThis cool toy for kids includes over 500 pieces.\nSky Police Air Base measures over 9” (25cm) high, 8” (22cm) wide and 1” (5cm) deep.\nSky Police airplane toy measures over 5” (13cm) high, 11” (30cm) long and 15” (39cm) wide.\nToy getaway car measures over 1” (4cm) high, 4” (12cm) long and 1” (4cm) wide.\nParachute measures over 11” (29cm) high and 7” (20cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/fire-plane-60217","description":"Help the firefighters protect the forest critters of LEGO® City with the exciting 60217 Fire Plane set, featuring a dual-propeller firefighting plane with pontoons, detachable minifigure cockpit, hatch on top to load the water elements and a lever to drop them. This rescue building toy set also includes a fire buggy with new-for-January-2019 3-shot stud shooter, plus 2 trees, 3 minifigures and a skunk figure.\n\nIncludes 3 LEGO® City minifigures: a pilot and 2 firefighter minifigures, plus a skunk figure.\nThis forest fire rescue set features a fire plane with opening and detachable minifigure cockpit, spinning propellers and opening top and bottom hatches, plus a fire buggy with new-for-January-2019 3-shot stud shooter and roll cage.\nAlso includes 2 buildable burning trees, one with a burrow at the base for the skunk to hide in.\nAccessory elements include 14 water elements (6 small studs and 8 larger elements), 6 buildable fire elements, and new-for-January-2019 smoke gear set and fire axe.\nOpen the top hatch and fill the plane with water elements.\nSpin the propellers to launch the plane and head to the fire.\nLoad 3 water elements into the stud shooter and push the plunger to shoot them at the fire and knock it out.\nPush the lever and release the hatch at the bottom of the plane to drop the water elements on the flames and knock them down.\nPut on your smoke gear and head into the forest fire to rescue the skunk.\nFire plane measures over 3” (10cm) high, 11” (28cm) long and 12” (33cm) wide.\nFire buggy measures over 2” (7cm) high, 4” (11cm) long and 1” (5cm) wide.\nTree with skunk burrow measures over 3” (10cm) high, 4” (12cm) wide and 3” (9cm) deep."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/lunar-space-station-60227","description":"You were born to explore the universe! Build and inspire the next generation of astronauts with LEGO® Space rockets and vehicles – Let’s Go!\n\nGive young space adventurers a treat with a NASA-inspired modular space station toy. This detailed LEGO® City 60227 Lunar Space Station toy set features 3 detachable, modular compartments that can be customized and rearranged however you like. There's a kitchen module, living module for sleeping and training and a lab module with light brick, central airlock compartment, detachable satellite and detachable shuttle with opening cockpit and storage space, plus 4 minifigures and a robot figure. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement.\n\nIncludes 4 LEGO® City minifigures: 2 astronauts and 2 crewmembers, plus a robot figure.\nThis space station toy set features 3 detachable modules with removable roofs: a living module with a treadmill, anti-gravity bed and TV screen, lab module with light brick and research tools, kitchen module with plants and a pizza oven, plus a central airlock compartment. The modules can be put together in different ways around and on the central airlock compartment.\nThis NASA-inspired astronaut toy set also includes a detachable satellite with folding solar panels and a detachable space shuttle with cargo space and an opening cockpit.\nAccessory elements include repair tools, pizza, 2 new-for-June-2019 geodes with blue crystals, helmet with blue visor and an Extra Vehicular Activity suit with golden visor, plus a brick separator.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nDownload the LEGO® Life app at the iOS or Android app store. Ask your parents’ permission before going online.\nThis awesome space station construction toy makes a great gift for kids.\nShuttle measures over 1” (4cm) high, 4” (12cm) long and 4” (12cm) wide.\nSatellite measures over 1” (3cm) high, 1” (5cm) long and 6” (17cm) wide.\nKitchen module measures over 2” (7cm) high, 5” (13cm) long and 3” (8cm) wide.\nLab module measures over 2” (7cm) high, over 2” (7cm) long and 2” (6cm) wide.\nLiving module measures over 2” (7cm) high, over 2” (7cm) long and 2” (6cm) wide.\nCentral airlock compartment measures over 2” (7cm) high, over 4” (11cm) long and 6” (17cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/garage-center-60232","description":"Give your young car mechanic a great start with this multi-vehicle set, inspired by the new-for-2019 LEGO® City TV series. This LEGO 4+ toy set is specially designed to be fun and easy for preschoolers and youngsters, featuring a car wash building, plus a sports car, tow truck and gas tanker, garage and gas station pump stand with special Starter Brick chassis and bases that let even first-time builders experience the pride of constructing buildings, vehicles and more, all on their own. The included simple guide to build and play will also help your young creator understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO brick building in a familiar LEGO City setting. Then give your young LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This cool toy playset includes 4 minifigures.\n\nLEGO® 4+ sets are specially designed to be fun and easy for youngsters and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nIncludes 4 LEGO® City minifigures: Harl Hubbs, a mechanic, a gas station worker and a sports car driver.\nThis building set for kids features 3 buildings: a drive-through car wash with hose and bucket, a toy garage with car lift and a gas station pump with flexible hose.\nThis great construction toy also includes 3 vehicles: a red sports car with red wheels, yellow and blue tow truck with raising crane arm and a gas tanker with flexible hose.\nAccessory elements include 2 traffic cones, a mug, oil dispenser, bucket, tools, exhaust pipes, oil barrel and an air intake.\nDrive the car onto the lift and give it a boost, run it through the car wash, then gas it up and go.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nDownload the LEGO® Life app at the iOS or Android app store. Ask your parents’ permission before going online.\nLEGO® 4+ introduces your child to a wide universe of their favorite TV characters and everyday heroes.\nLEGO® 4+ toys were previously branded as LEGO Juniors and are compatible with all LEGO construction toys for creative building.\nMakes an ideal birthday gift for preschoolers and kids.\nKids can reimagine fun scenes from the LEGO® City animated TV series with this building toy.\nSports car measures over 1” (4cm) high, 3” (9cm) long and 1” (4cm) wide.\nTow truck measures over 2” (6cm) high, 3” (9cm) long and 1” (4cm) wide.\nGas tanker measures over 1” (5cm) high, 3” (9cm) long and 1” (4cm) wide.\nCar wash measures over 3” (10cm) high, 3” (9cm) wide and 3” (9cm) deep.\nGarage measures over 4” (11cm) high, 4” (12cm) wide and 4” (11cm) deep.\nGas station pump measures over 3” (8cm) high, 4” (12cm) wide and 3” (8cm) deep."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/people-pack-fun-fair-60234","description":"Add even more fun to your youngster’s LEGO® City role-play adventures with this cool toy fun-fair-related set. The activity-packed 60234 People Pack – Fun Fair playset features 14 new minifigures to add to your city, plus a duck pool ring toss game with 3 new-for-June-2019 duck elements, shooting gallery game with stud shooter, face painting table, strength test and an ice cream cargo bike with an umbrella and room for an ice cream cone.\n\nIncludes 14 LEGO® City minifigures: a stilt walker, 2 boys, 2 girls, 2 teenagers, grandpa, grandma, mom, dad, face painter, ice cream vendor and a fun fair stand worker.\nThis kids’ toy features a new-for-June-2019 ice cream cargo bike with an umbrella and space for an ice cream cone, shooting gallery game with stud shooter, face painting table, duck pool ring toss game and a strength test.\nAccessory elements include 2 rings, 3 new-for-June-2019 rubber ducks, a new-for-June-2019 whirly hat, ice cream cone, popsicle, paintbrush, 6 paint pots, teddy bear prize, 3 studs, balloon animal, hot dog and a buildable mallet.\nIce cream cargo bike measures over 2” (6cm) high, 2” (7cm) long and 1” (4cm) wide.\nShooting gallery game measures over 1” (4cm) high, 1” (5cm) wide and 1” (4cm) deep.\nDuck pool ring toss game measures over 1” (3cm) wide and 1” (3cm) deep.\nStrength test measures over 3” (8cm) high, 1” (3cm) wide and 1” (3cm) deep."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/people-pack-space-research-and-development-60230","description":"You were born to explore the universe! Build and inspire the next generation of astronauts with LEGO® Space rockets and vehicles – Let’s Go! Give young space adventurers a treat with a NASA-inspired set full of minifigures and space-related kids’ toys. This cool LEGO City 60230 People Pack – Space Research & Development construction toy includes a bunch of new minifigures in different jobs relating to space travel and exploration. This set also features a spinning G-force astronaut training machine with two seats, treadmill, rocky ground scene, drone with spinning rotor, plant growing pod, robot stand, computer stand and a test rocket with stand, plus 14 minifigures and a robot figure.\n\nIncludes 14 LEGO® City minifigures: 7 astronauts, a reporter, camera operator, personal trainer, a drone engineer, rocket engineer, a mechanical engineer and a botanist plus a robot figure.\nFeatures a spinning G-force training machine, 2 beds, treadmill, drone with spinning rotor, growing pod with plant, robot stand, rocky ground scene, computer stand with screen and a test rocket with stand.\nAccessory elements include a magnifying glass, welder, white flag, megaphone, camera, microphone, alien head on a stick, 2 astronaut helmets with blue visor, astronaut helmet with golden visor, Extra Vehicular Activity suit with a golden visor and light, trashcan, mug, drone remote, pizza boxes, pizza, 2 new-for-June-2019 geodes and a toolbox.\nSpin the top of the G-force astronaut training machine to help the astronauts prepare for space travel.\nThis fun construction toy makes a great gift for kids.\nRocky ground scene measures over 1” (4cm) wide and 1” (3cm) deep.\nRobot stand measures over 1” (3cm) wide and 1” (3cm) deep.\nDrone measures over 1” (3cm) long and 1” (3cm) wide.\nComputer stand measures over 1” (3cm) high and 1” (4cm) wide.\nPlant pod measures over 1” (3cm) high, 1” (5cm) wide and 1” (3cm) deep.\nG-force training machine with beds measures over 1” (4cm) high, 1” (4cm) wide and 7” (18cm) deep.\nTreadmill measures over 1” (4cm) deep.\nRocket stand measures over 1” (4cm) high, 1” (3cm) wide and 2” (7cm) deep."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/sky-police-parachute-arrest-60208","description":"Patrol the LEGO® City streets from above with the awesome 60208 Sky Police Parachute Arrest set, featuring a high-speed toy police jet plane with opening minifigure cockpit and extending hook to capture the working parachute toy, plus a police motorbike and getaway buggy. This action-packed police play set also includes 2 backpacks with loot and 4 minifigures.\n\nIncludes 4 LEGO® City minifigures: 2 Sky Police officers and 2 crooks.\nFeatures a high-speed Sky Police jet with opening minifigure cockpit and extending hook to catch the thin, coated cloth parachute, police motorbike and the crooks’ getaway buggy toy car.\nAccessory elements include a pilot's helmet with opening visor and oxygen mask, handcuffs, 2 backpacks and 2 money bags.\nToss the parachute toy into the air and try to catch it with the jet's extending hook.\nSky Police Jet measures over 2” (7cm) high, 8” (22cm) long and 7” (20cm) wide.\nCrook’s parachute toy measures over 11” (29cm) high and 7” (20cm) wide.\nCrook’s getaway buggy measures over 1” (4cm) high, 3” (9cm) long and 1” (4cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/advent-calendar-60268","description":"Bursting with festive fun, this awesome LEGO® City Advent Calendar (60268) is guaranteed to bring Christmas joy to boys, girls and fans of the LEGO City Adventures TV series. As well as seasonal mini-builds and a snowy city play mat, where they can build their own Christmas scenes, kids also get 6 LEGO City TV character minifigures, including Duke DeTain, Harl Hubbs, Freya McCloud, Rooky Partnur, Daisy ‘Kaboom' and a Christmassy Chief Wheeler complete with Santa costume!\n\nFun and easy to build\nThis LEGO City Advent Calendar makes a great gift for children aged 5 and up. Each build comes with easy-to-follow building instructions ensuring that even budding LEGO builders can enjoy a fun and independent build and play experience.\n\nBest Christmas toys for kids\nLEGO City Advent Calendars are packed with inspiration, festive excitement and wonderful surprises for kids who love creative play. The models, minifigures and accessories included in the calendar can also be combined with existing LEGO toy playsets for even more fun.\n\nThe LEGO® City Advent Calendar (60268) is a great introduction to the exciting world of LEGO City and the LEGO City Adventures TV series. Kids aged 5 and up can enjoy fun, imaginative play throughout the holiday season.\nComes with 24 gifts, including Christmas tree and Santa's sleigh miniature builds, 6 LEGO® City Adventures TV series minifigures, including Chief Wheeler with Santa costume, plus a city play mat with snow-cleared roads.\nKids can count down to the big day with this LEGO® City Advent Calendar, containing festive builds, LEGO City TV series minifigure characters and a snowy city play mat where they build their own Christmassy adventures.\nLooking for a cool gift for kids aged 5 years and up? This Advent Calendar is ideal for fans of the LEGO® City Adventures TV series, and kids who love creative play. Requires only very basic building skills.\nThe LEGO® City Advent Calendar measures over 2\" (7cm) high, 14\" (38cm) long and 10\" (26cm) wide.\nNo need for batteries! The buildable LEGO® toys and characters contained in this advent calendar are powered by little kids with big imaginations – so the festive fun can start right away.\nThis LEGO® City Advent Calendar includes easy-to-follow building instructions to ensure that even budding LEGO builders can enjoy a fun and independent build and play experience.\nFestive LEGO® City Advent sets come with colorful miniature builds and fun characters that stimulate imaginative role play, helping kids developphysical and creative skills.\nLEGO® City toy sets meet the highest industry standards and quality criteria to ensure that all LEGO bricks and pieces are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure every kid's building set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/fire-chief-response-truck-60231","description":"Give young firefighters a treat with a detail-rich fire truck construction toy set, featured in the new-for-2019 TV series. This cool LEGO® City 60231 Fire Chief Response Truck toy features a brick-built fire truck with detachable ladder, opening roof and a screen in the cab, an electrical box with buildable flame element and opening doors, a water cannon with water tank, plus 2 minifigures. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement.\n\nIncludes 2 LEGO® City minifigures: Freya McCloud and a firefighter.\nThis building set for kids features a fire truck with detachable ladder, opening roof and a screen in the cab, plus a water tank with water cannon and shooting function.\nThis fun construction toy playset also includes an electrical box with opening doors.\nAccessory elements include a fire axe, walkie-talkie, megaphone, fire extinguisher, mug with marshmallow logo, 2 white and blue cones and 4 water elements, plus a buildable flame element.\nUse the trigger on the water cannon to fire brick water elements at the flames on the electrical box.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nDownload the LEGO® Life app at the iOS or Android app store. Ask your parents' permission before going online.\nKids can reimagine exciting scenes from the LEGO® City animated TV series with this fire truck toy.\nFire truck measures over 2” (6cm) high, 6” (16cm) long and 2” (7cm) wide.\nElectrical box including ground plate measures over 1” (3cm) square."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/rover-testing-drive-60225","description":"You were born to explore the universe! Build and inspire the next generation of astronauts with LEGO® Space rockets and vehicles – Let’s Go!\n\nGive young space adventurers a treat with a NASA-inspired rover set. This fun LEGO® City 60225 Rover Testing Drive kids’ toy features a rover with removable cockpit, new-for-June-2019 articulated grappling arm and removable solar panel generator. This space toy for kids also includes 2 new-for-June-2019 geodes, a laptop, video camera, remote control, rock drill and a helmet with visor. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This great space building set for kids also includes 2 minifigures.\n\nIncludes 2 LEGO® City minifigures: an astronaut and a ground crew technician.\nThis fun LEGO® building set for kids, inspired by NASA, features a rover with removable cockpit, new-for-June 2019 articulated grappling arm, tilting, removable solar panel generator and large all-terrain wheels.\nAccessory elements include 2 new-for-June-2019 geodes, a rover pilot helmet with blue visor, technician's hard hat, remote control, laptop, rock drill and a video camera with buildable stand.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nDownload the LEGO® Life app at the iOS or Android app store. Ask your parents' permission before going online.\nThis cool construction toy makes a great gift for kids.\nRover measures over 3” (9cm) high, 5” (14cm) long and 3” (9cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/sky-police-drone-chase-60207","description":"Patrol the LEGO® City streets from above with the exciting 60207 Sky Police Drone Chase set, featuring a police helicopter with opening minifigure cockpit, spinning rotor, searchlight and firing net shooter. This fun police play set also includes a buildable drone with spinning rotors and opening claws, a golden minifigure statue with pedestal, remote-control element, handcuffs and 2 minifigures.\n\nIncludes 3 LEGO® City minifigures: a Sky Police officer and a crook, plus a golden minifigure statue.\nFeatures a Sky Police helicopter with opening cockpit, spinning top rotor, searchlight and a firing net shooter, plus a buildable drone with spinning rotors and opening claws.\nAccessory elements include a set of handcuffs, net, remote control and a helmet with opening visor and oxygen mask.\nSpin the rotor on the Sky Police helicopter and take off.\nPush the plunger to fire the net from the net shooter and capture the drone before it escapes with the golden statue!\nSky Police helicopter measures over 3” (9cm) high, 8” (22cm) long and 4” (11cm) wide.\nCrook’s drone measures over 1” (3cm) high, 3” (9cm) long and 3” (9cm) wide.\nGolden minifigure statue and pedestal measures over 3” (9cm) high, 1” (3cm) wide and 1” (3cm) deep."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/dock-side-fire-60213","description":"Protect the LEGO® City waterfront with the cool 60213 Dock Side Fire set, featuring a fireboat firefighter toy with new-for-January-2019 water cannon with multi-shot function and a motor that can be raised, plus a dock scene with walkie-talkie, 2 oil barrels, dolly and 2 minifigures.\n\nIncludes 2 LEGO® City minifigures: a firefighter and a dockworker.\nFeatures a fireboat with new-for-January-2019 multi-shot water cannon and a raising motor.\nAlso includes a dock scene with ladder.\nThe boat really floats!\nAccessory elements include a walkie-talkie, dolly, 3 water elements, warning sign, buildable fire element and 2 buildable barrels.\nLower the motor on the fireboat and race toward the dock fire.\nLoad 3 water elements into the cannon and push the plunger to shoot them at the fire to pretend to put it out.\nFireboat measures over 1” (5cm) high, 5” (13cm) long and 2” (6cm) wide.\nDockside scene measures over 1” (3cm) high, 3” (9cm) wide and 1” (4cm) deep."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/snow-groomer-60222","description":"Keep the skiers of LEGO® City happy with the 60222 Snow Groomer! This hardworking snow groomer building toy features an opening minifigure cab, swiveling 6-stud rapid shooter snow cannon, sturdy tracks and a large plow blade in front to push snow into place. This cool set also includes a set of skis with poles and 2 LEGO minifigures.\n\nIncludes 2 LEGO® City minifigures: a skier and a driver.\nFeatures a detailed Snow Groomer with a minifigure cab, opening roof, sturdy segmented tracks and a large front plow blade, plus swiveling 6-stud rapid shooter snow cannon.\nAccessory elements include a pair of skis, 2 ski poles and 12 snow studs.\nClimb into the cab of the groomer and head out through the snow.\nSwivel the snow cannon into place and then turn the knob to fire the snow studs.\nPush the sides of the plow blade in to collect the snow as you plow.\nSnow Groomer measures over 3” (10cm) high, 7” (18cm) long and 4” (12cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/curve-and-crossroad-60237","description":"Build up your roads with LEGO® City 60237 Curve and Crossroad plates, to make hauling cargo or driving passengers around town even more entertaining. This construction toy set, including 1 curve road plate and 1 crossroad baseplate, is compatible with your existing LEGO City sets.\n\nFeatures 1 curve road plate and 1 crossroad plate.\nConnect the road plates to existing LEGO® City sets to extend your fun all around town.\nCurve and Crossroad road plates each measure 9” (25cm) square."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/straight-and-t-junction-60236","description":"Build up your roads with LEGO® City 60236 Straight and T-junction road plates, to make hauling cargo or driving passengers around even more entertaining. This creative play set, including 1 T-junction plate and 1 straight road plate, is compatible with your existing LEGO City sets.\n\nFeatures 1 T-junction road plate and 1 straight road plate.\nConnect the road base plates to your existing LEGO® City sets to extend your play.\nStraight and T-junction road base plates each measure 9” (25cm) square."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/barbecue-burn-out-60212","description":"Join in the fun with your child as they protect LEGO® City with the 60212 Barbecue Burn Out set. This action-packed LEGO 4+ set is made to be fun and easy for preschoolers and youngsters, featuring a fantastic fire truck toy with extending bucket and tool storage, plus a Starter Brick base that lets first-time builders experience the pride of construction, all on their own. The simple guide to building and creative play will help your young firefighter understand the purpose of the building steps, while growing their imagination and confidence, as the perfect start to LEGO brick building toys in a familiar LEGO City setting. This exciting LEGO City Fire set also includes a tree and barbecue, plus a new-for-January-2019 fire axe and 2 minifigures.\n\nLEGO® 4+ sets are specially made to be fun and easy for youngsters and help to grow their confidence with simple building steps for a great start to LEGO building.\nIncludes 2 LEGO® City minifigures: a firefighter and a park visitor.\nFeatures an easy-to-build fire truck with tool storage space, extending bucket and a Starter Brick base to get your child building and playing quickly in the exciting LEGO® City universe.\nAlso includes a tree and barbecue grill.\nAccessory elements include a hot dog, fire hose, water elements and a new for January 2019 fire axe, plus 2 buildable flames.\nExtend the fire truck bucket to help knock down the fire.\nClip the fire hose onto the fire truck to store it after you’re done.\nLEGO® 4+ introduces your child to an unlimited world of their everyday heroes.\nLEGO® 4+ play sets were previously known as LEGO Juniors and are compatible with all LEGO construction sets for creative building.\nMakes an ideal gift for preschoolers and youngsters.\nFire truck measures over 3” (9cm) high, 3” (8cm) long and 1” (5cm) wide.\nTree and barbecue measures over 2” (6cm) high, 1” (4cm) wide and 1” (4cm) deep."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/construction-loader-60219","description":"Help maintain the LEGO® City streets with the sturdy 60219 Construction Loader! This iconic construction toy set features a loader with raising front arm, tilting bucket and a roll cage, plus a small fence, jackhammer, buildable pile of concrete and a minifigure.\n\nIncludes a LEGO® City road worker minifigure.\nFeatures a construction loader building toy truck with raising front loader arm, tilting bucket and roll cage.\nAccessory elements include a jackhammer and a small build featuring a fence and pile of concrete.\nRaise the front loader arm to remove the fence after you break the concrete apart with the toy jackhammer.\nTilt the bucket on the toy excavator and scoop up the broken concrete to clean up the street.\nRaise the roll cage and climb down from the loader after a hard day’s work.\nConstruction loader measures over 2” (7cm) high 4” (12cm) long and 1” (5cm) wide.\nFence and concrete pile build measures over 1” (4cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/satellite-service-mission-60224","description":"You were born to explore the universe! Build and inspire the next generation of astronauts with LEGO® Space rockets and vehicles – Let’s Go!\n\nGive young space adventurers a treat with a NASA-inspired exploration shuttle and satellite set. This exciting LEGO® City 60224 Satellite Service Mission spaceship toy features a shuttle with opening minifigure cockpit and room in the back for the satellite, plus a satellite with opening solar panels, Extra Vehicular Activity suit with golden visor, wrench and an astronaut minifigure.\n\nIncludes a LEGO® City astronaut minifigure.\nFeatures a shuttle with opening minifigure cockpit, raising flaps on the wings and space in the back for the satellite.\nThis cool toy for kids also includes a satellite with opening solar panels.\nIncludes an astronaut Extra Vehicular Activity suit with golden visor and wrench accessory elements.\nShuttle with flaps lowered measures over 1” (4cm) high, 5” (13cm) long and 6” (17cm) wide.\nSatellite with panels extended measures over 2” (7cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/sky-police-jet-patrol-60206","description":"Help your child watch over LEGO® City with the great 60206 Sky Police Jet Patrol. This LEGO 4+ set is specially designed to be fun and easy for preschoolers and youngsters, featuring a cool toy jet plane with opening minifigure cockpit and searchlight, plus a special Starter Brick base that lets even first-time builders experience the pride of constructing buildings, vehicles and more, all on their own. The included simple guide to build and play will also help your young everyday hero understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO brick building in a familiar LEGO City setting. This fun LEGO City police chase set also includes an opening safe with room for gem elements, handcuffs and 2 minifigures.\n\nLEGO® 4+ sets are specially designed to be fun and easy for youngsters and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nIncludes 2 LEGO® City minifigures: a Sky Police pilot and a crook.\nFeatures an easy-to-build Sky Police jet with opening minifigure cockpit, searchlight and a Starter Brick base to get your child building and playing quickly in the exciting LEGO® City universe.\nAlso includes an opening mini safe box with room for loot.\nAccessory elements include 2 gem elements, a crowbar and a set of handcuffs.\nPry the safe door open with the crowbar to get to the gems inside.\nRace through the skies in a high-speed jet police chase.\nTurn the searchlight to find the crook before he gets away with the loot!\nLEGO® 4+ introduces your child to a wide universe of their everyday heroes in these LEGO City police sets.\nLEGO® 4+ play sets were previously branded as LEGO Juniors and are compatible with all LEGO construction sets for creative building.\nMakes an ideal gift for preschoolers and youngsters.\nToy Sky Police jet plane measures over 2” (7cm) high, 5” (14cm) long and 4” (11cm) wide."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/stunt-team-60255","description":"Mini stunt heroes can put on big shows with this LEGO® City Stunt Team (60255) building set! There’s a cool toy stunt ATV and motorcycle, 2 stunt driver minifigures with helmets, and a take-off ramp with flames. In fact, this building toy has all kids need for independent role play that will thrill the crowds! A building toy with a Plus! With this toy playset you get a simple building guide and Instructions PLUS! Part of the free LEGO Life app for smartphones and tablets, this interactive building guide features zoom and rotate viewing tools that help budding LEGO builders become master builders. Cool toys for kids LEGO City is made for wheels! And with LEGO City vehicle playsets, kids get to let their inner turbo loose with an awesome range of superfast, supercool building toys on wheels! These feature-rich building toys, with fun characters, inspire open-ended, independent play, where children can recreate scenarios that reflect real life in a fun and exciting way.\nThis Stunt Team toy is an ideal introduction to the exciting world of LEGO® City. Perfect for kids who love action toys, it is designed to inspire open-ended, independent role-play based on real-life scenarios.\nWhat’s in the box? A cool stunt ATV and motorcycle toy, 2 stunt driver minifigures with helmets, and a take-off ramp with flames. Everything a kid needs for action-packed, independent play.\nKids can combine the vehicles and characters in this set with other LEGO® toy playsets to form their own unique creations for play or display.\nThis LEGO® City Stunt Team (60255) playset is ideal for children aged 5 and up. It makes a great Christmas, birthday or any-other-day gift for kids who love role-play toys, model vehicles and action toys.\nWhen built, the ATV measures over 1\" (4cm) high, 1\" (5cm) long and 1\" (4cm) wide, while the toy motorcycle measures in at over 1\" (3cm) high, 2\" (6cm) long and less than 1\" (2cm) wide.\nNo batteries required – this stunt team buildingtoy is powered by kids’ imaginations, so the play can start right away!\nThis toy playset comes with a printed building guide and Instructions PLUS – an interactive building guide that helps budding builders become master builders! Available in the free LEGO® Life app for smart devices.\nWith LEGO® City vehicle playsets, kids get to let their inner turbo loose with feature-rich vehicles and fun characters that stimulate independent role-play as kids create open-ended adventures in lifelike settings.\nAll LEGO® City toy construction sets meet the highest industry standards, which ensures these fun toys continue to connect and pull apart easily time after time.\nAt The LEGO Group, we drop, squash, twist, heat, scratch and stretch LEGO® City building toys to make sure every set meets the highest global safety and quality standards."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/beach-buggy-30369","description":"Kids will love to build this cool beach buggy with chunky tires and detachable surfboard, before heading off road to power over sand dunes. Includes a driver minifigure."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/arctic-ice-saw-30360","description":"Cut through the ice with the powerful LEGO® City 30360 Arctic Ice Saw, featuring a spinning blade on a lifting arm, plus an ice pile with space for a small insect element and a minifigure."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/fire-atv-30361","description":"Race to the scene of the fire with this speedy LEGO® City Fire ATV, featuring an all-terrain vehicle firefighter building toy with blue siren bubble light, plus a firefighter minifigure with helmet, axe and a fire extinguisher."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/police-water-plane-30359","description":"Patrol the LEGO® City Mountains from the skies above with the Police Water Plane! Set features a plane with pontoons and space for the included pilot minifigure."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/road-worker-30357","description":"Head out on the LEGO® City roads and fix the potholes before the cars come along! Set includes a 4x4 with warning sign, lollypop STOP sign, radio accessory elements and a road worker minifigure."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/police-handcuffs-badge-854018","description":"Kids can step into the shoes of the LEGO® City Adventures TV series hero Duke Detain with this LEGO Police Handcuffs & Badge set (854018), perfect for heroic, action-packed role play. The awesome gold-colored LEGO City Police detailing is sure to boost kids' imaginations as they help secure law and order on the LEGO City streets!\nRole play really is child’s play with this LEGO® City Police Handcuffs & Badge set. An ideal gift for fans of the LEGO City Adventures TV series. Perfect for kids aged 6 and up who love creative play.\nIncludes a pair of toy handcuffs and a badge with golden LEGO® City Police detailing.\nHandcuffs measure over 7” (20cm) long and 3” (9cm) wide. The perfect size for little police officers on make-believe missions."},{"theme":"city","themeUrl":"https://www.lego.com/en-us/themes/city","productUrl":"https://www.lego.com/en-us/product/city-firefighter-keyring-853918","description":"Team up with a hero and fight fires with this cool LEGO® City 853918 City Firefighter Key Chain. Attach the awesome firefighter minifigure, on a durable metal chain and ring, to your backpack or keys and you are ready to go.\n\nFeatures a LEGO® City firefighter minifigure attached to a durable metal chain and ring.\nAttach it to your backpack or keys.\nMinifigure is not detachable from metal chain."}]