[{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/creative-building-bricks-11016","description":"Unleash a world of creativity with this 1,200-piece LEGO® Classic Creative Brick Box (11016) playset. There are 7 inspiring build ideas in the box to kick-start the fun. And with such a wide selection of LEGO bricks, shapes and expressive eye elements, kids are free to build whatever they can imagine!\n\nAn impressive LEGO treat for budding builders\nBoys and girls aged 4 and up will love these inspiring build ideas, including a toy watermill, tall bird, squid, pear, apple tree, space shuttle and a mouse on a wedge of cheese. And with easy-to-follow building instructions included for every model, even first-time builders can experience the pride of constructing their own LEGO toys.\n\nOpen-ended creative fun for kids\nLEGO Classic playsets put ideas and inspiration into kids' hands, with exciting models and simple building guides. Children develop creative and problem-solving skills that last a lifetime as they build and play. Learning has never been so much fun!\n\nHelp kids develop key life skills with this 1,200-piece LEGO® Classic Creative Brick Box (11016) set, featuring 7 fun model ideas and a wide selection of bricks, shapes and eyes for creative building.\nWhat’s in the box? Everything kids need to create a toy watermill, tall bird, squid, pear, apple tree, space shuttle and a mouse on a wedge of cheese, plus lots of extra LEGO® pieces for even more fun.\nKids build and play with the included model ideas, then innovate and discover as they find new and imaginative ways to create exciting LEGO® toys.\nThis high-quality LEGO® toy construction set makes an impressive Christmas, birthday or any-other-day gift for boys and girls aged 4 and up.\nIncludes 1,200 original LEGO® pieces for building whatever kids can imagine!\nComes with separate brick bags for each build. Simply choose a model, open the brick bag and you're good to go!\nEvery model idea comes with an easy-to-follow building guide, so even first-time builders can experience the pride and joy of constructing their own LEGO® toys.\nLEGO® Classic toys put ideas and inspiration into kids’ hands. Children develop creative and physical skills that last them a lifetime, as they experience the joy of constructing their own LEGO toys.\nLEGO® bricks and pieces are produced to stringent quality standards to ensure they are consistent, compatible and fun to play with.\nAll LEGO® construction toys are thoroughly tested to ensure they meets strict international safety standards."},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/bricks-and-wheels-11014","description":"This impressive LEGO® Classic Bricks and Wheels (11014) toy building set makes a great gift for kids who love hands-on play. And with 9 inspiring wheel-themed build ideas in the box, plus lots of extra bricks and pieces, it’s sure to provide endless hours of creative fun for boys, girls, friends and families.\n\nWhat's in the box?\nAll kids need to create a model car, train, school bus, robot, skateboarding zebra, race car, bunny in a wheelchair, pull-along duck and a monkey on a banana skateboard.\n\nPerfect for children aged 4 and up\nKids will love playing with these fun LEGO toys. And because every model comes with a simple construction guide and digital building instructions, even first-time builders get to experience the pride and joy of constructing their own LEGO toys.\n\nHelps kids develop key life skills\nLEGO Classic building sets put ideas and inspiration into kids' hands with buildable toys that stimulate open-ended play, while developing children's creativity and fine motor skills.\n\nKids, friends and families can get creative with 9 buildable toys and a colorful selection of wheels, bricks and pieces that puts imagination in the driving seat!\nWhat’s in the box? All kids need to build a car, train, bus, robot, skateboarding zebra, race car, bunny in a wheelchair, pull-along duck and a monkey on a banana skateboard, plus extra LEGO® bricks.\nThis high-quality toy construction set is bursting with creative ideas for rewarding build and play experiences. Kids can also combine it with existing LEGO® sets for even more creative fun.\nThe LEGO® Classic Bricks and Wheels (11014) playset makes an impressive gift for any occasion. Suitable for boys and girls aged 4 and up.\nWith 653 LEGO® pieces, kids can build whatever they can imagine!\nInside the box you'll discover separate brick bags containing all the LEGO® pieces you'll need for 1 or 2 builds. Simply choose a build, open the brick bag and you're good to go!\nIncludes easy-to-follow building instructions for kids aged 4 and up. So even first-time builders can experience the fun and pride of constructing their own LEGO® toys.\nLEGO® Classic toys put ideas and inspiration into kids’ hands with playsets that stimulate unlimited open-ended play, while developing their creative thinking and fine-motor skills.\nAll LEGO® bricks and pieces are produced to stringent quality standards to ensure they are consistent, compatible and work every time.\nLEGO® building toys are thoroughly tested to ensure every playset meets strict safety standards."},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/creative-transparent-bricks-11013","description":"The LEGO® Classic Creative Transparent Bricks (11013) building set features a dazzling array of transparent LEGO pieces in all kinds of colors, shapes and sizes, plus an exciting selection of classic LEGO bricks, pieces, eyes and wheels. Everything kids need for endless hours of creative play.\n\nA perfect playset for little builders aged 4 and up\nThis high-quality playset comes with 8 inspiring building ideas. There's a toy bird, lion, turtle, robot, unicorn, pink bird, wizard with a potions desk and a fish with a coral setting. And because every model comes with a simple building guide and digital building instructions, even first-time builders get to experience the pride and joy of constructing their own LEGO toys.\n\nHelps kids develop key life skills\nLEGO Classic building sets inspire boys and girls to imagine and create. Children can join with friends and family, developing creative and physical skills as they build and play. Learning has never been so much fun!\n\nKick-start kids’ creativity with this inspiring 500-piece playset, featuring a dazzling array of transparent LEGO® pieces, plus classic LEGO bricks, eyes and wheels for creating 8 fun models and more.\nWhat’s in the box? All kids need to build a toy bird, lion, turtle, robot, unicorn, pink bird, wizard with potions desk and a fish in a coral setting, plus extra LEGO® bricks for more creative fun!\nBuilding and playing with the 8 toys included with the LEGO® Classic Creative Transparent Bricks (11013) playset is just the beginning. There’s a whole universe of creative fun for kids to explore.\nMakes an impressive Christmas, birthday or any-other-day gift for new LEGO® builders, as well as boys and girls who wish to add a sparkle to their LEGO brick collection.\nKids can get creative with 500 LEGO® bricks, including a wide selection of transparent pieces. This playset also combines with other original LEGO sets for even more build and play fun.\nInside the box you'll discover separate brick bags, each containing the LEGO® pieces required to complete 2 builds. Simply make your choice, open the brick bag and let the fun begin!\nComes with printed building instructions and Instructions PLUS – part of the free LEGO® Building Instructions app, with zoom, rotate and visualization tools to bring the construction process to life\nLEGO® Classic construction sets inspire open-ended creative play. Boosting kids' creative-thinking and problem-solving skills has never been so much fun!\nLEGO® bricks and pieces are produced under stringent quality standards to ensure they are consistent, compatible and fun to build with.\nAll LEGO® playsets are thoroughly tested to ensure they meet strict safety standards."},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/creative-white-bricks-11012","description":"The LEGO® Classic Creative White Bricks (11012) playset is bursting with ideas and inspiration to unlock kids’ creative potential. Little builders aged 4 and up will love the 3 easy-to-build LEGO toy ideas. There’s a snowman with a broom, a sheep with a flower field and a seagull with a fish. And the creative fun continues as kids mix the bricks to modify the models and construct creations of their own.\n\nStep-by-step digital guide\nThis LEGO Classic playset comes with a simple building guide and Instructions PLUS – part of the free LEGO Building Instructions app for smartphones and tablets. This interactive building guide, with zoom and rotate viewing tools, really does make LEGO building child’s play!\n\nBuilding key life skills\nLEGO Classic building sets put ideas and inspiration into kids' hands, with exciting models that stimulate unlimited open-ended play, while developing children's creativity and motor skills.\n\nKids aged 4 and up can build, create and imagine with this LEGO® Classic Creative White Bricks (11012) toy playset. Includes 3 easy-to-build model ideas to get the creative building started.\nWhat’s in the box? This 60-piece playset has all the LEGO® bricks kids need to build a toy snowman with a broom, sheep with a flower field, seagull with a fish – or whatever they can imagine.\nChildren will love building and playing with the 3 fun model ideas included with this playset. And they can combine the bricks and pieces with other LEGO® sets for even more fun!\nMakes a great Christmas, birthday or any-other-day treat for new LEGO® builders and kids who wish to expand their LEGO brick collection.\nKids can take the creative fun wherever they go with this handy-sized LEGO® Classic Creative White Bricks playset.\nInside the box there are separate brick bags containing the LEGO® pieces required for each build. Simply choose a model, open the brick bag and away you go!\nComes with printed building instructions and Instructions PLUS – part of the free LEGO® Building Instructions app, with zoom, rotate and visualization tools to bring the construction process to life.\nLEGO® Classic building sets are bursting with ideas and inspiration for open-ended creative play. Boosting kids' creativity and problem-solving skills has never been so much fun!\nLEGO® toys meet the highest industry standards for quality, so they're consistent, compatible and fun to build with; it's been that way since 1958.\nAll LEGO® building toys are thoroughly tested to ensure every playset meets strict safety standards."},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/bricks-bricks-plates-11717","description":"LEGO® Classic Bricks Bricks Plates (11717) is overflowing with ideas and inspiration. As kids build, play and build again, this open-ended construction toy unleashes creative potential and delivers educational benefits that last a lifetime.\n\nA rainbow of LEGO bricks\nWith various colors and shapes – including wheels, windows, doors and eyes – plus 4 16x16-stud baseplates, kids can build whatever they imagine. Clear guides get kids building simple LEGO toys immediately: a frog, pirate ship, elephant or castle… before constructing cool models of their own. The baseplates hold building bricks at any angle, even upside down, yet release them with minimal effort, and transport and display models once building stops.\n\nOpen-ended creative building\nLEGO Classic sets put ideas and inspiration into kids' hands. Fun models and simple guides get them started. As they discover the joy of building creations of their own, they learn valuable skills that last a lifetime.\n\nA box of colorful LEGO® bricks to inspire creative building for kids aged 4 and up. With easy-to-build model ideas and endless free-building fun, this construction starter set is bursting with creative possibilities.\nWith LEGO® bricks in a range of shapes, sizes and colors, 4 16x16-stud baseplates and simple guides for suggested models, this colorful creative construction kit helps kids develop valuable skills that last a lifetime.\nKids build and play with suggested toys (a pirate ship,elephant and castle…) then develop their creativity with endless free-building fun. For even more possibilities, the set combines seamlessly with other LEGO® toys.\nThis versatile educational toy makes a great Christmas or birthday gift for boys and girls aged 4 and up. An ideal building toy for beginners as well as those wishing to expand their LEGO® brick collection.\nThe LEGO® Classic Bricks Bricks Plates box lets parents introduce kids to creative construction. With 4 baseplates, it's easy to build, play, display and transport models wherever kids go.\nBattery-free, so the fun never stops! The endless creative play is powered by kids’ imaginations, which boosts critical thinking, problem-solving skills and provides the satisfaction of creating something “by myself”.\nOpen the box and the imaginative play begins immediately. Simple, clear instructions get kids building and playing with the starter models. And once they've begun, the creative fun never ends.\nEvery LEGO® Classic set is bursting with ideas and inspiration. The mix of bricks and pieces stimulates endless open-ended play. Boosting kids’ creative-thinking skills has never been so fun and intuitive.\nLEGO® building bricks meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – and it's been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure every building set meets the highest global safety standards."},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/bricks-bricks-bricks-10717","description":"Enjoy endless creative fun with this LEGO® Classic 10717 Bricks Bricks Bricks set. Build whatever you can imagine with 1,500 brightly colored LEGO pieces, including building bricks, shapes, wheels, windows, doors and eyes. This set offers 3 levels of building complexity, and makes an excellent starter set for budding LEGO builders. Age-appropriate instructions for building and rebuilding your LEGO Classic creations are included in the box, with further building instructions and inspiration available online.\n\nIncludes 1,500 LEGO® pieces in vibrant colors, including building bricks, shapes, wheels, windows, doors and eyes.\nThis LEGO® Classic building set fosters open-ended creativity and imagination.\nCreate anything from a beautiful country house and gramophone with a spinning turntable, to a cute elephant with its baby and lots more—the possibilities are endless!\nProvides variable degrees of building complexity to suit builders on different levels.\nMakes a perfect starter set for budding LEGO® builders.\nVisit LEGO.com/classic for additional building instructions, fun videos, ideas and inspiration.\nComes with a handy brick separator to make building and rebuilding easier.\nLet creativity grow with LEGO® Classic sets!"},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/bricks-and-animals-11011","description":"Young animal lovers will enjoy endless imaginative play with this animal building set. The 10 amazing animals can be built at the same time, each in its own setting. And, while kids are busy building and playing, they’re also developing key skills. Kids' brick-built animals for LEGO® beginners! Youngsters will go wild for these easy-to-build LEGO animals. The 10 easy-to-build toys include a peacock with stand, bull, penguin with ice, dinosaur with rocks, unicorn, ostrich with nest, snail, hippo with a bird on its back, panda bear with bamboo trees and a giraffe with a tree. As kids build and rearrange the figures and accessories, they discover the joy of construction and immerse themselves in imaginative role-play. Inspire creative skills with LEGO Classic building toys LEGO Classic sets put creative construction and imaginative play into kids' hands. Once the simple guides and fun models get them building, they'll never want to stop!\nKids build 10 fun, familiar animals, then get creative using the kit for imaginative, open-ended play. Add to this the unlimited possibilities free-building bring and… anything is possible!\nThis creative toy builds into a peacock, bull, penguin, dinosaur, unicorn, ostrich, snail, hippo, panda, giraffe… and absolutely anything kids can imagine! With 1,500 awesome bricks, the animals are just the beginning!\nYoungsters enjoy building and playing with their models, and developing their own creations. Kids can also expand the fun by combining the bricks and pieces with other LEGO® toys.\nBoys and girls aged 4 and over will love this animal building kit. Versatile, fun and educational, this LEGO® toy makes an ideal Christmas holiday, birthday or any-other-day gift for any animal-loving child.\nWith 1,500 LEGO® bricks for kids to get creative with, there's no need to be restricted to building animals as they develop their construction skills – the possibilities are endless!\nThis animal playset is battery free, so the fun never stops! All that’s needed is a child’s imagination to fuel the creative fun. Hands-on building toys like this encourage a wide range of developmental benefits.\nSimple, clear instructions for each animal ensure kids get building the LEGO® models as soon as the set is opened. The more they play, the more their imaginations conjure up exciting new possibilities.\nDevelop kids' creative-thinking and fine motor skills with the mad mix of bricks,pieces, ideas and inspiration that you’ll find inside every LEGO® Classic set. Great open-ended play for LEGO beginners!\nLEGO® toys meet the highest industry standards, so they are consistent, compatible and connect and pull apart easily – and it’s been that way since 1958.\nAs well as meeting the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends, scratches and stretches LEGO® bricks and pieces so you can be sure the toy is safe for your child."},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/lego-large-creative-brick-box-10698","description":"Build up a storm with this big box of classic LEGO® bricks in 33 different colors. With lots of different windows and doors, along with other special pieces to inspire you, you can really run with your imagination. With some ideas to get you started, this set provides the perfect creative toolkit for budding builders of all ages to enjoy some classic LEGO construction. It comes in a convenient plastic storage box and is an ideal supplement to any existing LEGO collection.\n\nBuild your own amazing buildings and more with this classic collection of LEGO bricks in 33 different colors\nIncludes 8 different types of windows and doors, 2 green baseplates and 6 tires and wheel rims\nGreen baseplates measure over 6” long and 6” wide, and 4” long and 2” respectively\nLEGO Creative Brick building toys are compatible with all LEGO construction sets for creative building\n790 pieces – For boys and girls between the ages of 4 and 99 years old"},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/creative-fun-11005","description":"Enjoy endless creativity and fun with the LEGO® Classic 11005 Creative Fun set. Choose from a perfect mix of brightly colored LEGO building bricks and pieces, including eyes, wheels, doors, windows and hinges. Create animals, buildings, vehicles and LEGO models with a hint of nostalgia, including an old-fashioned typewriter and a vintage biplane. This set offers 3 levels of building complexity and makes an excellent starter set for budding LEGO builders. Includes age-appropriate building instructions to help children unlock their creative building skills, with further inspiration available online.\n\nIncludes a perfect mix of LEGO® bricks and pieces for creating classic toys, including eyes, wheels, windows doors and hinges.\nFeatures bright and colorful LEGO® bricks and pieces that allow for open-ended creative play.\nThis construction toy provides 3 levels of building complexity for budding LEGO® builders.\nVisit LEGO.com/classic for additional building instructions, fun videos, ideas and inspiration.\nComes with a brick separator to make building and rebuilding easier.\nLet creativity grow with LEGO® Classic building sets!\nThis set includes 900 pieces.\nThis LEGO® building set offers an age-appropriate build and play experience for ages 4+"},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/lego-medium-creative-brick-box-10696","description":"Designed with builders of all ages in mind, this collection of LEGO® bricks in 35 different colors will encourage open-ended building play, and inspire any imagination. Windows, eyes, and lots and lots of wheels add to the fun and offer endless possibilities for creative construction and vehicle play. A great supplement set to any existing LEGO collection, this set comes in a convenient plastic storage box and includes ideas to get the building started.\n\nBuild your own vehicles and much more with this classic collection of LEGO bricks in 35 different colors\nIncludes windows, eyes, 18 tires and wheel rims, green baseplate and more\nGreen baseplate measures over 3” long and 6” wide\nLEGO Creative Brick building toys are compatible with all LEGO construction sets for creative building\n484 pieces – For boys and girls between the ages of 4 and 99 years old"},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/bricks-and-lights-11009","description":"Kids can get doubly creative with this fun LEGO® set. First by building cool models, and second by transforming them into shadow puppets using Light Brick Shadow Casters! From building bricks to shadow plays Kids aged 5 and up will be captivated when their mini-models become cool shadow images! Imaginations will run wild as images move, shrink and enlarge, inspiring endless storytelling activities. With 12 fun LEGO toys for kids to make – a castle, face, princess, bat, rooster, crook, pirate ship, owl, ghost, windmill, shark and a dinosaur – plus extra bricks to build creations of their own, anything can happen! And, when the 2 Shadow Casters come into action, the shadow plays never stop! Kids build skills as they design, display and create! LEGO Classic sets put ideas and inspiration into young hands. Simple guides for the fun models soon get kids started with their indoor activities. As they discover the joy of constructing creations of their own, they acquire skills that are key to future success.\nIntroduce kids to fun construction with 12 mini-models – then watch them transform their model into an awesome shadow puppet! With 2 Light Brick Shadow Casters, the imaginative play possibilities are endless.\nThere are 12 LEGO® toys to make – a castle, funny face, princess, bat, rooster, crook, pirate ship, owl, ghost, windmill, shark and a dinosaur – plus extra bricks for kids to build their own toys.\nKids choose a model, build it, play with it, project its shadow, use the second LightBrick Shadow Caster to add another image and let their imaginations run wild as they invent cool stories with their shadow puppets!\nGreat Christmas holiday, birthday or theater gift for kids aged 5 and up who would enjoy the endless creative pleasure of LEGO® brick building and shadow puppet storytelling.\nMeasuring over 8” (22cm) long, the Light Brick Shadow Caster is ideal for small fingers to operate. As well as the 12 models to build, there are extra bricks left over for kids to get creative with models of their own.\nLight Brick batteries are included (2 x LR41), so kids can start projecting shadow shows without delay. And, of course, the hands-on model building is powered solely by children’s imaginations.\nIs this a gift for a new LEGO® builder? No problem! Simple instructions help them get started in no time. And if the instructions go missing, you can download a new set from LEGO.com/buildinginstructions.\nLEGO® Classic sets stimulate endless open-ended play with awacky mix of bricks, pieces, ideas and inspiration. Developing kids’ creative-thinking skills has never been so fun and easy!\nLEGO® toys meet the highest industry standards, so they are consistent, compatible and connect and pull apart easily – and it’s been that way since 1958.\nAs well as meeting the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends, scratches and stretches LEGO® bricks and pieces so you can be sure the toy is safe for yourchild."},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/basic-brick-set-11002","description":"Discover timeless creative fun with this charming LEGO® Classic 11002 Basic Brick Set. Choose from a selection of bright and colorful LEGO bricks, wheels and eyes to create a wide variety of iconic LEGO models, from a knight on horseback to a cool monster truck. This building set offers 3 levels of complexity and makes an excellent starter kit for budding LEGO builders. Includes age-appropriate instructions to help children discover their creative building skills, with further building instructions and inspiration available online.\n\nIncludes LEGO® bricks, wheels and eyes for creating classic LEGO models.\nFeatures bright and colorful LEGO® bricks for open-ended creative play.\nCreate a LEGO dinosaur toy, monster truck, propeller plane or whatever you can imagine!\nProvides 3 levels of building complexity for budding builders.\nVisit LEGO.com/classic for additional building instructions, fun videos, ideas and inspiration.\nLet creativity grow with LEGO® Classic sets!\nThis set includes 300 pieces.\nThis set offers an age-appropriate build and play experience for ages 4+."},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/bricks-and-houses-11008","description":"Children understand the importance of ‘home’ very early in their lives – so this LEGO® Classic Bricks and Houses set is an ideal way to introduce them to creative construction. As kids build, play and build again, they develop valuable skills that last a lifetime. Start kids building with this fun selection of LEGO houses Boys and girls aged 4 and up will love to assemble and play with these 6 easy-to-build LEGO models. There's a family home, a lighthouse, an igloo, a castle, a small house and a windmill to build. Simple instructions and cool features, such as turning sails on the windmill, make construction fast and fun. After making the models, there are even more bricks and pieces left for kids to create a dream home of their own. Develop key skills with LEGO Classic building toys LEGO Classic sets put ideas and inspiration into kids' hands. Fun models and simple guides get them started. As they discover the joy of constructing creations of their own, they acquire skills that are key to future success.\n\nKids construct 6 very different places to live, then get creative and build their own dream home. After that? With unlimited imaginative play and free-building fun, anything is possible with this versatile toy.\nThis 270-piece set builds into 6 places to live: a family home, a lighthouse, an igloo, a castle, a small house and a windmill. As kids progress to making their own creations, they develop skills that last a lifetime.\nKids enjoy building and playing with their models, then when they design their own creations, the imaginative play skyrockets! The bricks and pieces also combine to extend the fun of other LEGO® toys.\nBoys and girls aged 4 and up will love this fun building kit. This educational LEGO® toy makes an ideal birthday or Christmas holiday gift for kids interested in constructing houses, windmills, lighthouses and igloos.\nThe LEGO® Classic Bricks and Houses set is a great way to introduce kids to creative construction. For even more possibilities, combine with other LEGO sets.\nBattery-free, so the fun never stops! The endless creative play is powered by kids’ imaginations – which boosts critical thinking, problem-solving skills and the satisfaction felt when creating something “by myself”.\nSimple, clear instructions ensure kids get building the LEGO® starter models as soon as the set is opened. The more they play, the more their imaginations dream up exciting new possibilities.\nLEGO® Classic sets stimulate unlimited open-ended play with a wacky mix of bricks, pieces, ideas and inspiration. Developing kids’ creative-thinking skills has never been so fun and easy!\nAll LEGO® toys meet the highest industry standards. This means they are consistent, compatible and connect and pull apart perfectly – and it's been that way since 1958.\nAs well as meeting the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends, scratches and stretches LEGO® bricks and pieces so you can be sure the toy is safe for your child."},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/creative-suitcase-10713","description":"Create, play and pack neatly away with this smart and convenient LEGO® Classic 10713 Creative Suitcase, featuring a selection of brightly colored LEGO building bricks, including bricks, eyes, wheels and shapes, for building all kinds of houses, vehicles, creatures and creations. Open the yellow case to access multiple compartments where you can organize and store LEGO pieces. This set also includes simple, age-appropriate building instructions that will help children discover their own creative building skills.\n\nFeatures a sturdy yellow suitcase with handy sorting compartments and a selection of colorful pieces, including building bricks, shapes, wheels and eyes.\nMakes a perfect starter set for budding LEGO® builders.\nThis LEGO® Classic building set fosters open-ended creativity and imagination.\nSuitcase measures over 10” (26cm) high, 11” (28cm) wide and 2” (6cm) deep.\nVisit LEGO.com/classic for additional building instructions, fun videos, ideas and inspiration.\nLet creativity grow with LEGO® Classic sets!"},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/lego-creative-bricks-10692","description":"Dig into this selection of LEGO® bricks and let your imagination run away with you! The building possibilities are endless, with classic bricks in 29 different colors and special pieces including doors, windows, wheels, eyes and propellers. And if you don’t know where to start, you can find instructions with some ideas to get you going. This is an ideal set to help budding builders of all ages get creative, and would complement any existing LEGO collection.\n\nFeatures a wide range of LEGO® bricks in 29 different colors\nSpecial pieces include 2 different sets of eyes, windows, 2 types of door, wheels, axles and propellers\nLEGO® Classic is designed to inspire open-ended creativity with the LEGO brick\nSpecial pieces encourage imaginative building\nAll models pictured can be built from this set simultaneously\nIdeas included with the set and online at LEGO.com/classic to help you get started\nIncludes a brick separator and comes in a sturdy storage box \nLEGO® Classic sets are an ideal supplement to any existing LEGO collection "},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/gray-baseplate-10701","description":"Whether you’re creating a street scene, castle, or something of your own imagination, this gray-colored 48x48-stud baseplate is the perfect starting point for building, displaying, and playing with your LEGO® creations.\n\nMeasures 48x48 studs or 15'' (38cm) x 15'' (38cm)\nA great supplement to any LEGO® collection!"},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/bricks-and-ideas-11001","description":"Play and learn with the colorful LEGO® Classic 11001 Bricks and Ideas set. Choose from a selection of colorful LEGO bricks and pieces, including eyes, wheels and hinges to create buildings, animals, vehicles and objects. Build a LEGO keyboard, toy train, dinosaur toy or whatever you can imagine! This starter kit is ideal for budding LEGO builders or as an addition to existing LEGO sets and comes with age-appropriate building instructions that will help children unlock their creative building skills.\n\nIncludes LEGO® bricks, eyes, wheels and hinges for creating simple models.\nFeatures bright and colorful LEGO® pieces that allow for open-ended creative play.\nCreate a dinosaur, piano, house, train or whatever you can imagine!\nIdeal LEGO® starter kit for creative kids.\nVisit LEGO.com/classic for more building instructions, fun videos, ideas and inspiration.\nLet creativity grow with LEGO® Classic sets!\nThis set includes over 120 pieces.\nThis set offers an age-appropriate build and play experience for ages 4+."},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/blue-baseplate-10714","description":"Whether you are creating a seaside town, sunny swimming pool, ship at sea or something else from your imagination, this LEGO® Classic 10714 blue 32x32-stud baseplate is the perfect base for building, displaying and playing with your LEGO creations.\n\nBlue LEGO® Baseplate\nCreate a seaside town, sunny swimming pool, ship on the high seas or whatever else you can imagine.\nA great supplement to any LEGO® collection.\nMeasures 32x32 studs or 10'' (25cm) square.\nLet creativity grow with LEGO® Classic sets!"},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/green-baseplate-10700","description":"Whether you’re creating a garden, forest, or something of your own imagination, this Bright Green-colored 32x32-stud baseplate is the perfect starting point for building, displaying, and playing with your LEGO® creations.\n\nThis product is Bright Green\nMeasures 32x32 studs or 10'' (25cm) x 10'' (25cm)\nA great supplement to any LEGO® collection! "},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/creative-blue-bricks-11006","description":"An exciting mix of blue LEGO® bricks for kids, bursting with ideas and inspiration. As kids build, play and build again, this timeless building toy unlocks creative potential and delivers developmental benefits that last a lifetime. Kickstart creative building with a LEGO brick starter set Children aged 4 and over will love playing with the 3 easy-to-build LEGO toys. Simple instructions and fun features get the imaginative play started immediately. There's a blue whale toy with big round eyes and a waterspout, a train toy with revolving wheels, and a mini robot toy with movable arms. The creative fun continues as kids mix the bricks to modify their models – then skyrockets as they produce endless imaginative creations of their own. Build valuable skills with LEGO bricks for kids LEGO Classic sets put open-ended play and self-expression in kids' hands. And as they build, create and imagine, they develop skills that support future happiness and success.\nAn exciting mix of blue LEGO® bricks to inspire kids aged 4 and over to build, create and imagine. With 3 easy-to-build models plus endless free-building fun, this versatile toy is bursting with creative possibilities.\nThis 52-piece set becomes a blue whale, a train and a robot with fun features to encourage imaginative play. As kids progress to making their own customized creations, they develop valuable skills that last a lifetime.\nThere's much fun to be enjoyed building and playing with the 3 toys, but when kids start adapting models and creating their own – anything is possible. The kit can also integrate with other LEGO® toys for even more fun.\nA great building toy for beginners as well as those wishing to expand their LEGO® brick collection. This versatile educational toy makes an ideal Christmas, birthday or any-other-day gift for boys and girls.\nThe LEGO® Classic Creative Blue Bricks set is handy enough for parents to take the creative fun wherever their kids go.For even more possibilities, combine with other LEGO sets.\nPowered by kids’ imaginations – so the fun never ends! Battery-free toys boost kids’ critical thinking and problem-solving skills, and it gives them the satisfaction of making fun things happen “by myself”.\nOpen the box and the imaginative play begins immediately. Simple, clear instructions get kids building and playing with the starter models. And once they begin, the creative fun will never stop.\nEvery LEGO® Classic set explodes with ideas and inspiration. The exciting mix of bricks and pieces stimulates endless open-ended play. Boosting kids’ creative-thinking skills has never been so fun and intuitive.\nLEGO® toys meet the highest industry standards , so they are consistent, compatible and connect and pull apart easily – and it's been that way since 1958.\nAs well as meeting the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends, scratches and stretches LEGO® bricks and pieces so you can be sure the toy is safe for your child."},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/creative-green-bricks-11007","description":"This timeless building toy is bursting with ideas and inspiration in gorgeous green! As kids build, play and build again, it unlocks their imagination and encourages developmental skills that support future success. Boost creativity with this imaginative building bricks toy Introduce children aged 4 and over to creative construction with 3 easy-to-build LEGO® toys. There's a cute green dog, a mini helicopter with rotating blades and an apple tree model with a delicious-looking detachable apple. The fun starts right away thanks to simple instructions and fun features. The imaginative play takes off as kids mix the bricks to modify their models, then soars as kids build inspired creations of their own. Build skills for the future with these bricks for kids LEGO Classic sets inspire boys and girls to build, create and imagine. As they enjoy endless open-ended play and creative self-expression, they develop valuable skills that last a lifetime.\nA captivating collection of green LEGO® bricks for kids aged 4 and over. With 3 easy-to-build toys and endless free-building fun, this awesome starter-set fizzes with creative possibilities.\nThe 60 LEGO® bricks and pieces build into 3 models – a green dog, a mini helicopter and an apple tree. Cool features and endless customized creations ensure the imaginative play never stops.\nBuilding and playing with the 3 toys is only the beginning. Anything can happen when kids create models and stories of their own. And combining the set with other LEGO® toys adds a whole new dimension to the fun.\nThis LEGO® starter set for boys and girls aged 4 and over makes a great gift for beginners and more advanced builders wishing to expand their LEGO collection.\nThe LEGO® Classic Creative Green Bricks set is a great starter kit. For even more possibilities, combine with other LEGO sets.\nNo batteries needed – so the fun never ends! Because it's powered by kids' imaginations, this LEGO® toy boosts critical thinking skills, problem-solving abilities and a whole lot more!\nSimple, clear instructions get kids building and playing with the 3 starter models immediately. As they explore the set’s endless creative play possibilities, the imaginative fun grows and grows.\nLEGO® Classic boxes are packed with a stimulating mix of bricks and pieces to inspire open-ended creative play. Fun, intuitive and bursting with ideas and inspiration, anything is possible with LEGO Classic!\nAllLEGO® toys meet the highest industry standards. They are consistent, compatible and connect and pull apart perfectly every time – and it’s been that way since 1958.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces to ensure they meet the highest global safety and quality standards, and they are safe for your child."},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/brick-separator-630","description":"This tool makes it a snap to pull those small plates apart.\n\n "},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/white-baseplate-11010","description":"Never before has a white LEGO® baseplate as large as this been available! Measuring over 10'' (25cm) square, this bright white building toy gives kids a spacious 32x32-stud LEGO landscape on which to build, play and display. Bigger, better, brighter, whiter! Inspire LEGO builders with a dazzling array of building possibilities – from frozen lakes to snowy mountains, sunny beaches to spaceships! Who says the base must be at the bottom? This quality baseplate has enough grip to hold building bricks at any angle, even upside down (great for kids’ superhero adventures!) but releases them with minimal effort. And when the building stops, the firm baseplate gives kids a collapse-free way to transport and display their cool creations. Open-ended toys that build lifelong skills LEGO Classic sets put self-expression and open-ended play into kids' hands. And as they build, create and imagine, their free-thinking and problem-solving skills keep on growing!\nThis 32x32-stud baseplate gives LEGO® builders a solid white base for creative construction, an inspiring landscape for imaginative play and a sturdy platform for model display.\nSturdy, durable and in wonderful white, this more than 10'' (25cm) square grid has 1,024 perfectly aligned studs to provide LEGO® builders with a flawless grip on all LEGO building products.\nA white base takes kids to a world of possibilities where anything can happen! Made to grip bricks at any angle (even upside down!) yet be removed with ease, it grips firmly enough for model transport and display.\nGive this versatile baseplate to any LEGO® builder and watch the creative construction take shape! A great Christmas holiday or birthday gift for boys and girls aged 4 and over, from novices to veteran builders.\nThis white LEGO® baseplate measures over 10'' (25cm) square. Big enough for building projects and impressive displays (minifigure lineup, anyone?). Perfectly compatible with all LEGO building sets.\nYou don’t need batteries to power up the baseplate and switch kids on to creative construction. Just hand it to a LEGO® fan and the fun starts flowing immediately!\nNo instructions and no setting up needed. The base simply enables endless imaginative play, from the moment it is removed from the box.\nLEGO® Classic sets explode with ideas and inspiration. The exciting mix of bricks and pieces generate non-stop, open-ended play. Boosting kids' creative-thinking skills has never beenso instinctive and fun!\nLEGO® sets meet the highest industry standards. They’re consistent, compatible and connect and pull apart easily every time – it’s been that way since 1958.\nAt The LEGO Group, we test LEGO® Classic bricks and pieces to the max to ensure that every one of our toy playsets meets the highest global safety and quality standards."},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/bricks-and-eyes-11003","description":"Create fun characters and bring personality to your LEGO® creations with this LEGO Classic 11003 Bricks and Eyes set, featuring a selection of colorful LEGO bricks, shapes and pieces, plus an assortment of eyes with different sizes, colors and expressions that will bring all your LEGO models to life. This set provides 3 levels of building complexity and makes a great addition to existing LEGO sets. Includes age-appropriate building instructions to help children unlock their creative building skills, with further inspiration available online.\n\nIncludes a selection of colorful LEGO® bricks, shapes and pieces, plus a wide range of eyes with different expressions, sizes and colors.\nCreate fun characters with different expressions and give personality to your own LEGO® creations.\nFeatures bright and colorful LEGO® bricks and pieces that allow for open-ended creative play.\nThis creative builder set provides 3 levels of building complexity for budding builders.\nVisit LEGO.com/classic for additional building instructions, fun videos, ideas and inspiration.\nComes with a brick separator to make building and rebuilding easier.\nLet creativity grow with LEGO® Classic sets!\nThis building set includes over 450 pieces.\nThis construction toy offers an age-appropriate build and play experience for ages 4+."},{"theme":"classic","themeUrl":"https://www.lego.com/en-us/themes/classic","productUrl":"https://www.lego.com/en-us/product/windows-of-creativity-11004","description":"Kids and families can all learn to build in new and imaginative ways with the LEGO® Classic 11004 Windows of Creativity set, featuring a colorful selection of LEGO building bricks, eyes, wheels and hinges, plus a wide range of windows and doors for creating fun models. From a push-along robot with a cupboard tummy to a boot-shaped shoe house, children discover new ways to create exciting LEGO animals, buildings and objects using standard LEGO elements. This set offers 3 levels of building complexity, making it an excellent starter set for budding LEGO builders. Includes age-appropriate building instructions and even more LEGO bricks to help children unlock their creative building skills!\n\nIncludes a wide selection of windows and doors, plus a colorful mix of LEGO® pieces including eyes, wheels, hinges and bricks for kids to create classic LEGO toys.\nFeatures bright and colorful LEGO® bricks and pieces that allow for open-ended creative play.\nThis construction toy provides 3 levels of building complexity for budding LEGO® builders.\nVisit LEGO.com/classic for additional building instructions, fun videos, ideas and inspiration.\nComes with a brick separator to make LEGO® building and rebuilding easier.\nLet creativity grow with LEGO® Classic building kits!\nThis set includes 450 pieces.\nThis LEGO® building set offers an age-appropriate build and play experience for ages 4+."}]