[{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/surfer-beach-house-31118","description":"Kids will love taking a trip to the beach to surf and play with sea animals with this brilliant LEGO® Creator 3in1 Surfer Beach House (31118). Kids have everything they need to create exciting stories: a 2-floored beach hut with hinges to reconfigure and fold open, 2 minifigures and 3 brick-built sea animals – a dolphin, sea turtle and baby sea turtle.\n\n3in1 kids' toys fuel kids' passions\nKids will be thrilled to build 3 different fun-filled models with this LEGO Creator 3in1 set. They can put together the Surfer Beach House, rebuild it into a lighthouse, turn it into a pool house or use the bricks and pieces to create something new.\n\nTop gifts to grip kids’ imaginations\nLEGO Creator 3in1 building sets let kids enjoy creative fun with 3 different models in every set! The play options never end as each of the models can be taken apart and rebuilt into something new as often as kids choose. Select from an amazing 3in1 range that includes animals, cars and safari tree houses.\n\nThe LEGO® Creator 3in1 Surfer Beach House (31118) building set will captivate kids for hours and features 3 models in 1 – a surf shack, a lighthouse and a pool house.\nThis LEGO® toy set also includes man and woman minifigures for kids to include in their fun beach adventures.\nThe surf shack has 2 floors with hinges so it can fold open for different play options and comes with 3 brick-built sea animals – a dolphin, sea turtle and baby sea turtle.\nThe lighthouse toy features a small boat and a manta ray, while the pool house consists of 2 floors and comes with surfboards and a brick-built swimming pool.\nThis 564-piece LEGO® Creator 3in1 toy set is a rewarding building experience for LEGO fans aged 8 and up and makes a great birthday or holiday gift.\nThe LEGO® beach house measures over 7 in. (19 cm) high, 6 in. (17 cm) wide and 5 in. (15 cm) deep – a great size to play with or proudly display in a bedroom.\nLook out for other great, new-for-January 2021 LEGO® Creator 3in1 sets: Cyber Drone (31111), Wild Lion (31112), Race Car Transporter (31113) and Superbike (31114).\nLEGO® Creator 3in1 sets let kids enjoy the best creative play as they build action-packed stories around the 3 different models in every box.\nFor more than 6 decades LEGO® building bricks have been made from high-quality materials to ensure they consistently connect and pull apart every time.\nLEGO® building bricks meet stringent global safety standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/safari-wildlife-tree-house-31116","description":"Kids can roleplay an exciting safari on the African savanna with this fantastic LEGO® Creator 3in1 Safari Wildlife Tree House (31116). The building set is packed with everything they need: A tree house toy featuring a balcony and ladder and an interior with a toilet and sink, 2 minifigures and 3 brick-built animals – a giraffe toy, flamingo toy and hornbill toy.\n\n3in1 kids’ toys fuel kids’ passions\nKids will be thrilled to build 3 different, fun-filled models with this LEGO Creator 3in1 set. They can construct the Safari Wildlife Tree House, rebuild it into a biplane with a lion, turn it into a catamaran with a crocodile, or use the bricks to create something new.\n\nFun toys to inspire imaginations\nLEGO Creator 3in1 sets let kids explore their imaginations with 3 models to build in every box! The play options never end as each model can be rebuilt into something brand new as often as kids choose. Pick from an amazing range of 3in1 sets, including cars, motorbikes and robots.\n\nThe LEGO® Creator 3in1 Safari Wildlife Tree House (31116) building set will grip kids’ imaginations with 3 models in 1: a tree house toy, plane toy and boat toy.\nThis LEGO® set includes boy and girl minifigures with a camera accessory to add even more fun to kids’ safari adventures.\nThe tree house toy features a balcony with a couch and ladder, an interior with a toilet and sink, plus 3 brick-built animals: a posable giraffe toy, flamingo toy and hornbill toy.\nThe biplane toy has a cockpitfor a minifigure, plus a lion, a tree and an African lovebird, while the catamaran toy comes with an adjustable sail, a crocodile toy and marabou stork toy.\nThe 397-piece LEGO® Creator 3in1 toy set offers a fun build to little animal fans aged 7 and up and is a great birthday or holiday gift guaranteed to make them happy.\nThe LEGO® Tree House toy measures over 7 in. (18 cm) high, 4 in. (12 cm) deep and 4 in. (12 cm) wide – the perfect size to play with or proudly display in a bedroom.\nCreatebigger adventures with other great LEGO® Creator 3in1 sets: Cyber Drone (31111), Wild Lion (31112), Race Car Transporter (31113), Superbike (31114) and Surfer Beach House (31118).\nLEGO® Creator 3in1 sets allow kids to enjoy amazing imaginative play as they devise fun stories around the 3 different models in every box.\nFor more than 6 decades LEGO® building bricks have been made from high-quality materials to ensure they consistently connect and pull apart every time.\nLEGO® building bricks meet stringent global safety standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/space-mining-mech-31115","description":"LEGO® fans will love playing out action scenes with this impressive Creator 3in1 Space Mining Mech (31115) building set. The mech toy’s cool features include posable legs and arms, a spinning buzz saw, a jetpack on its back, and a face with changeable expressions, giving kids everything they need for hours of roleplay fun.\n\nThe best toys for creative fun\nSpace and robot fans can enjoy 3 different build-and-play experiences with this LEGO Creator 3in1 set. They can create the Space Mining Mech, which comes with an alien figure and a set of crystals, then rebuild it into a posable 4-legged cargo carrier with a robot pilot or make a posable 2-legged LEGO robot.\n\nAn amazing collection of 3in1 LEGO toys\nLEGO Creator 3in1 building toys open a world of exciting possibilities with 3 models to create in every box! Creator 3in1 sets inspire the best imaginative play with an amazing collection of models to fuel kids’ passions, including cars, creatures and planes.\n\nThis LEGO® Creator 3in1 Space Mining Mech (31115) building set lets imaginative kids build any of 3 exciting models: a mech toy, cargo carrier and space robot toy.\nThe Space Mining Mech model includes a green alien figure and a set of crystals to add an extra dimension to kids’ adventures in space.\nCreative kids can use the mech toy to compete with an alien for crystals, or zoom around the galaxy in a 4-legged cargo carrier, or fight space battles with a 2-legged mech.\nThe posable Space Mining Mech comes with a buzz saw, a jetpack and a face that can change expressions, while the 4-legged cargo carrier and 2-legged mech each feature a robot pilot.\nWith 327 pieces, this LEGO® Creator 3in1 set is a rewarding build for passionate space fans aged 7 and up and makes the perfect birthday or holiday gift.\nThis mech toy stands over 6 in. (15 cm) high and is a great portable size to play with at home or on the go.\nCreate even bigger adventures with other LEGO® Creator 3in1 sets: Wild Lion (31112), Race Car Transporter (31113), Superbike (31114), Safari Wildlife Tree House (31116) and Surfer Beach House (31118).\nLEGO® Creator 3in1 sets let kids enjoy endless imaginative play as they create action-packed stories around the 3 different cool and colorful models in every box.\nFor more than 6 decades LEGO® building bricks have been made from high-quality materials to ensure they consistently connect and pull apart every time.\nLEGO® building bricks meet stringent global safety standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/race-car-transporter-31113","description":"Exciting racing adventures await young builders with the brilliant LEGO® Creator 3in1 Race Car Transporter (31113) construction toy. It features a truck with a detachable trailer carrying 2 fast cars that can be unloaded down a ramp, letting kids enjoy racing action.\n\nFun toys for imaginative play\nThere are 3 different impressive models to build and play with in this LEGO Creator 3in1 building set. Kids can create a truck and trailer with 2 race cars, then rebuild it into a toy crane truck and a mini tugboat. Or they can use the 328 bricks and pieces to build something totally new.\n\nThe best toys for creative building\nLEGO Creator 3in1 building toys open a world of endless possibilities with 3 different models to create in every box! LEGO builders will be thrilled by all the exciting options on offer to them. Creator 3in1 inspires kids' imaginations and keeps them happy for hours with a great selection of sets, including scary creatures, fast jets and detailed buildings.\n\nInspire endless creative play with this fantastic LEGO® Creator 3in1 Race Car Transporter (31113) toy set featuring 3 models in 1 – a car carrier toy, crane truck and tugboat with crane.\nThe car transporter toy includes 2 race cars, 1 in blue and 1 in red, so kids can jump behind the wheel and stage exciting races at the track.\nThe Race Car Transporter is an articulated truck with a detachable trailer carrying 2 cars that can be loaded on and off its 2 ramps. A kickstand lets the trailer stand on its own.\nThis toy crane truck features a crane that swivels through 360 degrees and can lift cargo up and down, while the mini tugboat features a working crane.\nThe perfect reward for LEGO® fans aged 7 and up who have a passion for cool trucks and boats.\nThe car carrier toy measures over 3 in. (7 cm) high, 9 in. (24 cm) long and 1.5 in. (4 cm) wide – the perfect portable size to play with at home or to take to a friend's house.\nLook out for other great, new-for-January 2021 LEGO® Creator 3in1 sets: Cyber Drone (31111), Wild Lion (31112), Superbike (31114) and Surfer Beach House (31118).\nLEGO® Creator 3in1 sets let kids experience the best imaginative play as they create action-packed stories around the 3 different models in every box.\nFor more than 6 decades, LEGO® building bricks have been made from high-quality materials to ensure they consistently connect and pull apart every time.\nLEGO® building bricks meet stringent global safety standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/superbike-31114","description":"Inspire kids’ passion for cool motorbikes and creative building with the impressive LEGO® Creator 3in1 Superbike (31114) toy set. Kids will love staging exciting race action with this modern motorbike toy, which features moving handlebars, working suspension and a kickstand.\n\nThe best toys for imaginative play\nKids can enjoy 3 different build-and-play experiences in this LEGO Creator 3in1 toy set. They can build the modern Superbike and then rebuild it into a classic motorcycle with kickstand, make a futuristic hoverbike for high-flying adventures or use their imaginations to create something new.\n\nAn amazing collection of building toys\nLEGO Creator 3in1 sets open a world of endless possibilities with 3 different models to create in every box! LEGO builders will be thrilled as they build, rebuild and build again! Creator 3in1 inspires little builders' imaginations and keeps them happy for hours with a great selection of models, including cool cars, fearsome creatures and detailed buildings.\n\nThe LEGO® Creator 3in1 Superbike (31114) set inspires endless creative building, featuring 3 models in 1 – a modern motorbike, a classic motorcycle and a futuristic hoverbike.\nA host of exciting adventures are on offer to imaginative kids, who can stage super-fast races around the track with a modern or classic LEGO® motorbike or take to the sky on a hoverbike.\nThe motorbike toy set makes the ideal reward for kids aged 8 and up who have a real passion for toy motorbikes and creative building.\nThe Superbike measures over 4 in. (11 cm) high, 7 in. (19 cm) long and 2 in. (6 cm) wide – the perfect portable size to play with at home or to take to a friend’s house.\nThe Superbike features moving handlebars, a working suspension and a kickstand, while the classic motorbike also comes with a kickstand so kids can proudly display it.\nThis impressive set offers kids 3 different options to develop their building skills and create vehicles to play with on their own or add to otherLEGO® toy sets for more fun.\nLook out for other great, new-for-January 2021 LEGO® Creator 3in1 sets: Cyber Drone (31111), Wild Lion (31112), Race Car Transporter (31113) and Surfer Beach House (31118).\nLEGO® Creator 3in1 sets let kids enjoy endless imaginative play as they create action-packed stories around the 3 different colorful models in every box.\nFor more than 6 decades LEGO® building bricks have been made from high-quality materials to ensure they consistently connect and pull apart every time.\nLEGO® building bricks meet stringent global safety standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/wild-lion-31112","description":"Kids will love venturing into the savanna for fun animal adventures with this impressive LEGO® Creator 3in1 Wild Lion (31112) toy set. It features a brick-built lion model with posable tail, legs, head and jaw, plus a vulture and rack of ribs to inspire fun stories.\n\nKids' toys that inspire imaginative play\nYoung builders will love creating 3 different animal toys with this LEGO Creator 3in1 set. They can build the wild lion, rebuild it into a posable ostrich, turn it into a posable warthog,or tap into their imaginations to create another cool animal. The vulture can be used with all 3 models.\n\nCreative gifts that keep on giving\nLEGO Creator 3in1 building toys allow kids to enjoy endless captivating adventures with 3 different models to build in every set! The play options never end as each of the brilliantly detailed models can be taken apart and built into something new as often as kids choose. Pick from an amazing range of 3in1 toy sets that includes animals, vehicles and cool houses.\n\nThis LEGO® Creator 3in1 Wild Lion (31112) building set will fuel kids’ imaginations with 3 models in 1 – a wild lion, an ostrich and a warthog.\nImpressive LEGO® set also includes a vulture, which can be used with all 3 brick-built models to bring even more fun to kids' savanna adventures.\nThe 3 animal toys are all highly posable: The lion can move its legs, tail, head and jaw; the ostrich can move its neck and legs; and the warthog can move its legs, head and jaw.\nThis 224-piece LEGO® Creator 3in1 set makes a fun-filled building task for kids aged 7 and up and is a great reward for creative kids.\nThe lion model measures over 4 in. (12 cm) high – the perfect portable size to play with at home or on the go.\nFun-loving kids can enjoy savanna adventures with a fierce lion, a speedy ostrich and a powerful warthog, who can all enjoy fun adventures with the vulture.\nLook out for other great, new-for-January 2021 LEGO® Creator 3in1 sets: Cyber Drone (31111), Race Car Transporter (31113), Superbike (31114) and Surfer Beach House (31118).\nLEGO® Creator 3in1 sets allow kids to enjoy the best imaginative role play as they create action-packed stories around the 3 different colorful models in every box.\nFor more than 6 decades LEGO® building bricks have been made from high-quality materials to ensure they consistently connect and pull apart every time.\nLEGO® building bricks meet stringent global safety standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/cyber-drone-31111","description":"Get kids playing out action-packed adventures in space with this cool LEGO® Creator 3in1 Cyber Drone (31111) toy set. It features 2 rotating adjustable thrusters, posable elevators on the tail and a cockpit with an opening windshield, inspiring kids to enjoy hours of fun role play.\n\nThe best cool toys for kids\nYoung space explorers can enjoy 3 different build-and-play experiences with this LEGO Creator 3in1 toy set. They can build the cyber drone, then rebuild it into a cyber mech or cyber scooter. The toy set comes with a new-for-January 2021 robot minifigure with a transparent blue head, which can ride each of the 3 models.\n\nAn amazing collection of 3in1 LEGO sets\nLEGO Creator 3in1 building toys open up a world of possibilities with 3 different models to create in every box! LEGO builders will be captivated as they build, rebuild and build again! Creator 3in1 sets inspire imaginative role play with amazing models to choose from, including cars, creatures and beach houses.\n\nThis LEGO® Creator 3in1 Cyber Drone (31111) building set inspires fantastic playtime fun for kids, with 3 models in 1 – a cyber drone, cyber mech and cyber scooter.\nIncludes a new-for-January 2021 robot minifigure with transparent blue head. The robot can travel on the cyber drone, cyber mech and cyber scooter to add more fun to kids' battles.\nCreative kids can enjoy a host of fun adventures in space, travelling in the drone toy or racing around on the ground with the cyber mech or cyber scooter.\nThe Cyber Drone has 2 rotating adjustable thrusters, posable elevators on the tail and a cockpit with an opening windshield.\nWith 113 pieces, this LEGO® Creator 3in1 set is a fun-filled building task for kids aged 6 and up and makes the ideal unexpected treat for them.\nThe Cyber Drone measures over 2 in. (6 cm) high, 5 in. (14 cm) long and 2 in. (6 cm) wide – the perfect portable size to play with at home or on the go.\nLook out for other great, new-for-January 2021 LEGO® Creator 3in1 sets: Wild Lion (31112), Race Car Transporter (31113), Superbike (31114) and Surfer Beach House (31118).\nLEGO® Creator 3in1 sets allow kids to enjoy endless imaginative play as they create action-packed stories around the 3 different cool and colorful models in every box.\nFor more than 6 decades LEGO® building bricks have been made from high-quality materials to ensure they consistently connect and pull apart every time.\nLEGO® building bricks meet stringent global safety standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/yellow-taxi-40468","description":"LEGO® fans can create their own fun adventures on the streets of a vibrant city with a cool Yellow Taxi (40468) toy. This wonderfully attractive and detailed vehicle features an ad on the roof, side-view mirrors, license plates and turning rubber wheels. An awesome gift for kids aged 7 and up to proudly display or use to enjoy role-play action.\nTake an exciting trip to a vibrant city with this LEGO® Creator Yellow Taxi buildable toy for kids, featuring an ad on the roof, taxi decorations and turning rubber wheels.\nThis 124-piece taxi model is a fantastic gift for little builders aged 7 and up who have a passion for vehicles and using their imaginations to create fun stories.\nThe yellow taxi toy measures over 2 in. (6 cm) high, 5 in. (13 cm) long and 1 in. (5 cm) wide, the perfect size to play with at home or to take to a friend's house for more fun."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/pirate-ship-31109","description":"The high seas are calling! Swashbuckling adventures await pirate fans in the LEGO® Creator 3in1 Pirate Ship (31109) toy. This awesome, detailed set features a pirate ship with moving sails, cannons and a cabin with opening roof and sides, 3 minifigures, buildable figures including a shark and a parrot, plus lots of other brick-built details and cool accessories to jump-start play.\n\nFreedom to create and imagine\nAt least 3 different build-and-play experiences are possible with this LEGO Creator 3in1 toy set. Kids can build a Pirate Ship, then rebuild it into the Pirates’ Inn or a creepy Skull Island. Or they can let their creativity loose and design something new.\n\nEndless play possibilities await\nLEGO Creator 3in1 sets offer kids different models that are realistic and encourage imaginative play. The models give endless building and play opportunities while helping to spark creativity in children of all ages. The awesome toy sets also make great Christmas gifts or birthday presents for kids.\n\nLEGO® Creator 3in1’s Pirate Ship (31109) set encourages kids’ creative play, featuring 3 models in 1: A classic Pirate Ship, rustic Pirates’ Inn and mysterious Skull Island. Building and rebuilding keeps the play going.\nAn open bounty of opportunities! Kids can stretch their building and creativity skills with the super-detailed Pirate Ship toy, visit the Pirates' Inn for a bite, explore Skull Island or create a totally new model.\nThis set gives 3 options for building: A LEGO® Creator 3in1 Pirate Ship (31109), Pirates’ Inn or Skull Island, to play with solo or combine with other sets. The set also has 3 minifigures for extra play possibilities.\nAny fan of creative play and building will love this awesome set. The realistic Pirate Ship, Pirates' Inn and Skull Island models work as a great Christmas, birthday or holiday gift for boys and girls aged 9+.\nThe high seas are calling! The pirate ship measures over 14” (37cm) high, 18” (46cm) long and 7” (19cm) wide, meaning thisthrilling toy is full of awesome details and big enough for serious solo and group play fun.\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills and give them the joy of coming up with new stories all on their own.\nOpen the box and the play begins with building and rebuilding any 1 of the 3 model toys. Clear, easy-to-follow instructions help make assembly a snap for kids, leading to joy in construction and loads of creative fun.\nGive children endless opportunities to develop their building skills as they play with LEGO® Creator 3in1 sets. This awesome pirate ship playset lets kids grow their imagination with lots of building opportunities.\nLEGO® building bricks meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure every kid’s building set meets the highest global safety and quality standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/townhouse-pet-shop-cafe-31097","description":"Kids can enjoy creative play with the LEGO® Creator 3in1 31097 Townhouse Pet Shop and Café, featuring a 2-level building with café, upper-level kitchen and rooftop terrace, plus a 3-level building with pet shop, apartment and rooftop terrace. This colorful townhouse includes an array of interior details that inspire creative building and comes with brick-built animal toys, including a dog, toucan and mouse. With Creator 3in1 playsets kids get 3 different build and play experiences. Build the Townhouse Pet Shop and Café and then rebuild it into a multi-story Bank or Market Street with tram. Includes 3 minifigures, all ready for downtown adventures.\n\nEnjoy 3 building opportunities with this LEGO® Creator 3in1 playset. Build the Townhouse Pet Shop and Café and then rebuild to create a multi-story Bank or Market Street with tram.\nIncludes 3 minifigures, all ready for downtown adventures.\nThe Townhouse Pet Shop and Café features a colorful facade with ornate detailing, decorative café signage and large windows, plus an outdoor area with flowers, ATM, sidewalk, traffic light and fire hydrant.\n2-level building features a ground-level café with detailed interior and indoor and outdoor seating areas; upper-level kitchen with a stove and a balcony; and a rooftop terrace with flowers.\n3-level building features a ground-level pet shop with a detailed interior, aquarium and brick-built dog, toucan and mouse figures; a mid-level apartment with TV and sofa; upper-level bedroom with bed and telephone nightstand; and roof terrace with solar panel.\nThis set also includes a brick-built hot dog cart with large hot dog sign, condiment bottle and hot dog.\nEasily swap the modular sections including entire levels to customize your building with the LEGO® Creator modular system.\nTownhouse Pet Shop and Café measures over 9” (25cm) high, 7” (20cm) wide and 8” (22cm) deep.\nBank measures over 11” (28cm) high, 4” (12cm) wide and 4” (12cm) deep.\nMarket Street measures over 4” (12cm) high, 11” (29cm) wide and 4” (12cm) deep.\nTram measures over 4” (11cm) high, 4” (11cm) long and 1” (3cm) wide."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/caravan-family-holiday-31108","description":"Creative camping adventures and fun are waiting for outdoor fans in the LEGO® Creator 3in1 Caravan Family Holiday (31108) playset. The set has a retro car and caravan toy and features a kitchen, toilet, removable roof and opening side. Packed with accessories and features, the set also includes 3 minifigures to jump-start play.\n\nLimitless building creativity\nAt least 3 different build-and-play experiences are possible with this great LEGO Creator 3in1 toy set. Kids can build a caravan with aretro car model, then rebuild it into a camper van or a detailed lighthouse. Or they can free their creativity, tap into different passions and build something new.\n\nStand-alone models free imagination\nLEGO Creator 3in1 sets offer kids different models that are realistic and encourage imaginative play. The models give endless building and play opportunities while helping to spark creativity in children of all ages. The awesome toy sets also make great Christmas gifts or birthday presents forkids.\n\nLEGO® Creator 3in1’s Caravan Family Holiday (31108) set encourages kids’ creative play, featuring 3 models in 1: A family caravan with retro car, camper van or lighthouse. Building and rebuilding extends play endlessly!\nFun possibilities are around every corner! Kids can stretch their creativity and building skills with the detailed caravan and car toy, hop in the camper van for a holiday, visit the lighthouse or build something new.\nThis set gives kids 3 options for play: A LEGO® Creator 3in1 Caravan Family Holiday (31108), camper van or lighthouse. The set also has 3 minifigures and 3 different brick-built animals for extra play fun.\nAny fan of creative play and building will love this awesome set. The detailed caravan and retro car, camper van and lighthouse models work as a great Christmas, birthday or holiday gift for boys and girls aged 9+.\nReady for adventure? The caravan and retro car model measures over 5” (13cm) high, 13” (34cm) long and 4” (12cm) wide, meaningthis exciting action toy is full of awesome details and big enough for serious holiday fun!\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills and give them the joy of coming up with new stories all on their own.\nOpen the box and the play begins with building and rebuilding any 1 of the 3 model toys. Easy-to-follow instructions help make assembly a snap for kids, leading to pride in construction and loads of creative fun.\nGive children endless possibilities to develop building skills as they play with LEGO® Creator 3in1 sets. This clever outdoor family vacation playset lets kids grow their imaginations with lots of building opportunities.\nLEGO® building bricks meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure every kid’s building set meets the highest global safety and quality standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/monster-burger-truck-31104","description":"Budding cooks can hop onboard for a great building experience with the LEGO® Creator 3in1 Monster Burger Truck (31104) set. Kids can try their hand at running a food truck with this unique vehicle, filled with loads of brick-built details like a giant hamburger on the roof, foldable steps and a dog figure. Creative freedom Children get to explore 3 different build-and-play experiences in 1 with this LEGO Creator 3in1 set. They can make a monster burger truck, rebuild it into an off-roader or toy tractor pulling vehicle, or let their creativity loose and create whatever they want. This great building toy encourages imaginative play and makes a great Christmas present or birthday gift. Unique, stand-alone models LEGO Creator 3in1 sets offer kids models that are detailed and realistic and encourage imaginative play. The models provide endless building and play opportunities while helping to spark creativity in children of all ages. The fun sets make great gifts for kids for any occasion.\nFeed creative food truck role play with this set of 3 models in 1: A LEGO® Creator 3in1 Monster Burger Truck (31104) with suspension, an off-roader and a tractor pulling vehicle, plus 2 minifigures and a dog figure.\nWhat’s cooking? Kids can stretch their building skills as they serve burgers in a monster burger truck, explore in an off-roader, haul heavy loads with the tractor pulling vehicle or create something completely new.\nThis toy provides 3 in 1 building options, letting kids build 1 of 3 types of vehicle, which can be played with alone or with other LEGO® sets. Kids can develop their building skills every time they build.\nFans of imaginative play will love this set. The monster burger truck, with huge wheels, working suspension, foldable stairs and giant brick-built burger on the roof makes a cool all-occasion gift for kids aged 8 and up.\nDetailed and prepped for fun! With the monster burger truck measuring over 7” (19cm) high, 6” (17cm) long and 4” (11cm) wide, this awesome action toy is big enough for serious fast-food truck cooking adventures.\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills and encourage them to come up with new stories all on their own.\nCrack open the box and the play can begin with building and rebuilding any 1 of the 3 model toys. Easy-to-follow instructions help make assembly quick for kids, leading to pride in creating and loads of imaginative fun.\nDrive continuous play possibilities for kids with LEGO® Creator 3in1 sets. This cool food truck playset lets children develop their creativity and imagination as they develop new stories with every rebuilding.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it's been that way since 1958.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces to make sure every kids’ building toy meets the highest global safety and quality standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/space-rover-explorer-31107","description":"Adventure awaits young space explorers with the LEGO® Creator 3in1 Space Rover Explorer (31107) playset. Kids will love cruising in the detailed rover toy, with its cockpit, lab/living area, working crane arm and suspension, plus a small robot with moving arms, buildable alien figure and astronaut minifigure to inspire imagination and jump-start play.\n\nOut-of-this-world creative play\nKids get 3 different build-and-play experiences in this LEGO Creator 3in1 toy set. They can build a Space Rover Explorer and then rebuild it into a space base with a smaller alien or a space flyer. Or they can tap into different passions and build something completely new.\n\nOpen-ended models and fun\nLEGO Creator 3in1 sets offer kids different models that are detailed and realistic and encourage imaginative play. The models give endless building and play opportunities while sparking creativity in children of all ages. The inspirational sets also make great Christmas gifts or birthday presents for kids.\n\nThis LEGO® Creator 3in1 Space Rover Explorer (31107) set encourages kids’ creative play, featuring 3 models in 1, a Space Rover Explorer, space base or space flyer. Building and rebuilding extends the play endlessly!\nWhat adventure awaits in outer space? Kids can stretch their creativity and building skills as they study an alien in a Space Rover Explorer, recharge in a space base, go planet-hopping in a space flyer or build something new.\nThis set gives kids 3 options to build: A LEGO®Creator 3in1 Space Rover Explorer toy (31107), space base or space flyer, to play with solo or with other sets. The set also has an astronaut minifigure for extra play fun.\nAny fan of creative building will love this awesome set. The sturdy Space Rover Explorer, space base and space flyer models make a great Christmas, birthday or holiday gift for boys and girls aged 8+.\nReady for action? The Space Rover Explorer measures over 6” (17cm) high, 7” (20cm) long and 4” (11cm) wide, meaning this exciting action toy is full of awesome details and big enough for serious adventures!\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills and give them the joy of coming up with new stories all on their own.\nOpen the box and the play begins with building and rebuilding any 1 of the 3 model toys. Easy-to-follow instructions help make assembly a snap for kids, leading to pride in construction and loads ofcreative fun.\nGive children endless possibilities to develop their building skills as they play with LEGO® Creator 3in1 sets. This cool outer-space playset lets kids grow their imagination with lots of building opportunities.\nLEGO® building bricks meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure every kid’s building set meets the highest global safety and quality standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/townhouse-toy-store-31105","description":"Indulge a LEGO® Creator 3in1 fan’s love of detailed models in this Townhouse Toy Store (31105) set. Little builders will spend hours exploring the 2-level townhouse, with an apartment upstairs and a toy store downstairs, plus a working rocket ride. Inspire creative building freedom Kids get 3 different build-and-play experiences with this LEGO Creator 3in1 set. They can build a 2-level townhouse toy store and rebuild it into a cake shop with a seating area and a LEGO workshop attached to the back, a pretty flower shop with a skylight, or something new. This building toy encourages imaginative play and will make a great Christmas present or birthday gift. Unique, stand-alone models with play options LEGO Creator 3in1 sets include detailed, realistic models that encourage imaginative play. The toys offer endless building and play opportunities while helping to spark creativity in children of all ages. These impressive, inspirational kits make great gifts for fans and kids for any occasion.\nGive kids an exciting building challenge with this set, featuring 3 models in 1, a townhouse toy store, cake shop with LEGO® workshop and a flower shop with skylight, plus 2 minifigures and a brick-built bird figure.\nWhat makes a town grow? Kids can develop creativity and building skills by running a Creator 3in1 Townhouse Toy Store (31105), busy cake shop or flower shop, or by using their imaginations in new ways.\nThis detailed set offers 3 building options in 1 and can be connected toother Creator 3in1 buildings to develop a LEGO® street with endless creative possibilities. Kids can also build something totally new with the set.\nThe 2-level townhouse toy store with apartment, brick-built toy soldier, train sign and gumball machine, working rocket ride, loads of toys and other details makes a fantastic Christmas or birthday gift for kids aged 8+.\nDetailed and ready for immersive play! With the townhouse toy store measuring over 7” (20cm) high, 5” (13cm) wide and 3” (10cm) deep, this cool building toy is designed for serious adventures and loads of creative fun!\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills and give them the joy of coming up with new stories all on their own.\nOpen the box and the play begins with building and rebuilding any 1 of the 3 model toys. Easy-to-follow instructions help make assembly a snap for kids, leading to a boost in confidence and pride in creation.\nGive youngsters free rein to play with LEGO® Creator 3in1 sets. This awesome house playset offers kids the chance to push their creativity and building skills in new directions as they tell stories with each rebuilding.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it's been that way since 1958.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces to make sure every kids’ building toy meets the highest global safety and quality standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/shuttle-transporter-31091","description":"Head for the launch site with the powerful LEGO® Creator 3in1 31091 Shuttle Transporter, featuring a flatbed truck and trailer with vertical exhaust stacks, roof-mounted horns, tinted windshield and 10 sturdy wheels with chunky tires, plus a space shuttle toy with large engines, opening payload bay doors, working crane and a satellite. With LEGO Creator 3in1 sets you get 3 different build and play experiences. Build the Shuttle Transporter and then rebuild it to create a toy Helicopter Transporter or a Car with Caravan model, for even more fun and adventures.\n\nEnjoy 3 building opportunities with this LEGO® Creator 3in1 set. Build the Shuttle Transporter and then rebuild to create a cool Helicopter Transporter or a Car with Caravan.\nThe Shuttle Transporter features a flatbed truck and trailer, plus a space shuttle and a satellite.\nFlatbed Truck and trailer features vertical exhaust stacks, roof-mounted horns, tinted windshield and 10 wheels with rubber tires.\nSpace shuttle features an authentic color scheme, tinted windshield, large engines, opening payload bay doors and a working crane.\nLoad the space shuttle onto the heavy-duty truck and head for the launch site.\nBlast off into space, open the payload doors and use the crane to put the satellite into orbit, before heading back to earth for a perfect landing!\nShuttle Transporter (with shuttle) measures over 3” (10cm) high, 11” (28cm) long and 4” (12cm) wide.\nHelicopter Transporter measures over 3” (8cm) high, 6” (17cm) long and 1” (3cm) wide.\nCar with Caravan measures over 1” (4cm) high, 6” (16cm) long and 1” (3cm) wide."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/fire-dragon-31102","description":"Boost kids’ love of awesome creatures and their creativity with the LEGO® Creator 3in1 Fire Dragon (31102) set. Children love playing with this fearsome, fire-breathing dragon toy with posable head, jaw, legs, tail, wings and claws, plus an opening treasure chest with assorted elements.Build-and-play freedomKids get the joy and fun of 3 different build-and-play experiences in 1 with this LEGO Creator 3in1 set. They can build a fire dragon and then rebuild it into a saber-toothed tiger with posable limbs, head and jaw, a Scorpion with posable legs and claws, or dream up something completely new. This building toy encourages imaginative play and makes a great all-occasion gift for kids.Well-known models based in fantasy and realityLEGO Creator 3in1 sets offer kids toys that are wonderfully detailed, tap into different passion points and spark imaginative play. The models offer endless building and play opportunities while helping to drive creativity in children of all ages.\nSupport kids’ imaginative role play with this exciting set, featuring 3 models in 1: A fire dragon, a saber-toothed tiger and a scorpion. It makes a great gift for kids as building and rebuilding extends the play endlessly!\nWho dares face these creatures? Kids can stretch their building skills as they fly with a fire dragon, face a saber-toothed tiger, dodge a scorpion strike or let their creativity loose and build whatever they like.\n3 building options in 1. This set develops building skills as kids make a Creator 3in1 Fire Dragon (31102), saber-toothed tiger or a scorpion. The models can be played with solo or combined with other LEGO® sets.\nFans of creative building will love this cool set. The red, blue and yellow fire dragon, stealthy saber-toothed tiger and sleek scorpion make a great Christmas, birthday or anytime gift for boys and girls aged 7 and up.\nPosable and ready for adventure! With the Fire Dragon measuring over 4” (11cm) high, 12” (32cm) long and 9” (25cm) wide, this incredible animal action toy is big enough for playing out serious fantasy stories!\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills and give them the joy of coming up with new stories all on their own.\nOpen the box and the creative play begins with building and rebuilding any 1 of the 3 model toys. Easy-to-follow instructions help make assembly a snap for kids, leading to pride in creating and loads of fun.\nGive youngsters endless possibilities to play with LEGO® Creator 3in1 sets. This cool animal building toy lets kids grow their creativity and building skills as they develop new stories with each rebuild.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it’s been that way since 1958.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces to make sure every kids’ building toy meets the highest global safety and quality standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/sunset-track-racer-31089","description":"Race to the finish line with the LEGO® Creator 3in1 31089 Sunset Track Racer. Based on a real motorsport vehicle, this cool toy car features aerodynamic bodywork with large air intakes and comes with a bright orange, white and dark blue color scheme. Other features include a rounded and tinted windshield, tinted headlamps, visible rear-mounted engine, large rear spoiler and ground-gripping tires. Lift the roof to access the cockpit or check out the low-friction, cross-axle design. With LEGO Creator 3in1 sets you get 3 different build and play experiences. Build the Sunset Track Racer and then rebuild it into an open-top Classic Race Car or a Speed Boat for even more action and adventure.\n\nEnjoy 3 building opportunities with this LEGO® Creator 3in1 set. Build the Sunset Track Racer and then rebuild for high-speed motor sport action behind the wheel of an open-top Classic Race Car or a powerful LEGO Speed Boat.\nThe Sunset Track Racer features aerodynamic bodywork with large air intakes, rounded and tinted windshield, accessible cockpit, visible rear-mounted engine, large rear spoiler and ground-gripping tires.\nCheck out the Sunset Track Racer's sporty orange, white and dark blue color scheme.\nLift the roof to access the racing car cockpit.\nScreech through tight twists and turns at high speed to win the race!\nCockpit can accommodate a minifigure with race helmet (not included).\nSunset Track Racer measures over 1” (5cm) high, 6” (16cm) long and 2” (7cm) wide.\nClassic Race Car measures over 1” (4cm) high, 5” (14cm) long and 2” (7cm) wide.\nSpeed Boat measures over 1” (4cm) high, 5” (14cm) long and 2” (7cm) wide."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/underwater-robot-31090","description":"Explore the depths of the ocean for sea treasures with the LEGO® Creator 3in1 31090 Underwater Robot, featuring highly posable joints, large transparent domed helmet, red robot eye, ballast tanks and huge feet for walking on the seabed. Remove the robot eye to transform the dome into a cockpit control center. The Underwater Robot toy also has a claw and drill at the end of its left arm and a grabber on its right. This set also includes a buildable manta ray and a small seabed build with a sea plant and golden nugget elements. With LEGO Creator 3in1 sets you get 3 different build and play experiences. Build the Underwater Robot and then rebuild it to create a toy Submarine or an Underwater Crane treasure hunt center for more deep-sea action and adventure.\n\nEnjoy 3 building opportunities with this LEGO® Creator 3in1 set. Build the Underwater Robot and manta ray, then rebuild to create a toy Submarine with a manipulator arm, or an Underwater Crane treasure hunt center.\nThe Underwater Robot features highly flexible joints, viewing dome with red robot eye, mechanical-style hands with drill, claw and grabber, ballast tanks and large robot feet for traversing the seabed, plus a buildable manta ray and a small seabed build with a sea plant and golden nugget elements.\nThe Underwater Robot comes with a yellow, gray, black and red color scheme.\nOpen the Robot’s helmet and remove the robot eye to reveal a control console.\nMove the Robot’s head, arms and legs to create cool action poses.\nVenture to the depths of the ocean in search of underwater treasure with this futuristic robot, but watch out for the spiky-tailed manta ray!\nUnderwater Robot stands over 5” (14cm) high.\nManta ray measures over 1” (3cm) high, 2” (6cm) long and 2” (7cm) wide.\nToy Submarine measures over 3” (9cm) high, 6” (17cm) long and 5” (13cm) wide.\nUnderwater Crane measures over 4” (12cm) high, 5” (13cm) long and 7” (18cm) wide."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/deep-sea-creatures-31088","description":"Enjoy sea life adventures with the LEGO® Creator 3in1 31088 Deep Sea Creatures set, featuring a scary shark toy with a realistic dark-blue and white color scheme, opening mouth full of pointy teeth, moving fins, movable body joints and reflective eyes, plus a posable crab with a box of treasure. With LEGO Creator 3in1 play sets you get 3 different build and play experiences. Build the Shark and crab toys, and then rebuild them to create a posable Squid or a wide-mouthed Angler Fish for even more deep sea fun.\n\nEnjoy 3 building opportunities with this LEGO® Creator 3in1 set. Build the shark with crab and treasure, and then rebuild to create a flexible Squid or a giant-mouthed Angler Fish.\nThe Deep Sea Creatures set features a scary shark with an opening mouth, pointy teeth, posable fins, movable body joints and reflective eyes, plus a posable crab with a box of treasure.\nCheck out the Shark's cool dark-blue and white color scheme!\nOpen the Shark's mouth to reveal its scary, pointy teeth.\nHelp protect the cute crab and its box of treasure.\nEnjoy an additional build with this set. Building instructions for a whale – available at LEGO.com.\nShark measures over 3” (8cm) high, 8” (21cm) long and 3” (9cm) wide.\nCrab measures over 1” (3cm) long and 4” (11cm) wide.\nSquid measures over 1” (4cm) high, 7” (18cm) long and 8” (22cm) wide.\nAngler Fish measures over 1” (5cm) high, 5” (14cm) long and 3” (8cm) wide."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/mighty-dinosaurs-31058","description":"Have fun with the awesome T. rex, featuring a dark-green and beige color scheme, bright orange eyes, posable joints and head, large claws and an opening mouth with pointed teeth. Also includes the dinosaur’s prey in the form of a buildable rib cage. Rebuild this 3-in-1 LEGO® Creator Mighty Dinosaurs model to create a Triceratops or a Pterodactyl.\n\nFeatures a 3-in-1 T. rex with bright orange eyes, posable joints and head, large claws and an opening mouth with pointed teeth. Also includes the dinosaur’s prey in the form of a buildable rib cage.\nCheck out the authentic dark-green and beige color scheme.\nStomp through the streets with the scary T. rex.\nPose the T. rex’s arms, legs, tail and head, and open its mouth to reveal ferocious teeth.\nRebuild to create other Mighty Dinosaurs.\nThis set includes over 170 pieces and offers an age-appropriate build and play experience for ages 7-12.\n3-in-1 model: rebuilds into a Triceratops or a Pterodactyl.\nT. rex measures over 4” (11cm) tall.\nTriceratops measures over 3” (9cm) tall.\nPterodactyl measures over 1” (4cm) high, 7” (18cm) long and 9” (25cm) wide."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/monster-truck-31101","description":"Inspire kids’ passion for massive vehicles with the exciting LEGO® Creator 3in1 Monster Truck (31101) buildable toy set. They will love powering over any obstacles with this green and yellow monster truck, featuring a working suspension and a small car to roll over again and again. Open-ended creativity Kids get 3 different build-and-play experiences with this LEGO Creator 3in1 set. They can build a monster truck, rebuild it into a muscle car with finish line, a dragster, or create something from their imagination. This cool building toy encourages imaginative play and makes a great any-occasion present or gift for children. Recognizable models from real life LEGO Creator 3in1 sets offer kids models that are detailed and realistic and encourage imaginative play. The models offer endless building and play opportunities while helping to spark creativity in children of all ages. The fun, inspirational sets also make great extra gifts for kids for Christmas or birthdays.\nInspire creative play with this thrilling set, featuring 3 toy models in 1, a monster truck, a muscle car with finish line and a dragster. Makes a great gift for kids. Building and rebuilding extends the play endlessly.\nWhat challenges lie ahead? Kids can grow their imaginations and building skills in new ways as they race around in a monster truck, cruise in the muscle car, set records in the dragster or build something completely new.\nThis set offers kids 3 options: A Creator 3in1 Monster Truck (31101), a muscle car or a super-fast dragster. Kids can play with this set on its own or combine it with other LEGO® sets to grow their building skills.\nAny fan of creative building will love this incredible set. The powerful monster truck, sleek race car and fun dragster toy models work as great Christmas, birthday or any-occasion gifts for boys and girls aged 7+.\nPowered up and ready for action! With the monster truck measuring over 2” (6cm) high, 3” (10cm) long and 3” (8cm) wide, this exciting toy is big enough for real excitement while being small enough to take on the go.\nDriven by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills and give them the joy of imagining new stories all on their own.\nThe fun starts when the box opens. Children can build and rebuild any 1 of the 3 model toys as the easy-to-follow instructions help make assembly a snap, leading to pride in creating and loads of imaginative fun.\nGive children the freedom to develop their building and creative skills as they play with LEGO® Creator 3in1 sets. This exciting vehicle playset lets kids grow their imagination with loads of building opportunities.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it's been that way since 1958.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces to make sure every kids’ building toy meets the highest global safety and quality standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/propeller-plane-31099","description":"Inspire kids’ creativity and love of play with the exciting LEGO® Creator 3in1 Propeller Plane (31099) set. Kids will love to make cool takeoffs and landings with this colorful plane, featuring a spinning propeller and adjustable wing tips. Creative freedom Kids get 3 different build-and-play experiences with this LEGO Creator 3in1 set. They can build a propeller plane and then rebuild it into a jet plane or a toy helicopter with landing pad. Then they can let their creativity loose and build something completely new. This great building toy taps into different passions with its 3in1 building options and makes a great gift for all occasions. Iconic, stand-alone models LEGO Creator 3in1 sets offer kids models that are detailed and realistic and encourage imaginative play. The models give endless building and play opportunities while helping to spark creativity in children of all ages. The fun, inspirational sets also make great little Christmas gifts or birthday presents for kids.\nEncourage creative role play with this set featuring 3 models in 1, a propeller plane, jet plane and helicopter with landing pad. Makes a great any-occasion gift. Building and rebuilding extends the play endlessly!\nWhat adventure awaits in the air? Kids can stretch their creativity and building skills as they race around in a propeller plane, cruise in a powerful jet plane, zip around in a toy helicopter or create something new.\nThis set gives kids 3 options in each box: A Creator 3in1 Propeller Plane (31099), jet plane or helicopter, which can be played with on its own or with other LEGO® sets. Kids can grow their building skills and have fun.\nAny fan of creative building will love this awesome set. The classic Propeller Plane, sleek jet plane and fun helicopter models work as a great Christmas, birthday or anytime gift for boys and girls aged 6+.\nReady for action? The propeller plane measures over 2” (7cm) high, 5” (14cm) long and 7” (18cm) wide, meaning this exciting action toy is big enough for serious adventures while being small enough to take on the move!\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills, plus it gives them the joy of coming up with new stories all on their own.\nOpen the box and the play begins with building and rebuilding any 1 of the 3 model toys. Easy-to-follow instructions help make assembly a snap for kids, leading to pride in construction and loads of creative fun.\nGive children endless possibilities to develop their building skills as they play with LEGO® Creator 3in1 sets. This cool aircraft playset lets kids grow their creativity and imagination with lots of building opportunities.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it’s been that way since 1958.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces to make sure every kids’ building toy meets the highest global safety and quality standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/sports-car-31100","description":"Drive kids’ love of vehicles and creativity with the exciting LEGO® Creator 3in1 Sports Car (31100) toy set. Kids will love racing around with this red and black sports car, featuring a center motor, intake pipe and a spoiler on the back.Fun and creative freedom to buildKids get 3 different build-and-play experiences with this LEGO Creator 3in1 set. They can build a sports car, rebuild it into a hot rod with motor and intake pipe, make an old-time plane, or create something completely new. Thisawesome building toy encourages imaginative play and makes a great treat or reward. Both the sports car and hot rod have room for a minifigure in the cab.Stand-alone models to build, play and rebuildLEGO Creator 3in1 sets offer kids fun models that are detailed and realistic and encourage imaginative play. The models create endless building and play opportunities while sparking creativity in children of all ages. These small and inspirational sets also make great any-occasion gifts.\nDrive creative role play with this exciting toy set, featuring 3 models in 1: A sports car, hot rod and an old-fashioned plane. Makes a great gift for kids. Building and rebuilding extends the play endlessly!\nWhat fun waits behind the wheel? Kids can stretch their imaginations and creative skills as they cruise in a sports car, set new speed records in a hot rod, take a flight in an old-fashioned plane or build something new.\nThis set gives kids 3 options in each box: They can make a Creator 3in1 Sports Car (31100), hot rod or old-style plane. Kids can play with the set solo or combine it with other LEGO® sets to grow their building skills.\nAny fan of creative building will love this awesome set. The sports car with intake valve and spoiler, thrilling hot rod and fun plane models work as a great anytime gift for boys and girls aged 6+.\nDetailed and ready for action. With the sports car measuring over 1” (4cm) high, 4” (12cm) long and 2” (7cm) wide, this exciting toy is small enough to take on the go and big enough to hold a minifigure (not included).\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills and give them the joy of coming up with new stories all by themselves.\nEasy-to-follow instructions help make assembly a snap for kids, leading to pride in construction and loads of creative fun. Open the box and the play begins with building and rebuilding any 1 of the 3 toy models.\nGive children endless possibilities to develop their building skills as they play with LEGO® Creator 3in1 sets. This cool vehicle playset lets kids grow their creativity and imaginations with building opportunities.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it’s been that way since 1958.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces to make sure every kids’ building toy meets the highest global safety and quality standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/tuk-tuk-40469","description":"Have fun on the bustling streets of India with this detailed and brightly colored Tuk Tuk (40469) toy car. It features a host of realistic details including front and back seats, hanging decorations, a fire extinguisher and Indian-style lunchboxes in a pallet on the roof, so kids have all they need to create fantastic stories. A cool gift for kids aged 7 and up who enjoy playing out exciting scenes with car toys.\nKids will enjoy creating fun adventures with this colorful LEGO® Creator Tuk Tuk buildable car, featuring front and back seats, hanging decorations and Indian-style lunchboxes in a pallet on the roof.\nLEGO® fans aged 7 and up who love building and playing with car toys can use the Tuk Tuk to stage stories on their own or add it to other LEGO playsets in their collections for more fun.\nThe Tuk Tuk measures over 3 in. (9 cm) high, 2 in. (6 cm) long and 3 in. (10 cm) wide – just the right size to play with at home or to slip into a bag for fun on the go."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/riverside-houseboat-31093","description":"Set sail aboard the cozy LEGO® Creator 3in1 31093 Riverside Houseboat. This quirky boathouse model comes with an array of fun features, including a detailed deck area with a revolving chair, workbench and a mounted fishing rod. It also opens to allow easy access to a detailed cabin interior with a chair, bed, TV, lamp and kitchen. With Creator 3in1 sets you get 3 different build and play experiences. Build this toy boat and then rebuild it into a classic Seaplane model or enjoy waterside adventures at a Fishing Village with pier, café and fishing boat. The Houseboat includes 2 minifigures ready for adventure, plus brick-built bird, pelican and crocodile figures.\n\nEnjoy 3 building opportunities with this LEGO® Creator 3in1 set. Build the Riverside Houseboat and then rebuild to create a Seaplane with a dock and crab or a Fishing Village with a pier, café and fishing boat.\nThe Riverside Houseboat features a detailed cabin with a chair, bed, TV, lamp and kitchen area, plus a detailed deck area with 2 awnings, a revolving chair, workbench, mounted fishing rod and 4 lamps.\nIncludes 2 minifigures: a fisherman and a girl, both ready for adventure, plus brick-built bird, pelican and crocodile figures.\nSet sail for fun and adventure aboard the Riverside Houseboat with exotic LEGO® animals!\nAccessory elements include a camera, 3 life rings and 2 fish.\nRiverside Houseboat measures over 3” (10cm) high, 6” (17cm) long and 3” (8cm) wide.\nSeaplane measures over 3” (10cm) high, 6” (17cm) long and 3” (8cm) wide.\nFishing Village measures over 4” (12cm) high, 10” (27cm) wide and 6” (17cm) deep.\nToy boat measures over 2” (7cm) high, 6” (17cm) long and 2” (6cm) wide."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/twin-rotor-helicopter-31096","description":"Prepare for fast-moving air and sea adventures with the LEGO® Creator 3in1 31096 Twin Rotor Helicopter, featuring huge synchronized rotors with super-realistic functionality, plus a tinted cockpit with 2 seats, sliding side door and an opening rear cargo bay. Turn the gear wheel to spin the rotors and use the working winch to deliver the included ROV submarine. With LEGO Creator 3in1 playsets children get 3 different creative play experiences. Build the Twin Rotor Helicopter and then rebuild it into a toy Jet or a Hovercraft toy for more high-speed action. Includes a pilot minifigure, ready for adventure.\n\nEnjoy 3 building opportunities with this LEGO® Creator 3in1 set. Build the Twin Rotor Helicopter and then rebuild it into a Jet or Hovercraft toy for more fast-moving adventures.\nThe Twin Rotor Helicopter features large synchronized rotors, tinted cockpit with 2 seats, opening side and rear cargo bay doors and a working winch, plus an ROV submarine that fits into the cargo bay.\nTurn the gear wheel to spin the helicopter's huge synchronized rotors.\nOpen the helicopter's rear cargo bay door and load up the included ROV submarine.\nSlide open the helicopter’s side door and turn the gear wheel to operate the working winch.\nCheck out the helicopter’s cool orange, blue, white, black and gray color scheme.\nIncludes a pilot minifigure, ready for adventure.\nTwin Rotor Helicopter toy measures over 6” (17cm) high, 14” (37cm) long and 12” (33cm) wide.\nJet toy measures over 3” (8cm) high, 10” (26cm) long and 10” (27cm) wide.\nHovercraft toy measures over 3” (9cm) high, 7” (20cm) long and 3” (8cm) wide."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/fairground-carousel-31095","description":"Create a world of magical fairground adventures with this LEGO® Creator 3in1 31095 Fairground Carousel playset, featuring a space-themed carousel model with UFO signage, plus a ticket stall, ice cream cart and park bench. Kids can choose between 4 suspended carriages, including a rocket, space shuttle, alien craft and a funny spotted cow, and then turn the red handle to see them rise into the air as the Carousel spins. With this LEGO Creator 3in1 toy construction set children can build and play with 3 different carnival rides. You can build the Carousel and then rebuild it into a Free Fall Ride or LEGO Ferris Wheel toy. Includes 3 minifigures, all ready for fun at the fair.\n\nEnjoy 3 building opportunities with this LEGO® Creator 3in1 playset. Build the Carousel and then rebuild it for more fairground fun aboard the Free Fall Ride or wonderful Ferris Wheel.\nThe Fairground Carousel LEGO® set features a space-themed merry-go-round with UFO signage and 4 suspended carriages: a rocket, space shuttle, alien craft and spotted cow.\nThis construction toy also includes a brick-built ticket stall, park bench and an ice cream cart with buildable ice creams.\nTurn the red handle and see the carriages rise into the air as the Carousel spins!\nIncludes 3 minifigures: 1 boy and 2 girls, all ready for the fun of the fair.\nCheck out the cool UFO sign complete with flying saucer and alien pilot.\nFairground Carousel measures over 7” (20cm) high, 11” (29cm) wide and 7” (18cm) deep.\nFree Fall Ride measures over 10” (26cm) high, 4” (12cm) wide and 3” (9cm) deep.\nFerris Wheel measures over 6” (16cm) high, 5” (14cm) wide and 4” (12cm) deep."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/outback-cabin-31098","description":"Head for the wild yonder with the LEGO® Creator 3in1 31098 Outback Cabin playset. Kids can play out their own outback adventures with this fun model, featuring a log cabin with a waterside terrace, kayak and campfire, plus brick-built eagle and wolf animal figurines. Fold out the cabin to access the interior, complete with wall clock, radio and a cozy attic bedroom. With 3in1 LEGO Creator sets children get 3 different build and play experiences. Build the Outback Cabin and then rebuild it into Bird Watching Viewpoint with a secret hideout or a Canal Boat with a well-equipped galley. Includes 2 minifigures, ready for adventure.\n\nEnjoy 3 building opportunities with this 3in1 LEGO® Creator set. Build the Outback Cabin and then rebuild to create a Bird Watching Viewpoint with a secret hideout or a Canal Boat with a well-equipped galley.\nThe Outback Cabin features a toy cabin with a waterside terrace, plus a kayak and campfire.\nCabin interior features a wall clock, radio and a cozy attic bedroom.\nIncludes 2 minifigures, ready for outback adventures, plus brick-built eagle and wolf animal figurines.\nTry a spot of fishing from the log cabin’s waterside terrace, ride the kayak and roast chicken on the campfire, but watch out for the hungry wolf and eagle!\nContinue the outdoor LEGO® adventures with this 3in1 set. Rebuild the Outback Cabin to create a Bird Watching Viewpoint or a Canal Boat.\nOutback Cabin measures over 4” (11cm) high, 5” (14cm) wide and 3” (8cm) deep.\nBird Watching Viewpoint measures over 8” (13cm) high, 3” (9cm) wide and 3” (8cm) deep.\nCanal Boat measures over 3” (9cm) high, 7” (18cm) long and 3” (8cm) wide."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/race-plane-31094","description":"Enjoy vintage flying adventures with the classically designed LEGO® Creator 3in1 31094 Race Plane, featuring a blue, white, yellow and red color scheme with cool racing stickers, visible detailed engine with pipes and cylinders, fixed landing gear, large aircraft propeller, sporty hinged wings and adjustable tail elevators. This impressive toy airplane also features an opening cockpit and comes with a pilot minifigure, complete with a printed flight suit and a helmet. With LEGO Creator 3in1 sets you get 3 different build and play experiences. Build this propeller plane toy and then rebuild it to create a toy helicopter or a toy jet for more aerial action and adventure.\n\nEnjoy 3 building opportunities with this LEGO® Creator 3in1 set. Build the Race Plane and then rebuild for more aerial action with a powerful Helicopter or a fast Jet with rotating thrusters.\nThe Race Plane features a visible engine with pipes and cylinders, fixed landing gear, large spinnable aircraft propeller, hinged wings, opening cockpit and adjustable tail elevators, plus 2 race pylons with flags.\nCheck out the Race Plane's awesome blue, white, yellow and red color scheme with cool racing stickers.\nIncludes a pilot minifigure with printed flight suit and a helmet.\nOpen the tinted canopy to access the aircraft cockpit, adjust the tail elevators and spin the propeller.\nTake to the sky, then swoop and zoom between the race pylons at high speed!\nRace Plane measures over 3” (10cm) high, 9” (23cm) long and 10” (26cm) wide.\nHelicopter measures over 4” (11cm) high, 7” (19cm) long and 3” (8cm) wide.\nJet measures over 3” (10cm) high, 8” (22cm) long and 9” (24cm) wide."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/treehouse-treasures-31078","description":"Enjoy imaginative pirate adventures with this LEGO® Creator 3in1 31078 Treehouse Treasures set, featuring a 3-level pirate ship treehouse with a ship deck, ship’s wheel, treasure chest hideaway function, bowsprit with flag and teddy bear, crow’s nest, tire swing and an upper-level den. Pirate accessories include a hat, telescope and 2 swords. This 3in1 model rebuilds into a Pirate Ship or a Skull Cave for more pirating fun, and includes 2 minifigures rigged out for pirate adventures, plus a scary spider figure.\n\nIncludes 2 minifigures: a girl and a boy rigged out for pirate adventures, plus spider and teddy bear figures.\nFeatures a buildable pirate ship treehouse with a ship’s deck, ship’s wheel, treasure chest with hideaway function, bowsprit with flag, crow's nest, tire swing and an upper-level den.\nGrab your sword and pirate hat and head to the treehouse for pirate ship adventures.\nTake the ship's wheel or grab your map and telescope and climb to the crow's nest for a bird's eye view.\nStow your treasure chest in the hideout, but watch out for the spider!\nContinue the adventure with this LEGO® Creator 3in1 model. Rebuild and take to the high seas on a Pirate Ship or search for the treasure at a Skull Cave with glowing eyes.\nTreehouse measures 7” (20cm) high, 5” (14cm) wide and 7” (19cm) deep.\nPirate Ship measures 4” (11cm) high, 8” (22cm) wide and 2” (7cm) deep.\nSkull Cave measures 3” (10cm) high, 6” (16cm) wide and 4” (12cm) deep."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/rocket-truck-31103","description":"Power young vehicle fans’ imaginations with the LEGO® Creator 3in1 Rocket Truck (31103) toy set. Kids will love pushing limits with this building kit, featuring a green and white pickup truck with a rocket engine on the back, an intake pipe and an adjustable spoiler. Loads of imaginative excitement and action Kids get 3 different build-and-play experiences with this LEGO Creator 3in1 set. They can make a rocket truck, rebuild it into an off-roader or quad bike, or let their creativity loose and build something new. The rocket truck and off-roader have room for a minifigure (not included) in the cab. This great building toy drives imaginative play and makes a safe choice for an any-occasion gift. Iconic, realistic action models LEGO Creator 3in1 sets offer kids models that are detailed and realistic. The models offer endless building and play opportunities while helping to spark creativity in children of all ages. The fun, action-filled sets also make great Christmas or birthdays gifts.\nInspire creative role play with this exciting toy set, featuring 3 models in 1: A rocket truck, off-roader and quad bike. It makes a great gift for kids, while building and rebuilding extends the play endlessly.\nAdventure awaits! Kids can stretch their building skills in new ways as they break the sound barrier in a toy Creator 3in1 Rocket Truck (31103), rock crawl in an off-roader, race on a quad bike or build whatever they like.\nThis set offers 3 building options in 1, so kids can create toy vehicles that can be played with alone or as part of LEGO® sets they already have. Kids enhance their building and creativity skills every time they play.\nFans of cool vehicles and creative building will love this awesome set. The jet engine-driven rocket truck, beefy off-roader and fast quad bike models work as a great all-occasion gift for boys and girls aged 7+.\nDetailed and built for action. With the rocket truck measuring over 3” (8cm) high, 8” (22cm) long and 2” (7cm) wide, this great toy is small enough to take on the go, yet big enough to fit a minifigure (not included).\nCharged by a child’s creative play for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills and give them the joy of coming up with new stories all on their own.\nPlay begins when the box opens as kids build and rebuild any 1 of the 3 model toys or create their own. Easy-to-follow instructions help make assembly a snap, leading to lots of fun and pride in construction.\nInspire endless possibilities for youngsters to play with LEGO® Creator 3in1 sets. This fun truck playset gives kids chances to flex their creativity and imaginations as they develop new stories with every rebuilding.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it’s been that way since 1958.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces to make sure every kids’ building toy meets the highest global safety and quality standards."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/futuristic-flyer-31086","description":"Get set for supersonic fun with the LEGO® Creator 3in1 31086 Futuristic Flyer, featuring an awesome dark red and white color scheme, forward swept wings, tinted cockpit, fixed landing gear and a flaming jet engine. With this LEGO Creator 3in1 set you get 3 different build and play experiences. Build the Futuristic Flyer and then rebuild it into a Futuristic Spaceship toy or a Futuristic LEGO Robot with wings and backpack for more sci-fi fun.\n\nEnjoy 3 building opportunities with this LEGO® Creator 3in1 set. Build the Futuristic Flyer, then rebuild and head into space with a Futuristic Spaceship or enjoy sci-fi adventures with a flying Futuristic Robot.\nThe Futuristic Flyer features forward swept wings, a tinted cockpit, fixed landing gear and a flaming jet engine.\nCheck out the futuristic flyer's dark red and white color scheme.\nTake control of this awesome plane and head for the skies for supersonic jet adventures.\nFuturistic Flyer measures over 2” (7cm) high, 7” (20cm) long and 8” (22cm) wide.\nFuturistic Spaceship measures over 1” (4cm) high, 6” (17cm) long and 5” (14cm) wide.\nFuturistic Robot stands over 3” (10cm) high."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/dune-buggy-31087","description":"Race over rough terrain with the tough LEGO® Creator 31087 Dune Buggy, featuring a colorful, sporty design with chunky tires, front spot lamps, visible rear-mounted engine with air intake, large rear spoiler and exhaust, and a detailed cockpit with a red driving seat, steering wheel and opening roll cage. With LEGO Creator 3in1 sets you get 3 different build and play experiences. Build the toy Dune Buggy and then rebuild it into a toy plane or a tough toy Quad Bike for even more high-speed action and adventure.\n\nEnjoy 3 building opportunities with this LEGO® Creator 3in1 set. Build the Dune Buggy and then rebuild for aerial action aboard a fast Plane, or take on rugged terrain with a tough Quad Bike.\nThe Dune Buggy features a colorful, sporty design with chunky tires, front spot lamps, visible rear-mounted engine with air intake, large rear spoiler and exhaust, and a detailed cockpit with a red driving seat, steering wheel and opening roll cage.\nCheck out the Dune Buggy's sporty blue, white and yellow color scheme.\nRace and tumble over the terrain with the cool Dune Buggy!\nDune Buggy measures over 2” (7cm) high, 5” (13cm) long and 3” (8cm) wide.\nPlane measures over 2” (6cm) high, 5” (13cm) long and 5” (14cm) wide.\nQuad Bike measures over 1” (5cm) high, 3” (8cm) long and 2” (6cm) wide."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/helicopter-adventure-31092","description":"Get set for fast-moving action with the LEGO® Creator 3in1 31092 Helicopter Adventure set, featuring a hi-tech helicopter with a fresh green, yellow and black color scheme, tinted cockpit, large engines, adjustable landing gear and a spinning rotor. With LEGO Creator 3in1 sets you get 3 different build and play experiences. Build the toy helicopter and then rebuild it into a Power Boat or a Glider Plane for more high-speed fun.\n\nEnjoy 3 building opportunities with this LEGO® Creator 3in1 set. Build the Helicopter Adventure model and then rebuild into a Power Boat or a Glider Plane for more high-speed fun.\nThe Helicopter Adventure features a high-tech helicopter with a tinted cockpit, large engines, adjustable landing gear and spinning rotor.\nCheck out the helicopter's fresh green, yellow and black color scheme.\nTake control and head to the skies for Helicopter Adventures!\nHelicopter measures over 2” (7cm) high, 7” (19cm) long and 4” (12cm) wide.\nPower Boat measures over 1” (4cm) high, 4” (11cm) long and 1” (5cm) wide.\nGlider plane toy measures over 1” (5cm) high, 5” (15cm) long and 5” (15cm) wide."},{"theme":"creator-3-in-1","themeUrl":"https://www.lego.com/en-us/themes/creator-3-in-1","productUrl":"https://www.lego.com/en-us/product/cute-pug-30542","description":"Meet the Cute Pug, with its big round eyes and red tongue, investigating a fire hydrant. This 3-in-1 model has posable limbs and rebuilds into a Koala Bear or a Turkey."}]