[{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/colosseum-10276","description":"Nowhere on Earth compares to the majesty of the Colosseum of Rome. So, get ready to escape your everyday life as you take on the biggest ever LEGO® build (as at November 2020) yet. This epic 9,036-piece Colosseum model depicts each part of the famous structure in great detail. Authentic detailing shows the northern part of the outer wall’s facade and its iconic arches. The model features 3 stories, adorned with columns of the Doric, Ionic and Corinthian orders while the attic is decorated with Corinthian pilasters.\n\nAn awe-inspiring display piece\nThe LEGO Colosseum (10276) rests on an oval display base so the model can be seen from every aspect. It’s one of the biggest LEGO models ever but can easily be picked up, allowing you to look through the arches from all angles.\n\nA building project to savor\nThe Colosseum is part of a collection of LEGO models for adults who love beautiful architecture and thoughtful design. It also makes a great gift for architecture enthusiasts and LEGO lovers.\n\nBring to life your own brick-built model of the mighty Colosseum with this engaging and rewarding LEGO® Colosseum (10276) model kit for adults.\nWith an astounding 9,036 pieces, this Colosseum model is the biggest LEGO® set ever (as at November 2020), providing hours of relaxation for adults who love building sets.\nAnyone with a passion for architecture models will appreciate the amazing detail packed into this Colosseum souvenir. With 3 stories, the model is adorned with columns of the Doric, Ionic and Corinthian orders.\nIf you’re looking for special gifts for architecture fans or history lovers, this building set is a great choice, providing hours of hands-on building experiences with a stunning Colosseum model to display.\nThis Colosseum architecture model measures over 10.5” (27cm) high, 20.5” (52cm) wide and 23.5” (59cm) deep. With 9,036 pieces it’s one of the biggest LEGO® sets in the world, but is easy to lift and turn.\nThe Romans didn’t need batteries and neither do you! This Colosseum model runs on the power of imagination – no batteries required.\nThis model comes with coffee-table-style building instructions with design and history details to inspire you.\nPart of a series of inspiring LEGO® building sets designed for LEGO building fans, and hobbyists who love elegant design, beautiful architecture and models packed with detail.\nLEGO® building bricks meet the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time – it’s been that way since 1958.\nLEGO® bricks and pieces are rigorously tested to ensure that every building set meets the highest safety and quality standards, so you can be sure that this architectural model is designed to last."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/police-station-10278","description":"Escape into a delicious world of deceit, detection and donuts with this LEGO® Police Station (10278) model. Enjoy hours of immersive building as you create the three-floor police station. See the brick-built staircase wind through detailed floors that can be removed to let you explore inside. Next door is a donut shop brimming with treats and, to the other side, a newspaper kiosk.\n\nCriminally good details\nThis impressive set is packed with hidden features and clever design. With an evidence locker, jail cell, interrogation room and case board, complete with red lines connecting the clues, the police have all they need to solve the mystery. There are also a number of novel pieces within the set to appeal to adult LEGO fans.\n\nA building project for you\nThe LEGO Police Station is part of the imaginative Modular Buildings Collection. Whether you’re building alone or with family, this is a challenge to focus the mind and an eye-catching display piece to enjoy alongside other LEGO Modular Buildings.\n\nPacked with clever design features and unexpected surprises, this LEGO® Police Station (10278) model building kit is the perfect set for adults looking for a mindful project.\nDiscover stylish features with crime-busting details, including a case board with authentic red lines connecting the clues, reel-to-reel recorder, jail cell, evidence locker and more.\nWith 2,923 pieces and 5 minifigures, including a 1940s-era police officer, there’s lots to discover. Printed tiles like the billboard, telephone and typewriter bring the detailed scenes to life.\nIdeal for true-crime fans and LEGO® lovers alike, this building kit gives hours of enjoyment and a creative experience that will appeal to adults.\nAdult LEGO® fans will love the novel pieces in this set, including 2 pieces in ultra-rare nougat color, 4 blank animal-head pieces used for the cornice detail and an inverted 2-color arch.\nMeasures over 14.5 in. (37 cm) high (including antennae), 10 in. (25 cm) wide and 10 in. (25 cm) deep.\nAs well as being a step-by-step guide to building the model, the coffee-table-style instructions include inspirational design details.\nThis police station set is part of the Modular Buildings Collection of creative building sets designed for LEGO® building fans who love stunning design, intricate details and elegant architecture.\nLEGO® building bricks are manufactured from the highest quality materials. They’re consistent, compatible and connect and pull apart easily every time – it’s been that way since 1958.\nWith LEGO® pieces, safety and quality comes first. That’s why they’re rigorously tested so you can be sure that the model is as robust as it is beautiful."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/porsche-911-10295","description":"Celebrate the unmistakable style of Porsche with this fantastic building challenge as you create your own classic, collectible car with the LEGO® Porsche 911 (10295) model kit. Choose to build either the Turbo model with its turbocharged engine or the Targa with its iconic Targa bar and a removable roof that stores under the hood.\n\nBuild your favorite Porsche 911\nBoth the Turbo and the Targa model cars feature authentic Porsche 911 details like the iconic front and rear bumpers, angled headlights, printed logo and number plates. And the interior is just as impressive with working steering, gearshift, emergency brake, tilting seats and a dark-orange-and-nougat color scheme.\n\nA building project for you\nThe LEGO Porsche 911 is part of a collection of buildable model kits for adults. From classic collectible cars to detailed buildings, these LEGO sets are the perfect way to escape everyday life with an immersive building project.\n\nEscape from the everyday with this thrilling building project. The LEGO® Porsche 911 (10295) model car building kit is the perfect set for adults looking for their next hands-on project.\nExplore all the Porsche 911 features including the rear-mounted, air-cooled flat-six engine, working steering, gearshift, emergency brake and tilting seats.\nWhich will you choose to build? The Turbo model with its turbocharged engine or the Targa with a removable roof that can be stored under the hood.\nThe Porsche 911 Turbo model car features a wide rear axle, an integrated spoiler, plus a turbocharged engine complete with intercooler.\nThe Porsche 911 Targa model car includes a removable roof that fits in the hood plus the iconic Targa bar with rear glass behind the driver.\nDesigned especially for classic car fans and Porsche enthusiasts, this advanced building kit comes with coffee-table-style instructions with inspirational design details.\nThis Porsche 911 collectible car model measures over 4 in. (10 cm) high, 13.5 in. (35 cm) long and 6 in. (16 cm) wide.\nLooking for the best gift for a classic car fan? This Porsche 911 collectible buildable model kit is a great choice. It’s designed especially for adult LEGO® fans who appreciate stunning design.\nLEGO® building bricks are manufactured from high quality materials. They’re consistent, compatible and connect and pull apart easily every time – it’s been that way since 1958.\nWith LEGO® pieces, safety and quality come first. That’s why they’re rigorously tested so you can be sure that the model is as robust as it is beautiful."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/roller-coaster-10261","description":"Capture the speed, thrills and excitement of the ultimate fairground attraction with this incredible LEGO® Creator Expert 10261 Roller Coaster. This fully functional chain-lift model comes with 2 trains and an array of authentic features and functions, including a ticket booth, cotton candy cart, concession stand, height marker, and a covered boarding station complete with opening barriers and a control panel. Lower the lap bars to secure the riders into the cars and release the brake to send the train to the foot of the first climb. Then activate the chain lift and enjoy the ride as the gravity-driven cars hurtle through the Roller Coaster’s twists and turns. Upgrade the Roller Coaster with LEGO Power functions for a motorized chain lift or LEGO BOOST for an added movement sensor and realistic sound effects! This incredible collectible toy has been designed to provide a challenging and rewarding building experience with a touch of nostalgia and charm. Includes 11 minifigures.\n\nIncludes 11 minifigures: a cotton candy vendor, 2 ride attendants, 2 grandparents with their granddaughter and 5 riders. 8 of these minifigures feature reversible heads to display different emotions.\nFully functional chain-lift Roller Coaster model features a classic brick-built sign, control panel, 2 trains—each consisting of 3 train cars with low-friction wheels, and a 44-piece track consisting of 7 different rail elements.\nAlso features a ticket booth, fountain, cotton candy cart, concession stand, waiting area with bench, camera element and a pond with a frog figure.\nBuy your ticket at the booth and make your way to the covered plaza.\nNo cheating at the height marker—the ride attendant has an accurate measuring stick!\nHelp the riders into the cars and secure the lap bars.\nRelease the brake to send the cars to the foot of the first climb.\nActivate the chain lift to pull the train cars to the top of the first drop.\nMove the rails to launch a second train.\nServe refreshing beverages at the concession stand or spin some cotton candy.\nDon’t forget to smile as you race past the camera!\nUpgrade the Roller Coaster with LEGO® Power Functions for a motorized chain lift, or with LEGO BOOST for automated chain lift activation and realistic sound effects!\nThis amazing set includes over 4,120 pieces.\nDecorated elements include a ticket, money, arrow tiles, pressure gauge, number pad and a ride control panel.\nSpecial new-for-June-2018 elements include a 2x8x6 Rail Slope, 1x2x1 Bow Brick, plant leaves, stalks and flowers.\nOther elements include a height checker and 2 cotton candy treats.\nMakes the perfect fairground addition to the 10257 LEGO® Creator Expert Carousel.\nMotorize the Roller Coaster with the LEGO® Power Functions 8883 medium motor and 88000 AAA battery box (not included).\nMeasures over 20” (53cm) high, 34” (88cm) wide and 16” (41cm) deep."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/old-trafford-manchester-united-10272","description":"Manchester United fans will love building this big LEGO® set model of Old Trafford (10272) to show their allegiance to one of the world’s most famous football clubs. The building set for this LEGO football stadium provides a fun challenge to create a spectacular showpiece model.\n\nThe ultimate Manchester United gift\nManchester United fans can show off this Old Trafford replica at home or the office. New for February 2020, this LEGO® Creator sports set coincides with the stadium's 110th anniversary. This building kit for adults features several evocative details including the players’ tunnel and the statue of the United Trinity.\n\nBring to life your passions with advanced LEGO® sets!\nLEGO® Creator Expert advanced building sets allow adults to construct models based on some of their biggest passions, including cars, buildings and stadiums. Once the challenging and fun building experience is complete, these collector models from building bricks make an eye-catching display at home orthe office.\n\nA spectacular building set for adults to create a detailed model of Old Trafford. The perfect Manchester United gift for fans who want to show their undying support by displaying this LEGO® football stadium.\nA building kit of a 1:600 replica model of Old Trafford. This LEGO® football stadium provides a fun and rewarding project and allows fans to relive their cherished memories of Manchester United with this detailed model.\nThe first opportunity to construct a replica of Manchester United's Old Trafford from building bricks. The LEGO® Football stadium makes for a stunning showpiece at home or the office.\nThis 3,898-piece big LEGO® football set for adults makes for a unique Manchester United gift. It offers escapism for builders with a long and satisfying project, and the chance to show their passion for their club.\nThe Old Trafford-Manchester United LEGO football stadium measures 6.5” (18.5cm) high, 18” (47cm) long and 15” (39cm) wide. The perfect size to feature authentic details including the players’ tunnel and a statue of Sir Alex Ferguson.\nNo batteries required for this advanced building set, so the final whistle will never blow at this LEGO® football stadium.\nThis LEGO® set provides the ultimate building experience, and for you to be guided through the rewarding process with easy-to-follow, step-by-step instructions.\nLEGO® Creator Expert model advanced building sets allow adults to indulge in challenging projects to create collector toys based onsome of their biggest passions including cars, buildings and stadiums.\nLEGO® building bricks have met the highest industry standards for over 60 years, ensuring they are always consistent, compatible and pull apart with ease every time.\nYou know you are safe with LEGO® bricks. Our bricks and pieces have been relentlessly tested and meet the highest global safety and quality standards."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/haunted-house-10273","description":"If you love ghosts, ghouls and things that go bump in the night, we’ve got a treat for you – the LEGO® Haunted House (10273). Take time out of everyday life and explore something extraordinary as you discover the thrills and surprises packed into this stunning building project.\n\nSpookily good details bring the story to life\nTake your time building this impressive haunted house model, before exploring all the intricate details hidden within. The house opens up, making it easy to explore inside where you’ll discover a working free-fall ride plus automatic doors at the top of the tower. See the haunted front doors close for a spooky effect. Add the LEGO Powered Up components (available separately) to control the elevator via the Powered Up app.\n\nA building project that’s full of thrills\nThis Haunted House is part of a collection of LEGO building kits for adults who appreciate clever design. This model also makes a scarily good gift, birthday present or Christmas gift.\n\nWe have introduced new packaging for adult builders to make it easier to find products related to their interests and passions. Be it sports, film, art, vehicles, landmark buildings or fairground icons, LEGO sets bring these to life in brick form. With the new packaging clearly showcasing which interest each product relates to, we took the decision to discontinue Creator Expert branding. While the brand won’t be featured on future packaging and in communication, our product range will continue to include the same advanced-build, collectible sets, guaranteeing hours of building enjoyment.\n\nThis creepy LEGO® Haunted House (10273) model provides hours of enjoyment for anyone looking to unwind with a new project. Build the spooky horror house then explore its impressive features and delightful details.\nWhy should kids get all the fun when it comes to scary toys? This building kit is designed for adults but it includes lots of playful features, such as a free-fall ride, haunted doors and a cursed painting.\nIf you appreciate beautiful details, you’ll love displaying your haunted house model. Upgrade the Haunted House with the LEGO® Powered Up components (available separately) to control the elevator via the app.\nIdeal for ghost hunters, thrill seekers and adult LEGO® fans alike, this Haunted House set makes a great birthday gift for your ghost-loving mum, dad, husband, wife, partner or friend and also makes a fun Halloween gift.\nThis dark and spooky haunted manor measures over 26.5” (68cm) high, 9” (25cm) wide and 9” (25cm) deep, making it a challenging construction kit for adults and a great brick-built model to display.\nA battery is included with the light brick in this set, so you can enjoy the illumination right away. To motorize your model, add 1 x 88009 and 2 x 88008 Powered Up components (sold separately).\nThis set comes with coffee-table-style building instructions to guide and inspire you.\nPart of a series of inspiring LEGO® construction kits for adults, designed for LEGO building fans and hobbyists who love beautiful design and elegant LEGO models.\nLEGO® building bricks meet the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time – it’s been that way since 1958.\nLEGO® bricks and pieces are rigorously tested to ensure that every building set meets the highest safety and quality standards, so you can be sure that this model is designed to last."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/ghostbusters-ecto-1-10274","description":"If you’re a Ghostbusters™ fan, we’ve got just the thing for you – the LEGO® Ghostbusters ECTO-1! Bust the stress out of everyday life and indulge in some quality me time as you build a LEGO version of the converted 1959 Cadillac Miller-Meteor ambulance from the Ghostbusters movies.\n\nSpookily good details\nBased on the Ghostbusters: Afterlife movie version, this ECTO-1 model features working steering, a trapdoor, ghost trap, an extending rear gunner seat, proton pack and cool details from the original car such as the iconic Ghostbusters logo.\n\nA building project for you\nYou don’t need a collection of LEGO sets to enjoy this buildable model car kit. You just need some table space and maybe some Ghostbusters tunes playing in the background. This LEGO car set is part of a collection of inspiring LEGO building kits for adults who love great design. It also makes a great Ghostbusters gift for yourself or the model car builder in your life who’s looking for their next project.\n\nThis is the ultimate ECTO-1 building kit for fans of LEGO® bricks and Ghostbusters™ looking to build their next model car or simply relax with an immersive hands-on hobby project.\nThis is no Ghostbusters™ toy. It’s a car kit for adults with working steering, trapdoor with ghost trap, an extending gunner seat, plus a moving ghost sniffer and other paranormal detection equipment.\nAre you all about the details? With pieces like a curved windshield, modular steering wheel and brick with Ghostbusters™ deco, this authentically detailed set will look great in your home or office.\nIdeal for Ghostbusters™ fans and LEGO® lovers alike, this ECTO-1 model car gives hours of enjoyment and a building experience that will appeal to adults. It makes a great gift for anyone who’d love a model car to build.\nMeasuring over 8” (22.5cm) high, 18” (47cm) long and 6” (16.5cm) wide, ECTO-1 is packed with authentic details that you’ll be proud to display.\nYou don’t need batteries to enjoy this buildable model – it’s powered by pure ectoplasm (only joking).\nAs well as a step-by-step guide to building the model, the coffee table-style instructions include design details and the story of ECTO-1 (English language only. Download other languages at LEGO.com/ecto-1-book).\nPart of a series of inspiring LEGO® building sets designed for LEGO building fans, and hobbyists who love beautiful design and elegant architecture.\nLEGO® building bricks meet the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time – it’s been that way since 1958.\nLEGO® bricks and pieces are rigorously tested to ensure that every building set meets the highest safety and quality standards, so you can be sure that this souvenir model is as robust as it is beautiful."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/james-bond-aston-martin-db5-10262","description":"Get a license to build with the awesome LEGO® Creator Expert 10262 James Bond™ Aston Martin DB5. This impressive replica model captures the elegance and timeless sophistication of Agent 007’s iconic 1964 sports car, and comes with a wealth of authentic details and functioning gadgetry. Open the doors and you'll discover a detailed interior with a concealable radar tracker and a door compartment containing a telephone. And when it's time for action, activate the passenger ejector seat, turn the revolving number plates, raise the rear-window bulletproof screen, deploy the wheel-mounted tyre scythes and pull back the gearstick to reveal the front wing machine guns. This collectible model car also features a detailed straight-6 engine, drum-lacquered silver front and rear bumpers, moulded silver-coloured wire wheel rim inserts and front and rear Aston Martin logos. The model has been designed to provide a challenging and rewarding building experience full of nostalgia—a must-have for fans of the Aston Martin DB5, James Bond movies and LEGO building sets.\n\nAuthentic replica of the world-famous 1964 Aston Martin DB5 sports car, featuring a classic design with drum-lacquered silver front and rear bumpers, moulded silver-coloured wire wheel rim inserts, opening boot, bonnet and doors, and a wealth of James Bond™ gadgetry, including a working ejector seat, revolving number plates, rear-window bulletproof screen, front wing machine guns and wheel-mounted tyre scythes.\nThis LEGO® James Bond™ Aston Martin DB5 model also features opening doors and a detailed interior with a concealable radar tracker and door compartment with telephone.\nLift the bonnet to check out the straight-6 engine detailing.\nPull back the rear bumper to eject unwelcome passengers.\nRevolve the number plates, raise the rear-window bulletproof screen and deploy the wheel-mounted tyre scythes.\nPull back the gearstick to reveal the front wing machine guns.\nOwn this collectible replica of the Aston Martin DB5, as featured in the classic James Bond™ Goldfinger movie.\nThis set includes over 1,290 pieces and is suitable for ages 16+.\nNew-for-August-2018 special elements include a drum-lacquered macaroni connector, 2x4 tile and 1M beam, plus a printed 1x2 tile with grille pattern.\nMeasures over 3” (10cm) high, 13” (34cm) long and 4” (12cm) wide."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/london-bus-10258","description":"Celebrate iconic design with this charming double-decker London Bus, featuring a wealth of authentic details, including a bright-red color scheme, panoramic windshield, specially made standard-tread tires, destination sign, and an open rear boarding deck with a hand pole, ticket bin, fire extinguisher and a half-spiral staircase that leads to the upper sightseeing deck. Functions include an opening hood with engine, detailed driver’s cab with a sliding door, and a removable roof and upper deck for access to the detailed interior with worn look seating and additional authentic details, including a forgotten umbrella, newspaper, empty beverage can and discarded chewing gum. Reversible transit advertising posters are also provided as printed labels with a 1950s or present-day London promotion. This LEGO® Creator Expert model has been designed to provide a challenging and rewarding building experience with a touch of nostalgia and charm.\n\nThe London Bus comes with an array of brick-built features and details, including large windows, bright red curved bodywork, panoramic windshield, reversible transit advertising posters provided as printed labels, specially made standard-tread tires and a destination sign. It also has an opening hood with engine, detailed driver’s cab with sliding door, and a removable roof and upper deck for access to the detailed interior.\nInterior details include worn look seating, open rear boarding deck with a hand pole, ticket bin, fire extinguisher and a half-spiral staircase that leads to the sightseeing deck. Additional authentic detailing includes a forgotten umbrella, newspaper, empty beverage can and discarded chewing gum elements.\nChoose your favorite decade with the miniature, reversible transit advertising posters, featuring a 1950s or present day London promotion.\nRemove the roof and upper deck for full access to the detailed interior.\nSlide open the driver’s door to access the detailed cab with panoramic windscreen.\nLift the hood to access the engine.\nSpecial elements include a new-for-August-2017 tire with standard tread, quarter bows and arches in red, and 1x1x1 A2/3 bricks with vertical studs.\nThis model includes more than 1,680 pieces.\nThis model is scaled for shelf display alongside other models in the LEGO® Creator Expert vehicle series.\nMeasures over 7” (18cm) high, 13” (34cm) long and 5” (13cm) wide."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/nasa-apollo-11-lunar-lander-10266","description":"You were born to explore the universe! Build and inspire the next generation of astronauts with LEGO® Space rockets and vehicles – Let’s Go!\n\nCelebrate man’s first moon landing with this LEGO® Creator Expert 10266 NASA Apollo 11 Lunar Lander building set—developed in cooperation with NASA to mark the 50th anniversary of a historical event that captivated the world. This collectible model features a highly detailed replica of Apollo 11's Eagle lunar module, plus a depiction of the lunar surface, complete with crater, footprints and a U.S. flag. The descent stage comes with gold-colored landing pads and panels, opening camera and laser hatches, and a ladder, while the ascent stage has a detailed interior with room for 2 astronauts. Finished with an Apollo 11 Lunar Lander nameplate, this display model makes a great centerpiece for the home or office and provides a challenging and rewarding building experience full of nostalgia. Includes 2 astronaut minifigures with NASA decoration and golden helmets.\n\nIncludes 2 astronaut minifigures with NASA decoration and golden helmets.\nThis advanced LEGO® set features a detailed replica of the Eagle lunar lander with separate ascent and descent stages, plus a depiction of the lunar surface with crater, footprints and a U.S. flag.\nDescent stage features new-for-June-2019 gold-colored landing pads and panels, opening camera and laser hatches and a ladder.\nAscent stage features a detailed interior with room for 2 astronaut minifigures.\nCelebrate space exploration with this highly detailed display model.\nAccessory elements include a brick-built video camera and laser reflector.\nNew-for-June-2019 decorated elements include an Apollo 11 Lunar lander nameplate and golden elements.\nMeasures over 7” (20 cm) high, 8” (22cm) wide and 7” (20cm) deep."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/fiat-500-10271","description":"This LEGO® Creator Expert Fiat 500 model car (10271) recreates a true icon of classic automotive design. Teenagers and adult fans will enjoy the challenging building experience offered by this model kit based on the Fiat 500F legend from the late ‘60s, and will appreciate all the authentic LEGO brick details, such as the luggage rack with suitcase, detailed interior, and opening roof, doors, hood and tailgate. To complete the Italian theme, this classic model car also includes a folding easel with a paintbrush, palette and small ‘painting’ of the car in front of the famous Colosseum in Rome.\n\nBuilding toys that bring passion to life\nLEGO Creator Expert building kits are for adults and teenagers with a passion. From classic model cars and authentic buildings to fairground rides and other objects of desire, Creator Expert advanced LEGO sets offer a world of nostalgia, escapism, self-expression, pure enjoyment and surprise. Oh, and kids sometimes also use them as toys!\nRecreate a taste of ‘La Dolce Vita’ with an advanced LEGO® Creator Expert Fiat 500 model car brimming with Italian flair and LEGO brick details that teenagers and adults will enjoy building and displaying with pride.\nThis model kit features a luggage rack, suitcase, detailed interior, engine, spare wheel and opening roof, doors, hood and tailgate. There’s even a ‘painting’ of the car by the Colosseum to complete the Italian feel.\nThis advanced set is part of an amazing collection of authentic LEGO® model cars and other iconic objects of desire that offer relaxing ‘me time’ building and impressive display centerpieces.\nMore experienced teenage and adult builders will love to receive this 960-piece Fiat 500 model car as a birthday, Christmas or special-occasion gift.\nMeasuring over 11 cm (4.5 inches) high, 24 cm (9.5 inches) long and 11 cm (4.5 inches) wide, this buildable model makes for an impressive display piece on its own or as part of a collection of LEGO® sets.\nWhile toy cars run on batteries, this collector's item runs on pure imagination and creativity.\nThe included building instructions recreate the look and feel of the original promotional material, with fun facts about the real car, history of the Fiat company and an interview with the LEGO® designer of this classic car model.\nLEGO® Creator Expert building kits for adults and teenagers are challenging builds based on things people are passionate about, such as classic cars, authentic buildings, fairground rides and much more.\nSince 1958, LEGO® bricks have been tested to the highest industry standards to ensure consistency and compatibility, and that they connect and pull apart easily every time.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® pieces to make sure all of our advanced LEGO sets meet the highest global safety and quality standards."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/crocodile-locomotive-10277","description":"Clear your mind and escape the daily grind with this fulfilling building project. If your passion for toy train sets has never really left you, you’ll love recreating the amazing details of the Crocodile Locomotive, a vintage classic from the golden age of rail travel.\n\nImpressive attention to detail\nInspired by the Class Ce 6/8 II locomotive, first built for the Swiss Federal Railways between 1919 and 1927, this beautiful LEGO® model is packed with realistic details. With side rods that move as the wheels turn and posable pantographs that move up and down, there’s lots to explore. Lift the roof to access the crew compartment and use the 2 minifigures to bring the story of this iconic train to life. Add the Powered Up components (sold separately) to motorize your locomotive.\n\nSpark your passion for building\nThe Crocodile Locomotive (10277) is part of a collection of LEGO® model building kits for adults who love beautiful design. This model also makes a great gift for anyone who loves model trains.\n\nThis LEGO® Crocodile Locomotive (10277) model kit is perfect for adults looking to build a vintage locomotive model or for anyone who loves trains and is looking for their next hobby project.\nEnjoy a rewarding challenge as you bring this buildable model train to life. Then explore the features and functions packed into this set, which celebrates the classic Crocodile Locomotive train.\nDiscover amazing details with authentic features true to the original Crocodile Locomotive. The 2 LEGO®minifigures with tools, display track and plaque provide lots to explore after building the classic train.\nIdeal for model train fans, railway enthusiasts and LEGO® lovers, this building kit for adults makes a creative gift or birthday present to transport building fans to a world of total relaxation.\nThis train model measures over 6” (16cm) high, 20.5” (52cm) long and 3.5” (8cm) wide, making it a beautiful display piece to show off with pride.\nYou can jump right into this immersive building project since no batteries are required. To motorize your locomotive, add 1 x 8809 and 1 x 88013 Powered Up components (sold separately).\nThis building set for adults comes with coffee-table-style building instructions with design details to encourage and inspire you.\nPart of a series of inspiring LEGO® building model sets for adults, designed for LEGO building fans, and hobbyists who love elegant design, beautiful architecture and models packed with detail.\nLEGO® building bricks meet the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time – it’s been that way since 1958.\nLEGO® bricks and pieces are rigorously tested to ensure that every building set meets the highest safety and quality standards, so you can be sure that this set is designed to last."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/bonsai-tree-10281","description":"The art of bonsai has captured the imaginations of tree lovers for centuries. Now you can celebrate this ancient art with the LEGO® Bonsai Tree model building kit. Enjoy a sense of calm as you carefully shape the bonsai tree model with either green leaves or pink cherry blossoms. When you're ready for a change, it's easy to swap the colored crowns to create a totally new look. Take a closer look at the pink blooms – do you see the tiny frogs that make up each blossom flower?\n\nA beautiful display piece\nThe LEGO Bonsai Tree model comes with a rectangular pot and a slatted wood-effect LEGO stand, creating a pretty display piece to take pride of place in any home or office. Whether it’s a birthday gift for a loved one or a treat for you, this set is sure to capture the imagination with its beauty. Part of the LEGO Botanical Collection for adults, it includes leaf elements made from a plant-based plastic, produced using sustainably sourced sugarcane.\n\nThe LEGO® Bonsai Tree 10281 model building kit is a unique gift or mindful project for anyone who loves bonsai trees, plants or building creatively with LEGO pieces.\nIncludes interchangeable pieces so you can style the bonsai tree model with classic green leaves or vibrant pink cherry blossom blooms.\nCheck out the sweet frog design hidden in the pink blossom. With a rectangular pot and a slatted LEGO® wood-effect stand, it's easy to display the elegant tree once built.\nThis LEGO® Bonsai Tree is ideal for adults who love interesting LEGO building projects. It also makes a great birthday present or anytime gift for bonsai lovers or those who enjoy creative projects.\nMeasures over 7 in. (18 cm) high, 8.5 in. (21 cm) long and 7.5 in. (20 cm) wide.\nBoth sets of leaves can be custom arranged, making each display unique. Swap the colors as the seasons change to create an eye-catching feature for the home or office.\nLEGO® fans will love discovering a completely new way to build as they explore the unexpected shapes and colors in this Bonsai Tree building set.\nThe LEGO® Bonsai Tree is part of the LEGO Botanical Collection. This revolutionary collection uses several elements made from a plant-based plastic, produced using sustainably sourced sugarcane.\nLEGO® components meet strict industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it's been that way since 1958.\nLEGO® components are dropped, heated,crushed, twisted and analyzed to make sure they meet high global safety standards."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/flower-bouquet-10280","description":"Giving and receiving beautiful flowers is such a joy. If you’re looking for a flower gift with a difference, the LEGO® Flower Bouquet (10280) is an inspired choice. Whether you’re treating a loved one, or are looking for your next creative project, this flower bouquet model building kit lets you relax, unplug and create something wonderful. When complete, the impressive flower display brings a touch of fun and color to any room. The adjustable stems make it easy to tailor the arrangement for any vase or container.\n\nStyle flowers like a pro\nEach detail of the bouquet is made from LEGO components – all customizable to create a unique display. Most of the flowers have petals that are positionable so you can have fun designing different arrangements. Take the stems apart and recombine to adjust the height and shape of your flowers. Part of the LEGO Botanical Collection for adults, this set includes several elements made from a plant-based plastic, produced using sustainably sourced sugarcane.\n\nThe LEGO® Flower Bouquet (10280) building kit makes a unique gift or mindful project, creating a beautiful flower display model made entirely from LEGO pieces. Please note, a vase is not included.\nThis flower bouquet delivers a vibrant display of colors and interesting shapes, inspired by real flowers such as roses, snapdragons, poppies, asters, daisies and grasses.\nLet your imagination bloom with customizable elements. Position the petals and leaves, then change the lengths of the stems to create wonderful arrangements for the home.\nLooking for the best gifts for birthdays, anniversaries or special occasions? The LEGO® Flower Bouquet set makes a special and unusual gift for friends, loved ones, or yourself, at any time of year.\nThe stems come in a variety of lengths. As a guide, the ‘snapdragon’, with its straight stem, measures over 14 in. (36 cm) high.\nAs the first ever LEGO® Flower Bouquet, this set includes a host of new colors and shapes that adult LEGO fans will love.\nThe flowers are created from over 17 unusual LEGO® elements with realistic petal shapes and colors, to create an unexpected display that is sure to make people look twice.\nThe LEGO® Flower Bouquet is part of the LEGO Botanical Collection. This revolutionary collection uses several elements made from a plant-based plastic, produced using sustainably sourced sugarcane.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/assembly-square-10255","description":"Take a trip to the amazing Assembly Square, developed to celebrate ten years of LEGO® Modular Buildings, featuring a wealth of unsurpassed, intricate details and hidden surprises. Easy-to-remove building sections provide access to the highly detailed interior, comprising a ground level with a bakery, florist’s shop and café, a middle level with a music store, photo studio and dental office, and an upper-level dance studio and apartment with access to a rooftop terrace with barbecue. The exterior of the building features a detailed sidewalk with outdoor café furniture, fountain, streetlamps and a highly elaborate facade with beautifully detailed windows and doors, three buildable shop signs, spired tower and a decorative roofline. Collect and build an entire town with the LEGO Creator Expert Modular Building series 10243 Parisian Restaurant, 10246 Detective’s Office and 10251 Brick Bank. Includes eight minifigures and a baby figure.\n\nIncludes eight minifigures: a dentist, barista, baker, florist, music store assistant, dancer, photographer and a LEGO® fan, plus a baby figure.\nThe three-level Assembly Square features an authentic, elaborate facade with detailed windows and doors, three buildable shop signs, spired tower, decorative roofline and a rooftop terrace, plus a detailed tiled sidewalk with a fountain, outdoor café furniture and two streetlamps. The highly detailed interior includes a bakery, florist’s shop, café, music store, photo studio, dental office, apartment and a dance studio.\nGround level features a bakery with counter, cash register, shelves, opening oven, wedding cake and assorted buildable pastries and treats; a florist’s shop with counter, cash register, garden tools, flower arrangements, bouquets and a blue and yellow macaw parrot element; and a café with espresso machine, counter, bench seating and pie elements.\nMiddle level features a music store with a buildable drum set, two guitars and saxophone element; photo studio with buildable classic camera and adjustable tripod; and a dental office with buildable reclining chair, waiting area, telephone and a sink.\nUpper level features a dance studio with buildable piano and reflective mirror element; an apartment with buildable foldout sofa bed, detailed kitchen, toilet, micro LEGO® train, modular buildings and Eiffel Tower, and access to a rooftop terrace with buildable barbecue, table and a neglected plant.\nAccessory elements include a ballerina skirt, Chihuahua, pretzel, ornamental chicken and candy. Also includes a buildable telephone, grill, baby carriage and buildable lamps.\nRemove the building sections to access the detailed interior.\nAdjust the camera tripod and take photos all around the square.\nRecline the dentist chair and reveal those pearly whites!\nOpen the oven door to remove your freshly-baked pastries.\nFold out the sofa bed and relax while you admire your modular buildings collection!\nCelebrate Modular Buildings with this awesome 10th anniversary LEGO® Creator Expert set!\nThis set offers an age-appropriate build and play experience for ages 16+.\nWith over 4,000 LEGO® pieces, this model will really put your LEGO® building skills to the test!\nNew-for-spring-2017 decorated elements include a dentist torso, dentist window and 2x3 tile with the 10182 Café Corner box front.\nIncludes lots of curved and corner angle tiles, garage doors used as box windows and LEGO® Technic excavator scoops used as roofing elements.\nCollect and build an entire town with the LEGO® Creator Expert Modular Building series 10243 Parisian Restaurant, 10246 Detective’s Office and 10251 Brick Bank.\nMeasures over 13” (35cm) high, 14” (38cm) wide and 9” (25cm) deep."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/corner-garage-10264","description":"Drop by the LEGO® Creator Expert 10264 Corner Garage, where you’ll discover a world of fun and surprises! This amazing model comes with removable building sections for easy access to the highly detailed interior and comprises 3 stories. On the ground level there’s a 1950s-style gas station with fuel pump, kiosk and a vehicle workshop complete with a roll-up door, vehicle lift and tire mounter. At the mid-level animal clinic you’ll find an examination table, fish tank, and a waiting area with sofa, while on the upper level you’ll discover a well-equipped apartment with kitchen, TV, sofa, bed and a staircase that leads to a rooftop terrace with sun lounger, parasol and flower garden. The exterior of the building features a classic 1950s facade with signage, detailed windows and a decorative roofline, plus a sidewalk area with a tree and an ornate streetlamp. This charming addition to the Modular Buildings series has been designed to provide a challenging and rewarding building experience, full of nostalgia. Also includes a scooter, tow truck and 6 minifigures, plus parrot, bunny, dog, frog and fish figures.\n\nIncludes 6 minifigures: gas station owner, mechanic, vet, woman, man and a girl, plus bunny, parrot, dog, frog and fish figures.\nThe 3-level Corner Garage advanced building set comes with an array of brick-built details, including a detailed 1950s-style facade with gas station signage, windows, bay windows, arched doorway, roll-up vehicle workshop door, decorative roofline and a rooftop terrace, plus a detailed sidewalk area with tree and ornate streetlamp. This set also includes a tow truck and a scooter.\nGround level features a gas station with a bucket and a fuel pump with a flexible hose, plus a kiosk and a vehicle workshop for car service and repairs, featuring a cash register, tool rack and trolley, oil drum, tire mounter and working vehicle lift.\nMid-level animal clinic features an examination table, parrot perch, fish tank and a waiting area with sofa, armchair, table and flowerpot, plus the animal doctor’s desk lamp, microscope, mug, newspaper, envelope, scissors and syringe.\nUpper-level apartment features a well-equipped kitchen with cookies baking in the oven, sink, pan, mug, salt and pepper, spoon and spatula, plus a sofa, bed, an old-fashioned TV, and a bathroom with toilet.\nRooftop terrace features a sun lounger, parasol and flower garden.\nTow truck features a working hoist.\nAccessory elements include a window squeegee and a crash helmet.\nHelp the gas station assistant fill up the 1950s-style scooter.\nRoll up the door to access Jo’s vehicle workshop, complete with tire mounter and working vehicle lift.\nRemove the modular building sections to access the detailed interior.\nNew-for-January-2019 decorated elements include an animal clinic window, service station sign and a printed octane gas pump.\nSpecial elements include new-for-January-2019 black ice skates, 2x6x2 window in sand blue, 1x1 medium gray roof tiles, 1x1 angle plate in dark blue and rare dark-orange elements in various shapes and sizes.\nCollect and build an entire town with the LEGO® Creator Expert Modular Building 10243 Parisian Restaurant, 10255 Assembly Square and 10260 Downtown Diner.\nThis set includes over 2,560 pieces.\nMeasures over 12” (32cm) high, 10” (26cm) wide and 9” (25cm) deep.\nTow truck measures over 2” (6cm) high, 5” (14cm) long and 1” (5cm) wide."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/bookshop-10270","description":"Recreate the charm of a backstreet bookshop that you might discover in any European village or town with this LEGO® Creator Expert collectors’ toy. The 3-story bookshop and adjoining modular town house building is filled with fun building techniques and surprising details, including a display window, reading nook and an open-out design. Collectors will love to display this big 2,504-piece LEGO set proudly alongside their other modular buildings. An ever-growing modular house collection The LEGO Creator Expert Modular Buildings series is a premium collection of advanced, interconnecting buildings featuring authentic designs from around the world. LEGO sets that bring passion to life LEGO Creator Expert building sets are for adults and teenagers with a passion. From authentic buildings and classic cars to other objects of desire, Creator Expert advanced LEGO sets offer a world of nostalgia, escapism, self-expression, pure enjoyment and surprise.\nAn advanced LEGO® Creator Expert Modular Buildings set bookshop with adjoining town house packed with surprising details and unexpected features that teenagers and adults will enjoy building and displaying with pride.\nThis big 3-story LEGO® set features so many details, including a display window, bookshelves, reading nook and living spaces in the town house. 5 minifigures also help to really bring this collectors' toy to life.\nThis set is part of the Modular Buildings series – an ever-growing collection of interconnecting model toy buildings that combine to create amazing street scenes that builders and collectors love to own and display.\nWith 2,504 pieces, this LEGO® building set for adults and teenagers makes an inspirational birthday, Christmas or special-occasion gift.\nMeasuring over 11” (29cm) high, 9” (25cm) wide and 9” (25cm) deep, this buildable model makes for an impressive display piece on its own or as part of a larger Modular Buildings series street scene.\nNo batteries required... this advanced building set runs on the pure power of imagination and creativity.\nWith colorful, step-by-step building instructions, this advanced set offers a rewarding building experience, whether you’re building alone or sharing the experience with a loved one.\nLEGO® Creator Expert modular house toys immerse teenagers and adults in challenging builds based on things they're passionate about, including classic cars, authentic buildings, fairground rides and muchmore.\nSince 1958, LEGO® bricks have been tested to the highest industry standards to ensure consistency and compatibility, and that they connect and pull apart easily every time.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® pieces to make sure every building set meets the highest global safety and quality standards."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/ford-mustang-10265","description":"Discover the magic of an iconic 1960s American muscle car with the LEGO® Creator Ford Mustang, featuring dark-blue bodywork with white racing stripes, bonnet scoop, printed mustang grille badge, GT emblems and 5-spoke rims with road-gripping tires. Developed with input from Ford, this authentic replica comes with optional add-ons for customization, including a selection of license plates, supercharger, rear ducktail spoiler, beefy exhaust pipes, front chin spoiler and a nitrous oxide tank. You can even adjust the lift of the rear axle for an extra-mean look! Remove the roof panel or open the doors and you have access to the detailed interior with handsome seats, radio, working steering and a mid-console gearshift. Store items in the trunk or lift the hood to reveal a detailed big block 390 V8 engine with battery, hoses and air filter detailing. This advanced building set has been designed to provide a challenging and rewarding building experience full of nostalgia and makes a great centerpiece for the home or office.\n\nAuthentic replica of a 1960s Ford Mustang featuring dark-blue bodywork with white racing stripes, air scoop, 5-spoke rims with road-gripping tires, and a selection customization add-ons.\nOpen the doors or remove the roof panel to access the detailed interior with handsome seats, radio, mid-console gearshift and working steering.\nOpen the trunk to store items and lift the hood to reveal a detailed Ford Mustang V8 engine with battery, hoses and air filter.\nAlso includes a printed mustang grille badge and 2 GT emblems.\nCustomize the Ford Mustang with the included supercharger, rear ducktail spoiler, beefy exhaust pipes, front chin spoiler and a nitrous oxide tank.\nChoose from a selection of license plates.\nLift the hood to check out the realistic engine detailing.\nAdjust the lift of the rear axle for a real mean look!\nNew-for-March-2019 special elements include 5-spoke rims, 2x8 brick with bow, 1x3 mustang logo tile, 2x4 bow with ‘GT’ Emblem.\nMeasures over 3” (10cm) high, 13” (34cm) long and 5” (14cm) wide."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/elf-club-house-10275","description":"If you’re looking to recreate the cozy feeling of your favorite Christmas memories, we’ve got the perfect thing for you – the LEGO® Elf Club House (10275). It’s the ideal way to enjoy quality time with a sugar-sweet DIY project. Build the intricately detailed Elf Club House then explore all its merry features.\n\nA build packed with Christmas cheer\nRamp up the Christmas spirit as you enter the world of the elves. With waffles, presents and sleigh rides, this model building kit is filled with your favorite holiday traditions. There’s a Christmas tree decked with ornaments, a selection of gifts and a computer to track who’s naughty and who’s nice. A telescope lets the elves watch Santa’s sleigh as it takes off on Christmas Eve.\n\nA Christmas building project for you\nThe Elf Club House is part of a collection of LEGO model building kits for adults who love clever design and detailed scenes. And, of course, this model makes a great Christmas present for your loved ones.\n\nExplore your favorite family Christmas traditions with this delightful building challenge. Build the quaint Elf Club House (10275) then explore all its cozy holiday details as you unwind with this hands-on project.\nCreate something truly magical with your family this holiday period. Savor the build then enjoy a wonderful festive display model that will bring seasonal cheer to your home year after year.\nPacked with seasonal details. Discover a waffle machine, triple-decker bed with glowing light that shakes to wake the elves, a repositionable chimney and a sleigh, complete with a reindeer, to park in the ‘sleighport’.\nLooking for Christmas or Advent gift ideas? This model building kit is ideal for LEGO® fans or any adult or family who’d love to receive a model building kit with a beautiful display piece to enjoy.\nAt over 8.5” (22cm) high and 5” (13cm) deep, this building set for adults and families makes an impressive Christmas present or secret Santa gift idea with a display model to enjoy year after year.\nA battery is included with the light brick in this set, so you can enjoy the illumination right away.\nIt’s easy to get started because the set comes with coffee-table-style building instructions, complete with design details.\nPart of a series of inspiring LEGO® building sets for adults designed for LEGO building fans and hobbyists who love elegant design, beautiful architecture and models packed with detail.\nLEGO® building bricks meet the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time – it’s been that way since 1958.\nLEGO® bricks and pieces are rigorously tested to ensure that every building set meets the highest safety and quality standards, so you can be sure that this model is designed to last."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/gingerbread-house-10267","description":"Enjoy a festive build and play experience with the LEGO® Creator Expert 10267 Gingerbread House. A treasure chest of magical details, this amazing model features frosted roofs with colorful candy buttons and a delicious facade with candy-cane columns, glittery windows and a tall chimney stack with a glowing fireplace. Inside the house there’s an array of fun details and candy furnishings including a tasteful bedroom with chocolate bed and cotton candy lamp, and a bathroom with the essential toilet and bathtub. This wonderful LEGO Gingerbread House sets the scene for imaginative adventures with the gingerbread family. Children can light up the cozy fireplace, help clear the sidewalk with the snow blower and nestle the gingerbread baby in its carriage. It also includes a decorated Christmas tree with wrapped gifts and toys, including a rocking horse and a toy train. This advanced LEGO set delivers a challenging and rewarding building experience and makes a great seasonal centerpiece for the home or office. Includes gingerbread man, woman and baby figures.\n\nIncludes 3 LEGO® figures: a gingerbread man, gingerbread woman and gingerbread baby.\nThe Gingerbread House features frosted roofs with colorful candy buttons, a rich facade with candy cane columns and walking sticks, glittery windows and a tall chimney stack with a glowing fireplace, plus a detailed interior, brick-built baby carriage and a snow blower.\nGingerbread House interior features an array of fun details and candy-style furnishings, including a bedroom with chocolate bed and cotton-candy lamp, and a bathroom with the essential toilet and bathtub!\nAlso includes a Christmas tree with wrapped gifts and toys, including a rocking horse and a toy train.\nCheck out the yummy candy-cane signposts!\nPress down on the chimney-smoke button to set the fire aglow!\nChildren will love imaginative play with the gingerbread family.\nHelp the gingerbread lady nestle the gingerbread baby in the carriage.\nAccessory elements include a baby bottle, cups, frying pan and an axe.\nSpecial elements include a new-for-August-2019 gold bar element in tan and transparent 1x1 glitter bricks in purple.\nMeasures over 8” (21cm) high, 10” (26cm) wide and 5” (13cm) deep."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/harley-davidson-fat-boy-10269","description":"Explore the finer details of iconic engineering with the LEGO® Creator Expert 10269 Harley-Davidson® Fat Boy® motorcycle. Developed in partnership with Harley-Davidson, this highly detailed LEGO motorcycle captures the magic of the real-life machine, from its solid-disc Lakester wheels with beefy tires to its teardrop fuel tank with printed logos and inbuilt speedometer. Other features include a Milwaukee-Eight® engine with moving pistons, dual exhaust pipes, handlebar steering, moveable gearshift pedal and brake levers, kickstand and a sturdy display stand. Finished with a dark red and black color scheme, this amazing display model makes a truly iconic centerpiece for the home or office. This advanced LEGO set provides an immersive and rewarding building experience.\n\nFeatures solid-disc Lakester wheels with beefy tires, teardrop fuel tank with Harley-Davidson logos and inbuilt speedometer, Milwaukee-Eight® engine with moving pistons, dual exhaust pipes, handlebar steering, moveable gear shift pedal and brake levers, kickstand and a sturdy display stand.\nComes with an authentic dark red and black color scheme.\nThis LEGO® motorcycle makes an iconic centerpiece for the home or office.\nSpin the rear tire to see the Milwaukee-Eight® engine pistons spring to life.\nNew-for-July-2019 decorated elements include 2 dark red 2x4 tiles printed with the Harley-Davidson® Fat Boy® tank emblem.\nSpecial elements include a new-for-July-2019 rear rim with super-wide tire.\nMeasures over 7” (20 cm) high, 7” (18 cm) wide and 12” (33 cm) long."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/volkswagen-t1-camper-van-10220","description":"This authentic camper van is a replica of the classic Volkswagen Camper Van from 1962. Every iconic feature is here! On the outside, the terrific detailing includes 'V' shape three-way color split at the front, rounded roof and window frames, opening 'splittie' safari windshield, opening doors, iconic pop-up roof with textile curtain surround, roof rack, rear side air intake vents and lots more! The detailing is equally impressive on the inside, from the authentic VW air-cooled flat four cylinder boxer engine, front cabin bench seat, gear stick, angled dashboard and iconic spherical speedometer, to custom LEGO® features like folding rear bench seat, folding dinette table, closet with mirror and even a painting!\n\nBuild the classic 1962 camper van packed with authentic features!\nIncludes “V” shaped color split, “splittie” safari windshield, pop-up roof, textile curtains, “boxer” engine, wing mirrors and folding furniture\nLEGO Creator Expert building toys are compatible with all LEGO construction sets for creative building\nThe Camper Van is over 5” high and 11” long\n1332 pieces – For LEGO fans over 16 years old"},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/taj-mahal-10256","description":"Build and discover the Taj Mahal! The huge ivory-white marble mausoleum, renowned as one of the world’s architectural wonders, was commissioned in 1631 by the Emperor Shah Jahan in memory of his wife, the Empress Mumtaz Mahal. This relaunched 2008 LEGO® Creator Expert interpretation features the structure's 4 facades with sweeping arches, balconies and arched windows. The central dome, subsidiary domed chambers and surrounding minarets are topped with decorative finials, and the raised platform is lined with recessed arches. The model is finished with ornate detailing throughout and intricate tilework around the base. With more than 5,900 pieces, this set is designed to deliver a rewarding building experience and makes a great display piece for the home or office.\n\nLEGO® interpretation of the real-world architectural wonder, the Taj Mahal.\nRelaunched 2008 model, featuring 4 facades with arches and arched windows; central dome, 4 subsidiary domed chambers and 4 minarets, all topped with decorative finials; raised platform lined with recessed arches; ornate detailing throughout; and intricate tilework around the base.\nDivides into 7 modular sections for easier transportation.\nPut your LEGO® building skills to the test with one of the largest LEGO models ever created!\nSpecial elements include 6 blue 16x32 baseplates, white 1x5x4 bricks with bow, lots of transparent elements, ‘Erling’ bricks and ‘jumper’ plates.\nThis set includes over 5,900 LEGO® pieces.\nMeasures over 16” (43cm) high, 20” (51cm) wide and 20” (51cm) deep."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/vestas-wind-turbine-10268","description":"Celebrate green energy innovation with the LEGO® Creator Expert 10268 Vestas Wind Turbine. Developed in partnership with Vestas, this detailed, motorized LEGO model captures the elegance and graceful movement of a traditional wind turbine and features a new-for-January 2019 spruce tree, manufactured from sustainably sourced plant-based plastic. At approximately 39” (1m) high, the structure towers above a wooded hill and a house with furnished patio, mailbox, flowers and a white picket fence. Turn the nacelle left or right and switch on the included Power Functions motor to rotate the adjustable wind turbine blades and illuminate the cottage’s porch light. This collectible model has been designed to provide a challenging and rewarding building experience with a touch of nostalgia and makes a great display piece for the home or office. This big LEGO set also includes a Vestas service vehicle, 3 minifigures and a dog figure.\n\nIncludes 3 minifigures plus a dog figure.\nIncludes a LEGO® Power Functions medium motor, battery box and 2 new-for-January-2018 19.6” (50cm) extension wires.\nThis LEGO® Creator Expert Vestas Wind Turbine set also features adjustable wind turbine blades, detailed tower, movable nacelle with aircraft warning lights, Vestas service vehicle, trees, greenery and a house with garden, flowers, picket fence and a patio with 2 chairs, table and a parasol.\nTurn the nacelle left or right and switch on the included Power Functions motor to activate the adjustable wind turbine blades and working porch light.\nCelebrate renewable energy technology with this buildable science toy.\nOpen the service vehicle doors and slide out the retractable tool compartment.\nIncludes a new-for-January-2019 spruce tree; manufactured from sustainably sourced plant-based plastic.\nAccessory elements include 2 safety helmets, tools and 2 envelopes.\nThis set includes over 800 pieces and is suitable for ages 12+.\nMeasures approximately 39” (100 cm) high, 24” (62cm) wide and 12” (31cm) deep."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/downtown-diner-10260","description":"Drop in at the LEGO® Creator Expert 10260 Downtown Diner, where you’ll discover a healthy portion of fun and surprises. This impressive model features removable building sections for easy access to the detailed interior, which comprises a ground-level 1950s-style diner with a large curved front window, red bar stools, jukebox, counter and an open-plan kitchen. The mid level has a boxing gym with boxing ring, punching bag and weight training room, while on the upper-level you'll find a recording studio, complete with vocal booth, mixing desk and a refreshments cabinet. The facade of this modular building features pink-and-teal Streamline Moderne styling with a large ‘DINER’ sign. Other external features include arched windows, balconies and a staircase, plus a pink convertible car and a detailed sidewalk, complete with mailbox, parking meter, flowerpots and a streetlamp. This incredible collectible toy has been designed to provide a challenging and rewarding building experience with a touch of nostalgia and charm. Includes 6 minifigures.\n\nIncludes 6 minifigures: a chef, waitress, boxer, rock star, manager and a bodybuilder.\nThe 3-level LEGO® Creator Expert Downtown Diner comes with an array of brick-built details, including a detailed facade with pink-and-teal Streamline Moderne styling and a large ‘DINER' sign, external staircase, arched windows, drainpipe, balconies, decorative roofline, opening skylight and a rooftop terrace, plus a detailed sidewalk with a mailbox, parking meter, flowerpots and an ornate streetlamp. This set also includes a pink 1950s-style convertible.\nGround level features 1950s downtown American diner styling with a large curved front window, red barstools, benches, jukebox, candy machine, counter, 2 soda dispensers, and a kitchen with a coffee machine, stove and a cooker hood.\nMid-level features a boxing gym with a boxing ring, punching bag, weight training room, water dispenser and a wall clock.\nUpper level features a recording studio complete with vocal booth, soundproofed walls, mixing desk and a refreshments cabinet.\nTake a ride in the stylish convertible and head for a diner where fast food and music are on the menu.\nHelp the chef prepare the fastest food in town while the roller-skating waitress lines up the orders.\nDrop in at the gym for a couple of rounds in the boxing ring or a good workout on the punching bag.\nOpen the skylight and eavesdrop on the making of a hit album.\nAccessory elements include roller skates, guitar, golden record award and a buildable barbell.\nRemove the building sections to access the detailed interior.\nThis set includes over 2,480 pieces and is suitable for ages 16+.\nNew-for-January-2018 decorated elements include a decorated door, album cover, lots of teal-colored and pink-colored elements, and a dual-face minifigure with singing and smiling expressions.\nSpecial elements include new-for-January-2018 flower stalks and flower heads, plus 1x3 ‘jumper' plates, 2x2 plate with 2 studs and a minifigure torso with boxing gloves.\nCollect and build an entire town with the LEGO® Creator Expert Modular Buildings series 10243 Parisian Restaurant, 10246 Detective’s Office, 10251 Brick Bank and 10255 Assembly Square.\nMeasures over 13” (34cm) high, 9” (25cm) wide and 9” (25cm) deep."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/volkswagen-beetle-10252","description":"Celebrate the iconic VW Beetle with this awesome LEGO® Creator Expert reproduction. This detailed model comprises a number of special features and elements that help recreate the distinctive Beetle characteristics, including an azure-blue color scheme, curved fenders, flat windshield, VW logo, and an authentic 4-cylinder air-cooled engine and fuel tank. The accessible interior features beige-colored, forward-tilting seats, dashboard and steering wheel, and the roof-mounted surfboard and a cooler box can be removed. This model has been designed to provide a challenging and rewarding building experience with a touch of nostalgia.\n\nBuild the world’s most popular car, packed with authentic 1960’s details!\nIncludes curved fenders, distinctive hubcaps, round headlights, wing-mounted turn signals, surfer accessories, opening hood, trunk and doors\nLEGO Creator Expert building toys are compatible with all LEGO construction sets for creative building\nThe Beetle is over 5” high, 11” long and 4” wide\n1167 pieces – For LEGO fans over 16 years old"},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/winter-village-fire-station-10263","description":"Welcome to the snowy LEGO® Creator Expert 10263 Winter Village Fire Station, where the firefighters are enjoying the calm of the holiday season. This delightful LEGO set features a 2-level, holly-adorned building with an upper-level kitchen, complete with a red telephone, table, fold-down bed and a LEGO light brick. Behind the large red fire station doors, you'll discover firefighting equipment and a fire pole, while outside there's an ice rink with a decorative firefighter statue, a decorated Christmas tree with transparent star and gifts, plus a bench and lamppost. This set also features a classic red fire truck with a turntable ladder, hoses, toolbox and deep-tread tires. Gather the family and bring the magic of the holiday season to your home with this festive LEGO Creator Expert set. Includes 6 minifigures, plus baby and Dalmatian figures, and a brick-built snowman.\n\nIncludes 6 minifigures: 3 firefighters, ice hockey player, musician with saxophone and a girl with a scarf, plus a Dalmatian figure, brick-built snowman and a baby figure with a moose sweater.\n2-level Winter Village Fire Station comes with an array of brick-built details, including a detailed facade with decorative columns, ornate windows, large red garage doors and holly decorations, plus an ice skating rink with firefighter statue, decorated Christmas tree with transparent star, sleigh, bench, lamppost and a LEGO® light brick.\nAlso includes a classic red fire truck with a turntable ladder, hoses, toolbox and deep-tread tires.\nGround level features a garage area with a fire pole and firefighting equipment.\nUpper level interior features a cozy kitchen with red telephone, coffee maker, dining table, radio, dog bed and a fold down bed for a firefighter.\nRaise the fire truck ladder and help the firefighters decorate the tree.\nBuild a cute snowman with a cool top hat.\nLight up the fire station windows with the LEGO® light brick!\nGather the family and bring the magic of the holiday season to your home with this festive LEGO® Creator Expert set.\nAccessory elements include ice skates, a hockey stick, gold-colored helmets, saxophone, hot dog and bun, dog bone, toolbox and tools.\nThis festive set includes over 1,160 pieces.\nNew-for-October-2018 decorated elements include a classic firefighter uniform and an adorable baby sweater.\nCollect the rest of the Winter Village! Build the Exclusive Fire Station and add the Winter Holiday Train (10254) and the Winter Village Station (10259).\nNew-for-October-2018 special elements include a 1x2 rounded plate, 2x2 plate with reduced knobs, 1x1 plant and 1x1 flower elements.\nFire Station measures over 9” (23cm) high, 9” (25cm) wide and 5” (14cm) deep.\nFire truck measures over 2” (6cm) high, 1” (4cm) wide and 5” (13cm) deep.\nIncludes LEGO® Light Brick."},{"theme":"creator-expert","themeUrl":"https://www.lego.com/en-us/themes/creator-expert","productUrl":"https://www.lego.com/en-us/product/london-bus-40220","description":"Build this retro bus with turning wheels plus transparent window and light elements. Apply the number plate, route number, destination and advertising banner stickers. With authentic details, this delightful vintage bus makes a perfect gift for fans of LEGO® Creator modular building sets and London.\n\nThis buildable LEGO® brick London Bus features authentic details, turning wheels, transparent window and light elements and stickers for the number plate, route number, destination name and advertising banners inspired by LEGO Creator models 21013 Big Ben and 10232 Palace Cinema (not included).\nThis set includes over 115 pieces and offers an age-appropriate building experience for ages 7 and over.\n Measures over 2” (6cm) high, 4” (11cm) long and 1” (3cm) wide."}]