[{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/batman-40386","description":"Fans of the Caped Crusader™ can build and display their own LEGO® Batman™ illustration with this LEGO Brick Sketches™ Batman (40386). Hang it on the wall using the built-in hook – the 12x16 baseplate holds the LEGO bricks firmly in place. A great gift for birthdays and holidays, and an impressive addition to any collection of LEGO Brick Sketches character portraits.\nYoung LEGO® builders and Batman™ fans will love to build and display this cool, collectible Brick Sketches™ portrait of the famous crime fighter of GOTHAM CITY™.\nAn awesome gift for kids aged 8 and up, this 115-piece construction set is part of the LEGO® Brick Sketches™ theme, which features collectible, buildable, 3D illustrations of iconic characters on 12x16 baseplates.\nMeasuring over 5” (13cm) high, 3” (9cm) wide and 1” (3cm) deep, this LEGO® Brick Sketches™ Batman™ makes an eye-catching addition to any kid’s room, whether standing alone or hanging on the wall from the built-in hook."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/the-joker-40428","description":"Fans of Batman™ can build and display their own portrait of The Joker™ with this LEGO® Brick Sketches™ The Joker (40428). Made entirely from LEGO bricks on a 12x16 baseplate to hold the LEGO bricks firmly in place, kids can even hang it on the wall using the built-in hook. A cool gift for kids’ birthdays and holidays, and an impressive addition to any collection of LEGO Brick Sketches character portraits.\nYoung LEGO® builders and fans of Batman™ will enjoy constructing and displaying this awesome, collectible Brick Sketches™ portrait of the most notorious villain of GOTHAM CITY™.\nA great gift for kids aged 8 and up, this 170-piece construction set is part of the LEGO® Brick Sketches™ theme, which features collectible, buildable, 3D illustrations of iconic characters on 12x16 baseplates.\nMeasuring over 5” (13cm) high, 3” (9cm) wide and 1” (3cm) deep, this LEGO® Brick Sketches™ The Joker™ willlook amazing in any kid’s room, whether on a shelf, bedside table or hanging on the wall from the built-in hook."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/batman-vs-the-penguin-harley-quinn-40453","description":"Super-hero fans will love to role-play crime-fighting action with Batman™ and 2 Super-Villains. The playset is packed with fun features to engage and entertain kids: The Penguin™ rides in a buildable toy duck boat, Harley Quinn™ wields her big hammer, and there’s dynamite to use to blast open the bank vault and steal the money!\nIncludes 3 minifigures – Batman™, The Penguin™ with his buildable umbrella and Harley Quinn™ with her buildable mallet.\nThe set also contains a buildable duck vehicle, bank vault containers, money, buildable blasting machine and dynamite.\nFun toy for young superheroes ages 6 and up."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/1989-batmobile-76139","description":"Batman™ fans and anyone who appreciates cool cars will love the LEGO® DC Batman 76139 1989 Batmobile™ model car kit for adults. This beautifully detailed LEGO brick building toy replicates the classic curves of the famous Batmobile car, as seen in the 1989 Batman movie. Measuring over 60cm long and built from 3,306 pieces, the model offers a challenging and rewarding build. Die-hard fans will love authentic features such as the slide-open cockpit with a new-for-November-2019 wraparound windshield element, 2 hidden machine guns with a pop-up function activated by turning the turbine exhaust, and decorative grappling hooks on each side of the vehicle. The Batman toy car comes with a rotating display stand (with an attached information plate with 1989 Batmobile™ statistics) for ease of viewing from any angle. A must-have for all Batman fans, this super-hero toy construction set also includes 3 new-for-November-2019 minifigures—Batman with a cape that matches his 1989 movie outfit, The Joker™ and Vicki Vale™—plus a brick-built minifigure display stand.\n\nThis super-hero toy includes 3 new-for-November-2019 LEGO® minifigures: Batman™ (new torso decoration), The Joker™ (new face and torso decoration) and Vicki Vale™ (new torso and legs), plus a brick-built minifigure display stand.\nThis LEGO® brick version of the 1989 Batmobile™ features a slide-open cockpit with a new-for-November-2019 wraparound windshield element, 2 minifigure seats, a steering wheel, stick shift and dashboard stickers, 2 hidden, non-shooting machine guns under the bonnet with a pop-up function activated by rotating the turbine exhaust, 2 decorative grappling hooks, wheel trims with the Bat logo and specially designed tyres for the front wheels, batwings and other iconic design details.\nThis LEGO® set also includes a brick-built rotating display stand for the Batman™ toy car with an attached information plate with 1989 Batmobile™ statistics.\nWeapons include Batman’s Batarang and a gun and The Joker’s gun.\nAccessories include Batman’s new-for-November-2019 cape that matches his 1989 movie outfit and Vicki Vale’s brick-built camera.\nThis LEGO® Batman™ model car kit for adults includes over 3,300 pieces and makes a wonderful nostalgic holiday gift or birthday present for any Batman fan.\n1989 Batmobile™ measures over 4” (12cm) high, 23” (60cm) long and 8” (22cm) wide."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/1989-batwing-76161","description":"This is no kid’s toy. If you’re serious about BATMAN™, comic book super heroes or making cool models, this LEGO® DC BATMAN 1989 Batwing is for you!\n\nBatwing construction project\nRecreate the authentic detail and gothic elegance of BATMAN’s iconic aircraft, the Batwing, with this LEGO brick build-and-display model. The impressive reproduction features realistic details, removable canopy, full interior, poseable flaps and a new special brick that will allow you to mount and display your model on your wall. There’s also a stand, nameplate and 3 minifigures – BATMAN™, THE JOKER™ and a Lawrence the Boombox Goon™ – to create an impressive setting for your model.\n\nLEGO brick model-making kits\nEscape the busy world for a moment and discover the joy of creative construction with adult LEGO building sets. Satisfying to build and stunning to display, adult LEGO kits make great birthday gifts, holiday presents and personal treats for anyone interested in model making or comic culture.\n\nIndulge your passion for the Caped Crusader™ with the LEGO® DC BATMAN™ 1989 Batwing. If you’re an adult Batman fan or a model-building enthusiast, this buildable display model of the Batwing is for you!\nThe iconic style of the Batwing from the 1989 BATMAN™ movie is enhanced by a sturdy stand, nameplate and 3 minifigures: BATMAN, THE JOKER™ and a Boombox goon.\nThis challenging and rewarding building project provides an engrossing and stress-relieving break from the real world – and will look great when displayed on the wall or on its stand in your home or workplace.\nAny superhero or LEGO® fan will love this 2,363-piece construction kit. Whether you buy it for yourself, as a birthday gift or a holiday present, the LEGO Batwing model is sure to deliver hours of enjoyment.\nMeasuring over 4” (11cm) high, 20” (52cm) long and 22” (58cm) wide, the LEGO® DC BATMAN™ 1989 Batwing looks stunning on its stand and when attached to the wall.\nNo batteries required. This collectible piece of BATMAN™ memorabilia offers a hands-on, build-and-display experience that will catch the eye of every BATMAN, sci-fi or model-making enthusiast.\nEasy-to-follow, high-quality instructions are included to ensure you gain maximum enjoyment from this fascinating construction project.\nPart of a series of authentic LEGO® reproductions designed to deliver a satisfying build-and-display experience. For more in the series, check out the LEGO DC BATMAN™ 1989 Batmobile™.\nNo super-powers arerequired to connect and pull apart LEGO® bricks and pieces. They meet the highest industry standard, which ensures they fit together and separate perfectly every time.\nLEGO® bricks and pieces are rigorously tested to ensure your awesome display model meets the highest toy safety standards in GOTHAM CITY™ and the rest of planet Earth."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/mobile-bat-base-76160","description":"The LEGO® DC Mobile Bat Base (76160) incorporates 5 iconic vehicles, a bunch of awesome weapons and lots of cool gadgets. With 6 popular LEGO DC minifigures from the Batman™ movies, this set gives kids everything they need to explore an exciting world of Batman adventures!\n\nLEGO Batman Batcave™ playset – on wheels!\nKids join Batman, Batgirl™ and Nightwing™ on the hunt for notorious Super-Villains Mr. Freeze™, Man-Bat™ and Bronze Tiger™. The high-tech Mobile Bat Base is packed with exciting hidden features: Detach the Batjet from the trailer and unfold its wings; when it lands, drive the BatQuad out of the rear; unfasten the motorcycle from the back of the truck; release a water scooter from the front of the truck with the touch of a switch… there's even an on-board jail for the bad guys and an explosion feature for when they escape.\n\nBatman building toys and action minifigures\nLEGO DC Batman playsets bring all the thrills and epic fun of the Batman movies into kids' homes.\n\nThe LEGO® DC Mobile Bat Base (76160) toy is packed with iconic vehicles, awesome gadgets and cool weapons for kids to use as they help Batman™ and Batgirl™ round up 4 notorious Super-Villains.\nThis ‘Batcave™ on wheels’ set incorporates a Batjet, BatQuad, motorcycle, water scooter, toy truck and 6 minifigures from the Batman™ movies: Batman, Batgirl™, Nightwing™, Mr. Freeze™, Man-Bat™ and Bronze Tiger™.\nThe toy's opening roof and side provide easy access to Batman's Batcave™ accessories.With so much to discover, and 6 minifigures from the Batman™ movies, the possibilities for independent imaginative play are endless.\nIt’s not just Batman™ movie fans who’ll be thrilled to receive this mobile Batcave™ building toy as a birthday gift. It's a great ‘build your own truck' playset for all children aged 6 and up who enjoy imaginative play.\nMeasuring over 14” (38cm) long, the Mobile Bat Base vehicle is the perfect size for hands-on play and big enough to contain everything kids needs for epic super-hero adventures.\nThis Batman™ truck toy doesn’t need batteries – it’s powered purely by kids’ imaginations! And with so many accessories and fun features, young super heroes can enjoy endless, hands-on, creative play.\nSimple instructions are included to get kids building and playing right away and making the most of all the toy's cool features and amazing vehicles.\nLEGO® DC Batman™ playsets put super-hero movie action into kids' hands. With characters, vehicles, gadgets and weapons from the blockbuster movies, fans can recreate favorite scenes and dream up adventures of their own.\nLEGO® children’s building toys meet the highest industry standards, ensuring they are consistent, compatible and connect and pull apart perfectly every time – it's been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure that your child's build-and-play set meets the highest safety and quality standards in the world."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/joker-s-trike-chase-76159","description":"The LEGO® DC Batman™ Joker's Trike Chase (76159) playset is a fast-moving Batman-vs.-THE JOKER™ gift for kids, featuring iconic cars, awesome weapons and favorite characters from the Batman movies.\n\nHot Batman toys for cool kids\nPut Batman action and adventure into the hands of young super heroes with THE JOKER's monster 3-wheel trike toy, with its cool weapons and flames coming from the exhaust, and the ultra-cool Batmobile™ car. With Batman, Robin™, THE JOKER and Harley Quinn™ minifigures,the pretend play starts right away. And with cool features, including the opening and closing mouth on the front of THE JOKER’s trike and the removable Batmobile engine that also turbocharges the trike, the imaginative play will never end.\n\nBatman action with minifigures and construction toys\nLEGO DC Batman playsets bring all the thrills and epic fun of the Batman movies into kids' homes. Super-hero fans will have endless fun reliving favorite scenes and creating imaginative adventures of their own.\n\nThe awesome LEGO® DC Batman™ Joker's Trike (76159) puts fast-moving, Batman-vs.-THE JOKER™ action, iconic vehicles, awesome weapons and super-cool features into the hands of young Batman fans.\nIncludes 4 minifigures and the Batmobile™, with opening cockpit for the Batman™ minifigure and a removable engine. THE JOKER's 3-wheeler has a grinning mouth on the front that opens and closes as the trike moves.\nKids develop skills as they enjoy endless hands-on play driving the souped-up vehicles, acting out battles with minifigures, cool weapons and accessories, and removing the Batmobile’s engine to put in THE JOKER’s trike.\nLooking for a top gift for kids who’re into cars and toys from the Batman™ movies? Whether they’re a fan of DC Comics, RC cars or Batmobile™ toys, this LEGO® Batman playset is an awesome gift for kids aged 7 and up.\nWith the LEGO® Batmobile™ toy measuring over 6” (16cm) long, this awesome playset is big enough for epic adventures and small enough for youngsters to enjoy lots of hands-on fun.\nThis hot Batman™ toy doesn’t need batteries to work – just kids’ imaginations! Because the imaginative fun starts straight from the box, this LEGO® playset makes a great birthday or holiday gift.\nSimple instructions are included so kids can build, play and get maximum enjoyment from every feature in this versatile playset.\nLEGO® DC Batman™ playsets bring super-hero movie action into kids' homes. With amazing characters, vehicles, gadgets and weapons, fans can be part of the Batman movie action and create imaginative adventures of their own.\nAll LEGO® construction toys meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart perfectly every time – and it's been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure your child's new toy meets the highest safety and quality standards in the world."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/wonder-woman-vs-cheetah-76157","description":"Young super heroes can relive Wonder Woman™ 1984 movie action with the LEGO® DC Wonder Woman vs Cheetah (76157) building kit. When Wonder Woman (Diana Prince™) encounters her archenemy, Cheetah (Dr Barbara Minerva™), at the transmitter tower, the scene is set for an epic battle!\n\nWonder Woman vs Cheetah\nThis action-packed playset gives kids double the fun. Down below in the bunker, Max™ tries to enter the tower, while overhead the transmitter panels rotate. Meanwhile, Wonder Woman and Cheetah confront each other. With super-cool features and so many possibilities for play, young super heroes will experience endless imaginative fun.\n\nPopular action minifigure toys from LEGO DC\nLEGO DC kids’ construction toys let children role-play as their favorite super hero in good vs evil conflicts to save the world! With legendary characters and cool gadgets, LEGO DC building sets make great gifts for kids, inspiring individual and group play that never ends.\n\nThis 2-sided model includes a high-tech bunker and a revolving transmitter tower. When kids bring Wonder Woman™ (Diana Prince™) and her archenemy, Cheetah (Dr Barbara Minerva™), to the scene… anything can happen!\nA winged Wonder Woman™ and Cheetah minifigures provide super-hero action, while a Max™ minifigure is at the control center. High above, the transmitter tower rotates through 360 degrees and up and down.\nKids can fix the Wonder Woman™ minifigure to the rotating transmitter. As she flies around the tower, Max™ stands at the controls. When the Super-Villain, Cheetah, arrives, it’s time for an epic battle!\nBoys and girls aged 7 and up will enjoy exciting, imaginative adventures with this popular LEGO® DC Wonder Woman™ toy. A hot, action-packed gift for all young super heroes.\nMeasuring 7” (19 cm) high and 6” (17cm) wide, with a radar dish measuring 7” (20cm) across, the LEGO® DC Wonder Woman™ vs Cheetah (76157) set encourages imaginative play on a large scale.\nWith no batteries required, kids can enjoy this Wonder Woman™ 1984 LEGO® DC playset whenever they want. Hands-on, battery-free play develops their creative thinking, imaginative role play and problem-solving skills.\nLooking for a super-hero playset for a kid who's new to LEGO® building toys? This Wonder Woman™ and Cheetah toy comes with an easy-to-follow guide that gets kids building and playing without delay.\nLEGO® DC playsets inspire imaginative group and solo play as kids recreate favorite movie scenes, make up stories of their own and put the awesome playsets on display in their room.\nLEGO® building bricks meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – and it’s been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure every building set meets the highest global safety standards for your little super hero."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/batcave-10919","description":"When THE JOKER™ escapes from jail, your little super hero joins Batman™ and Robin™ as they try to capture him and put him back where he belongs. This means lots of fun-packed action, imaginative role play and a chance for toddlers to develop super-power skills!\n\nDevelopmental play with Batman and Robin\nLEGO® DUPLO® Batman Batcave™ (10919) features Batman, Robin and THE JOKER in a versatile playset designed to encourage creative play and stimulate developmental benefits. Infants build fine motor skills as they maneuver the Batmobile™ toy through the gate and open and close the jail door. Role-playing the interaction between the 3 characters encourages social and emotional development.\n\nIconic characters and endless, pretend-play action\nFeaturing favorite super heroes and Super-Villains, cool gadgets and amazing vehicles, LEGO DUPLO Batman starter sets provide toddlers with endless developmental play and give parents an opportunity to share precious moments with their little superhero.\n\nLEGO® DUPLO® Batman™ Batcave™ (10919) combines developmental learning with action-packed adventures in a super-fun playset designed to unleash your little super hero’s super powers!\nThe Batcave™ provides the setting for role-play adventures with THE JOKER™, Batman™ and Robin™. There's also a jail with an opening and closing gate, and a cool-looking Batmobile™ toy to inspire stories on the move.\nPreschoolers use their fine motor skills and problem-solving abilities to catch THE JOKER™ and return him to jail. But, with THE JOKER’s slime shooter and Batman’s high-speed Batmobile™, anything can happen!\nThis exciting infant toy uses elements designed to be easy for small hands to pick up and place. It’s an ideal LEGO® starter set for boys and girls aged 2 and up who enjoy mechanical toys.\nThe Batcave™ measures over 5” (14cm) high, 8” (22cm) wide and 3” (9cm) deep and the Batmobile™ toy is over 4” (12cm) long. To create even more play possibilities, the set combines easily with other LEGO® DUPLO® playsets.\nNo batteries needed. The hands-on fun starts right away, unlocking developmental benefits with play designed to stimulate young minds.\nThe simple instructions included make it easy for parents and caregivers to share the construction fun with their toddler.\nLEGO® DUPLO® Batman™ playsets use super heroes, Super-Villains, cool gadgets and amazing vehicles from the Batman movies to deliver developmental benefits to preschoolers and precious moments for parents to share.\nLEGO® DUPLO® building sets are easy for little fingers to pick up, place and pull apart because they meet the very highest industry standards – and it’s been that way since 1969.\nLEGO® DUPLO® bricks and pieces are stringently tested to make sure every little builder's DUPLO playset meets the highest safety and quality standards on the planet."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/batboat-the-penguin-pursuit-76158","description":"LEGO® DC Batboat The Penguin Pursuit! (76158) gives youngsters endless imaginative role-play possibilities with favorite characters from the Batman™ movies.\n\nTop build-and-play toy for Batman fans!\nBatman and The Penguin™ minifigures and 2 cool buildable boats put super-hero action and adventure right into kids' hands. This LEGO 4+ set is a great way for preschoolers and youngsters to learn building skills. It's easy to build, so even first-time builders can experience the joy of construction “by myself” – and a simple guide clearly explains the building process, giving kids the confidence to take on more challenging LEGO projects.\n\nLooking for the best Batman gifts for kids?\nIf you want a cool birthday gift or Christmas toy for kids aged 4 and up, LEGO DC Batman building sets have all the action minifigures, awesome features and developmental benefits that you need to make a young super hero's day!\nLEGO® DC Batboat The Penguin Pursuit! (76158) inspires young imaginations and creative thinking as kids enjoy role-play fun with super-hero minifigures and toy vehicles from DC comics and movies.\nThis building set includes Batman™ and The Penguin™ minifigures, plus the Batboat and The Penguin's duck boat. The boats don't float, but they provide endless play possibilities on dry land!\nLEGO® 4+ sets get youngsters building right away with a special Starter Brick. As they build, their confidence grows, and they discover a never-ending universe of amazing characters and creative play possibilities.\nPacked with fun features and awesome accessories for imaginative play and super-hero action, this cool toy construction set is an ideal Christmas or birthday gift for preschoolers and youngsters aged 4 and up.\nWith the Batboat measuring over 5” (13cm) long, this small toy for kids inspires super-hero fun on an epic scale – and when the action stops, it looks great on display in any kid’s bedroom.\nNo batteries required. This hands-on, buildable toy is fueled by kids’ imaginations – so the fun never stops!\nThe included simple guide helps youngsters build, play and develop confidence as they learn the purpose of the building steps.\nLEGO® DC playsets bring comic-book, super-hero action to kids' toys. With famous characters and cool vehicles, gadgets and weapons, fans can relive favorite scenes and create adventures of their own.\nLEGO® building toys for kids meet the highest industry standards, which means every playset is consistent, compatible and connects and pulls apart perfectly every time – and it’s been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure every kid's LEGO gift meets the best toy safety and quality standards in the world."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/knightmare-batman-acc-set-2018-853744","description":"Let the battle commence against the Parademons with this LEGO® DC Super Heroes 853744 Knightmare Batman™ Accessory Set. This cool toy for kids features Batman’s turret with 2 stud shooters and 3 minifigures with assorted weapons, including the new-for-September-2018 Knightmare Batman minifigure and his rifle with an attachable LEGO tile of The Joker's face.\n\nIncludes a new-for-September-2018 Knightmare Batman™ and 2 Parademon™ minifigures with detachable wings.\nBatman’s turret features 2 stud shooters.\nWeapons include Batman’s rifle (with an attachable decorated LEGO® tile of The Joker’s face) and the Parademons' 2 stud shooters.\nRecreate the famous Knightmare scene from the Batman™ v Superman™: Dawn of Justice movie.\nTurret measures over 1” (3cm) high and 1” (5cm) wide."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/batman-keyring-853951","description":"Keep the Caped Crusader with you wherever you go when you attach the LEGO® DC 853951 Batman™ Key Chain to your keys or backpack. With an updated design for January 2019, this Batman minifigure linked to a sturdy metal ring, chain and LEGO tag makes a cool gift for all fans of the Dark Knight.\n\nFeatures a LEGO® DC Batman™ minifigure linked to a durable metal ring, chain and LEGO tag.\nAttach it to your keys or backpack.\nMinifigure is not detachable from metal chain."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/batwoman-key-chain-853953","description":"Carry a super hero with you when you attach the LEGO® DC 853953 Batwoman™ Key Chain to your keys or backpack. With an updated design for January 2019, this Batwoman minifigure linked to a sturdy metal ring, chain and LEGO tag makes a great gift for all fans of this popular DC character.\n\nFeatures a LEGO® DC Batwoman™ minifigure linked to a durable metal ring, chain and LEGO tag.\nAttach it to your keys or backpack.\nMinifigure is not detachable from metal chain."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/lego-super-heroes-wonder-woman-keyring-853433","description":"Show off the pride of Paradise Island with an authentic LEGO® Super Heroes Wonder Woman minifigure! This classic comic heroine comes attached to a sturdy metal ring and chain for attaching to your keys or backpack! Makes a great gift for LEGO Super Heroes fans!\n\nFeatures authentic LEGO® Super Heroes Wonder Woman minifigure attached to a sturdy metal ring and chain\nAttach to your keys or backpack!\nMinifigures are not detachable from metal chain\nMakes a great gift for fans of LEGO Super Heroes building sets!"},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/superman-keyring-853952","description":"Team up with the Man of Steel when you attach the LEGO® DC 853952 Superman™ Key Chain to your keys or backpack. With an updated design for January 2019, this Superman minifigure linked to a sturdy metal ring, chain and LEGO tag makes a great gift for all fans of this legendary super hero.\n\nFeatures a LEGO® DC Superman™ minifigure linked to a durable metal ring, chain and LEGO tag.\nAttach it to your keys or backpack.\nMinifigure is not detachable from metal chain."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/dc-super-heroes-series-complete-box-66638","description":"Kids and fans with a passion for super heroes will love these awesome LEGO® Minifigures (66638) DC Super Heroes Series collectible sets. Children and adult fans can collect a range of character toys, old and new, from the expansive DC Universe, including Aquaman™, Batman™, Bat-Mite™, BUMBLEBEE, Cyborg™, The Flash™, Green Lantern™, Metamorpho™, Mister Miracle™, Sinestro™, Wonder Woman™, Superman™, The Joker™, Huntress™, The Cheetah™ and Stargirl™. Each of the finely crafted, highly detailed minifigures comes in a sealed mystery bag with one or more accessory elements to add to the fun, a collector's leaflet with information on the character and a posing brick to display them in different poses.\n60 Limited Edition LEGO® Minifigures characters to build and play out your very own adventures! The full case contains 60 individual bags and at least one complete collection of all 16 minifigures in the series.\nInspire thrilling super-hero role play with these cool minifigures. A great gift for kids and fans of the DC Universe. Play starts straight out of the bag! These also make great collectibles for fans of any age.\nWhat’s in the bag? Kids can discover super heroes or villains they've never met before to add to their LEGO® Minifigures collections, with different characters from the DC Universe comic books.\nThese awesome characters are great for independent play, where kids can help their favorite super heroes face off against villains and save the day, be part of new stories with other models or collect and display.\nAny fan of the DC Universe will love these unique collectible super heroes. The detailed LEGO® minifigures (66638) and their accessories will thrill any kid and make a great gift for boys and girls aged 5+.\nSmall yet mighty. The individual mystery bags each contain 1 of 16 DC Universe super hero minifigures, complete with one or more accessories and a posing brick. Totally portable and ready for play and display.\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills, plus it gives them the joy of imagining new stories all on their own.\nOpen the bag and the play begins with assembling the minifigure. Easy-to-follow instructions make building a snap, giving kids the joy of constructing their own cool super-hero toy - and loads of creative fun.\nGive youngsters iconic characters for play or display with LEGO® Minifigures collectibles. These fun, mini playsets offer open-ended play that helps build children’s creativity and imagination skills.\nLEGO® bricks meet the highest industry standards and quality criteria, so they are consistent, compatible and connect and come apart easily every time – it's been that way since 1958.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® bricks and pieces to make sure every kid's building toy meets the highest global safety and quality standards.\nPLEASE NOTE: Each ‘mystery’ bag contains one of the 16 DC Super Heroes minifigure characters available in this collection. This box includes 60 'mystery' bags, and at least one complete collection."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/batcave-clayface-invasion-76122","description":"Inspire kids to create their own thrilling stories with this 1,037-piece LEGO® DC Batman™ 76122 Batcave Clayface™ Invasion construction toy. The Batcave is packed with play-starting features and functions including a Batcomputer zone, detachable transformation tower with a function to ‘transform’ Bruce Wayne™ into Batman and a detachable jail building with an explode function to play out a prison break. This super-hero toy playset also includes the Bat-Tank™ with a rotating turret with 4 flick missiles, plus a stud shooter and hook shooter, each of which can be detached and used as minifigure weapons. Children can also get creative by using the included Action Pack elements and Bat Family Pack elements to customize builds, minifigures and weapons. And with 6 minifigures and a posable, big build Clayface, this cool kids’ toy makes a great super-hero gift for Batman fans.\n\nThis LEGO® Batman™ toy playset includes 6 minifigures: Batman, Bruce Wayne™, Robin™, Batwoman™, Catwoman™ and Two-Face™, plus a posable, Clayface™ big figure with snapping jaws and gripping hands that can hold a minifigure.\nThis set features the LEGO® Batcave toy with Batcomputer zone, hi-tech zone, workout zone, weapons room, trophy room and detachable transformation tower and jail modules, plus a Bat-Tank™.\nThe Batcave’s Batcomputer zone features a desk, rotating minifigure chair and 5 computer screen elements with computer graphics stickers.\nHi-tech zone features a buildable backpack for the Batman™ minifigure with detachable building tools.\nTrophy room has 3 podiums to display 3 iconic artifacts from the Batman™ universe—dinosaur statue, giant penny and The Joker™ card elements.\nTransformation tower features a function to ‘transform’ Bruce Wayne™ into Batman™—place the Bruce Wayne minifigure on top next to the telephone element, the Batman™ minifigure inside, then pull the pin on the back to make Bruce disappear and Batman appear at the base of the tower.\nJail features an explode function to blow out the prison bars, plus a rooftop parking spot for the Batwing included in the 76120 Batman™ Batwing and The Riddler™ Heist playset.\nBat-Tank™ features an opening minifigure cockpit, rotating turret with 4 flick missiles, plus a detachable stud shooter and hook shooter.\nThis Batman™ toy playset includes Batman’s Batarang, Batwoman’s Batarang, Catwoman’s whip and Two-Face’s dynamite and non-shooting gun.\nAccessory elements include 10 assorted Action Pack elements and 10 assorted Bat Family Pack elements to customize builds, minifigures and weapons.\nBatman™, Bruce Wayne™, Robin™, Catwoman™ and Two-Face™ minifigures are new for June 2019.\nThis set includes over 1,037 pieces.\nThis cool kids’ toy makes the best birthday gift for Batman™ fans.\nLEGO® Batcave toy including detachable prison and transformation tower modules measures over 8” (22cm) high, 16” (43cm) wide and 3” (9cm) deep.\nBat-Tank™ measures over 3” (8cm) high, 3” (8cm) long and 2” (7cm) wide.\nClayface™ stands over 4” (12cm) tall."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/batman-batwing-and-the-riddler-heist-76120","description":"Kids can dream up their own exciting adventures with this LEGO® DC Batman™ 76120 Batman Batwing and The Riddler™ Heist playset. The iconic Batwing building toy has cool features and functions to thrill Batman fans including new-for-June-2019 rapid-fire multi shooters and shooters which can shoot tiles or studs. This Batman toy playset also includes The Riddler's helicopter with a chain and hook to attach to a lockable safe containing cash and gem elements, and Commissioner Gordon's police car to play out a robbery getaway and pursuit. A great birthday gift for kids, it also includes 4 minifigures with weapons, plus 10 assorted Action Pack elements to customize builds, minifigures and weapons.\n\nThis super-hero kids’ toy includes 4 new-for-June-2019 LEGO® minifigures: Batman™, Commissioner Gordon™, SHAZAM!™ and The Riddler™.\nBatman’s Batwing features an opening minifigure cockpit, 2 new-for-June-2019 rapid-fire multi shooters with tile ammo and 2 shooters which can fire tiles or studs.\nEach multi shooter can fire 3 tiles in quick succession.\nCommissioner Gordon's police car features a minifigure driver's seat, removable roof for easy access and GOTHAM CITY™ police stickers.\nThe Riddler’s helicopter has an opening minifigure cockpit, spinning rotors, 2 flick missiles and a chain with a hook to pick up the safe.\nSafe features a locking function and 2 gem and 2 $100 bill cash elements inside.\nTurn the dial on the safe’s door to lock it.\nThis LEGO® Batman™ toy playset includes Batman's Batarang and SHAZAM!'s 2 Power Bursts.\nAccessory elements include The Riddler's crowbar, plus 10 assorted Action Pack elements to customize builds, minifigures and weapons.\nBatwing fits on the roof of the Batcave jail in LEGO® DC Batman™ 76122 Batcave Clayface™ Invasion playset.\nThis cool kids’ toy makes the best super-hero gift for Batman™ fans.\nBatwing toy measures over 1” (5cm) high, 6” (17cm) long and 7” (19cm) wide.\nPolice car measures over 1” (4cm) high, 5” (14cm) long and 1” (5cm) wide.\nHelicopter measures over 3” (8cm) high, 7” (20cm) long and 1” (4cm) wide."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/batman-and-the-joker-escape-76138","description":"Young children will love role-playing as Batman™ to stop a Super-Villain prison breakout with this LEGO® DC Batman 76138 Batman and The Joker™ Escape super-hero toy playset. Specially designed to be fun and easy for preschoolers, this LEGO 4+ set includes a Batman helicopter toy with a special Starter Brick chassis that lets even first-time builders experience the pride of building all on their own. An ideal birthday gift, this kids’ toy playset also features an Arkham Asylum model with lots of details to inspire play including 2 jail cells with walls that can be pulled down by attaching a chain and hook from Harley Quinn’s bike. It comes with 4 LEGO minifigures with weapons and a simple guide to build and play. Instructions PLUS are also available for this Batman playset in the LEGO Life app for smartphones and tablets. These easy-to-use, intuitive building instructions let kids zoom, rotate and visualize their creation using the special ghost mode as they go.\n\nLEGO® 4+ sets are specially designed to be fun and easy for youngsters and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nThis super-hero toy includes 4 LEGO® minifigures: Batman™, Harley Quinn™, The Joker™ and a prison guard.\nArkham Asylum features an opening barrier, entrance doors with a removable crossbar lock, watchtower with a minifigure seat, 2 prison wings each with an opening jail cell for a minifigure, rotating buildable searchlight, TV screen element with image of The Joker™, buildable control panel with a detachable handcuffs element, plus 3 Batman villains’ possessions—buildable Scarecrow™ fear gas container and Mr. Freeze™ ray gun, plus Penguin’s hat element.\nBatman’s helicopter features a Starter Brick chassis, opening minifigure cockpit and rotating rotors.\nHarley Quinn’s bike features space for a minifigure plus a chain and hook to pull the mobile catapult or pull down the prison cell walls.\nMobile catapult has 2 launchers plus 3 buildable bombs.\nThis cool Batman™ toy playset includes Batman’s Batarang and megaphone element, and Harley Quinn’s baseball bat.\nHarley Quinn™ and The Joker™ minifigures with prison outfit decoration are new for June 2019.\nThe best super-hero gift for preschoolers, LEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ building sets were previously known as LEGO Juniors and can be built together with all other original LEGO sets and LEGO bricks for creative building.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nArkham Asylum measures over 8” (21cm) high, 9” (23cm) wide and 3” (10cm) deep.\nBatman™ helicopter toy measures over 3” (9cm) high, 5” (14cm) long and 1” (4cm) wide."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/wonder-woman-77906","description":"LEGO® DC Wonder Woman™ (77906) brings together 3 classic characters from the Wonder Woman comic book in a buildable, play-and-display action scene.\n\nHands-on Wonder Woman display set\nSuperhero fans of any age can build their own recreation of a superhero battle between Wonder Woman™ and Cheetah™ – as seen on the cover of the classic Wonder Woman comic. As the model features the same iconic characters as the Wonder Woman 1984 movie – Wonder Woman and Cheetah – it's also the ideal gift for fans of the blockbuster movie. The 3 collectible minifigures are displayed in an outdoor environment set on a sturdy base. The completed model will add a great conversation piece to any room.\n\nPopular action minifigure toys from LEGO DC\nLEGO DC construction toys let children role-play as their favorite characters in good vs. evil conflicts to save the world! With legendary super heroes and cool gadgets, LEGO DC building sets make great gifts for kids, inspiring individual and group play that never ends.\n\nFans of Wonder Woman™ can bring together 3 of the comic’s characters in LEGO® DC Wonder Woman (77906). Great for superhero play and display.\nIncludes 3 minifigures – Wonder Woman™, Cheetah™ and Etta Candy™ – in an outdoor battle scene set on a sturdy base with a nameplate attached to the front.\nWonder Woman™ and Cheetah™ provide super-hero action as they battle it out. Wonder Woman's best friend, Etta Candy™, is eager to lend a helping hand.\nThe thrilling super hero scene is capturedin a striking display piece that will appeal to Wonder Woman™ fans of all ages and captivate all who see it.\nThe model measures over 4 in. (11 cm) high, 4 in. (12 cm) long and 3 in. (9 cm) wide. The minifigures easily remove for hands-on action and combine with other LEGO® DC sets for extra imaginative play.\nLEGO® DC playsets inspire imaginative group and solo play as kids recreate favorite movie scenes, make up stories of their own and put the awesome playsets on display in their room.\nLEGO® bricks and pieces satisfy rigorous industry standards to ensure they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958.\nLEGO® sets are dropped, heated, crushed, twisted and analyzed to make sure they fulfil stringent global safety standards."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/batmobile-pursuit-of-the-joker-76119","description":"Kids will love pretending to be Batman™ and The Joker™ with LEGO® DC Batman 76119 Batmobile™: Pursuit of The Joker. This classic Batmobile toy car model has lots of eye-catching features to delight young super heroes, including a detailed dashboard in the opening minifigure cockpit, Bat symbol decoration on the wheel trims and a flame exhaust element that automatically rotates when the car is pushed along. The Batmobile's hidden, foldout stud shooters are also great for battles against The Joker, who is also equipped with a stud shooter. This LEGO Batman toy playset includes 2 minifigures and children can customize their builds, minifigures and weapons with the included pack of 10 assorted Bat elements. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement.\n\nThis super-hero toy playset includes 2 new-for-June-2019 LEGO® minifigures: Batman™ and The Joker™.\nBatmobile™ features an opening minifigure cockpit with detailed dashboard, 2 hidden, foldout stud shooters, opening hood with brick-built engine inside, automatic spinning flame exhaust element function, wheel trims with Bat symbol decoration, 2 batwings and translucent yellow and red light elements.\nThe flame exhaust element spins around when the car is moved along.\nThis LEGO® Batman™ toy playset includes The Joker’s stud shooter and 10 assorted Bat elements to customize builds, minifigures and weapons.\nThis cool kids’ toy makes the best super-hero gift for Batman™ fans.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions for this super-hero toy. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nBatmobile™ toy car measures over 2” (7cm) high, 9” (24cm) long and 2” (6cm) wide."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/mr-freeze-batcycle-battle-76118","description":"Children can create their own thrilling adventures as Batman™ and Robin™ and bid to save GOTHAM CITY™ from Mr. Freeze™ in LEGO® DC Batman 76118 Mr. Freeze Batcycle Battle. Great for solo or social play, this super-hero toy playset features the Batcycle with a dual minifigure cockpit, stud shooter and detachable weapons, and kids will love the split function to divide the vehicle into 2 separate bikes. Mr. Freeze's snow scooter and backpack with attached freeze gun add to the super heroes vs. Super-Villain battle fun. This LEGO Batman toy includes 3 LEGO minifigures with weapons, plus 10 assorted Action Pack elements to customize builds, minifigures and weapons. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement.\n\nThis super-hero toy playset includes 3 LEGO® minifigures: Batman™, Robin™ and Mr. Freeze™.\nBatcycle features a dual minifigure cockpit for Batman™ and Robin™, a stud shooter, Batman’s Batarang and grappling hook shooter, Robin’s sword, 2 non-shooting guns, 2 batwings and a split function to divide the vehicle into 2 separate bikes.\nThe Batarang, grappling hook shooter, sword and 2 guns can be detached from the Batcycle and held by minifigures for battle action.\nAlso includes a snow scooter with space for the Mr. Freeze™ minifigure.\nAccessory elements include Mr. Freeze’s new-for-June-2019 helmet and backpack with an attached, non-shooting freeze gun, plus 10 assorted Action Pack elements to customize builds, minifigures and weapons.\nAll 3 minifigures in this LEGO® DC Batman™ toy playset are new for June 2019.\nThis cool kids' toy makes the best super-hero birthday gift for Batman™ fans.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions for this Batman™ playset. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nBatcycle measures over 1” (5cm) high, 4” (11cm) long and 3” (8cm) wide.\nSnow scooter measures over 2” (6cm) long, 1” (4cm) wide and under 1” (2cm) high."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/batman-vs-the-riddler-robbery-76137","description":"Give preschoolers and youngsters a fun introduction to super-hero adventures with this LEGO® DC Batman™ 76137 Batman vs. The Riddler™ Robbery toy playset. This easy-to-build LEGO 4+ safe learning set features a Batmobile™ toy car with a special Starter Brick chassis that lets even first-time builders experience the pride of constructing buildings, vehicles and more, all on their own. The included simple guide to build and play will also help young builders understand the purpose of the building instructions and expand their imagination and confidence. This super-hero toy playset also includes a buildable ATM cash machine with an attachment point for dynamite. An ideal super-hero gift for Batman fans, children will love role-playing their own stories with 2 minifigures plus weapons and accessories including The Riddler's buildable skateboard.\n\nLEGO® 4+ toy building sets are specially designed to be fun and easy for youngsters and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nThis LEGO® DC Batman™ playset includes 2 minifigures: Batman and The Riddler™.\nThe easy-to-build Batmobile™ toy car features a Starter Brick chassis, minifigure cockpit, 2 separate attachment points for Batman's Batarang, 2 batwings and a flame exhaust element.\nBuildable ATM cash machine features an attachment point for The Riddler’s dynamite element.\nWeapons include Batman’s Batarang and The Riddler’s dynamite.\nAccessories includes The Riddler’s buildable skateboard and crowbar element.\nThe Riddler™ minifigure is new for June 2019.\nLEGO® 4+ creative toys introduce your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ building sets were previously known as LEGO Juniors and can be built together with all other original LEGO sets and LEGO bricks for creative building.\nThis super-hero toy makes the best birthday gift for preschoolers and youngsters who love Batman™.\nBatmobile™ toy car measures over 1” (4cm) high, 5” (15cm) long and 1” (4cm) wide.\nATM measures over 1” (5cm) high, 1” (5cm) wide and 1” (3cm) deep."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/dc-super-heroes-series-71026","description":"Kids and fans with a passion for super heroes will love these awesome LEGO® Minifigures (71026) DC Super Heroes Series collectible sets. Each mystery bag contains 1 of 16 different super-hero or villain characters from the DC Universe. Outstanding character lineup Children and adult fans can collect a range of character toys, old and new, from the expansive DC Universe, including Aquaman™, Batman™, Bat-Mite™, BUMBLEBEE, Cyborg™, The Flash™, Green Lantern™, Metamorpho™, Mister Miracle™, Sinestro™, Wonder Woman™, Superman™, The Joker™, Huntress™, The Cheetah™ and Stargirl™. Exciting accessories and posing brick for display Each of the finely crafted, highly detailed minifigures comes in a sealed mystery bag with one or more accessory elements to add to the fun, a collector's leaflet with information on the character and a posing brick to display them in different poses.\nInspire thrilling super-hero role play with these cool minifigures. A great gift for kids and fans of the DC Universe. Play starts straight out of the bag! These also make great collectibles for fans of any age.\nWhat’s in the bag? Kids can discover super heroes or villains they've never met before to add to their LEGO® Minifigures collections, with different characters from the DC Universe comic books.\nThese awesome characters are great for independent play, where kids can help their favorite super heroes face off against villains and save the day, be part of new stories with other models or collect and display.\nAny fan of the DC Universe will love these unique collectible super heroes. The detailed LEGO® minifigures (71026) and their accessories will thrill any kid and make a great gift for boys and girls aged 5+.\nSmall yet mighty. These mystery bags each contain 1 of 16 DC Universe super hero minifigures, complete with one or more accessories and a posing brick. Totally portable and ready for play and display.\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills, plus it gives them the joy of imagining new stories all on their own.\nOpen the bag and the play begins with assembling the minifigure. Easy-to-follow instructions make building a snap, giving kids the joy of constructing their own cool super-hero toy - and loads of creative fun.\nGive youngsters iconic characters for play or display with LEGO® Minifigures collectibles. These fun, mini playsets offer open-ended play that helps build children’s creativity and imagination skills.\nLEGO® bricks meet the highest industry standards and quality criteria, so they are consistent, compatible and connect and come apart easily every time – it's been that way since 1958.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® bricks and pieces to make sure every kid's building toy meets the highestglobal safety and quality standards."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/lego-dc-comics-super-heroes-superman-minifigure-clock-5002424","description":"Hit the streets of Metropolis or just hit snooze with the Superman™ Minifigure Clock! Make your LEGO® décor collection fun and functional with a digital, lighted display and alarm clock. Makes a great gift for fans of the LEGO DC Universe Super Heroes building sets!\n\n\n• Features jumbo Superman™ minifigure with a fabric cape and digital LCD display alarm clock with snooze\n• Movable wrists, legs, arms and head\n• Easy-to-read digital LCD display\n• Makes a great gift for fans of the LEGO® DC Universe Super Heroes building sets!\n• Measures over 9\"\" (22cm) tall"},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/lego-dc-super-heroes-visual-dictionary-5005730","description":"Celebrate the entire action-packed DC Universe of super heroes and Super-Villains with the LEGO® DC Super Heroes Visual Dictionary. This comprehensive guide to LEGO DC construction toys—including THE LEGO BATMAN MOVIE sets—features full-color images of the models, characters, vehicles, weapons and gadgets, complemented by lots of fascinating facts and figures. Fans can explore every detail of the Batcave™, Wonder Woman's Invisible Jet, Lex Luthor's powerful mech, the crazy rides at Jokerland and much more. Readers also get a look behind the scenes at the LEGO Group’s HQ in Billund, Denmark, and meet the team that creates such brilliant sets. This 128-page book comes with an exclusive Yellow Lantern Batman™ minifigure, a great addition to any LEGO fan's collection.\n\nThis hardcover, illustrated, 128-page book features full-color images of LEGO® DC sets, minifigures, vehicles, weapons and gadgets plus lots of fascinating facts and figures.\nIncludes an exclusive Yellow Lantern Batman™ minifigure.\nThis book is in English.\nMeasures over 11” (30cm) long and 9” (25cm) wide."},{"theme":"dc","themeUrl":"https://www.lego.com/en-us/themes/dc","productUrl":"https://www.lego.com/en-us/product/lego-dc-comics-super-heroes-supergirl-keyring-853455","description":"Give your keys or backpack a touch of super-hero class with this fun Supergirl key chain. With a sturdy metal ring and chain, this minifigure charm is just the thing for budding super heroes of any age.\n\nFeatures an authentic LEGO® DC Comics™ Super Heroes Supergirl minifigure on a sturdy metal ring and chain\nUse as a key chain or backpack charm\nMinifigure is not detachable from metal chain\nMakes a great gift for any fan of LEGO® building sets or DC Comics movies and comic books"}]