[{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/elsa-and-the-nokk-storybook-adventures-43189","description":"Kids can explore scenes and stories from Disney’s Frozen 2 in this imaginative LEGO® ǀ Disney Elsa and the Nokk Storybook Adventures (43189) set. This set features a customizable opening book and a sticker sheet to decorate it, plus printed building instructions and digital Instructions PLUS. Using the LEGO Building Instructions app, kids can zoom, rotate and visualize the model. The guided building process lets even younger builders feel like master builders… awesome!\n\nOn-the-go role-play fun\nKids get lots of creative fun with this portable set. It can be played with on its own or added to other LEGO ǀ Disney sets, and is packed with features and play starters to inspire imagination.\n\nFavorite characters and exciting scenes\nThis creative LEGO ǀ Disney set gets kids playing quickly with 3 micro-doll figures – including Iduna and 2 versions of Disney’s Elsa – plus Olaf, the Nokk and Earth Giant LEGO figures. The storybook makes a great gift that a great kid deserves for everyday play.\n\nSpark exciting movie-based role play or creative fun with this LEGO® ǀ Disney Elsa and the Nokk Storybook Adventures (43189) set. Play starts with opening the book!\nWhat’s waiting in the Enchanted Forest and beyond? This cool set features an opening book with a 2-sided center build, free-form stickers and plenty of play starters for imaginative fun.\nThese beloved micro-characters, including Disney’s Elsa, Olaf, Earth Giant, Nokk and Iduna, are ready for adventure in this buildable toy or together with other sets for new stories and fun.\nAny Disney’s Frozen 2 fan will love this set. The book opens to a complete micro-world that will thrill any child as a great everyday, Christmas or birthday treat for boys and girls aged 5 and up.\nPortable adventures. With the open book measuring over 9 in. (23 cm) wide, 4 in. (12 cm) deep and 3 in. (8 cm) high, this set is big enough for new escapades or can be packed up for on-the-go fun.\nPrinted building instructions are great, but digital Instructions PLUS are awesome! Using the LEGO® Building Instructions app, even younger builders can zoom in on and visualize models as they build.\nWith detailed micro-doll figures and recognizable scenes, this Disney’s Frozen 2 buildable toy house offers story starters and encourages open creative play that helps build important skills.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/bruni-the-salamander-buildable-character-43186","description":"Hit the right note with fans of Disney’s Frozen 2 with this sweet LEGO® ǀ Disney Bruni the Salamander Buildable Character (43186) set. This great little kit features a bright blue buildable salamander figure and 3 small builds. The set also comes with printed building instructions and digital Instructions PLUS! When kids use the LEGO Building Instructions app, the guided real-life building process leaves even younger builders feeling like real master builders… awesome!\n\nCute character\nThis small set includes a salamander LEGO buildable figure, with big eyes and an opening mouth, plus a small fire with a flame, 2 sticks with marshmallows and a snowflake that balances on the salamander’s tongue.\n\nAn unexpected treat\nThis little character is ready to come to life with help from a child’s imagination. The set features a LEGO buildable salamander figure from Disney’s Frozen 2 movie. It makes a nice little extra gift to make a child happy and encourages kids to build role-play skills through fun.\n\nTreat a youngster with this fun LEGO® ǀ Disney Bruni the Salamander Buildable Character (43186) set. Small extra builds encourage endless imaginative play.\nThis cute set, based on Disney’s Frozen 2, includes a LEGO® buildable salamander figure, a small buildable toy campfire, snowflake and 2 buildable toy marshmallows on sticks.\nThis character set helps grow kids’ construction skills and set their imaginations free. This set makes a good play addition to any other LEGO® ǀ Disney Frozen 2 sets.\nFans of Disney’s Frozen 2 or other LEGO® ǀ Disney sets will love this set with its imaginative play options. The buildable model makes a perfect reward gift for children aged 6 and up.\nPortable and ready for fun, Bruni the Salamander stands over 1.5 in. (4 cm) high and 5.5 in. (14 cm) long and is designed to be built and played with again and again, independently or with friends.\nPrinted building instructions are great, but digital Instructions PLUS are awesome! Using the LEGO® Building Instructions app, even younger builders can zoom in on and visualize models as they build.\nEnchant kids with the excitement and adventure of Disney’s Frozen 2 with this creative LEGO® ǀ Disney set. Children can explore the wonders of the world with this cute character!\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/arendelle-castle-village-41167","description":"The LEGO® l Disney Frozen II 41167 Arendelle Castle Village playset will give any fan of the movie endless hours of magical creative play. Perfect for reenacting favorite scenes, Anna and Elsa’s home has 3 stories that can be easily removed and reassembled for play access inside. The furniture pieces are also designed to be easily moved and rearranged between the throne room, bedroom and attic floors. Outside, the market stalls are full of their finest produce, and there's a rowing boat at the jetty, just waiting to be taken on an adventure! This Arendelle playset includes 3 favorite Disney characters and 3 LEGO animal figures.\n\nIncludes Elsa, Anna and Kristoff mini-doll figures, plus 3 LEGO® animal figures: a cat and 2 birds.\nFeatures a 3-story castle with throne room, bedroom and attic, baker’s stall, fishmonger’s stall with small dock and a rowing boat with oars.\nAccessory elements include a portrait and easel, treasure chest, crown, telescope, bust with stand, bird house, lamppost, gift box, gift, fish, crab, bread, vegetables, broom and a sword.\nInspire imagination as kids create, build and play out the Frozen II universe in Anna and Elsa’s castle, then make up new settings and Frozen stories using the LEGO® bricks.\nLift the comforter to ‘tuck’ a mini-doll inside the bed!\nThe furniture pieces are designed to be easily moved and mixed around between the rooms.\nThe modular style means the 3 stories can be taken apart and reassembled, making it easy for friends to play inside different parts of the castle at the same time.\nThis Frozen playset for all fans of the Frozen II movie makes an ideal Christmas gift or birthday gift.\nCombine with the 41164 Enchanted Treehouse, 41165 Anna’s Canoe Expedition, 41166 Elsa’s Wagon Adventure, 41168 Elsa’s Jewelry Box Creation and 41169 Olaf for even more LEGO® l Disney Frozen II adventures.\nFrozen castle measures over 11” (30cm) high, 11” (30cm) wide and 4” (12cm) deep.\nBaker's stall measures over 3” (8cm) high, 1” (4cm) wide and 1” (3cm) deep.\nFishmonger stall with dock measures over 2” (7cm) high, 3” (8cm) wide and 2” (6cm) deep.\nRowing boat measures over 1” (5cm) high, 4” (12cm) long and 1” (4cm) wide."},{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/elsa-s-magical-ice-palace-43172","description":"Help your young Disney Frozen fan replay scenes from Disney’s Frozen and Frozen Fever with a grand Ice Palace. This cool toy LEGO® l Disney playset for kids features a 2-story palace with special sliding bridge, revolving staircase and kitchen with table and chairs, an outdoor playground with snow fort, tree and working seesaw, plus a 3-carriage sleigh. Children can have hours of fun and imaginative play with this holiday gift set that comes with Elsa and Anna mini-dolls, plus Olaf, Marshmallow and 4 Snowgie minifigures.\n\nIncludes LEGO® l Disney Frozen Elsa and Anna mini-doll figures, plus Olaf, Marshmallow and 4 Snowgie minifigures.\nThis beautiful playset includes a palace with sliding bridge and revolving staircase, translucent balcony, kitchen with table and chairs, and a music room with music stand and sheet music, plus an outdoor playground with snow fort and seesaw.\nThis cool toy for kids also includes a 3-carriage sleigh for snowy role-play fun.\nAccessory elements include a teapot, glasses, cake, carrot, chocolate, sheet music, mirror and a rug.\nHave fun building this enormous Ice Palace with special functions to add to the imagination and magic.\nPlay out scenes from Disney’s Frozen and Frozen Fever.\nCreate new adventures with some of your favorite Frozen characters with this fun holiday gift.\nElsa's Magical Ice Palace measures over 12” (31cm) high, 11” (30cm) wide and 7” (19cm) deep.\nPlayground with snow fort measures over 2” (6cm) high, 7” (20cm) wide and 1” (4cm) deep.\nSleigh with carriages measures over 4” (12cm) long and 1” (3cm) wide."},{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/frozen-ice-castle-10899","description":"Join Disney’s Anna, Elsa and Olaf at the LEGO® DUPLO® l Disney 10899 Frozen Ice Castle to share imaginative play and precious developmental milestones with your preschooler. As toddlers role-play with their favorite Disney Frozen characters, they improve their language and fine motor skills, and develop social and emotional awareness. Talk about Elsa's relationship with her sister Anna. Enjoy open-ended creative fun with Olaf the snowman. With a multicolored light brick feature illuminating the castle at the push of a button, you and your little one will have endless enjoyment recreating scenes from Disney’s Frozen movie and dreaming up stories of your own with this sparkling Ice Castle toddler toy building set.\n\nIncludes 3 LEGO® DUPLO® figures: Anna, Elsa and Olaf.\nThis Disney Frozen castle toy features a slide, table, chairs and kitchen equipment. A special button-operated light brick provides multicolored illumination for the castle.\nHelp your child master basic construction skills and improve their fine motor abilities as the building bricks are assembled and re-positioned for endless imaginative play.\nThis buildable toys for toddlers is designed to encourage role-play and storytelling to help your child develop language, social and emotional skills.\nThe Disney Frozen Ice Castle measures over 11” (28cm) high, 7” (19cm) wide and 6” (16cm) deep."},{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/elsa-s-jewelry-box-creation-41168","description":"The LEGO® l Disney Frozen II 41168 Elsa’s Jewelry Box Creation makes a perfect gift for fans of the Disney Frozen movies. This decorative jewelry box for kids is inspired by Elsa’s ice castle with snowflake decoration, and features a turntable function to make Elsa and the Nokk, a mythical water spirit, spin around and around. The drawer itself has a lock function to keep jewelry or favorite bits and pieces safe inside, and there's a mirror to see how the jewelry looks on. The Frozen jewelry box comes with 2 LEGO rings and includes 2 characters from the movie: Elsa and the Nokk.\n\nIncludes an Elsa mini-doll figure and a Nokk LEGO® figure.\nFeatures an Elsa Frozen jewelry box with lockable drawer, mirror, spinning function for Elsa and the Nokk, and 2 LEGO® rings.\nStore favorite jewelry inside the drawer and flick the lock function to keep it safe.\nThis beautiful trinket box makes an ideal birthday gift or Christmas gift for a fan of the Disney Frozen films.\nThe Disney characters can be removed and added to any existing LEGO® Disney minifigure and mini-doll figure collection.\nMeasures over 9” (23cm) high, 5” (15cm) wide and 4” (12cm) deep."},{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/elsa-s-wagon-adventure-41166","description":"Let your child recreate magical moments from Disney’s Frozen II movie with LEGO® | Disney 41166 Elsa’s Wagon Adventure. This LEGO 4+ wagon toy building set is specially designed to be fun and easy for youngsters, with Disney characters and a LEGO baby reindeer figure for role-play fun and a special Starter Brick base that lets even first-time builders experience the pride of constructing buildings, vehicles and more, all on their own. The included simple guide to build and play will also help your Disney Frozen fan understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO brick building in a familiar Disney setting. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This Disney toy building kit for girls and boys and all fans of the Frozen II movie includes a mini-doll figure, plus 2 LEGO reindeer figures.\n\nLEGO® 4+ sets are specially designed to be fun and easy for youngsters and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nIncludes an Elsa Frozen mini-doll figure plus 2 LEGO® reindeer figures: Sven and a baby reindeer.\nFeatures Elsa’s wagon that can seat 2 mini-doll figures, harness to attach it to Sven, stable with water trough and campfire, hay feeder and a Frozen picnic area.\nSven reindeer’s buildable toy carriage features a Starter Brick base to quickly get your child building and playing in an exciting LEGO® | Disney Frozen adventure.\nAccessory elements include a carrot, cookie, cookie box, marshmallow and a brush.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ playsets were previously branded as LEGO Juniors and are compatible with all LEGO construction sets for creative building.\nThis Elsa construction toy makes an ideal gift for youngsters.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nCombine with 41165 Anna’s Canoe Expedition for even more 4+ LEGO® | Disney Frozen II magic.\nWagon with Sven attached measures over 2” (7cm) high, 8” (21cm) long and 5” (12cm) wide.\nStable measures over 2” (6cm) high, 3” (8cm) wide and 2” (6cm) deep."},{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/anna-and-elsa-s-storybook-adventures-43175","description":"Kids can play out life in Arendelle Castle with this unique LEGO® ǀ Disney Anna and Elsa’s Storybook Adventures (43175) set. This toy playset features a customizable, opening book with 2 areas, the outside of Arendelle Castle with a bridge, the castle itself with a folding roof and the inside of the castle, with grand piano and bedroom, plus 2 sticker sheets to decorate the book with.On-the-go role-play fun and excitementKids will stretch their imaginative role-play skills with this portable playset. It can be experienced on its own or combined with other LEGO ǀ Disney sets for even more creative play options. Plus, it makes a great Christmas gift or birthday present for a young Disney’s Frozen 2 fan.Favorite characters and scenes offer effortless playThis creative Disney gift comes with 3 detailed micro-doll figures, Disney Princess Elsa, Anna and Kristoff, plus an Olaf LEGO figure for Disney. These will get kids playing quickly, as will the areas made to inspire children’s imagination in this well-known world.\nSpark exciting movie-based role play or creative play with this imaginative LEGO® ǀ Disney (43175) set, featuring Disney’s Elsa, Anna, Kristoff and Olaf. Perfect for kids and fans. Play starts with opening the book!\nWhat fun can be found around the castle? Kids can flex their creativity and role-play skills as they explore the castle inside and out, dream up new stories or go sledding with Disney Princess Anna and Olaf.\nThese beloved micro-characters are great to play with in this set or with other models. Kids can adventure with Disney’s Elsa, Anna and Kristoff, hang outside with Olaf or come up with something completely new!\nAny fan of Disney’s Frozen 2 will adore this awesome set. The clever, opening book reveals a complete micro-world that will thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 5+.\nPortable micro-world travel toy to take anywhere. With the open book measuring over 9” (23cm) wide, 4” (12cm) deep and 3” (8cm) high, this awesome playset is big enough for new adventures or packable for on-the-go fun.\nHours of fun for a child’s imagination! Open-ended, battery-free toys help boost kids’ group play and problem-solving skills or give them the joy of creating new stories on their own through independent play.\nOpen the toy book and the play begins. Easy-to-follow instructions help make building a snap, giving kids the joy of imagining new scenarios and lots of creative excitement with the well-known ones in the book.\nGive children detailed characters and recognizable scenes to play out with LEGO® ǀ Disney sets. This imaginative Disney’s Frozen 2 playset offers cute story starters plus open creative play that helps build important skills.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it’s been that way since 1958.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® bricks and pieces to make sure every kid’s building toy meets the highest global safety and quality standards."},{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/anna-s-canoe-expedition-41165","description":"Let your child relive favorite scenes from Disney’s Frozen II movie with LEGO® | Disney 41165 Anna’s Canoe Expedition. This LEGO 4+ canoe playset is specially designed to be fun and easy, with a LEGO animal figure for role-play fun and a special Starter Brick base that lets even first-time builders experience the pride of constructing buildings, vehicles and more, all on their own. The included simple guide to build and play will also help your young Disney Frozen fan understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO brick building in a familiar Disney setting. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This Disney toy construction set for boys and girls and Frozen fans includes 2 Disney characters plus a LEGO bunny figure.\n\nLEGO® 4+ sets are specially designed to be fun and easy for youngsters and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nIncludes 2 iconic Disney character mini-doll figures: Anna and Olaf, plus a LEGO® bunny figure.\nThis adventure playset features an ice canoe with lamp and river scene with ice slide, seesaw, movable foliage and rocks with a sleeping earth giant image.\nAdventure canoe features a Starter Brick base to quickly get your child building and playing in an exciting LEGO® | Disney world of adventures.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ playsets were previously branded as LEGO Juniors and are compatible with all LEGO construction sets for creative building.\nThis Anna Frozen toy building set makes an ideal gift for youngsters.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nCombine with the 41166 Elsa’s Wagon Adventure Disney playset for even more 4+ LEGO® | Disney Frozen II magic.\nCanoe measures over 1” (3cm) high, 3” (9cm) long and 1” (3cm) wide.\nRiver scene measures over 3” (8cm) high, 11” (28cm) wide and 5” (15cm) deep."},{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/elsa-and-olaf-s-tea-party-10920","description":"This versatile Disney Frozen building toy for toddlers provides a world of play and educational possibilities. Playful, buildable learning toy for young kids and Frozen fans! While they have fun, toddlers progress toward key developmental milestones. They relate to Elsa and Olaf, so role-play boosts emotional development. They can role-play a range of scenarios, from a tea party to hide and go seek among the ice blocks, which develop their creative and visual-spatial awareness. Each piece is easy for little hands to pick up and place, so kids can rearrange the set to create stories of their own – great for imagination and fine motor skills. LEGO® DUPLO® starter sets and developmental toys These charming buildable playsets combine iconic themes, familiar settings, well-known characters and toddler-friendly bricks to stimulate preschooler development with creative fun. As play progresses from acting out simple scenes to role-playing make-believe stories, parents can join in and share precious moments with their children.\nInspire imaginative adventures and playful learning with Disney’s Elsa and Olaf from the blockbuster Frozen movies. The fun starts straight from the box – the developmental benefits last a lifetime!\nDisney’s Elsa and her adorable snowman friend, Olaf, are playing in the snow and building an icehouse! With a teapot, hot chocolate and cakes on the table, the scene is set for a super-cool tea party!\nChildren can explore imaginative fun with Disney's Elsa and Olaf. As they role-play endlessadventures, they also build their creative-thinking, fine-motor, visual-spatial and emotional skills.\nA great LEGO® starter set for budding builders and little Disney Frozen fans. With safe, toddler-friendly pieces, this buildable imaginative playset makes a great Christmas, birthday or any-other-day gift for kids aged 2 and up.\nWith the assembled ice house measuring over 3” (12cm) high, this captivating construction playset is big enough for serious play and small enough to pack up and take wherever kids go.\nNo batteries needed. Because it’s powered solely by kids’ imaginations, this great developmental toy boosts critical thinking and problem-solving skills. It gives kids control over the action… and the fun never ends!\nOpen the box and the imaginative role-play begins. There's no complex setting up and no fiddly pieces to assemble. Simple instructions ensure instant delighted smiles and captivated minds.\nIntroduce preschoolers to real-life scenarios, familiar characters, cute animals and free-thinking fun with LEGO® DUPLO® gifts for kids – buildable playsets that encourage open-ended creative play and grow young minds.\nLEGO® DUPLO® building sets meet the highest industry standards. This ensures they are easy for little fingers to pick up, place and pull apart – and it's been that way since 1969!\nAt The LEGO Group, we drop, squash, twist, heat, bend, scratch and stretch LEGO® DUPLO® bricks and pieces to make sure every little builder's DUPLO playset meets the highest global safety and quality standards."},{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/lego-%C7%80-disney-frozen-2-anna-key-chain-853969","description":"This LEGO® ǀ Disney Frozen 2 853969 Anna Key Chain attaches easily and securely to backpacks, bags, belts and keys. Dressed in her travel outfit and a cape, this Anna Key Chain makes a great gift for any Frozen 2 movie fan. Add key chains with other characters from the movie (sold separately) for even more Frozen fun.\n\nIncludes a LEGO® ǀ Disney Anna mini-doll figure.\nFeatures Anna wearing her travel outfit, including a cape, attached to a metal chain and ring.\nMini-doll figure is not detachable from the metal chain.\nLEGO® ǀ Disney Frozen 2 Anna Key Chain measures over 6” (16cm) long."},{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/lego-%C7%80-disney-frozen-2-elsa-keyring-853968","description":"This LEGO® ǀ Disney Frozen 2 853968 Elsa Key Chain attaches easily and securely to backpacks, bags, belts and keys. Featuring an Elsa mini-doll figure (non-detachable) dressed in her travel outfit and a cape, it makes a great gift for any Frozen 2 movie fan. Add key chains with other characters from the movie (sold separately) for even more Frozen fun.\n\nIncludes a LEGO® ǀ Disney Elsa mini-doll figure.\nFeatures Elsa wearing her travel outfit, including a cape, attached to a metal chain and ring.\nMini-doll figure is not detachable from the metal chain.\nLEGO® ǀ Disney Frozen 2 Elsa Key Chain measures over 6” (16cm) long."},{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/lego-%C7%80-disney-frozen-2-olaf-keyring-853970","description":"This LEGO® ǀ Disney Frozen 2 853970 Olaf Key Chain attaches easily and securely to backpacks, bags, belts and keys. Featuring the adorable and ever-cheerful snowman, this Olaf Key Chain makes a great gift for any Frozen 2 movie fan. Add key chains with other characters from the movie (sold separately) for even more Frozen fun.\n\nIncludes a LEGO® ǀ Disney Olaf figure.\nFeatures an Olaf the snowman figure attached to a metal chain and ring.\nMini-doll figure is not detachable from the metal chain.\nLEGO® ǀ Disney Frozen 2 Olaf Key Chain measures over 6” (16cm) long."},{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/enchanted-treehouse-41164","description":"There are so many forest adventures for Disney Frozen fans to build and play out in the LEGO® l Disney Frozen II 41164 Enchanted Treehouse set. This buildable magic treehouse playset features a bedroom area in the base of the tree and a dining area on the floor above. There's a ladder up to the lookout and an awesome zip line to whizz down to the enchanted forest floor, where kids will love to look after the 2 bunnies in their little house. A camping area and a fishing area with flying fish function are perfect for creating fun adventures with Anna, Olaf and Mattias from Frozen II. Explore the forest and discover the mythical stones on an epic and magical journey. Includes 3 favorite Disney characters from Frozen II and 3 LEGO animal figures.\n\nIncludes Anna and Mattias mini-doll figures, plus 4 LEGO® figures: Olaf, 2 bunnies and a fish.\nFeatures a treehouse with downstairs bedroom, upstairs dining area, lookout tower, zip wire, bunny house, camping area and a fishing area, plus a magic portal.\nAccessory elements include Mattias's sword, treasure chest, telescope, fishing rod, bucket, fish, glasses, plates, scissors, carrot and an apple.\nDisney Frozen fans will love to build a LEGO® treehouse and explore the enchanted forest to find the mythical stones.\nThe perfect Disney toy building kit for reenacting memorable scenes with Olaf, Anna and Mattias from Frozen II, or creating new role-play forest adventures with favorite Disney characters.\nThis buildable Frozen toy for boys and girls and for all fans of the Frozen II movie makes an ideal Christmas gift or birthday gift.\nCan be built together with all other original LEGO® bricks for creative building.\nCombine with 41165 Anna's Canoe Expedition, 41166 Elsa's Wagon Adventure, 41167 Arendelle Castle Village, 41168 Elsa’s Jewelry Box Creation and 41169 Olaf for even more LEGO® l Disney Frozen II adventures.\nTreehouse measures over 7” (20cm) high, 9” (25cm) wide and 7” (20cm) deep."},{"theme":"disney-frozen-2","themeUrl":"https://www.lego.com/en-us/themes/disney-frozen-2","productUrl":"https://www.lego.com/en-us/product/olaf-41169","description":"This LEGO® brick-built Olaf toy is loads of fun to build and play with. His arms and neck are articulated so you can position and move him however you like, and he comes with Frozen accessories to add to the fun. Disney Frozen II fans can channel the joy of this lovable snowman as they put on his blue bow tie or help him hold his pencil to write in his journal as he discovers the various wonders of life. When displayed at home or at work, this buildable Olaf Frozen character figure adds a ray of sunshine on even the coldest day, and is a great Frozen gift idea for Disney fans.\n\nFeatures a brick-built Olaf figure from Frozen II with adjustable arms and neck.\nAccessory elements include a blue bow tie, Olaf’s journal and a pencil.\nHave fun building and rebuilding your favorite Disney Frozen character.\nPerfect to display at home or in your office to brighten up every day.\nOlaf measures over 4” (14cm) high, 3” (10cm) wide and 1” (5cm) deep."}]