[{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/the-disney-castle-71040","description":"Bring the magical world of Disney to your home with The Disney Castle. This highly detailed LEGO® model with over 4,000 pieces offers a rewarding build and play experience, and comes with an array of exciting Disney-themed features and functions. The intricately detailed facade and towers replicate the iconic Walt Disney World® Resort Cinderella Castle, and each accessible castle room includes special features inspired by some of Disney’s greatest animated feature films, providing endless play possibilities with the included minifigures: Mickey Mouse, Minnie Mouse, Donald Duck, Daisy Duck and Tinker Bell, or other characters from your collection.\n\nIncludes 5 minifigures: Mickey Mouse with a tuxedo, Minnie Mouse with red dress, Donald Duck with classic outfit, Daisy Duck with pink skirt, lavender colored shoes and a bow, and Tinker Bell with wig element, skirt, wings and a magic wand.\nThe Disney Castle features a detailed facade with a stone bridge, clock, wide arched entrance, ornate balconies, spired towers, plus a four-story main building and a five-story, golden-spired main tower, both containing rooms with assorted Disney-inspired features and elements.\nCastle main building first floor features the main hall with large arched doorway, mosaic floor tiling, ornate chandelier, suits of armor, shield-decorated walls, grandfather clock, floor-standing vase with buildable flower elements, magic carpet and a golden lamp.\nCastle main building second-floor room features buildable dark-blue curtains with curtain pole, ornate buildable candelabra and rose, and glass case elements.\nCastle main building third-floor room features a chest with book of spells, mop and bucket elements, and access to the main tower second-floor room.\nCastle main building fourth-floor bedroom features a detailed bed with decorative golden headboard elements.\nMain tower first-floor kitchen features a large redbrick-patterned stove, workbench, buildable broom and pumpkin, plus pots, pans and assorted kitchen and food elements.\nMain tower second-floor room includes a spinning wheel and access to the castle main building third-floor room.\nMain tower third-floor room features a chest containing brush, scissor and lock of black hair elements, plus a balcony with 2 stud shooters for a firework-display function.\nMain tower fourth-floor room features a golden mirror, plus red apple and glass vase elements.\nMain tower fifth-floor room features a window bench and an arched window.\nAlso includes 2 frogs and a golden crown element.\nRemove part of the roof section to discover the glass slipper element and fairy-tale book element with printed cover.\nLaunch the fireworks and let the magic begin!\nCombine with other LEGO® minifigure characters for endless adventures!\nThis set offers an age-appropriate building experience for ages 16 and over.\nThis set includes over 4,000 LEGO® pieces.\nThe Disney Castle measures over 29” (74cm) high, 18.8” (48cm) wide and 12” (31cm) deep."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/disney-train-and-station-71044","description":"Gather the family for a rewarding build and play experience with the LEGO® ǀ Disney 71044 Train and Station. Kids will love to join Disney characters Mickey Mouse, Minnie Mouse, Chip, Dale and Goofy for magical adventures with this awesome LEGO train set, featuring a motorized steam-style locomotive with tender, passenger car and a luxurious parlor car, plus an oval track and an iconic Disney Parks®-style station building. This set comes with an array of cool details, including app-controlled functionality. Use a smart phone or tablet to drive the locomotive forward, reverse and emit realistic sound effects. Joining up the train cars is simple with the magnetic LEGO couplings, and the panels on the parlor car open for access to its detailed interior complete with table, armchairs, teapot and cup. And the fun doesn’t end there! Inside the toy train station building there’s an array of intricate brick-built furnishings and details, including draped windows, wall clock, ceiling chandelier and a tower room with a little LEGO surprise!\n\nIncludes 5 uniquely decorated LEGO® ǀ Disney minifigures with accessories: Mickey Mouse, Minnie Mouse, Chip, Dale and Goofy minifigures.\nThe LEGO® ǀ Disney Train and Station includes 16 curved pieces and 4 straight pieces of track, locomotive, tender, passenger car, parlor car and an iconic station building.\nLocomotive features a large red fender, red wheels with working coupling rods, a big smoke stack and a driver’s cab.\nTender contains a LEGO® Powered Up 88009 Hub and a LEGO Powered Up 88011 Train Motor.\nTrain and sound effects can be controlled via a smart device. Connect via Bluetooth from the LEGO® Powered Up app.\nRequires batteries (not included). Please refer to the product packaging for type and quantity.\nPassenger car has seating for the LEGO® ǀ Disney minifigures.\nRemove the panel on the parlor car to access a rich interior with table, armchairs, teapot and cup.\nStation exterior features a detailed facade with balcony, clock and 2 flagged towers.\nStation interior features a ticket counter, café corner and an array of brick-built furnishings and details, including draped windows, wall clock, ceiling chandelier and a tower room with a little LEGO® ǀ Disney surprise.\nEasily connect the cars with the included LEGO® magnetic couplings.\nThis LEGO® building toy includes more than 2,900 pieces.\nThe LEGO® ǀ Disney train toy (in total) measures over 4” (12cm) high, 30” (78cm) long and 3” (8cm) wide.\nLEGO® ǀ Disney train station building measures over 15” (39cm) high, 14” (36cm) wide and 6” (16cm) deep.\nOval rail track diameter measures over 37” (96cm) long and 27” (70cm) wide."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/raya-and-the-heart-palace-43181","description":"Adventure awaits Disney fans with this LEGO® ǀ Disney Raya and the Heart Palace (43181) set. The set comes with printed building instructions and digital Instructions PLUS! Using the LEGO Building Instructions app, the guided, real-life building process leaves even younger builders feeling like real master builders… awesome!\n\nAppealing building details\nThe buildable palace has 6 different rooms to explore, including a throne room, treasure room and a hidden room behind a revolving wall. The 2 side towers open and can hold Raya’s and Namaari’s weapons. The central tower opens to reveal a bedroom, with portraits of Raya’s friends.\n\nExciting adventures\nKids can dive into playing with 2 mini-doll figures from Disney’s Raya and the Last Dragon – Raya and Namaari – plus Tuk Tuk and Namaari’s Serlot LEGO figures. The set makes a unique holiday gift and can be combined with LEGO ǀ Disney Raya and Sisu Dragon (43184) to create an ultimate Heart Palace construction toy set for the best role-play fun.\n\nSurprise a great kid with this different and unique LEGO® ǀ Disney Raya and the Heart Palace (43181) set. Packed with features and accessories, this fun set inspires imaginative role play.\nThis set, based on the new movie Disney’s Raya and the Last Dragon, has a palace with 6 rooms and 2 towers, Raya and Namaari mini-doll figures, plus Tuk Tuk and Namaari’s Serlot LEGO® figures.\nThe palace has a revolving wall with a secret room, a large treasure chest and opening central and side towers. Combine with the LEGO® ǀ Disney Raya and Sisu Dragon (43184) set for a real wow factor.\nDisney’s Raya and the Last Dragon fans will adore this buildable toy with its details and fun accessories. The functions and story starters help make this a great on-trend gift for children aged 7+.\nA buildable toy model full of details. The palace measures over 9.5 in. (24 cm) high, 11 in. (28 cm) wide and 6 in. (16 cm) deep and is designed to be built and played with alone or with friends.\nThe set is great for play and will look good on display. Kids can build the set, take a picture and then share their very first LEGO® ǀ Disney Raya and the Last Dragon Heart Palace with friends!\nPrinted building instructions are great, but digital Instructions PLUS are AWESOME! Using the LEGO® Building Instructions app, even younger builders can zoom in on and visualize models as they build.\nImmerse kids in the fantasy and adventure of Disney’s Raya and the Last Dragon with this creative LEGO® ǀ Disney set. Children can play out exciting adventures with Disney’s Raya and her friends!\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/boun-s-boat-43185","description":"Disney's Raya and the Last Dragon fans will love this LEGO® ǀ Disney Boun’s Boat (43185) set. This great kit features a large boat and 2 smaller builds to spark creative role play. The set also comes with printed building instructions and digital Instructions PLUS! Using the LEGO Building Instructions app, even younger kids feel like master builders thanks to the guided real-life building process… awesome!\n\nThe WOW is in the details\nThe set includes a detailed boat with large and small shrimp decorations, colorful platform, paddle and trap door, plus a dock area featuring a small market area, a smaller boat for the Ongis and loads of accessories and play starters.\n\nA cool and unique gift\nThis set is brought to life by a child’s imagination and includes Disney’s Sisu Human and Boun mini-doll figures, plus3 LEGO Ongi figures. It makes a perfect gift for kids who want to be part of the hottest trends, and boosts creativity and role-play skills as they play out movie scenes or dream up new ones.\n\nInspire a Disney fan’s imagination with this exciting LEGO® ǀ Disney Boun’s Boat (43185) set. Packed with features and accessories, this fun set sparks creative role play.\nThis set, based on the new movie Disney’s Raya and the Last Dragon, includes a large shrimp boat, a smaller boat and a dock area, plus Sisu Human and Boun mini-doll figures and 3 Ongi LEGO® figures.\nThis set offers 3 builds to set kids’ imaginations free and makes a great addition to any other LEGO® ǀ Disney Raya and the Last Dragon-related sets that a child might have to expand play.\nA perfect reward gift for boys and girls aged 6+. Disney’s Raya and the Last Dragon fans will adore this set with its clever buildable models that encourage imaginative role-play options.\nFull of premium details, Boun’s boat measures over 5 in. (13 cm) high, 11 in. (28 cm) long and 3 in. (8 cm) wide and is designed to spark imagination as it’s built and played with again and again.\nStand out! This unique set can be combined with other LEGO® ǀ Disney sets to charge kids’ imaginations in exciting ways. It also makes a cool gift everyone will talk about.\nPrinted building instructions are great, but digital Instructions PLUS are AWESOME! Using the LEGO® Building Instructions app, even younger builders can zoom in on and visualize models as they build.\nImmerse kids in the fantasy and adventure of Disney’s Raya and the Last Dragon with this creative LEGO® ǀ Disney set that lets children play out imaginative adventures from the movie.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/cinderella-s-royal-carriage-43192","description":"Magic and adventure await fans of Disney’s Cinderella with this detailed LEGO® ǀ Disney Cinderella’s Royal Carriage (43192) set. In addition to the fabulous carriage, this set also comes with printed building instructions and digital Instructions PLUS. Using the LEGO Building Instructions app leaves even younger builders feeling like real master builders… awesome!Exciting role-play funKids can explore their Disney Princess fantasies with this buildable toy set. The carriage can be played with on its own or combined with other LEGO ǀ Disney sets for more fun story options. It also makes a great just-because treat or birthday present for a young Disney Princess fan.Wonderful characters start the playThis Disney Princess building set comes with Cinderella and the Fairy Godmother mini-doll figures, plus Gus Gus and 2 LEGO horse figures. The set gets kids playing quickly, with several fun play starters that inspire them to dive into their own imaginative world of magic and adventure.\nInspire thrilling role play or endless creative play with this adorable LEGO® ǀ Disney Cinderella’s Royal Carriage (43192) set, a great treat for kids and fans of Disney’s Cinderella.\nDiscover a carriage with room for 2 mini-dolls, a pumpkin patch with a small table and a treasure chest that fits on the back of the carriage, plus 3 LEGO® animal figures.\nThis great LEGO® ǀ Disney set is loaded with fun accessories, including a ball invitation, wand, crown and glass slippers. Perfect for living out favorite movie scenes or open-ended role play fun.\nAny fan of Disney’s Cinderella will love this set. The gold and white carriage with its team of horses makes a thrilling Christmas, birthday or everyday gift for boys and girls aged 6+.\nWith the horses and carriage measuring over 5 in. (13 cm) high, 10.5 in. (27 cm) long and 3.5 in. (9 cm) wide, this set is perfect for play or display and encourages lots of creative role-play fun.\nPrinted building instructions are great but digital Instructions PLUS are awesome! Using the LEGO® Building Instructions app, even younger builders can zoom in on and visualize models as they build.\nGive youngsters great characters and scenes to play out with LEGO® ǀ Disney sets. This fun building toy offers story starters that help build children’s creativity and imagination skills.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/ariel-s-celebration-boat-43191","description":"Help youngsters grow their building and role-playing skills with this 4+ LEGO® ǀ Disney Ariel’s Celebration Boat (43191) set. The kit features a boat, pier and underwater scene, plus printed building instructions and digital Instructions PLUS! Using the LEGO Building Instructions app, the guided real-life process leaves even younger builders feeling like real master builders… awesome!\n\nLearn to build\nDesigned with budding builders in mind, this 4+ set is packed with engaging details and characters to ensure young kids have a great play experience. Inside the box, each bag contains a complete model. The boat features a partly constructed Starter Brick base kids can easily build with to get the play started fast!\n\nGreat fun for families\nKids and adults can join Disney Princess Ariel and her friends as they celebrate a wedding. 4+ sets are a great way for adults to share the building fun with youngsters, whether they are a seasoned LEGO fan or are discovering LEGO bricks for the first time.\n\nFull of details and functions, this 4+ LEGO® ǀ Disney Ariel’s Celebration Boat (43191) set helps youngsters learn to build as they have a fun celebration with Disney Princess Ariel and her friends.\nFeaturing a floating boat, pier with arch and revolving dance floor, underwater turning music stage and 5 characters. Starter Bricks get the building going fast, so there’s more time for play!\nDisney’s The Little Mermaid fans will love the accessories, including a saxophone, bone and a treasure chest with a ring and trident. Perfect for reenacting favorite movie scenes or open-ended play.\nA great everyday or birthday gift for boys or girls aged 4+ who deserve a treat. Reward good work with a present that entertains for hours and teaches construction and imagination skills.\nWith the buildable toy boat measuring over 5 in. (15 cm) long, this set is perfect for play or display. It’s compatible with all LEGO® bricks, so it can be expanded as kids’ buildings skills grow.\nPrinted building instructions are great but digital Instructions PLUS are awesome! Using the LEGO® Building Instructions app, even younger builders can zoom in on and visualize models as they build.\n4+ playsets provide a fun way for youngsters to learn to build, while growing their confidence with easy steps. They let kids and grown-ups discover the joy of building and playing together.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/raya-and-sisu-dragon-43184","description":"Excitement and mystery await Disney fans with this very different LEGO® ǀ Disney Raya and Sisu Dragon (43184) set. This exciting kit includes 2 builds and plenty of accessories to spark endless play. The set also comes with printed building instructions and digital Instructions PLUS! Using the LEGO Building Instructions app, the guided real-life building process leaves even younger builders feeling like real master builders… awesome!\n\nCreative possibilities\nThis open-ended set lets kids play how they like. They can replay thrilling scenes from the movie or dream up new ones with a detailed palace gate that has a small secret room and an opening waterfall, plus a Raya mini-doll figure and a Sisu Dragon LEGO figure.\n\nA fun reward\nThis buildable toy is ready to be brought to life by a child’s imagination and makes a unique gift that will wow everyone on the playground. It can also be combined with the LEGO ǀ Disney Raya and the Heart Palace (43181) set to create the ultimate Heart Palace.\n\nSpark a child’s creativity with this exciting LEGO® ǀ Disney Raya and Sisu Dragon (43184) set. Packed with features and accessories, this fun set inspires imaginative role play.\nThis set, based on the new movie Disney’s Raya and the Last Dragon, includes a palace gate, waterfall and accessories, plus a Raya mini-doll figure and a Sisu Dragon LEGO® figure.\nThe palace gate has a secret room to hold a small box with a diamond and a waterfall that opens up. Combine with the LEGO® ǀ Disney Raya and the Heart Palace (43181) set to expand the fun.\nFans of Disney’s Raya and the Last Dragon will adore this set with its many details and fun accessories. The functions and story starters make this a great any-day reward for children aged 6 and up.\nBeautiful, posable dragon Sisu stands over 9 in. (24 cm) tall and is designed to be built and played with again and again in all sorts of adventures.\nBe innovative! This unique set can be combined with other LEGO® ǀ Disney sets to boost kids’ imaginations in exciting ways. It makes a cool gift that everyone will be talking about.\nPrinted building instructions are great but digital Instructions PLUS are AWESOME! Using the LEGO® Building Instructions app, even younger builders can zoom in on and visualize models as they build.\nImmerse kids in the fantasy and adventure of Disney’s Raya and the Last Dragon with this creative LEGO® ǀ Disney set. Children can play out exciting adventures with Disney’s Raya and Sisu!\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/elsa-and-the-nokk-storybook-adventures-43189","description":"Kids can explore scenes and stories from Disney’s Frozen 2 in this imaginative LEGO® ǀ Disney Elsa and the Nokk Storybook Adventures (43189) set. This set features a customizable opening book and a sticker sheet to decorate it, plus printed building instructions and digital Instructions PLUS. Using the LEGO Building Instructions app, kids can zoom, rotate and visualize the model. The guided building process lets even younger builders feel like master builders… awesome!\n\nOn-the-go role-play fun\nKids get lots of creative fun with this portable set. It can be played with on its own or added to other LEGO ǀ Disney sets, and is packed with features and play starters to inspire imagination.\n\nFavorite characters and exciting scenes\nThis creative LEGO ǀ Disney set gets kids playing quickly with 3 micro-doll figures – including Iduna and 2 versions of Disney’s Elsa – plus Olaf, the Nokk and Earth Giant LEGO figures. The storybook makes a great gift that a great kid deserves for everyday play.\n\nSpark exciting movie-based role play or creative fun with this LEGO® ǀ Disney Elsa and the Nokk Storybook Adventures (43189) set. Play starts with opening the book!\nWhat’s waiting in the Enchanted Forest and beyond? This cool set features an opening book with a 2-sided center build, free-form stickers and plenty of play starters for imaginative fun.\nThese beloved micro-characters, including Disney’s Elsa, Olaf, Earth Giant, Nokk and Iduna, are ready for adventure in this buildable toy or together with other sets for new stories and fun.\nAny Disney’s Frozen 2 fan will love this set. The book opens to a complete micro-world that will thrill any child as a great everyday, Christmas or birthday treat for boys and girls aged 5 and up.\nPortable adventures. With the open book measuring over 9 in. (23 cm) wide, 4 in. (12 cm) deep and 3 in. (8 cm) high, this set is big enough for new escapades or can be packed up for on-the-go fun.\nPrinted building instructions are great, but digital Instructions PLUS are awesome! Using the LEGO® Building Instructions app, even younger builders can zoom in on and visualize models as they build.\nWith detailed micro-doll figures and recognizable scenes, this Disney’s Frozen 2 buildable toy house offers story starters and encourages open creative play that helps build important skills.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/mickey-mouse-40456","description":"Fans of Disney’s iconic characters can build and display their own Mickey Mouse illustration with this LEGO® Brick Sketches™ Mickey Mouse (40456) kit. Hang it on the wall using the built-in hook – the 12x16 baseplate holds the LEGO bricks firmly in place – or stand it on a shelf. A great treat for holidays, birthdays or other celebrations, and an impressive addition to any collection of LEGO Brick Sketches character portraits.\nYoung LEGO® builders and Disney Mickey Mouse fans will love to create and display this cool, collectible Brick Sketches™ portrait of the well-known Disney character.\nA great gift idea for ages 8 and up, this 118-piece building set is part of the LEGO® Brick Sketches™ theme, which features collectible, buildable, 3D illustrations of iconic characters on 12x16 baseplates.\nMeasuring over 5 in. (13 cm) high, 3 in. (9 cm) wide and 1 in. (3 cm) deep, this LEGO® Brick Sketches™ Mickey Mouse picture makes a striking piece displayed on the mantelpiece or hung by its built-in hook on a wall."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/minnie-mouse-40457","description":"Fans of Disney’s iconic characters can build and display their own Minnie Mouse illustration with this LEGO® Brick Sketches™ Minnie Mouse (40457) kit. Hang it on the wall using the built-in hook – the 12x16 baseplate holds the LEGO bricks firmly in place – or stand it on a shelf. It’s a perfect gift for birthdays, holidays or other celebrations and an impressive addition to any collection of LEGO Brick Sketches character portraits.\nYoung LEGO® builders and Disney Minnie Mouse fans will love to create and display this cool, collectible Brick Sketches™ portrait of the well-known Disney character.\nA great gift idea for ages 8 and up, this 140-piece building set is part of the LEGO® Brick Sketches™ theme, which features collectible, buildable, 3D illustrations of iconic characters on 12x16 baseplates.\nMeasuring over 5 in. (13 cm) high, 3 in. (9 cm) wide and 1 in. (3 cm) deep, this LEGO® Brick Sketches™ Minnie Mouse picture makes a striking piece displayed on the mantelpiece or hung by its built-in hook on a wall."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/goofy-pluto-40378","description":"Collectors of LEGO® BrickHeadz™ will love Goofy & Pluto (40378), featuring 2 classic Disney characters. Goofy, wearing his familiar turtleneck sweater and tall green hat, stands alongside the playful Pluto. The 2 lovable Disney friends come with sturdy baseplates that make them easy to display, either individually or alongside other BrickHeadz models. Collectors of LEGO BrickHeadz can combine elements of different sets to create fun, mashed-up characters of their own.\nThis collectible building set lets kids construct fun LEGO® BrickHeadz™ models of 2 of Disney’s most recognizable characters: Goofy and Pluto.\nA great gift for LEGO® and Disney fans, this set provides an age-appropriate build-and-play experience for kids aged 10 and up.\nWith Goofy standing over 3” (8cm) tall and Pluto over 1” (5cm) tall, this 214-piece buildable toy delivers creative fun on a big scale as kids build, play and display."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/bruni-the-salamander-buildable-character-43186","description":"Hit the right note with fans of Disney’s Frozen 2 with this sweet LEGO® ǀ Disney Bruni the Salamander Buildable Character (43186) set. This great little kit features a bright blue buildable salamander figure and 3 small builds. The set also comes with printed building instructions and digital Instructions PLUS! When kids use the LEGO Building Instructions app, the guided real-life building process leaves even younger builders feeling like real master builders… awesome!\n\nCute character\nThis small set includes a salamander LEGO buildable figure, with big eyes and an opening mouth, plus a small fire with a flame, 2 sticks with marshmallows and a snowflake that balances on the salamander’s tongue.\n\nAn unexpected treat\nThis little character is ready to come to life with help from a child’s imagination. The set features a LEGO buildable salamander figure from Disney’s Frozen 2 movie. It makes a nice little extra gift to make a child happy and encourages kids to build role-play skills through fun.\n\nTreat a youngster with this fun LEGO® ǀ Disney Bruni the Salamander Buildable Character (43186) set. Small extra builds encourage endless imaginative play.\nThis cute set, based on Disney’s Frozen 2, includes a LEGO® buildable salamander figure, a small buildable toy campfire, snowflake and 2 buildable toy marshmallows on sticks.\nThis character set helps grow kids’ construction skills and set their imaginations free. This set makes a good play addition to any other LEGO® ǀ Disney Frozen 2 sets.\nFans of Disney’s Frozen 2 or other LEGO® ǀ Disney sets will love this set with its imaginative play options. The buildable model makes a perfect reward gift for children aged 6 and up.\nPortable and ready for fun, Bruni the Salamander stands over 1.5 in. (4 cm) high and 5.5 in. (14 cm) long and is designed to be built and played with again and again, independently or with friends.\nPrinted building instructions are great, but digital Instructions PLUS are awesome! Using the LEGO® Building Instructions app, even younger builders can zoom in on and visualize models as they build.\nEnchant kids with the excitement and adventure of Disney’s Frozen 2 with this creative LEGO® ǀ Disney set. Children can explore the wonders of the world with this cute character!\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/donald-duck-40377","description":"Fans of LEGO® BrickHeadz™ and classic Disney characters will love this model of Donald Duck (40377). Check out Donald’s cute sailor shirt, cap and bow tie – and his orange bill, legs and feet. The adorable duck also comes with a sturdy baseplate that makes him easy to display, either by himself or alongside other classic BrickHeadz models. Collectors of LEGO BrickHeadz can also have fun combining different elements of the models to create crazy hybrid characters of their own.\nThis collectible building set lets kids construct a fun LEGO® BrickHeadz™ model of Donald Duck in all his iconic detail.\nA great gift for LEGO® and Disney fans, this set provides an age-appropriate, build-and-play experience for kids aged 10 and up.\nWith 90 pieces and standing over 3” (8cm) tall, this Donald Duck buildable toy will inspire creative construction on a large scale as kids build, play and display."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/mickey-mouse-minnie-mouse-buildable-characters-43179","description":"If you’re a Disney fan and love their original cartoons, this is the perfect fit! LEGO® ǀ Disney Mickey Mouse & Minnie Mouse Buildable Characters (43179) gives you a chance to focus your mind and use your hands to create a truly display-worthy item.\n\nFantastic retro details\nBased on Walt Disney and Ub Iwerks’ iconic characters, these figures feature Mickey Mouse and Minnie Mouse in dynamic poses, with several buildable accessories including a guitar, vintage camera, tripod and a photo album with photos of their adventures. Mickey stands 14 in. (36cm) high and Minnie stands 13 in. (35cm) high.\n\nLEGO building projects for you\nTake time for you, focus on an enjoyable creative challenge and make these 2 stunning, large-scale, buildable figures to display in your home or office. Part of a collection of inspiring LEGO building sets for adults interested in pop culture, art, architecture and design, they make an excellent gift for yourself or a Disney fan in your life looking for their next project.\n\nGive yourself or a DIY lover in your life a creative experience with this LEGO® ǀ Disney Mickey Mouse & Minnie Mouse Buildable Characters (43179) set. Makes a unique display and conversation piece.\nClear your mind while building 2 large-scale, detailed figures and accessories to create and display. This set lets you experience a satisfying, hands-on build as you recharge.\nOnce built, these iconic characters look great on display in a home or office. You can keep them together or set up a unique scene with each figure and the included accessories.\nShare your love of Disney’s Mickey Mouse and enjoy this set with all its details and accessories. The engrossing build and retro look of the figures also makes this a great gift for yourself or any Disney fan you know.\nDetailed, large-scale figures, with the largest model standing over 14 in. (36 cm) tall, 7.5 in. (19 cm) wide and 6.5 in. (16.5 cm) deep. This stunning set contains 1,739 pieces and can be displayed in a special place in your home.\nMemories and quality alone time are waiting. You don’t need batteries to enjoy this set – building these high-quality figures helps you escape your daily routine and they are designed to be displayed in your home.\nThe coffee-table-quality instructions help guide you through the project, with stories and vignettes to add entertainment value during building. This LEGO® set makes a perfect creative outlet to escape the daily grind.\nGive adult builders like yourself 2 impressively detailed, large-scale figures in this LEGO® ǀ Disney set. The set offers you a unique build that you can put on display as a way of reflecting your love of the characters.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it’s been that way since 1958.\nLEGO® bricks are dropped, heated, crushed, twisted and analyzed to make sure every building set meets the highest global safety and quality standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/arendelle-castle-village-41167","description":"The LEGO® l Disney Frozen II 41167 Arendelle Castle Village playset will give any fan of the movie endless hours of magical creative play. Perfect for reenacting favorite scenes, Anna and Elsa’s home has 3 stories that can be easily removed and reassembled for play access inside. The furniture pieces are also designed to be easily moved and rearranged between the throne room, bedroom and attic floors. Outside, the market stalls are full of their finest produce, and there's a rowing boat at the jetty, just waiting to be taken on an adventure! This Arendelle playset includes 3 favorite Disney characters and 3 LEGO animal figures.\n\nIncludes Elsa, Anna and Kristoff mini-doll figures, plus 3 LEGO® animal figures: a cat and 2 birds.\nFeatures a 3-story castle with throne room, bedroom and attic, baker’s stall, fishmonger’s stall with small dock and a rowing boat with oars.\nAccessory elements include a portrait and easel, treasure chest, crown, telescope, bust with stand, bird house, lamppost, gift box, gift, fish, crab, bread, vegetables, broom and a sword.\nInspire imagination as kids create, build and play out the Frozen II universe in Anna and Elsa’s castle, then make up new settings and Frozen stories using the LEGO® bricks.\nLift the comforter to ‘tuck’ a mini-doll inside the bed!\nThe furniture pieces are designed to be easily moved and mixed around between the rooms.\nThe modular style means the 3 stories can be taken apart and reassembled, making it easy for friends to play inside different parts of the castle at the same time.\nThis Frozen playset for all fans of the Frozen II movie makes an ideal Christmas gift or birthday gift.\nCombine with the 41164 Enchanted Treehouse, 41165 Anna’s Canoe Expedition, 41166 Elsa’s Wagon Adventure, 41168 Elsa’s Jewelry Box Creation and 41169 Olaf for even more LEGO® l Disney Frozen II adventures.\nFrozen castle measures over 11” (30cm) high, 11” (30cm) wide and 4” (12cm) deep.\nBaker's stall measures over 3” (8cm) high, 1” (4cm) wide and 1” (3cm) deep.\nFishmonger stall with dock measures over 2” (7cm) high, 3” (8cm) wide and 2” (6cm) deep.\nRowing boat measures over 1” (5cm) high, 4” (12cm) long and 1” (4cm) wide."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/elsa-s-magical-ice-palace-43172","description":"Help your young Disney Frozen fan replay scenes from Disney’s Frozen and Frozen Fever with a grand Ice Palace. This cool toy LEGO® l Disney playset for kids features a 2-story palace with special sliding bridge, revolving staircase and kitchen with table and chairs, an outdoor playground with snow fort, tree and working seesaw, plus a 3-carriage sleigh. Children can have hours of fun and imaginative play with this holiday gift set that comes with Elsa and Anna mini-dolls, plus Olaf, Marshmallow and 4 Snowgie minifigures.\n\nIncludes LEGO® l Disney Frozen Elsa and Anna mini-doll figures, plus Olaf, Marshmallow and 4 Snowgie minifigures.\nThis beautiful playset includes a palace with sliding bridge and revolving staircase, translucent balcony, kitchen with table and chairs, and a music room with music stand and sheet music, plus an outdoor playground with snow fort and seesaw.\nThis cool toy for kids also includes a 3-carriage sleigh for snowy role-play fun.\nAccessory elements include a teapot, glasses, cake, carrot, chocolate, sheet music, mirror and a rug.\nHave fun building this enormous Ice Palace with special functions to add to the imagination and magic.\nPlay out scenes from Disney’s Frozen and Frozen Fever.\nCreate new adventures with some of your favorite Frozen characters with this fun holiday gift.\nElsa's Magical Ice Palace measures over 12” (31cm) high, 11” (30cm) wide and 7” (19cm) deep.\nPlayground with snow fort measures over 2” (6cm) high, 7” (20cm) wide and 1” (4cm) deep.\nSleigh with carriages measures over 4” (12cm) long and 1” (3cm) wide."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/rapunzel-s-tower-43187","description":"Exciting escapades await young Disney Princess fans in this delightful LEGO® ǀ Disney (43187) Rapunzel’s Tower set. The charming set includes a tower with a cave and secret room, plus extra play starters in 2 smaller builds.\n\nAppealing, creative, construction fun\nThe detailed tower features 4 different rooms to explore, a hobby room, bedroom, cozy sitting room and a cave at the bottom with a secret door. There are also 2 smaller builds – a swing made from Rapunzel's hair and The Snuggly Duckling tavern, complete with stool and piano, to encourage endless open-ended creative play.\n\nFun role-play adventures with beloved characters\nChildren can jump right into playing with this great set, which features 2 mini-doll figures-Disney’s Rapunzel and Flynn-plus a Pascal the chameleon LEGO figure for Disney. The set frees kids' imaginations with different play starters, so kids can role-play their favorite Tangled movie scenes or come up with new ones.\n\nGive Disney Princess fans of all ages an exciting and fulfilling building experience with this LEGO® ǀ Disney Rapunzel’s Tower (43187) set, featuring Disney’s Tangled characters, which makes a fun holiday gift.\nInspire builders with a colorful, detailed tower with multiple rooms, 2 smaller builds, Disney's Rapunzel and Flynn Rider mini-doll figures, plus other items to encourage imagination and creative play.\nThe beautiful tower building toy and cute characters are great for children toplay with to stretch their creative skills. Kids can construct the tower and small builds, then act out movie scenes or imagine new stories.\nFans of Disney’s Tangled will love this set with all its playful details and clever accessories. The extra small builds and fun story starters help make this the perfect birthday gift for children aged 6 and up.\nA 4-level tower full of details. With the tower measuring over 17.5” (44cm) high, 4” (11cm) wide and 3” (8cm) deep, this expansive buildableset is designed to be constructed and played with again and again.\nThe power of imagination in a box. Includes highly recognizable mini-dolls and LEGO® figures designed for kids to play with in countless ways, with no need for batteries. Open the box and the play starts with building.\nEase of construction bolsters youngsters' confidence. Clear, picture-based instructions help children grow their building and play skills as they create a tower for Disney's Rapunzel, Flynn and Pascal the chameleon.\nImmerse children in the excitement and magic of Disney’s Tangled with this LEGO® ǀ Disney set. This cool set lets kids build Rapunzel’s Tower and play out fun adventures with the bold Disney Princess and her friends!\nLEGO® bricks meet exacting quality standards, so they are consistent, compatible and connect and come apart easily every time – it's been that way since 1958.\nLEGO® bricks are dropped, heated, crushed, twisted and analyzed to make sure every kid's building kit meets strict global safety standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/belle-s-castle-winter-celebration-43180","description":"Winter fun awaits young kids who love Disney’s Beauty and the Beast with this exciting LEGO® ǀ Disney Belle’s Castle Winter Celebration (43180) set. The playset has elements and play starters to help youngsters grow their creative skills. It also includes Starter Brick bases and walls that let even first-time builders experience the pride of constructing buildings and more, all on their own.\n\nEncourage young imaginations with extra details\nThe colorful castle features several rooms to explore, plus small accessory builds such as a vanity table with a brush, bow and tiara, a table and chair, and a fireplace, to help inspire endless creative play.\n\nBeloved characters inspire fun role-play possibilities\nYoungsters can get right to adventuring with this fantastic set, featuring 2 mini-doll figures, Disney's Belle and the Beast, who can be transformed into the Prince. Other well-known characters include Mrs. Potts, Chip and Cogsworth, plus bird and snowman LEGO figures for Disney.\n\nOffer preschoolers an exciting and fulfilling building experience with this LEGO® ǀ Disney Belle’s Castle Winter Celebration (43180) set, featuring Disney’s Beauty and the Beast characters. Makes a fun holiday gift.\nInspire younger builders with a bright and colorful, easy-to-build castle with multiple rooms, buildable accessories, Disney's Belle and the Beast mini-doll figures and other items to boost imagination and creative play.\nThe pretty castle and cute characters are great for young kids to play with and stretch their creative skills. Kids can build the castle and accessories, then act out favorite movie scenes or imagine new stories.\nYounger Disney’s Beauty and the Beast fans will love this set with all its playful details and clever accessories. The ease of assembly and fun story starters help make this a great gift for preschoolers aged 4 and up.\nAn easy-to-build castle full of details. With the castle measuring over 9” (23cm) high, 9” (25cm) wide and 6” (16cm)deep, this fantastic set is designed to be constructed and played with over and over again.\nThe power of imagination in a box. Highly recognizable mini-dolls and LEGO® figures designed for kids to play with in countless ways, with no need for batteries. Open the box and the play starts with building.\nEase of construction bolsters youngsters' confidence. Clear, picture-based instructions help children grow their building and play skills as they create a beautiful castle and accessories forDisney’s Belle and the Beast.\nIntroduce younger children to the wonder and magic of Disney’s Beauty and the Beast with this LEGO® ǀ Disney set. This detailed set takes kids to the Beast’s castle for a winter celebration with Belle and her friends!\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it's been that way since 1958.\nLEGO® bricks are dropped, heated, crushed, twisted and analyzed to make sure every kid's building toy meets the highest global safety and quality standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/frozen-ice-castle-10899","description":"Join Disney’s Anna, Elsa and Olaf at the LEGO® DUPLO® l Disney 10899 Frozen Ice Castle to share imaginative play and precious developmental milestones with your preschooler. As toddlers role-play with their favorite Disney Frozen characters, they improve their language and fine motor skills, and develop social and emotional awareness. Talk about Elsa's relationship with her sister Anna. Enjoy open-ended creative fun with Olaf the snowman. With a multicolored light brick feature illuminating the castle at the push of a button, you and your little one will have endless enjoyment recreating scenes from Disney’s Frozen movie and dreaming up stories of your own with this sparkling Ice Castle toddler toy building set.\n\nIncludes 3 LEGO® DUPLO® figures: Anna, Elsa and Olaf.\nThis Disney Frozen castle toy features a slide, table, chairs and kitchen equipment. A special button-operated light brick provides multicolored illumination for the castle.\nHelp your child master basic construction skills and improve their fine motor abilities as the building bricks are assembled and re-positioned for endless imaginative play.\nThis buildable toys for toddlers is designed to encourage role-play and storytelling to help your child develop language, social and emotional skills.\nThe Disney Frozen Ice Castle measures over 11” (28cm) high, 7” (19cm) wide and 6” (16cm) deep."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/elsa-s-jewelry-box-creation-41168","description":"The LEGO® l Disney Frozen II 41168 Elsa’s Jewelry Box Creation makes a perfect gift for fans of the Disney Frozen movies. This decorative jewelry box for kids is inspired by Elsa’s ice castle with snowflake decoration, and features a turntable function to make Elsa and the Nokk, a mythical water spirit, spin around and around. The drawer itself has a lock function to keep jewelry or favorite bits and pieces safe inside, and there's a mirror to see how the jewelry looks on. The Frozen jewelry box comes with 2 LEGO rings and includes 2 characters from the movie: Elsa and the Nokk.\n\nIncludes an Elsa mini-doll figure and a Nokk LEGO® figure.\nFeatures an Elsa Frozen jewelry box with lockable drawer, mirror, spinning function for Elsa and the Nokk, and 2 LEGO® rings.\nStore favorite jewelry inside the drawer and flick the lock function to keep it safe.\nThis beautiful trinket box makes an ideal birthday gift or Christmas gift for a fan of the Disney Frozen films.\nThe Disney characters can be removed and added to any existing LEGO® Disney minifigure and mini-doll figure collection.\nMeasures over 9” (23cm) high, 5” (15cm) wide and 4” (12cm) deep."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/ariel-s-undersea-castle-10922","description":"LEGO® DUPLO® │ Disney Ariel's Undersea Castle (10922) entertains and stimulates young minds, developing social and emotional skills with a mermaid’s playground full of fun features and role-play stories.\n\nDevelopmental play with Disney’s The Little Mermaid\nFeaturing popular kids' movie characters Ariel and Flounder, this versatile toy is designed to encourage imaginative role play and inspire developmental progress. Turning Ariel and Flounder around on the carousel helps to build toddlers' fine motor skills. There’s also a slide to play on, a xylophone to make pretend music with, and a sunken treasure chest to open.\n\nCharacters kids love in settings they’ll adore\nWith familiar figures, favorite locations and lots of fun features, LEGO® DUPLO® │ Disney building toys provide preschoolers with the perfect introduction to playful learning – and provide parents and caregivers with a chance to share precious developmental milestones with their little Disney fan.\n\nTake toddlers to an undersea world of fun features and role-play adventures with Ariel and Flounder from Disney’s The Little Mermaid movie. Designed to stimulate and inspire the minds of mermaids and humans alike!\nMuch-loved kids’ movie characters Ariel and Flounder will encourage toddlers' emotional development; and the playground is packed with cool features and accessories to inspire role-play stories.\nKids develop their fine motor skills and creative thinking as they turn Ariel and Flounder around on the carousel, play on the slide, make pretend music on the xylophone and unlock the sunken treasure chest!\nThis versatile preschooler playset contains elements that are easy for small hands to pick up and place. A great Christmas, birthday or any-day-of-the-year gift for boys and girls aged 2 and up.\nLEGO® DUPLO® │ Disney Ariel's Undersea Castle (10922) measures over 11” (28cm) high, 7” (20cm) wide and 5” (13cm) deep and combines easily with other DUPLO playsets for evenmore imaginative play possibilities.\nNo batteries needed. Battery-free, hands-on play stimulates, engages and entertains young children, unlocking countless developmental benefits as the fun is fueled purely by their own imaginations.\nParents and caregivers can use the simple instructions included to share the set-building fun with their toddler. Also, the different elements can be rearranged to create endless new play possibilities.\nLEGO® DUPLO® │ Disney playsets are designed to stimulate and inspire preschoolers using popular movie characters in familiar settings, while parents and caregivers share precious developmental milestones.\nLEGO® DUPLO® building sets meet the highest industry standards to ensure they are easy for little fingers to pick up, place and pull apart – and it's been that way since 1969.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® DUPLO® bricks and pieces to make sure every little builder's DUPLO playset meets the highest global safety and quality standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/elsa-s-wagon-adventure-41166","description":"Let your child recreate magical moments from Disney’s Frozen II movie with LEGO® | Disney 41166 Elsa’s Wagon Adventure. This LEGO 4+ wagon toy building set is specially designed to be fun and easy for youngsters, with Disney characters and a LEGO baby reindeer figure for role-play fun and a special Starter Brick base that lets even first-time builders experience the pride of constructing buildings, vehicles and more, all on their own. The included simple guide to build and play will also help your Disney Frozen fan understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO brick building in a familiar Disney setting. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This Disney toy building kit for girls and boys and all fans of the Frozen II movie includes a mini-doll figure, plus 2 LEGO reindeer figures.\n\nLEGO® 4+ sets are specially designed to be fun and easy for youngsters and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nIncludes an Elsa Frozen mini-doll figure plus 2 LEGO® reindeer figures: Sven and a baby reindeer.\nFeatures Elsa’s wagon that can seat 2 mini-doll figures, harness to attach it to Sven, stable with water trough and campfire, hay feeder and a Frozen picnic area.\nSven reindeer’s buildable toy carriage features a Starter Brick base to quickly get your child building and playing in an exciting LEGO® | Disney Frozen adventure.\nAccessory elements include a carrot, cookie, cookie box, marshmallow and a brush.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ playsets were previously branded as LEGO Juniors and are compatible with all LEGO construction sets for creative building.\nThis Elsa construction toy makes an ideal gift for youngsters.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nCombine with 41165 Anna’s Canoe Expedition for even more 4+ LEGO® | Disney Frozen II magic.\nWagon with Sven attached measures over 2” (7cm) high, 8” (21cm) long and 5” (12cm) wide.\nStable measures over 2” (6cm) high, 3” (8cm) wide and 2” (6cm) deep."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/lightning-mcqueen-s-race-day-10924","description":"Turbocharge toddlers’ imaginations with the Lightning McQueen’s Race Day (10924) building toy. As kids explore role-play fun with Lightning McQueen and Mater from the popular Disney and Pixar Cars movies, they build key fine motor and emotional skills.\n\nBuild, play and learn\nFeaturing recognizable characters from the Disney and Pixar Cars movies, this 2-in-1 playset is designed to fuel kids' creative thinking and drive their developmental progress. Maneuvering the cars is a great way for small hands to develop fine motor skills. And when the race is over, it’s time to place the vehicles on the fixing table for some essential repairs.\n\nRole-play with much-loved characters\nWith familiar figures, cool settings and lots of fun features, LEGO® DUPLO® │ Disney and Pixar building toys inspire kids to engage and interact as they play, and give parents and caregivers the perfect opportunity to share precious developmental milestones with their little racing driver.\n\nThe race is on for fun with the LEGO® DUPLO® │ Disney and Pixar Cars Lightning McQueen’s Race Day playset (10924). It’s the perfect toy to turbocharge toddlers’ imaginations and accelerate developmental benefits.\nLighting McQueen and Mater, from the Disney and Pixar Cars movies, stimulate toddlers' emotional development. Familiar racetrack and repair workshop settings inspire endless imaginative role play.\nWhether driving Lightning McQueen to a Piston Cup victory, towing him with Mater's truck hook, or doing repairs in the toy workshop – kids develop fine motor skills as they role-play endless imaginative stories.\nThe pieces in this playset are designed to be easy for small hands to pick up, place, rearrange and use creatively. It makes a great Christmas, birthday or any-other-day gift for boys and girls aged 2 and up.\nLightning McQueen measures over 1” (4cm) high, 2” (6cm) long and 3” (10cm) wide. Mater measures over 5” (13cm) high, 4” (12cm) long and 4” (12cm) wide. The playset combines with other LEGO® DUPLO® sets for even more fun.\nNo batteries needed. The role-play fun is powered purely by kids’ imaginations. Battery-free, hands-on play is stimulating, engaging and entertaining – and it unlocks countless developmental benefits in young minds.\nSimple instructions make it quick, easy and fun for parents and caregivers to assemble the playset alongside their little builder. Also, rearranging the different elements creates continual new play possibilities.\nLEGO® DUPLO® │ Disney and Pixar playsets engage, entertain and inspire preschoolers with popular movie characters in stimulating settings, while parents and caregivers join in and share precious developmental milestones.\nLEGO® DUPLO® building sets meet the highest industry standards to ensure the toys are easy for kids' little fingers to pick up, place and pull apart – and it's been that way since 1969.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® DUPLO® bricks and pieces to make sure every little builder’s DUPLO playset meets the highest global safety and quality standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/mickey-minnie-birthday-train-10941","description":"Celebrate a toddler’s birthday in style with the delightful LEGO® DUPLO® ǀ Disney Mickey & Minnie Birthday Train (10941). Packed with developmental activities and featuring favorite Disney characters, this premium building playset is the perfect way to introduce preschoolers to numbers, creative construction and Disney magic!\n\nPlayful learning for young minds\nToddlers join Disney's Mickey Mouse, Minnie Mouse and Pluto as they drive the birthday train, stopping off to play and learn with the onboard activities. This colorful construction set improves fine motor skills as kids assemble the train and stack the number bricks; inspires creativity as they decorate the wagons; and develops social skills as they role-play with the lovable Disney characters.\n\nBuild skills with well-known Disney characters\nAll LEGO DUPLO │ Disney construction sets are expertly designed with imaginative features and iconic characters so parents and toddlers can share endless play and precious developmentalmilestones.\n\nLEGO® DUPLO® ǀ Disney Mickey & Minnie Birthday Train (10941) is a premium building playset for preschoolers, packed with developmental activities, imaginative play possibilities and Disney magic!\nIncludes iconic Disney characters Mickey Mouse, Minnie Mouse and Pluto, a 3-section buildable train, buildable birthday cake with candle, 5 stackable number bricks and accessories.\nKids develop fine motor skills as they build and play with the train; recognize numbers as they stack the bricks; and build social and emotional awareness as they role-play with Disney characters.\nFor ages 2 and up. This stand-out gift will make any toddler’s birthday a celebration to remember.\nTrain measures over 6 in. (15.5 cm) high, 14 in. (35.5 cm) long and 5.5 in. (13.5 cm) wide. This versatile, toddler-friendly construction toy can be played with in a wide variety of entertaining ways.\nExpertly designed with elements that are easy for little hands to pick up and place, and fun accessories that encourage role play: a guitar, flexible balloons, gifts and Minnie’s fabric dress.\nSimple printed instructions make it easy for parents to share an enjoyable building experience with their little one.\nAll LEGO® DUPLO® │ Disney building playsets are expertly designed with imaginative features and familiar characters, so parents and toddlers can enjoy endless play and share developmental milestones.\nLEGO® DUPLO® components meet strict industry standards to ensure they are easy for little fingers to pick up, place and pull apart – and it’s been that way since 1969.\nLEGO® DUPLO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they fulfill stringent child safety standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/anna-and-elsa-s-storybook-adventures-43175","description":"Kids can play out life in Arendelle Castle with this unique LEGO® ǀ Disney Anna and Elsa’s Storybook Adventures (43175) set. This toy playset features a customizable, opening book with 2 areas, the outside of Arendelle Castle with a bridge, the castle itself with a folding roof and the inside of the castle, with grand piano and bedroom, plus 2 sticker sheets to decorate the book with.On-the-go role-play fun and excitementKids will stretch their imaginative role-play skills with this portable playset. It can be experienced on its own or combined with other LEGO ǀ Disney sets for even more creative play options. Plus, it makes a great Christmas gift or birthday present for a young Disney’s Frozen 2 fan.Favorite characters and scenes offer effortless playThis creative Disney gift comes with 3 detailed micro-doll figures, Disney Princess Elsa, Anna and Kristoff, plus an Olaf LEGO figure for Disney. These will get kids playing quickly, as will the areas made to inspire children’s imagination in this well-known world.\nSpark exciting movie-based role play or creative play with this imaginative LEGO® ǀ Disney (43175) set, featuring Disney’s Elsa, Anna, Kristoff and Olaf. Perfect for kids and fans. Play starts with opening the book!\nWhat fun can be found around the castle? Kids can flex their creativity and role-play skills as they explore the castle inside and out, dream up new stories or go sledding with Disney Princess Anna and Olaf.\nThese beloved micro-characters are great to play with in this set or with other models. Kids can adventure with Disney’s Elsa, Anna and Kristoff, hang outside with Olaf or come up with something completely new!\nAny fan of Disney’s Frozen 2 will adore this awesome set. The clever, opening book reveals a complete micro-world that will thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 5+.\nPortable micro-world travel toy to take anywhere. With the open book measuring over 9” (23cm) wide, 4” (12cm) deep and 3” (8cm) high, this awesome playset is big enough for new adventures or packable for on-the-go fun.\nHours of fun for a child’s imagination! Open-ended, battery-free toys help boost kids’ group play and problem-solving skills or give them the joy of creating new stories on their own through independent play.\nOpen the toy book and the play begins. Easy-to-follow instructions help make building a snap, giving kids the joy of imagining new scenarios and lots of creative excitement with the well-known ones in the book.\nGive children detailed characters and recognizable scenes to play out with LEGO® ǀ Disney sets. This imaginative Disney’s Frozen 2 playset offers cute story starters plus open creative play that helps build important skills.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it’s been that way since 1958.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® bricks and pieces to make sure every kid’s building toy meets the highest global safety and quality standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/anna-s-canoe-expedition-41165","description":"Let your child relive favorite scenes from Disney’s Frozen II movie with LEGO® | Disney 41165 Anna’s Canoe Expedition. This LEGO 4+ canoe playset is specially designed to be fun and easy, with a LEGO animal figure for role-play fun and a special Starter Brick base that lets even first-time builders experience the pride of constructing buildings, vehicles and more, all on their own. The included simple guide to build and play will also help your young Disney Frozen fan understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO brick building in a familiar Disney setting. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This Disney toy construction set for boys and girls and Frozen fans includes 2 Disney characters plus a LEGO bunny figure.\n\nLEGO® 4+ sets are specially designed to be fun and easy for youngsters and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nIncludes 2 iconic Disney character mini-doll figures: Anna and Olaf, plus a LEGO® bunny figure.\nThis adventure playset features an ice canoe with lamp and river scene with ice slide, seesaw, movable foliage and rocks with a sleeping earth giant image.\nAdventure canoe features a Starter Brick base to quickly get your child building and playing in an exciting LEGO® | Disney world of adventures.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ playsets were previously branded as LEGO Juniors and are compatible with all LEGO construction sets for creative building.\nThis Anna Frozen toy building set makes an ideal gift for youngsters.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nCombine with the 41166 Elsa’s Wagon Adventure Disney playset for even more 4+ LEGO® | Disney Frozen II magic.\nCanoe measures over 1” (3cm) high, 3” (9cm) long and 1” (3cm) wide.\nRiver scene measures over 3” (8cm) high, 11” (28cm) wide and 5” (15cm) deep."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/ariel-s-storybook-adventures-43176","description":"Kids can play out life underwater and on the beach with this awesome LEGO® ǀ Disney Ariel’s Storybook Adventures (43176) set. This buildable toy features a customizable, opening book with 2 worlds, Ariel’s underwater palace, with an opening clamshell, slide and different trinkets, and a beach above water with a 2-figure boat, plus 2 sticker sheets to decorate the book with.Totally portable fun and excitementKids will have fun devising imaginative play with this portable playset. It can be played with on its own or combined with other LEGO ǀ Disney sets for even more options. Plus, it makes a great Christmas gift or birthday present for a young Disney’s Little Mermaid fan.Favorite characters and scenes offer effortless playThis creative Disney gift comes with 3 detailed micro-doll figures, 2 versions of Princess Ariel, Prince Eric, plus Sebastian and Flounder LEGO figures for Disney. These will get kids playing quickly, as will the scenes made to inspire children’s imagination in this well-known world.\nEncourage creative role play with this LEGO® ǀ Disney (43176) set, with Disney Princess Ariel, Flounder, Sebastian and Prince Eric. Great for kids and fans of Disney’s Little Mermaid. Play starts when the book opens!\nWhat treasures can be discovered under the sea? Kids can flex their creativity and role-play skills as they explore the beach or swim around with Disney’s Ariel, Flounder and Sebastian as they imagine familiar stories in new ways.\nThese beloved micro-characters are great to play with in this set or will make a fun addition to other models. Kids can adventure with Disney Princess Ariel, Prince Eric, Sebastian and Flounder in completely new ways!\nAny fan of Disney’s Little Mermaid will absolutely love this set. The unique, opening book reveals a complete micro-world that will thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 5+.\nPortable micro-world travel toy to take anywhere. With the open book measuring over 9” (23cm) wide, 4” (12cm) deep and 3” (8cm) high, this fantastic playset is big enough for new adventures or packable for on-the-go fun.\nHours of fun for a child’s imagination! Open-ended, battery-free toys help boost kids’ group play and problem-solving skills or give them the joy of creating new stories on their own through independent play.\nOpen the toy book and the play begins. Easy-to-follow instructions help make building a snap, giving kids lots of creative excitement and the joy of imagining new adventures or replaying well-known ones in the book.\nGive children detailed characters and places to play with in LEGO® ǀ Disney sets. This imaginative Disney’s Little Mermaid playset offers cute story starters and encourages open creative play to build important skills.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it’s been that way since 1958.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® bricks and pieces to make sure every kid’s building toy meets the highest global safety and quality standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/belle-s-storybook-adventures-43177","description":"Thrills await Beauty and the Beast fans with this awesome LEGO® ǀ Disney Belle’s Storybook Adventures (43177) set. This buildable toy features an opening book with Beast’s castle in the center, the outside of the castle on one side and the inside on the other, plus 2 sticker sheets to personalize the book.Totally portable fun and excitementKids will love discovering all the fun play possibilities in this portable playset. It can be enjoyed on its own or combined with other LEGO ǀ Disney sets for even more options. Plus, it makes a great Christmas gift or birthday present for a young Disney’s Beauty and the Beast fan.Detailed characters and scenes offer effortless playThis creative Disney gift comes with 2 detailed micro-doll figures, Disney Princess Belle, Beast, who can transform into Prince Adam, plus Wardrobe, Mrs. Potts, Chip and Cogsworth LEGO figures for Disney. These will get kids into the fun right away, as will the items made to inspire a child’s imagination in this well-known world.\nEncourage role play with this LEGO® ǀ Disney (43177) set, featuring Disney Princess Belle, Beast, Mrs. Potts, Chip, Cogsworth and Wardrobe. Makes a great gift for kids and fans. Play starts when the book opens!\nWhat secrets lie behind the door? Kids can flex their role-play and creative skills as they uncover the mysteries of the castle. The magical rose, a place for Disney’s Belle to sleep, even a dance floor await discovery inside.\nThese great micro-characters are fun to play with in thisset or with make an awesome addition to other models. Kids can adventure with Disney Princess Belle, Beast, Mrs. Potts and the others in completely new ways!\nAny fan of Disney’s Beauty and the Beast will love this set. The collectible book toy reveals a complete micro-world to thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 5+.\nPortable micro-world travel toy to take anywhere. With the open book measuring over 9” (23cm) wide, 4” (12cm) deep and 3” (8cm)high, this amazing playset is big enough for new adventures or packable for on-the-go fun.\nHours of fun for a child’s imagination! Open-ended, battery-free toys help boost kids’ group play and problem-solving skills or give them the joy of creating new stories on their own through independent play.\nOpen the book and play begins. Easy-to-follow instructions help make building a snap, giving kids lots of creative excitement and the joy of imagining new adventures or replaying well-known ones inthe book.\nGive children detailed characters and places to play with in LEGO® ǀ Disney collectible toy sets. This imaginative Disney’s Beauty and the Beast playset offers cute story starters and encourages open creative play to build important skills.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it’s been that way since 1958.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® bricks and piecesto make sure every kid’s building toy meets the highest global safety and quality standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/minnie-s-birthday-party-10873","description":"Little Disney fans will love to help Minnie Mouse celebrate in style with LEGO® DUPLO® 10873 Minnie’s Birthday Party! Play with them as they drive Minnie in her cute pink car to the party venue, where Figaro the cat is waiting to get the party started. This LEGO DUPLO set is perfect for endless role-play with a birthday celebration theme, and comes with a giant buildable birthday cake plus 2 bricks decorated as presents. Includes a LEGO DUPLO figure: Minnie Mouse, plus a DUPLO cat figure.\n\nIncludes a LEGO® DUPLO® figure: Disney’s Minnie Mouse plus a Figaro the cat DUPLO figure.\nFeatures a party venue with an opening window, table, chair and buildable birthday cake, plus a car.\nAccessory elements include a Minnie Mouse portrait tile for the wall and 2 bricks decorated as birthday gifts.\nPreschoolers will love to build the cake and help Figaro throw an amazing party for Minnie Mouse.\nUse this set to play out the special parts of any birthday party with your toddler.\nHelp your child master basic construction skills with this easy-to-build LEGO® DUPLO® l Disney toy.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nParty venue measures over 5” (13cm) high, 4” (12cm) wide and 2” (6cm) deep.\nCar measures over 1” (4cm) high, 3” (10cm) long and 2” (6cm) wide."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/toy-story-train-10894","description":"Inspire imagination and role-play adventures with your little Disney•Pixar Toy Story fan, as Woody and Buzz Lightyear take a ride on the LEGO® DUPLO® l Disney•Pixar 10894 Toy Story Train. Teach them about teamwork and help build social and emotional skills as these two iconic characters work together to protect the bank vault from the evil Dr. Porkchop, who is featured on a ‘Wanted' poster. This classic buildable steam train toy is easy to build, helping preschoolers develop early construction and fine motor skills in a much-loved Pixar setting. Includes 2 LEGO DUPLO figures: Woody and Buzz Lightyear.\n\nIncludes 2 LEGO® DUPLO® figures: Woody and Buzz Lightyear with detachable wings.\nFeatures a LEGO® DUPLO® steam train with opening roofs and a separate cactus.\nAccessory elements include a bank vault, lasso and bricks decorated as money and a ‘Wanted' sign—great story starters!\nHelp your child master basic construction skills with this easy-to-build Disney\nPixar Toy Story Train set for toddlers.\nYoung children will love to push Woody around on the steam train and attach Buzz Lightyear's wings to fly him in for backup.\nEncourage language development and social and emotional skills through role-play with favorite Disney\nPixar Toy Story characters.\nThe endless creative play possibilities of LEGO® DUPLO® building toys set the stage for toddlers to become creative thinkers.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nMakes an ideal gift for preschoolers.\nSteam train measures over 5” (14cm) high, 7” (19cm) long and 2” (6cm) wide."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/aurora-s-forest-cottage-43188","description":"Imaginative adventures await young Disney Princess fans in this delightful LEGO® ǀ Disney Aurora’s Forest Cottage (43188) set. This appealing building kit features a cottage with spinning water wheel and a separate, buildable forest bridge, plus a range of accessories for extra play starters.\n\nIntriguing possibilities\nThe detailed cottage inspires open-ended creative play with 2 rooms, a kitchen with an entrance door, table and fireplace with stove, plus a bedroom upstairs. The water wheel on the side spins and moves the magical sparks in the chimney, plus there’s a small buildable bridge to extend play.\n\nThrilling stories with favorite characters\nChildren can jump right into playing with this great set, which features 2 mini-doll figures-Disney's Aurora and Maleficent-plus Diablo, fawn, bunny, squirrel and bluebird LEGO figures for Disney. The set frees kids' imaginations with different play starters, so kids can role-play their favorite Sleeping Beauty movie scenes or imagine new ones.\n\nGive Disney Princess fans of all ages an exciting and fulfilling building experience with this LEGO® ǀ Disney Aurora’s Forest Cottage (43188) set, featuring Disney’s Sleeping Beauty characters. Makes a fun kids’ gift.\nIntrigue young builders with a detailed 2-story cottage construction toy, forest bridge build, Disney's Aurora and Maleficent mini-doll figures, plus accessories to encourage imagination and creative play.\nThe rustic cottage and sweet characters are great for children to play with and stretch their inventive skills. Kids can construct the cool set, then act out favorite movie scenes or imagine new stories.\nDisney’s Sleeping Beauty fans will love this set with all its playful details and imaginative accessories. The small bridge build and fun story starters help make this the perfect gift for children aged 5 and up.\nA 2-story cottage full of details. The cottage measures over 6.5” (17cm) high, 8” (21cm) wide and 4” (11cm) deep, so this appealing set is designed to be constructed and played with again and again.\nThe power of imagination in a box. Highly recognizable mini-dolls and LEGO® figures designed for kids to play with in countless ways, with no need for batteries. Open the box and the play starts with building.\nEase of construction bolsters youngsters' confidence. Clear, picture-based instructions help children grow their building and play skills as they create a detailed cottage for Disney's Aurora, Maleficent and Diablo.\nImmerse kids in the magic of Disney’s Sleeping Beauty with this LEGO® ǀ Disney set. This delightful building kit lets kids build Aurora’s Cottage and play out adventures with the brave Disney Princess and her friends!\nLEGO® bricks meet exacting quality standards, so they are consistent, compatible and connect and come apart easily every time – it's been that way since 1958.\nLEGO® bricks are dropped, heated, crushed, twisted and analyzed to make sure every kid's building set meets strict global safety standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/winnie-the-pooh-21326","description":"Take time out and rekindle joyful childhood memories with this LEGO® Ideas set (21326) featuring Disney Winnie the Pooh and a delightful LEGO brick recreation of Pooh Bear’s house under a big oak tree in Hundred Acre Wood. Great to build alone or with family, the house opens at the back for easy access to the authentic details inside, including Pooh’s buildable armchair, Pooh-Coo clock, Poohsticks, honey pot elements and much more. You can also create the effect of bees flying around beehives in the branches of the tree, like in the stories.\n\nPopular characters\nThe model comes with Disney’s Winnie the Pooh, Piglet, Tigger and Rabbit minifigures, plus an Eeyore LEGO figure. The friends each have an accessory, including Winnie the Pooh’s buildable red balloon, to recreate classic scenes.\n\nSpecial gift\nPart of a collection of premium-quality LEGO building kits for adults, this set makes a charming gift for yourself, a Disney Winnie the Pooh enthusiast, LEGO fan or any hobbyist.\nEnjoy me-time or quality family time and spark childhood memories with this LEGO® Ideas display set (21326) featuring Disney Winnie the Pooh and Pooh Bear’s house in Hundred Acre Wood.\nIncludes 5 characters: Winnie the Pooh, Piglet, Tigger and Rabbit minifigures, plus an Eeyore LEGO® figure, each with iconic accessories, including Pooh Bear’s buildable red balloon.\nThe house opens at the back for easy access to the authentic accessories inside including a buildable armchair, Pooh-coo clock and elements including a Pooh Bear storybook, honey pots and Poohsticks.\nSit Pooh Bear on the log by the buildable fire and, with his balloon, help him ‘float’ up to see the bees ‘buzzing’ around the 2 beehives in the tree.\nAn ideal birthday or holiday gift for LEGO® fans, hobbyists and anyone who loves Winnie the Pooh, this display model measures over 9 in. (24 cm) high, 7 in. (18 cm) wide and 8 in. (22 cm) deep.\nPerfect for solo building or sharing your childhood passion for LEGO® building and Winnie the Pooh with your family – you’ll want to photograph and share pictures of this charming buildable model.\nThis 1,265-piece set comes with an illustrated booklet featuring details about the set’s fan designer and LEGO® designers, plus step-by-step instructions so even LEGO newcomers can build confidently.\nThis LEGO® Ideas │ Disney set for adults is part of a collection of unique LEGO Ideas models, each created by a fan designer, voted for by thousands of LEGO fans and produced by the LEGO Group.\nEver since 1958, LEGO® components have met strict industry standards to ensure that they connect consistently and securely for robust builds.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and rigorously analyzed to make sure that they meet stringent global safety standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/disney-s-mickey-mouse-31202","description":"If you’re a fan of classic Disney characters, we have a project just for you! You can build 1 of 2 wall decor portraits with this LEGO® Art ǀ Disney’s Mickey Mouse (31202) set and enjoy a creative mosaic project that offers active stress relief as you build.\n\nLEGO relaxation for adults\nSpend some rejuvenation time assembling a tile picture of either Disney's Mickey Mouse or Minnie Mouse with this 2,658-piece set. As you build, listen to the included Soundtrack and learn more about the iconiccharacters. Up for a change? Rebuild it or collect 2 sets and create a united Mickey Mouse and Minnie Mouse wall decoration.\n\nCreative possibilities\nYou don’t have to be an artist or LEGO collector to appreciate the creativity of this set. Once finished, display it on a wall or shelf in your home or office. This LEGO Art set is part of a unique collection of building kits focused on art, music, design and architecture that also make a great gift for anyone (including yourself) seeking a new project.\n\nShow off your love of Disney’s Mickey Mouse or Minnie Mouse with this stunning mosaic LEGO® Art ǀ Disney’s Mickey Mouse (31202) set. You can display the piece on your wall or shelf after creating it.\nEnjoy a relaxing break with this LEGO® set, featuring over 2,650 pieces, including 9 canvas wall decor plates, Disney signature tile, brick-built LEGO frame, unique hanging element and a tile tool.\nThis set lets you relax and recharge while you focus on your appreciation for Disney's MickeyMouse through art. With the included Soundtrack, you can learn new details as you build.\nTo push your creativity further, combine 2 of the craft hobby sets to create a special united piece, featuring Disney’s Mickey Mouse and Minnie Mouse on a distinctive background.\nA portrait measures over 15.5 in. (40 cm) square and offers 2 building options. It makes a meaningful gift for yourself or other Disney enthusiasts in your life who also love DIY projects.\nThe coffee-table-quality instructions guide you through the project and offer a stress-relieving road map through the art along with some creative LEGO®-inspired relaxation.\nPerfect to display on a wall or shelf, LEGO® Art sets offer adults like you a rewarding building experience while you explore your passion for creative arts-and-crafts-related hobbies.\nLEGO® components meet rigorous industry standards to ensure they are consistent, compatible and connect and pull apart consistently every time – it's been that way since 1958.\nLEGO® components are dropped, squashed, twisted, heated, bent, scratched and stretched, ensuring that this Disney’s Mickey Mouse wall decor piece meets stringent global safety standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/lego-%C7%80-disney-frozen-2-anna-key-chain-853969","description":"This LEGO® ǀ Disney Frozen 2 853969 Anna Key Chain attaches easily and securely to backpacks, bags, belts and keys. Dressed in her travel outfit and a cape, this Anna Key Chain makes a great gift for any Frozen 2 movie fan. Add key chains with other characters from the movie (sold separately) for even more Frozen fun.\n\nIncludes a LEGO® ǀ Disney Anna mini-doll figure.\nFeatures Anna wearing her travel outfit, including a cape, attached to a metal chain and ring.\nMini-doll figure is not detachable from the metal chain.\nLEGO® ǀ Disney Frozen 2 Anna Key Chain measures over 6” (16cm) long."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/lego-%C7%80-disney-frozen-2-elsa-keyring-853968","description":"This LEGO® ǀ Disney Frozen 2 853968 Elsa Key Chain attaches easily and securely to backpacks, bags, belts and keys. Featuring an Elsa mini-doll figure (non-detachable) dressed in her travel outfit and a cape, it makes a great gift for any Frozen 2 movie fan. Add key chains with other characters from the movie (sold separately) for even more Frozen fun.\n\nIncludes a LEGO® ǀ Disney Elsa mini-doll figure.\nFeatures Elsa wearing her travel outfit, including a cape, attached to a metal chain and ring.\nMini-doll figure is not detachable from the metal chain.\nLEGO® ǀ Disney Frozen 2 Elsa Key Chain measures over 6” (16cm) long."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/lego-%C7%80-disney-frozen-2-olaf-keyring-853970","description":"This LEGO® ǀ Disney Frozen 2 853970 Olaf Key Chain attaches easily and securely to backpacks, bags, belts and keys. Featuring the adorable and ever-cheerful snowman, this Olaf Key Chain makes a great gift for any Frozen 2 movie fan. Add key chains with other characters from the movie (sold separately) for even more Frozen fun.\n\nIncludes a LEGO® ǀ Disney Olaf figure.\nFeatures an Olaf the snowman figure attached to a metal chain and ring.\nMini-doll figure is not detachable from the metal chain.\nLEGO® ǀ Disney Frozen 2 Olaf Key Chain measures over 6” (16cm) long."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/mickey-key-chain-853998","description":"Introduce a fan of Disney’s Mickey Mouse to this great LEGO® ǀ Disney Mickey Key Chain (853998) to take along on their adventures! It features a Mickey minifigure looking dapper in his classic red shorts and yellow shoes, attached to a durable metal chain and ring. This eye-catching key chain can be fastened to a backpack or used to keep keys together in a pocket or bag.\nThrill Disney cartoon fans with a LEGO® ǀ Disney Mickey Mouse minifigure on a durable metal chain and ring that attaches securely to a backpack, bag or keys. The minifigure is not detachable from the metal chain.\nMakes a great Christmas stocking stuffer, birthday or anytime gift for kids aged 6 and up who are fans of Disney's Mickey Mouse.\nMeasures over 5” (15cm) long, which makes it big enough to be seen and admired, but small enough to not get in the way of anything."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/minnie-key-chain-853999","description":"Give a Disney’s Minnie Mouse fan this great LEGO® ǀ Disney Minnie Key Chain (853999) to keep them company! It features a Minnie minifigure with a cute bow in her hair that matches her bright polka-dot dress, attached to a durable metal chain and ring. This adorable key chain can be fastened to a backpack or used to hold keys safely in a pocket or purse.\nDelight Disney cartoon fans with a LEGO® ǀ Disney Minnie Mouse minifigure on a durable metal chain and ring that attaches securely to a backpack, bag or keys. The minifigure is not detachable from the metal chain.\nMakes a fun Christmas stocking stuffer, birthday or anytime gift for kids aged 6 and up who are fans of Disney's Minnie Mouse.\nMeasures over 5” (15cm) long, which makes it big enough to be seen and admired, but small enough to not get in the way of anything."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/aurora-keyring-853955","description":"Take a little bit of Disney Princess magic with you wherever you go with this LEGO® l Disney Aurora Key Chain. Attach the mini-doll figure on a durable metal ring and chain to your keys or backpack and show Disney Princess Aurora the world outside her castle tower.\n\nFeatures a Disney Princess Aurora mini-doll figure attached to a durable metal chain and ring.\nAttach it to your backpack or keys.\nMini-doll figure is not detachable from metal chain.\nMini-doll figure on key chain measures over 2” (6cm) long."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/belle-keyring-853782","description":"Embark on enchanting adventures with this LEGO® l Disney Belle Key Chain. Attach this mini-doll figure on a durable metal ring and chain to your keys or backpack and take a bit of Disney Princess magic with you wherever you go.\n\nFeatures a LEGO® l Disney Belle mini-doll figure attached to a durable metal ring and chain.\nAttach it to your keys or backpack.\nMini-doll figure is not detachable from metal chain."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/cinderella-keyring-853781","description":"Make your wish come true with this gorgeous LEGO® l Disney Cinderella Key Chain. Attach this mini-doll figure on a durable metal ring and chain to your keys or backpack and you can take a bit of Disney Princess magic with you wherever you go.\n\nFeatures a LEGO® l Disney Cinderella mini-doll figure attached to a durable metal ring and chain.\nAttach it to your keys or backpack.\nMini-doll figure is not detachable from metal chain."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/buzz-woody-s-carnival-mania-10770","description":"Share the excitement and joy of a carnival with your child, with Disney•Pixar’s Toy Story 10770 Buzz & Woody’s Carnival Mania LEGO® 4+ set! This action-packed play set is specially designed to be fun and easy for preschoolers and smaller children, featuring a colorful carnival shooting game with a large sign and laser cannon, plus a special Starter Brick baseplate that gives first-time builders the experience and pride of constructing buildings, vehicles and more on their own. This fun preschool toy building set also includes a spinning Terrorantulus ride with adjustable arms, 2 bumper cars with Starter Brick chassis and an ice cream shop with register, table and benches and a sign. The included simple guide to build and play will also help your young carnival visitor understand the purpose of the building steps and grow their imagination and confidence for the perfect start to easy LEGO brick building in a familiar Toy Story setting. Includes Woody, Buzz Lightyear and Bo Peep minifigures, plus Ducky and Bunny LEGO figures.\n\nLEGO® 4+ sets are made specifically to be fun and easy for youngsters, to grow their confidence, with simple steps for an easy start to LEGO brick building.\nIncludes 3 Toy Story character minifigures: Woody, Buzz Lightyear and Bo Peep, plus Ducky and Bunny LEGO® figures.\nFeatures a carnival shooting game, decorated rocket elements that can be knocked down and separate, working cannon, plus a Starter Brick baseplate and decorated wall plate to get your child building and playing quickly with LEGO® bricks in a fun Disney\nPixar Toy Story world. Also includes an ice cream shop with register, a table and benches.\nThis cute set also includes a Terrorantulus ride that turns and has adjustable arms, plus 2 bumper cars with Starter Brick chassis.\nAccessory elements include 6 studs, crate, 3 decorated rocket elements, large ice cream, 2 small ice creams, ice cream sundae, ice cream spoon, bucket and Bo Peep's shepherd crook.\nHelp your child replay exciting Toy Story movie scenes or make up their own stories.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ play sets were previously branded as LEGO Juniors and can be built together with all LEGO construction toys for creative building.\nThis Toy Story 4 creative play set makes an ideal gift for preschoolers and youngsters.\nCarnival shooting game measures over 3” (10cm) high, 4” (12cm) wide and 1” (3cm) deep.\nBumper cars each measure over 3” (9cm) high, 1” (3cm) long and 1” (3cm) wide.\nIce cream stand measures over 4” (11cm) high, 2” (6cm) wide and 3” (8cm) deep.\nTerrorantulus ride measures over 3” (8cm) high, 7” (19cm) wide and 7” (19cm) deep."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/steamboat-willie-21317","description":"Disney Mickey Mouse fans will love this LEGO® Ideas 21317 Steamboat Willie building toy marking the 90th anniversary of the most famous cartoon character ever. Mickey Mouse made his screen debut in a 1928 black-and-white animated short film called ‘Steamboat Willie', which was also the first Disney film to have synchronized sound. This LEGO brick version of the S.S. Willie features steam pipes that move up and down and paddle wheels that rotate when the boat is pushed along. The boat's bridge has room for a minifigure and play-inspiring nautical details such as the ship’s wheel, life buoy and buildable bell. On deck there is a working crane to lift the ‘potato bin’ cargo aboard and this unique toy building set comes with new-for-April-2019 Mickey Mouse and Minnie Mouse minifigures, each with special silver-colored decoration, plus a parrot figure. An ideal LEGO set for kids and adults to recreate scenes from the original Mickey Mouse cartoon or simply build and display this striking monochrome model.\n\nBuild and display this collectible LEGO® set or recreate your favorite scenes from the classic Disney Mickey Mouse cartoon, ‘Steamboat Willie’.\nThis unique toy building set includes 2 new-for-April-2019 minifigures: Mickey Mouse and Minnie Mouse, each with silver-colored decoration, plus Mickey Mouse's parrot figure.\nThe iconic Steamboat Willie boat features a black-and-white color scheme, hidden wheels, moving steam pipes, rotating paddle wheels, adjustable crane and assorted elements including the ‘S.S. Willie’ boat name sign, ‘1928’ year sign and a ‘potato bin’.\nThe boat’s bridge has space for a minifigure, a brick-built bell and assorted elements including the ship’s wheel and life buoy.\nThe 2 steam pipes move up and down and the 2 paddle wheels rotate when the boat is pushed along.\nAccessory elements include Minnie Mouse's guitar and music sheet.\nThis LEGO® Ideas creative toy building set comes with a booklet with building instructions, fun facts about the historic 1928 animated Disney short film ‘Steamboat Willie’, and information about this awesome retro set’s fan creator and LEGO designers.\nSteamboat Willie toy boat measures over 5” (15cm) high, 10” (26cm) long and 5” (14cm) wide."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/enchanted-treehouse-41164","description":"There are so many forest adventures for Disney Frozen fans to build and play out in the LEGO® l Disney Frozen II 41164 Enchanted Treehouse set. This buildable magic treehouse playset features a bedroom area in the base of the tree and a dining area on the floor above. There's a ladder up to the lookout and an awesome zip line to whizz down to the enchanted forest floor, where kids will love to look after the 2 bunnies in their little house. A camping area and a fishing area with flying fish function are perfect for creating fun adventures with Anna, Olaf and Mattias from Frozen II. Explore the forest and discover the mythical stones on an epic and magical journey. Includes 3 favorite Disney characters from Frozen II and 3 LEGO animal figures.\n\nIncludes Anna and Mattias mini-doll figures, plus 4 LEGO® figures: Olaf, 2 bunnies and a fish.\nFeatures a treehouse with downstairs bedroom, upstairs dining area, lookout tower, zip wire, bunny house, camping area and a fishing area, plus a magic portal.\nAccessory elements include Mattias's sword, treasure chest, telescope, fishing rod, bucket, fish, glasses, plates, scissors, carrot and an apple.\nDisney Frozen fans will love to build a LEGO® treehouse and explore the enchanted forest to find the mythical stones.\nThe perfect Disney toy building kit for reenacting memorable scenes with Olaf, Anna and Mattias from Frozen II, or creating new role-play forest adventures with favorite Disney characters.\nThis buildable Frozen toy for boys and girls and for all fans of the Frozen II movie makes an ideal Christmas gift or birthday gift.\nCan be built together with all other original LEGO® bricks for creative building.\nCombine with 41165 Anna's Canoe Expedition, 41166 Elsa's Wagon Adventure, 41167 Arendelle Castle Village, 41168 Elsa’s Jewelry Box Creation and 41169 Olaf for even more LEGO® l Disney Frozen II adventures.\nTreehouse measures over 7” (20cm) high, 9” (25cm) wide and 7” (20cm) deep."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/mickey-s-vacation-house-10889","description":"Head to LEGO® DUPLO® l Disney 10889 Mickey’s Vacation House for open-ended imaginative play with Disney Mickey Mouse and friends. With the reversible roof bricks turned to show their red-hot summer side, preschoolers will love watering flowers with Minnie Mouse, flying an airplane with Goofy and drinking tea at the garden table. Turn the reversible roof bricks to show their snowy white winter side, and your toddler can enjoy sleighing with Mickey and sharing a hot drink by the fireplace. The easy-to-handle building bricks develop kids’ social and emotional awareness plus early construction and fine motor skills. With 4 DUPLO figures and so many ways to play and learn, this fun-packed Mickey Mouse and Minnie Mouse toy construction set is ideal for sharing precious moments with your toddler.\n\nThis educational Disney Mickey Mouse and Minnie Mouse toddler building toy includes a sleigh for the characters to ride on.\nIncludes 4 LEGO® DUPLO® figures: Mickey Mouse, Minnie Mouse, Goofy and Pluto.\nTwo-sided summer/winter roof-tile bricks let kids switch between seasons.\nHelp your child master basic construction skills and improve their fine motor abilities as the building bricks are assembled and re-positioned for endless imaginative play.\nThis buildable toy for toddlers is designed to encourage role-play and storytelling to help your child develop language, social and emotional skills.\nMickey’s playhouse measures over 9” (25cm) high, 7” (19cm) wide and 5” (13cm) deep.\nAirplane measures over 2” (7cm) high, 5” (15cm) long and 5” (15cm) wide."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/toy-story-4-rv-vacation-10769","description":"Help your child experience the adventure and fun of Disney•Pixar’s Toy Story 4 with the 10769 Toy Story 4 RV Vacation LEGO® 4+ set! This jaunty set is developed to be fun and easy for preschoolers and youngsters, featuring a recreational vehicle (RV) with special Starter Brick chassis, removable roof and interior with bed, toilet and sink, plus a park building wall with special Starter Brick baseplate, tree, picnic table and a grill. The Starter Brick pieces help even first-time builders experience the pride of building vehicles, structures and more, all on their own. This great easy LEGO set also includes an RV Park sign with tree and opening gate. The included simple guide to build and play will help your young camper understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO model kits in an exciting new Toy Story 4 movie setting. Includes Jessie and Alien minifigures, plus Rex and Forky LEGO figures.\n\nLEGO® 4+ sets are developed to be fun and easy for young children and help to grow their confidence with simple building steps for an excellent start to LEGO brick building.\nIncludes 2 minifigures: Jessie and Alien, plus Rex and Forky LEGO® figures.\nThis great camping set features an RV with special Starter Brick chassis, removable roof, interior with bed, toilet and sink, and a ladder to get youngsters building and playing quickly with LEGO® bricks in a Disney\nPixar Toy Story 4 world.\nAlso includes a park building wall with special Starter Brick baseplate, picnic table and a grill, plus an RV Park sign with opening gate.\nThis fun set also features 2 of the new sustainable LEGO® plant-based plastic trees.\nAccessory elements include 2 mugs, croissant, skateboard, camera, plate, apple, hot dog and a marshmallow on a stick.\nRemove the roof for easy play inside the RV.\nYoung children with love to replay exciting Toy Story 4 movie scenes or make up their own stories.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ play sets were previously branded as LEGO Juniors and can be built together with all LEGO building toys for creative building.\nThis Toy Story 4 construction set makes an ideal gift for preschoolers and youngsters.\nRV measures over 3” (10cm) high, 5” (14cm) long and 2” (7cm) wide.\nPark building wall measures over 2” (7cm) high, 6” (16cm) wide and 3” (9cm) deep.\nRV Park sign measures over 5” (13cm) high, 5” (13cm) wide and 1” (3cm) deep."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/cinderella-s-castle-celebration-43178","description":"Kids can stretch their role-play and creativity skills with a Disney Princess and her pets in this LEGO® ǀ Disney Cinderella’s Castle Celebration (43178) set, featuring a castle façade with towers and a buildable pavilion with balloon, seat and cake stand.Welcome to 4+!This fun toy for kids helps preschoolers and youngsters learn to build with LEGO bricks. The set includes a Starter Brick base to make building simpler, and the step-by-step guide will help even first-time builders construct the models all on their own, gaining a huge confidence boost. For extra fun, download the free LEGO Life Instructions PLUS interactive building app with zoom and rotate features.Adorable characters and accessories ensure stellar playThe playset comes with a Disney Princess Cinderella mini-doll figure, plus Lucifer, Bruno and mouse LEGO animal figures for Disney to get kids playing quickly. Cute play starters, including party hats for the animals, help inspire kids’ imagination for their own world offun and adventure.\nInspire creative movie-based role-play with this LEGO® ǀ Disney (43178) set that features Disney’s Cinderella. LEGO® 4+ sets are a fun way for youngsters to learn to build and grow their confidence with simple building steps.\nLoads of party fun and exploration await kids with this cute set. The castle has Starter Brick plates to make building easier, so children can quickly get to playing with Disney’s Cinderella and her pets Lucifer and Bruno.\nThese beloved characters are great to play with in this set or with others as part of new stories. Kids can party with Disney Princess Cinderella in her castle or expand other sets with this one to extend the play in new ways.\nAny fan of Disney’s Cinderella will love this awesome set. The colorful castle with its different rooms will make an ideal Christmas, birthday or anytime gift for preschoolers and youngsters aged 4+.\nDecorated and ready to party. With the castle measuring over 6” (16cm) high, 6” (17cm) wide and 3” (8cm) deep, this exciting playset is big enough for serious adventures and helps young kids learn the joy of building.\nPowered by a child’s imagination for hours of endless fun! This easy-to-build, battery-free toy help boost kids’ independent play and problem-solving skills, plus it gives them the joy of constructing on their own.\nInstructions PLUS is an interactive guide that makes building this model extra fun. Available in the free LEGO® Life app, it has zoom and rotate tools to help even preschool childrenbuild this LEGO playset independently.\nLEGO® 4+ buildable toys have Starter Brick bases to make building simpler and boost confidence, plus they make a top gift to introduce younger children to LEGO themes, movie favorites, TV characters and everyday heroes.\nSince 1958, LEGO® bricks have met the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – and it’s still that way today.\nAt the LEGO Group, we drop, heat, crush, twist and analyzeLEGO® bricks and pieces to make sure every kid’s building toy meets the highest global safety and quality standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/moana-s-island-home-43183","description":"Introduce kids to island life with Disney’s Moana, Hei Hei and Grandma Tala Stingray in this detailed LEGO® ǀ Disney Moana’s Island Home (43183) set. This unique playset features a colorful play hut with bedroom under the roof, living area and attached dock, plus buildable waterfall with spinning whirlpool disc.Experience life at the seasideChildren can dream up great stories with this fun set, that can be played with independently or combined with other LEGO ǀ Disney sets for different, exciting possibilities. Plus, it makes a great Christmas gift or birthday present for a young Moana fan.Adventure with characters from the movieThe fun starts with a Disney’s Moana mini-doll figure, plus Hei Hei, mama and baby turtles and Grandma Tala Stingray LEGO figures for Disney, to get kids playing quickly and easily. The set helps inspire kids’ creativity and imagination with built-in story starters while also encouraging open-ended play.\nKids can role-play heartwarming movie scenes with the characters or develop their own stories with Disney’s Moana, Grandma Tala Stingray and Hei Hei as they spend time in the pretty seaside hut.\nDaily life and adventure meet in this LEGO® ǀ Disney (43183) set. The detailed hut has a bedroom and living space with attached dock, plus a separate waterfall with spinning whirlpool disc, to encourage imaginative play.\nRecognizable characters make this a great set to play with or can join others as part of new stories. Kids can help Disney’s Moana around in her house or add this set to others to expand the play in different ways.\nThis is a cool set for fans of Disney’s Moana movie. The colorful island hut and waterfall, plus Moana, Hei Hei and Grandma Tala Stingray will make an ideal holiday, birthday or anytime gift for children aged 5+.\nMade for imaginative house play and adventure. With the island hut measuring over 6” (15cm) high, 5” (14cm) wide and 3” (8cm) deep, this multi-purpose playset is big enough for loads of serious play and fun.\nPowered by a child’s imagination for hours of endless fun! This easy-to-build, battery-free toy help boost kids’ independent play and problem-solving skills, plus it gives them the joy of constructing on their own.\nOpen the box and play begins. Simple and clear instructions help make building a snap, giving kids lots of creative excitement and the joy of imagining new adventures or replaying stories from the movie.\nGive children detailed characters and places to play with in LEGO® ǀ Disney collectible toy sets. This detailed playset offers different story starters and encourages open creative play to build important skills.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it’s been that way since 1958.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® bricks and pieces to make sure every kid’s building toy meets the highest global safety and quality standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/mulan-s-training-grounds-43182","description":"Unexpected discoveries await fans of Disney’s Mulan, Cri-Kee and her horse Khan in this cute LEGO® ǀ Disney Mulan’s Training Grounds (43182) set. This unique playset features a training area with gate, fireworks shooter and zipline, plus a buildable plum tree with storage space inside. This fun set offers kids a range of imaginative play possibilities.Discover the secrets hidden insideYoungsters can explore creative role-play fun with this great set, that can be played with independently or combined with other LEGO ǀ Disney sets for different, thrilling possibilities. Plus, it makes a great Christmas gift or birthday present for a young Mulan fan.Well-known characters to adventure withThis fairy tale toy comes with a Disney Princess Mulan mini-doll figure, plus a Khan the horse LEGO figure for Disney and an element decorated with Cri-Kee and his cage to get kids playing quickly and easily, inspiring kids’ creativity and sparking their imagination to go into their own world of fun and adventure.\nPlay out fun movie-based role-play with this LEGO® ǀ Disney (43182) set that features characters from Disney’s Mulan. Kids can train with Mulan, have tea at her training area, or shoot off fireworks from the gate roof.\nAdventure awaits kids with this exciting set. The training area has an attached zipline and fireworks shooter on the gate roof, while the buildable toy plum tree opens to reveal a hidden space for Disney Princess Mulan’s sword, chest and vanity.\nThis beloved character is great to play with in this set or with others as part of new stories. Kids can train and drink tea with Disney’s Mulan in her pavilion or add this set to others to boost creative play in new ways.\nFans of Disney’s Mulan will love this set. The unique, detailed training area and buildable plum tree, along with Disney’s Mulan, Cri-Kee and her horse Khan will make an ideal Christmas, birthday or anytime gift for children aged 5+.\nDesigned for training and relaxation. With the paifang measuring over 5” (16cm) high, 4” (12cm) wide and 2” (6cm) deep, this exciting playset is big enough for serious, imaginative play adventures.\nPowered by a child’s imagination for hours of endless fun! This easy-to-build, battery-free toy help boost kids’ independent play and problem-solving skills, plus it gives them the joy of constructing on their own.\nOpen the box and play begins. Easy-to-follow instructions help make building a snap, giving kids lots of creative excitement and the joy of imagining new adventures or replaying well-known ones from the movie.\nGive children detailed characters and places to play with in LEGO® ǀ Disney collectible toy sets. This clever playset offers different story starters and encourages open creative play to build important skills.\nSince 1958, LEGO® bricks have met the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – and it’s still that way today.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® bricks and pieces to make sure every kid’s building toy meets the highest global safety and quality standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/buzz-bo-peep-s-playground-adventure-10768","description":"Introduce your youngster to the fun and excitement of Disney•Pixar’s Toy Story 4 with this adorable 10768 Buzz & Bo Peep’s Playground Adventure LEGO® 4+ play set! This sweet set is specially designed to be easy and fun for young children and preschoolers, featuring a 2-level playhouse with kitchen area, slide, bridge, climbing wall, bubble window stand and a special Starter Brick baseplate that lets even first-time builders experience the pride of constructing buildings, vehicles and more on their own. The cute playground toy building set also includes a merry-go-round and movable bushes under the bridge that open to reveal a hiding spot and a skunk-mobile. The included simple guide to build and play will also help your young adventure-seeker understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO brick building in a well-known Toy Story setting. Includes Buzz Lightyear, Bo Peep and Gabby Gabby minifigures.\n\nLEGO® 4+ learning toy sets are specially designed to be fun and easy for your child and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nIncludes 3 Toy Story 4 minifigures: Buzz Lightyear, Bo Peep and Gabby Gabby.\nFeatures a 2-level playhouse with kitchen area, slide, bridge with movable bushes underneath, climbing wall, bubble window stand, and a Starter Brick baseplate to get youngsters building and playing quickly with LEGO® bricks in a Disney\nPixar Toy Story world.\nThis sweet set also includes a merry-go-round and a skunk-mobile.\nThis fun set also features the new sustainable LEGO® plant-based plastic trees.\nAccessory elements include Bo Peep’s shepherd crook, frying pan and an egg.\nHelp your child replay exciting Toy Story movie scenes or make up their own stories.\nLEGO® 4+ preschool toys introduce your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ construction toy sets were previously branded as LEGO Juniors and can be built together with all LEGO building toys for creative building.\nThis Toy Story 4 construction set makes an ideal gift for preschoolers and youngsters.\nPlayhouse measures over 6” (17cm) high, 9” (25cm) wide and 4” (12cm) deep.\nMerry-go-round measures over 2” (6cm) wide and 2” (7cm) deep.\nSkunk-mobile measures over 5” (14cm) long and 1” (3cm) wide."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/mickey-minnie-birthday-parade-10597","description":"All aboard the Mickey Mouse Clubhouse birthday train as Mickey and Minnie throw a parade in your honor! Load up the train with everything you need for the perfect birthday party—a buildable cake, balloons and decorated gift bricks. How old are you today? With decorated age bricks numbered from 1 to 5, Mickey and Minnie can bring birthday fun year after year. Young children will love the endless birthday role-play opportunities and developing their construction skills with the big, bright LEGO® DUPLO® bricks designed especially for budding builders. Includes 2 DUPLO figures: Mickey Mouse and Minnie Mouse.\n\nBuild a birthday train featuring your favorite Disney characters, including a buildable birthday cake, balloons, a candle and three gift-decorated bricks\nIncludes two DUPLO figures, Mickey and Minnie Mouse\nLEGO DUPLO Disney building toys are compatible with all LEGO DUPLO sets for creative building\nTrain measures over 7” high, 13” long and 2” wide.\n24 pieces – For boys and girls between the ages of 2 and 5 years old"},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/carnival-thrill-coaster-10771","description":"Share the excitement and joy of a carnival with you child, with the Disney•Pixar Toy Story 4 10771 Carnival Thrill Coaster LEGO® 4+ construction toy! The action-packed play set is specially designed to be fun and easy for preschoolers and smaller children. This great set features a colorful carnival roller coaster with 3 cars, 6 sturdy track sections and a large entrance arch with spinning turnstile, plus a special Starter Brick baseplate that gives first-time builders the experience and pride of constructing buildings, vehicles and more on their own. This fun preschool toy building set also comes with a cute ice cream wagon with balloon and pizza pie. The included simple guide to build and play will also help your young carnival visitor understand the purpose of the building steps and grow their imagination and confidence for the perfect start to easy LEGO brick building in a fun Toy Story setting. Includes Buzz Lightyear and Alien minifigures.\n\nLEGO® 4+ sets are made specifically to be fun and easy for youngsters, to grow their confidence, with simple steps for an easy start to LEGO brick building.\nIncludes 2 Toy Story character minifigures: Buzz Lightyear and Alien.\nFeatures a roller coaster track with a large entrance arch, flags, camera, spinning turnstile, 6 purple track sections and a special Starter Brick baseplate to get youngsters building and playing quickly with LEGO® bricks in a Disney\nPixar Toy Story 4 world.\nThis exciting set also includes 3 coaster cars and an ice cream wagon with balloon.\nAccessory elements include a camera, 1 ice cream element and a pizza pie.\nYoungsters will love to replay exciting Toy Story movie scenes or make up their own stories.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ starter play sets were previously branded as LEGO Juniors and can be built together with all LEGO building toys for creative building.\nThis Toy Story 4 construction set makes an ideal gift for preschoolers and youngsters.\nIncludes a digital building extension via LEGO® Life.\nThrill Coaster with arch measures over 3” (10cm) high, 11” (28cm) wide and 11” (29cm) deep.\nCoaster cars each measure over 6” (16cm) long and 1” (3cm) wide.\nPizza wagon with balloon measures over 2” (7cm) high and 1” (4cm) long."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/duke-caboom-s-stunt-show-10767","description":"Help your youngster see the thrill and adventure of Disney•Pixar’s Toy Story 4 with this 10767 Duke Caboom’s Stunt Show LEGO® 4+ set. This fun preschool toy building set is specially designed to be easy and enjoyable for preschoolers and youngsters, featuring an adjustable ring of fire with attached ramp and 2 special Starter Brick plates that let even first-time builders have the pride of constructing vehicles, buildings and more all on their own. This fun set also includes a buildable toy motorcycle, 3 stackable cans, 2 cars and a stunt sign that can be knocked down. The simple guide to build and play, included in the box, will help your young stunt driver understand the purpose of the building steps and boost their imagination and confidence, for a great start to LEGO building toys in a fun Toy Story setting. Includes 2 minifigures for role-play fun.\n\nThe design of LEGO® 4+ starter sets makes it fun and easy for youngsters to grow their confidence, with simple building steps for the perfect start to LEGO brick building.\nIncludes 2 minifigures: Woody and Duke Caboom.\nThis cool set features a striped ramp with a gap for cars and an adjustable ring of fire, plus 2 Starter Brick plates to get your child building with LEGO® bricks and playing quickly in a thrilling Disney\nPixar Toy Story world.\nAlso includes a motorcycle and two cars, plus a small stunt sign with ramp.\nAccessory elements include 4 fire elements, cape and an extra wig, plus 3 buildable, stackable cans.\nHelp your child move the ring of fire into different positions and more challenging stunt jumps.\nYoungsters will enjoy replaying exciting Toy Story movie scenes or making up their own stories.\nLEGO® 4+ starter sets introduce your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ play sets were previously branded as LEGO Juniors and can be built together with all LEGO building toys for creative building.\nThis Toy Story 4 building set makes an ideal gift for preschoolers and youngsters.\nRamp with ring of fire measures over 7” (18cm) high, 8” (22cm) wide and 4” (12cm) deep.\nMotorcycle measures over 1” (3cm) high and 2” (6cm) long.\nCars each measure over 1” (4cm) long and 1” (3cm) wide."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/mulan-s-storybook-adventures-43174","description":"Honor and adventure await fans of Disney’s Mulan in this unique LEGO® ǀ Disney Mulan’s Storybook Adventures (43174) set. This playset features a customizable, opening book with 2 scenes: winter training grounds with spinning training dummy and a garden setting with unfolding plum tree, plus 2 sticker sheets to decorate the book with. On-the-go role-play fun and excitement Kids like building creative role-play fun with this portable playset. It can be played with on its own or combined with other LEGO ǀ Disney sets for thrilling imaginative play options. Plus, it makes a great Christmas gift or birthday present for a young Disney’s Mulan fan. Favorite characters and scenes offer effortless play This creative Disney gift comes with 3 detailed micro-doll figures, including 2 versions of Disney Princess Mulan, Li Shang and a Khan the horse LEGO figure for Disney, plus a brick with a Cri-Kee decoration. These will get kids playing quickly, as will the scenes designed to inspire children's creativity and imagination.\nSpark exciting movie-based role play or creative play with this imaginative LEGO® ǀ Disney (43174) set, featuring Disney’s Mulan, Li Shang, Cri-Kee and Khan the horse. Makes a great gift. Play starts with opening the book!\nWhat adventure awaits the warrior-in-disguise? Kids can stretch their creative and role-play skills as they train for battle with Disney's Mulan and Li Shang in the wintry setting or drink some tea in Mulan's garden.\nThese beloved micro-characters are great to play with in this set or with others in new stories and fun. Kids can adventure with Disney’s Mulan, Cri-Kee, Khan and Li Shang, relax by the plum tree or dream up something new!\nAny fan of Disney’s Mulan will adore this awesome set. The clever, opening book reveals a complete micro-world that will thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 5+.\nPortable micro-world travel toy to take anywhere. With the open book measuring over 9” (23cm) wide, 4” (12cm)deep and 3” (8cm) high, this awesome playset is big enough for new adventures or packable for on-the-go fun.\nHours of fun, driven by a child’s imagination! Open-ended, battery-free toys help boost kids’ independent play, group play and problem-solving skills, while giving them the joy of dreaming up new stories all on their own.\nOpen the toy book and the play begins. Easy-to-follow instructions help make assembly a snap, giving kids the joy of making new stories on their own, and lots of creative excitement with the built-in scenarios.\nGive youngsters detailed micro-characters and known scenes to play out with LEGO® ǀ Disney sets. This imaginative Disney’s Mulan playset offers story starters as well as open creative play that helps build important skills.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it's been that way since 1958.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® bricks and pieces to make sure every kid’s building toy meets the highest global safety and quality standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/olaf-41169","description":"This LEGO® brick-built Olaf toy is loads of fun to build and play with. His arms and neck are articulated so you can position and move him however you like, and he comes with Frozen accessories to add to the fun. Disney Frozen II fans can channel the joy of this lovable snowman as they put on his blue bow tie or help him hold his pencil to write in his journal as he discovers the various wonders of life. When displayed at home or at work, this buildable Olaf Frozen character figure adds a ray of sunshine on even the coldest day, and is a great Frozen gift idea for Disney fans.\n\nFeatures a brick-built Olaf figure from Frozen II with adjustable arms and neck.\nAccessory elements include a blue bow tie, Olaf’s journal and a pencil.\nHave fun building and rebuilding your favorite Disney Frozen character.\nPerfect to display at home or in your office to brighten up every day.\nOlaf measures over 4” (14cm) high, 3” (10cm) wide and 1” (5cm) deep."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/aurora-s-royal-carriage-43173","description":"Adventure awaits for fans of Disney Princess Aurora and her owl friend in this cute LEGO® ǀ Disney Aurora’s Royal Carriage (43173) set. This adorable playset features a pink and white carriage with translucent top, small table and a cake with a candle. Awesome role-play fun and festivities Kids can explore creative role-play fun with this cute playset. The set can be played with independently or combined with other LEGO ǀ Disney sets for exciting and imaginative play options. Plus, it makesa great Christmas gift or birthday present for a young Disney Princess fan. Beloved character and accessories offer effortless play This Disney Princess playset comes with an Aurora mini-doll figure and an owl LEGO figure for Disney to get kids playing quickly and easily, as well as several play starters to inspire kids' creativity and spark their imagination to go into their own world of fun and adventure.\nInspire thrilling role play or creative play with this adorable toy, featuring Disney Princess Aurora and her owl friend. A great gift for kids and fans of Disney’s Sleeping Beauty. Play starts with building, straight out of the box!\nWhat excitement awaits at the LEGO® ǀ Disney (43173) princess party? Kids can build their imaginative play skills as they join Disney Princess Aurora in her carriage to meet her owl friend and celebrate the day with cake.\nThis well-known princess is fun to play with alone or with other playsets as part of new stories. Kids can share a piece of cake with Disney’s Aurora and the owl before hopping in the carriage and taking off on an adventure!\nAny fan of Disney’s Sleeping Beauty will love this set. The sweet pink and white carriage, small table and a cake with candle will thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 5+.\nSmall yet fun and ready for play. With the carriage measuring over 1” (5cm) high,3” (10cm) long and 1” (5cm) wide, this exciting playset is the perfect size for imaginative play and creative story role-play.\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills, plus it gives them the joy of coming up with new stories all on their own.\nOpen the box and the play begins with building the model. Easy-to-follow instructions help make assembly a snap, giving kids the joy of constructing thetoy independently and loads of creative fun.\nGive youngsters cute characters and scenarios to play out with LEGO® ǀ Disney sets. This fun Princess Aurora playset offers story starters as well as open-ended play that helps build children’s creativity and imagination skills.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it's been that way since 1958.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® bricks and pieces to make sure every kid’s building toy meets the highest global safety and quality standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/mini-doll-dress-up-kit-40388","description":"Kit out your mini-doll figures in Disney Princess style with the LEGO® l Disney Mini-Doll Dress-Up Kit, featuring a buildable sewing machine, dressing table, vanity table with chair and a clothes rack, plus assorted accessory elements. Use this kit to customize your LEGO® l Disney sets and inspire even more role-play fun.\n\nFeatures various small builds including a sewing studio with buildable sewing machine, dressing table, vanity table with chair, clothes rack, 4 fabric capes and a fabric skirt to fit a mini-doll (not included), plus assorted accessory elements.\nThe perfect addition to your LEGO® l Disney play sets.\nCombine with the 40307 Castle Interior Kit to create even more play possibilities for your LEGO® l Disney sets."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/moana-s-ocean-adventure-43170","description":"Young fans of Disney’s Moana movie will love the creative play and fun they can have with this adorable LEGO® ǀ Disney (43170) Moana’s Ocean Adventure toy building set, featuring a camakau sailboat with mast, decorated fabric sail and a magic oar, plus other play starters and an element decorated with the Heart of Te Fiti gem. Fearlessly replay exciting movie scenes Kids can role-play their favorite movie scenes or reimagine them however they like with this cute Disney Moana playset. The model can be played with on its own or added to other sets for all sorts of exciting and imaginative play options and makes a great holiday gift. Fun accessories for effortless play This Disney Moana playset comes with several play starters to inspire kids' creativity and spark their imagination to go beyond the movie into their own world of fun and adventure. This playset also includes a Moana mini-doll figure and a Pua the pig LEGO figure for Disney to get kids playing quickly and easily.\n\nInspire thrilling movie-based role play or creative play with this adorable set, featuring Moana and Pua the pig. A great gift for kids and fans of Disney’s Moana. Play starts with building, straight out of the box!\nWhat adventure awaits on the sea? Kids can stretch their imagination and creative skills as they head off on an exciting mission with Disney's Moana and Pua the pig on her buildable camakau sailboat toy.\nThese beloved characters are great to play with in this set or with other models as part of new stories and fun. Kids can explore with Disney’s Moana or feed Pua a snack before sailing off on an adventure!\nFans of Disney’s Moana will love this LEGO® ǀ Disney (43170) set. The boat with its fabric sail and Heart of Te Fiti element will thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 6+.\nSmall yet mighty and ready for action. With the sailboat measuring over 3” (10cm) high, 3” (9cm) long and 2” (6cm) wide, the playset is big enough for serious adventures and small enough to go wherever kids go.\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills, plus it gives them the joy of coming up with new stories all on their own.\nOpen the box and the play begins with building the model. Easy-to-follow instructions help make assembly a snap, giving kids the joy of constructing the toy on their own, and loads of creative fun.\nGive youngsters cute characters and scenarios to play out with LEGO® ǀ Disney sets. This fun Disney Moana playset offers story starters as well as open-ended play that helps build children’s creativity and imagination skills.\nLEGO® bricks meet the highest industry standards, so they are consistent, compatible and connect and come apart easily every time – it's been that way since 1958.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® bricks and pieces to make sure every kid's building toy meets the highest global safety and quality standards."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/my-first-mickey-build-10898","description":"Toddlers will love to build and rebuild their favorite Disney character with LEGO® DUPLO® 10898 My First Mickey Build! This 3D puzzle is easy to build from chunky DUPLO bricks. Help your preschooler develop fine motor skills as they stack up the body parts in a simple tower construction to make a Disney Juniors Mickey Mouse toy they'll play with over and over again. Young children can express their creativity through rebuilding Mickey with 2 different outfits: daytime clothes or pajamas with a sleep hat. DUPLO bricks are specially designed to be fun and safe for small hands.\n\nFeatures a 3D buildable Disney Juniors Mickey Mouse puzzle.\nIncludes interchangeable day and nighttime outfits with a sleep hat for Mickey Mouse.\nHelp your young child learn to build with this simple model of their favorite character that helps develop their fine motor skills.\nInspire fun and creative play for kids with their favorite Disney character.\nDevelop language and social and emotional skills as toddlers have endless role-play fun with Mickey Mouse.\nThis LEGO® DUPLO® l Disney Juniors Mickey Mouse learning toy makes an ideal gift for preschool children.\nThe endless creative play possibilities of LEGO® DUPLO® educational toys for kids set the stage for toddlers to become creative thinkers.\nLEGO® DUPLO® products are specially designed to be fun and easy for small hands.\nMickey puzzle (with hat) measures over 6” (16cm) high, 3” (9cm) wide and 1” (5cm) deep."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/my-first-minnie-build-10897","description":"Little Disney fans will love LEGO® DUPLO® 10897 My First Minnie Build—a 3D Minnie Mouse puzzle to make from chunky DUPLO bricks. The simple tower construction makes this Disney Juniors Minnie Mouse toy easy to build, as your toddler stacks up the parts in the correct order to make the whole body. It comes with a hair bow and 2 different outfits to mix and match, inspiring creativity for kids as they rebuild Minnie in different looks. DUPLO bricks are specially designed to be fun and safe for small hands.\n\nFeatures a 3D buildable Disney Juniors Minnie Mouse puzzle.\nIncludes a hair bow and an extra interchangeable outfit for Minnie Mouse.\nHelp your child learn to build and develop fine motor skills with this simple puzzle.\nInspire role-play fun and storytelling with this iconic Disney character, helping your child pick up language development and social and emotional skills along the way.\nThis LEGO® DUPLO® l Disney Juniors Minnie Mouse toy makes an ideal gift for preschool children.\nThe endless creative play possibilities of LEGO® DUPLO® educational toys for kids set the stage for toddlers to become creative thinkers.\nLEGO® DUPLO® products are specially designed to be fun and easy for small hands.\nMeasures over 5” (15cm) high, 3” (9cm) wide and 1” (5cm) deep."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/woody-rc-10766","description":"Introduce your child to the fun of LEGO® building and the excitement of Disney•Pixar’s Toy Story 4 with the 10766 Woody & RC set. This simple LEGO 4+ set is specially designed to be fun and easy for preschoolers and youngsters, featuring an easy to build Toy Story RC character car with a special Starter Brick chassis that lets even first-time builders have the pride of constructing vehicles and more, all on their own. The included simple guide to build and play will also help your young race car driver understand the purpose of the building steps, and grow their confidence and imagination for a great start to LEGO brick building in a familiar Disney•Pixar setting. Includes a Woody minifigure for role-play fun.\n\nLEGO® 4+ sets are specially designed to be fun and easy for youngsters and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nIncludes a Woody minifigure.\nFeatures an easy-to-build RC toy car with big back fin, front fender with eyes and remote antenna, plus a Starter Brick base to get your child building with LEGO® bricks and playing quickly in a fun Disney\nPixar Toy Story 4 world.\nAccessory elements include 3 green army men, remote control element for RC, 6 colorful, buildable display bricks and 3 buildable cones.\nHelp your child replay exciting Toy Story movie scenes or make up their own stories.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ play sets were previously branded as LEGO Juniors and can be built together with all LEGO building kits for creative building.\nThis Toy Story 4 construction set makes an ideal gift for preschoolers and youngsters.\nRC car measures over 2” (6cm) high, 3” (9cm) long and 2” (6cm) wide."},{"theme":"disney","themeUrl":"https://www.lego.com/en-us/themes/disney","productUrl":"https://www.lego.com/en-us/product/ariel-key-chain-853954","description":"Let all your Disney Princess dreams come true with this LEGO® l Disney Ariel Key Chain. Attach this mini-doll figure on a durable metal ring and chain to your keys or backpack and take a bit of The Little Mermaid magic with you wherever you go.\n\nFeatures an Ariel mini-doll figure in a dress attached to a durable metal chain and ring.\nAttach it to your backpack or keys.\nMini-doll figure is not detachable from metal chain.\nMini-doll figure on key chain measures over 2” (6cm) long."}]