[{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/barn-tractor-farm-animal-care-10952","description":"LEGO® DUPLO® Town Barn, Tractor & Farm Animal Care (10952) is a fun-packed farm filled with playful learning for preschoolers. It’s an ideal developmental toy for toddlers who love animals or tractors.Play-and-learn farm for toddlersThe LEGO DUPLO farm is filled with playful learning fun. There are farm buildings and a tractor, plus a pig, sheep, horse, dog, hen, rooster and cows to care for. As toddlers role-play the different farm activities, they build fine motor skills and develop social and emotional awareness. At the end of the day, it’s time to settle the animals into bed – until the fun starts again tomorrow!Hands-on educational toys for toddlersLEGO DUPLO toys put open-ended fun, self-expression and joyful learning into preschoolers’ hands. With DUPLO playsets, parents and young children can share precious developmental milestones as they play together.\nThe LEGO® DUPLO® Town Barn, Tractor & Farm Animal Care (10952) playset is packed with play-and-learn opportunities for toddlers who love animals and farm vehicles.\nIncludes a tractor, pig, sheep, horse, dog, hen, rooster, 2 cows, 4 LEGO® DUPLO® figures, a buildable barn, realistically textured hay bale and lots of cool accessories.\nKids develop fine motor skills, social and emotional awareness and imaginative thinking when they play out fun farm activities, such as feeding the animals and riding the horse.\nA great Christmas, holiday, birthday or ‘just because’ gift for little farmers aged 2 and up who are animal lovers, tractor fans or just curious kids.\nThe barn measures over 9 in. (23 cm) high, 7.5 in. (20 cm) wide and 4 in. (11 cm) deep. This versatile playset can be configured in different ways and combined with all other LEGO® DUPLO® farm toys.\nBuilding instructions include a fun picture story involving models from the set to add an extra element of enjoyment to the creative construction and imaginative play.\nAll LEGO® DUPLO® playsets are specially created with toddler-friendly features to encourage open-ended developmental play that parents can share with little ones.\nLEGO® DUPLO® playsets meet stringent industry quality standards that ensure they are easy for little fingers to pick up, place and pull apart – and it’s been that way since 1969.\nLEGO® DUPLO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure they satisfy demanding child safety standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/creative-birthday-party-10958","description":"It’s time to celebrate with the LEGO® DUPLO® Classic Creative Birthday Party (10958)! Bursting with colorful bricks and pieces, this versatile playset delivers maximum play value.\n\nEndless play possibilities\nStimulate toddlers’ imaginations and skill development with LEGO DUPLO Classic Creative Birthday Party. The entertaining learning possibilities never end with this colorful mix of bricks. There are inspirational builds for parents and toddlers to assemble, plus anything else they can imagine – from making a birthday cake and party food to building presents and figures for number play.\n\nEducational building toys for toddlers\nLEGO DUPLO playsets make great gifts for toddlers. With colorful, easy-to-hold pieces that excite imaginations and encourage open-ended play, they put creative control right into the hands of preschool kids.\n\nThe great-value LEGO® DUPLO® Classic Creative Birthday Party (10958) is bursting with colorful bricks and pieces that introduce little builders to hands-on construction and playful learning.\nInspire young imaginations with 200 colorful bricks and fun shapes, including a star and a water melon. There's so much in this versatile construction set, kids will never stop playing and learning.\nThe toddler-friendly bricks combine to create a birthday cake, presents, party food, numbers and more. Parents can help to build the inspirational builds, or anything else they can imagine.\nFor ages 18 months and up. With pieces that are perfect for small hands to pick up and place, this fun learning toy for toddlers is a great gift for Christmas, holidays, birthdays or ‘just because'.\nThis 200-piece set offers unlimited play possibilities. Combine the contents with other LEGO® DUPLO® sets for even more fun.\nSimple building instructions help parents and toddlers build a range of imaginative models. With so many pieces to inspire creativity, the free-building fun is as boundless as kids’ imaginations.\nAll LEGO® DUPLO® playsets are expertly designed with imaginative features to encourage open-ended developmental play that parents can share with their little ones.\nLEGO® DUPLO® playsets meet stringent industry quality standards to ensure they are easy for little fingers to pick up, place and pull apart – and it's been that way since 1969.\nLEGO® DUPLO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they satisfy rigorous child safety standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/horse-stable-and-pony-care-10951","description":"LEGO® DUPLO® Town Horse Stable and Pony Care (10951) has everything a little animal lover needs to care for 2 adorable ponies. The imaginative fun and playful learning will never end.Play-and-learn pony stableIt’s always a fun-packed play-day at the pony stable. The 2 cute ponies need feeding before being taken out for a ride. Then they’ll want to have a drink and be brushed. Don’t forget to prepare a cozy place for them to sleep. As they take care of the ponies in the iconic stable, little animal lovers boost their preschool development, particularly fine motor skills and social and emotional awareness.Hands-on educational toys for toddlersLEGO DUPLO toys put open-ended fun, self-expression and joyful learning into preschoolers’ hands. With DUPLO playsets, parents and young children can share precious developmental milestones as they play together.\nLEGO® DUPLO® Town Horse Stable and Pony Care (10951) inspires endless imaginative fun and playful learning with 2 cute ponies and everything a young animal lover needs to care for them.\nIncludes a boy and girl figure, 2 cute ponies, a buildable stable with an iconic design and opening doors, water pot, carrots and a realistically textured hay bale.\nKids develop fine motor skills and expand social and emotional awareness as they role-play riding and caring for the ponies, by feeding and brushing them and making a cozy place for them to sleep.\nGreat developmental play gift for kids aged 2 and up for Christmas, holidays, a birthday or any other day!\nMain building measures over 7.5 in. (19 cm) high, 6 in. (15 cm) wide and 3.5 in. (9 cm) deep. The set can be arranged in many ways and easily combines with other LEGO® DUPLO® farm toys.\nBuilding instructions include a fun picture story involving models from the set to add an extra element of enjoyment to the creative constructionand imaginative play.\nAll LEGO® DUPLO® playsets are expertly designed with imaginative features to encourage open-ended developmental play that parents can share with little ones.\nLEGO® DUPLO® playsets satisfy rigorous industry quality standards to ensure they are easy for little fingers to pick up, place and pull apart – it’s been that way since 1969.\nLEGO® DUPLO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they fulfil demanding child safety standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/animal-train-10955","description":"All kids love animals, right? So give a toddler the perfect introduction to the animal kingdom with LEGO® DUPLO® My First Animal Train (10955).\n\nPull-along animal parade toy\nThere’s lots for little animal lovers to do with the elephant, tiger, giraffe and panda. As they build and rebuild, line up the carriages, place animals on and off the train and stack them on top of each other, they develop fine motor skills and explore a magical world of imaginative role play. Innovative features, like the giraffe’s wobbling neck, add extra joy to this playful learning toy. Building cards, with life-size images of the models, let kids position the bricks over the image as they build. For even more fun, kids can connect the train to other wheel-based DUPLO toys.\n\nHands-on kids' learning toys\nLEGO DUPLO toys put open-ended fun, self-expression and joyful learning into preschoolers' hands. With DUPLO playsets, parents and toddlers can share precious developmental milestones as they play together.\n\nTreat a toddler to the enchanting LEGO® DUPLO® My First Animal Train (10955). This versatile toy includes 4 buildable animals that are perfect for little hands to pick up, place and pull along.\nIncludes a buildable elephant (4 pieces), tiger (2 pieces), giraffe (3 pieces) and panda (2 pieces), plus 4 push-along ‘carriages' with wheels.\nKids build and rebuild, line up the carriages, place animals on and off the train and stack them on top of each other, developing fine motor skills as they enjoy imaginative role play.\nFor children aged 18 months and up, this delightful playset has it all: hands-on creativity, imaginative play possibilities and developmental benefits. It’s a great gift for toddlers.\nMeasures over 5 in. (14 cm) high, 17 in. (45 cm) long and 2 in. (6 cm) wide. Perfect for small hands to pick up and play with.\nIncludes building cards showing life-size images of the models. Kids can position the bricks over the image as they build while parents teach their child about colors and shapes.\nThe distinctive animals have different levels of building complexity to encourage toddlers’ construction skills. Special features, like the giraffe’s wobbling neck, add extra fun to the play.\nAll LEGO® DUPLO® playsets are skillfully designed to incorporate features that encourage open-ended developmental play, so parents can share precious moments with their little ones.\nLEGO® DUPLO® playsets meet stringent industry quality standards to ensure they are easy for little fingers to pick up, place and pull apart – and it’s been that way since 1969.\nLEGO® DUPLO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they satisfy rigorous child safety standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/farm-tractor-animal-care-10950","description":"Introduce toddlers to tractor fun, animal care and imaginative play with LEGO® DUPLO® Town Farm Tractor & Animal Care (10950). This versatile tractor playset inspires endless opportunities for creative fun and developmental play.\n\nPlayful learning on the farm\nParents and preschoolers can enjoy magical moments together helping out at the farm and petting zoo. There’s a tractor pulling a cart full of tools, 2 cute sheep and farmer and child figures. As kids act out animal-care activities, such as transporting food to the sheep and feeding them, they develop fine motor skills and social and emotional awareness.\n\nHands-on educational toys for toddlers\nLEGO DUPLO toys put open-ended fun, self-expression and joyful learning into preschoolers’ hands. With DUPLO playsets, parents and young children can share precious developmental milestones as they play together.\n\nWith a tractor to drive and sheep to feed, LEGO® DUPLO® Town Farm Tractor & Animal Care (10950) inspires imaginative play and preschool learning for kids with a passion for vehicles and animals.\nIncludes a tractor with pull-along cart, 2 sheep and farmer and child figures for toddlers to pick up and play with. Also includes a buildable tree, farm tools and a realistically textured hay bale.\nKids develop fine motor skills and expand their social and emotional understanding as they act out fun farm activities, such as transporting hay to the sheep and caring for them.\nGreat Christmas, holiday, birthday or ‘just because’ gift for kids aged 2 and up who love tractors, animals and creative play.\nThe tractor measures over 6 in. (15 cm) long and the buildable tree stands over 4 in. (11 cm) tall. This set can be played with in many ways and it combines easily with all LEGO® DUPLO® farm toys.\nBuilding instructions include a fun picture story involving models from the set to add an extraelement of enjoyment to the creative construction and imaginative play.\nAll LEGO® DUPLO® playsets are specially created with toddler-friendly features to encourage open-ended developmental play that parents can share with little ones.\nLEGO® DUPLO® playsets meet rigorous industry quality standards to ensure they are simple for little fingers to pick up, place and pull apart – and it’s been that way since 1969.\nLEGO® DUPLO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they fulfil strict child-safety standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/farm-animal-care-10949","description":"The versatile LEGO® DUPLO® Town Farm Animal Care (10949) playset engages toddlers with imaginative play and encourages key developmental skills with the help of 4 adorable farm animals.\n\nBuild skills with toddler-friendly animals\nParents and toddlers will enjoy endless imaginative fun with the delightful pig, sheep, duck and cat. These 4 cute farm animals are perfect for preschoolers to pick up and play with. As they act out animal-care activities, such as feeding and preparing the barn for bedtime, little animal lovers will improve their fine motor skills and their social and emotional awareness.\n\nHands-on educational toys for toddlers\nLEGO DUPLO toys put open-ended fun, self-expression and joyful learning into preschoolers’ hands. With DUPLO playsets, parents and young children can share precious developmental milestones as they play together.\n\nDelight a little animal lover with the LEGO® DUPLO® Town Farm Animal Care (10949) playset. These 4 adorable farm animals encourage endless hands-on imaginative play and learning fun.\nIncludes a pig, sheep, duck and cat figure, each beautifully colored and specially designed for toddlers to pick up and play with. Also includes a buildable barn and realistically textured hay bale.\nKids develop fine motor skills and expand their social and emotional understanding as they act out animal-care activities, such as feeding and preparing the barn for bedtime.\nThis delightful and durable playset makes a great gift for ages 2 and up for Christmas, holidays, birthdays or ‘just because they deserve a special treat’ days!\nMeasures over 4 in. (10 cm) high, 3.5 in. (9 cm) wide and 2.5 in. (6 cm) deep – although the playset can be arranged in many different ways and easily combines with other LEGO® DUPLO® farm toys.\nBuilding instructions include a fun picture story involving models from the setto add an extra element of enjoyment to the creative construction and imaginative play.\nAll LEGO® DUPLO® playsets are expertly designed with imaginative features to encourage open-ended developmental play that parents can share with their little ones.\nLEGO® DUPLO® playsets meet stringent industry quality standards to ensure they are easy for little fingers to pick up, place and pull apart – and it’s been that way since 1969.\nLEGO® DUPLO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they satisfy rigorous child safety standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/fire-helicopter-police-car-10957","description":"LEGO® DUPLO® My First Fire Helicopter and Police Car (10957) is a toddler-friendly, developmental toy built with colorful shapes and filled with fun features.\n\nKids’ rescue vehicle toy\nToddlers build skills as they enjoy hands-on fun with this push-along police car and fire-fighting helicopter. Basic construction tasks improve fine motor skills and teach toddlers about shapes and colors. Exciting rescue stories inspire role play and strengthen kids' social and emotional skills. Detailed decoration on both sides of the vehicles, a siren brick (no noise) and a propeller that can be spun all help to bring the imaginative play to life. Building cards, featuring life-size images of the models, let kids position the bricks over the image as they build.\n\nHands-on kids' learning toys\nLEGO DUPLO playsets put open-ended fun, self-expression and joyful learning into preschoolers' hands. With DUPLO toys, parents and toddlers can share precious developmental milestones as they enjoy playing together.\n\nTreat a toddler to LEGO® DUPLO® My First Fire Helicopter and Police Car (10957). This toddler-friendly toy is designed to inspire imaginative play and deliver developmental benefits.\nIncludes a buildable helicopter with a spinnable rotor and a push-along police car with siren brick (no noise). Built with colorful shapes that are perfect for little hands to pick up and place.\nBasic construction improves fine motor skills; role-playing rescue missions strengthens social and emotional skills; and colorful shapes and fun features bring the imaginative play to life.\nHigh-quality, durable and a delightful gift for kids aged 18 months and up for birthdays, Christmas, or ‘just because’.\nHelicopter measures over 3 in. (9 cm) high, 3 in. (10 cm) long and 2 in. (6 cm) wide. Police car measures over 3 in. (8 cm) high, 3 in. (10 cm) long and 1 in. (5 cm) wide.\nIncludes building cards showing life-size images of the models. Kids can position the bricks over the image as they build,while parents teach their child about colors and shapes.\nAll LEGO® DUPLO® playsets are cleverly designed to feature elements that encourage open-ended developmental play, so parents can share precious moments with their little ones.\nLEGO® DUPLO® playsets meet strict industry quality standards to ensure they are easy for little fingers to pick up, place and pull apart – it's been that way since 1969.\nLEGO® DUPLO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they meet rigorous child safety standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/unicorn-10953","description":"Surprise a toddler with the cute and colorful LEGO® DUPLO® My First Unicorn (10953). This versatile toy is built with colorful shapes that are perfect for little hands to pick up, place and pull along.\n\nPlay-and-learn unicorn toy\nEngage toddlers with imaginative play as they develop basic construction skills and learn about shapes and colors. With toddler-friendly pieces that attach and detach from the roll-along carriages, the unicorn train is packed with play possibilities. The set includes building cards showing life-size images of the models, so kids can position the bricks over the image as they build while parents help them learn about colors and shapes. For even more fun, the train connects to other wheel-based DUPLO toys.\n\nHands-on educational toys for toddlers\nLEGO DUPLO toys put open-ended fun, self-expression and joyful learning into preschoolers' hands. With DUPLO playsets, parents and toddlers can share precious developmental milestones as they enjoy playing together.\n\nSurprise a toddler with the cute and colorful LEGO® DUPLO® My First Unicorn (10953). This versatile toy includes fun shapes that are perfect for little hands to pick up, place and pull along.\nIncludes a buildable unicorn, 2 stars, a rainbow and 2 push-along ‘carriages' with wheels. All shapes have super-smooth corners and are perfect for little hands to pick up and place.\nKids develop fine motor skills and learn about colors and shapes as they build and play with their parents and caregivers.\nThis delightful and durable playset makes a great gift for children aged 18 months and up, for birthdays, Christmas, or ‘just because’.\nMeasures over 5 in. (13 cm) high, 9 in. (23 cm) long and 2 in. (6 cm) wide. Perfect for small hands to pick up and play with.\nIncludes building cards showing life-size images of the models. Kids can position the bricks over the image as they build, while caregivers help their child learn about colors and shapes.\nAll LEGO® DUPLO® playsets are expertly designed with imaginative features to encourage open-ended developmental play that parents and caregivers can share with their little ones.\nLEGO® DUPLO® playsets meet rigorous industry quality standards to ensure they are easy for little fingers to pick up, place and pull apart – it's been that way since 1969.\nLEGO® DUPLO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they fulfil stringent child safety standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/lego-education-my-xl-world-45028","description":"My XL World provides playful learning experiences that teach preschool children about the world around them through role-play, fun building activities and idea sharing. This LEGO® learning set also develops children’s confidence and essential social skills, such as collaboration, communication and understanding roles and responsibilities.\n\nReal-World Role-Play\nWorking in groups of 2-10, children use the colorful collection of 480 LEGO® DUPLO® bricks, figures, wheel bases, windows, doors and a building plate to build their home, a restaurant, bus stop, hospital and a fire station. They’ll also discover an airplane, car and even a submarine, and will use their imagination to build fantasy animals and make up fun stories of their own. My XL World also combines with the 45029 Animals and 45030 People accessory sets in the Early Learning system for even more playful learning fun for children.\n\nFull Teacher Support\nMy XL World includes everything that teachers need to deliver inspiring lessons, including a Getting Started card with 5 activity ideas and 10 double-sided building cards. There’s also an online Unit Plan with 8 standards-aligned lessons available at www.LEGOEducation/Start. We even offer a full-day professional development course (additional purchase required) to give teachers the best-possible start.\n\nA Holistic Approach to Learning\nLEGO Education Early Learning lays the foundation for children's learning and passion for lifelong development by stimulating their natural curiosity to explore together and learn through play. My XL World combines with other products in the Early Learning system to develop social, emotional and language skills, as well as free play and early science skills.\n\nDevelops children’s confidence and essential social skills, such as collaboration, communication, and understanding roles and responsibilities.\n480 LEGO® DUPLO® elements including a building plate, 8 figures, wheel bases, windows, doors and a collection of colorful bricks – everything needed to unleash children's imaginations.\nComes with a Getting Started card with 5 activity ideas, 10 double-sided building inspiration cards with 20 models to build, and an online teacher's guide with 8 standards-aligned lessons to help deliver inspiring lessons.\nOptional full-day professional development course available (at additional cost) to give teachers the best-possible start.\nCombines with other LEGO® Education sets – such as 45029 Animals and 45030 People accessory sets – to extend the learning fun.\nPart of the LEGO® Education Early Learning system of holistic learning for preschoolers.\nIncludes enough bricks for 10 sets of LEGO® ‘six bricks' learning activities.\n\nIf you are an educator buying these products for schools or to deliver other accredited learning, please click on the link below for more information on how to source and use these solutions to deliver learning outcomes tailored to your local education requirements, such as options on classroom packs, professional development offerings and advice on classroom solutions. https://education.lego.com/shop/find-distributor\n\n \n\nAre you a home user, looking for a way to provide home learning activities for children of all ages? Whether they’re in the classroom or the living room children have big imaginations, innate curiosity, and a desire to explore and take risks. All you need are the resources to tap into them. LEGO Education wants to help. Hands-on learning provides a medium for building ideas and models while practicing important skills such as communication, collaboration, critical thinking and creativity.\n\nFor more than 40 years, LEGO Education has been developing educational solutions based on a well-established educational theory that children learn best and remember more through hands-on experiences. Our products aren’t toys - instead home use of LEGO Education Learning Resources is intended to be a highly rewarding education experience that supplements locally applicable curriculum needs.\n\nLEGO Education offers pre and post-sale support to ensure LEGO Education resources are used as effectively as possible in a learning environment. Contact our Customer Services team."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/coding-express-45025","description":"\nCoding Express is a creative, intuitive and versatile solution that introduces preschoolers to early coding concepts that naturally sparks their curiosity, creativity and desire to explore and learn together. Based on the ever popular train theme, the highly versatile LEGO DUPLO solution allows children to make connections and intuitively explore early coding concepts, such as sequencing, looping and conditional coding, while developing problem-solving skills , critical thinking, collaboration, and social and emotional skills.\n\n\nThe child led free optional app provides four areas for preschoolers to explore: Journeys, Characters, Music and Math. The different themed activities change the way the action bricks behave, altering the effect on the train. The activities are open ended and preschoolers will practice a variety of skills relevant for early childhood development.\n\nJourneys: Tags as destinations – sequencing events and language\nCharacters: Tags as emotional reactions – action/reaction and social and emotional development\nMusic: Tags as melodies/instruments – exploring, sequencing and looping sound\nMath: Assigning values for movement – exploring action/re-action\n\n\nThe LEGO Education Coding Express makes it intuitive and fun for preschool children to learn early coding concepts and critical 21st century skills through playful, hands-on learning with LEGO DUPLO bricks.\n\n\nKey learning objectives to develop early coding and critical 21st century skills\n\n\nEarly coding skills\nSequencing\nLooping\nConditional coding\nLanguage and literacy\nCollaboration\nProblem solving\nExpress ideas with digital elements\nFeatures 234 LEGO® DUPLO® bricks\nKey features include Push & Go train with lights and sounds, motor, color sensor that interacts with 5 colored action bricks, and 2 railroad switches\nEasy in-the-box getting started materials include: Getting Started activities, introduction guide, large poster, and 6 building inspiration cards to build 12 unique models\nTeacher Guide includes 8 online lessons: 4 lessons use the physical set and 4 lessons use the digital app\n8 short online video tutorials\nFree optional app for iOS and Android app included\nApp includes 4 themed activities; Journeys, Characters, Music and Math, that allow preschoolers to collaborate and interact with the physical toy train through a digital medium\nFace-to-face training is available for in-depth understanding of how to successfully implement the Coding Express teaching solution into your teaching\n\nIf you are an educator buying these products for schools or to deliver other accredited learning, please click on the link below for more information on how to source and use these solutions to deliver learning outcomes tailored to your local education requirements, such as options on classroom packs, professional development offerings and advice on classroom solutions. https://education.lego.com/shop/find-distributor\n\n \n\nAre you a home user, looking for a way to provide home learning activities for children of all ages? Whether they’re in the classroom or the living room children have big imaginations, innate curiosity, and a desire to explore and take risks. All you need are the resources to tap into them. LEGO Education wants to help. Hands-on learning provides a medium for building ideas and models while practicing important skills such as communication, collaboration, critical thinking and creativity.\n\nFor more than 40 years, LEGO Education has been developing educational solutions based on a well-established educational theory that children learn best and remember more through hands-on experiences. Our products aren’t toys - instead home use of LEGO Education Learning Resources is intended to be a highly rewarding education experience that supplements locally applicable curriculum needs.\n\nLEGO Education offers pre and post-sale support to ensure LEGO Education resources are used as effectively as possible in a learning environment. Contact our Customer Services team."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/tech-machines-45002","description":"Transform your children into expert builders! With the Tech Machines set in your classroom, you'll help children develop their fine motor and problem solving skills while simultaneously unleashing their creativity as they construct classic machines.\nLearning Values:\nProblem solving\nCreativity\nFine motor skills USPs:\nIntroduces young minds to basic engineering concepts\nIncludes 4 screwdrivers with integrated screws for joining special bricks together\nIncludes 2 inspirational building cards with building instructions for 2 pieces of construction equipment\nIncludes an activity booklet with quick ideas\n\nIf you are an educator buying these products for schools or to deliver other accredited learning, please click on the link below for more information on how to source and use these solutions to deliver learning outcomes tailored to your local education requirements, such as options on classroom packs, professional development offerings and advice on classroom solutions. https://education.lego.com/shop/find-distributor\n\n \n\nAre you a home user, looking for a way to provide home learning activities for children of all ages? Whether they’re in the classroom or the living room children have big imaginations, innate curiosity, and a desire to explore and take risks. All you need are the resources to tap into them. LEGO Education wants to help. Hands-on learning provides a medium for building ideas and models while practicing important skills such as communication, collaboration, critical thinking and creativity.\n\nFor more than 40 years, LEGO Education has been developing educational solutions based on a well-established educational theory that children learn best and remember more through hands-on experiences. Our products aren’t toys - instead home use of LEGO Education Learning Resources is intended to be a highly rewarding education experience that supplements locally applicable curriculum needs.\n\nLEGO Education offers pre and post-sale support to ensure LEGO Education resources are used as effectively as possible in a learning environment. Contact our Customer Services team."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/tubes-45026","description":"LEGO® Education Tubes lets children explore a world of fantasy animals and other creative builds – made from Tubes! Using a colorful collection of unique tube elements, LEGO® DUPLO® bricks, balls, doors and baskets, and 6 building inspiration cards, kids can create an egg-laying hen, dragon, little pooping larva and more. Tubes develops children's 21st century skills, such as problem-solving, collaboration and fine motor skills, while introducing them to cause and effect, symmetry and 3D shape recognition. This fun Early Learning set for preschoolers also includes a Getting Started card containing 5 simple ideas to inspire playful learning with Tubes in the classroom.\n150 LEGO® DUPLO® elements, including colorful tubes, bricks, 6 balls, doors and baskets, for unlimited playful learning and creative fun for preschoolers.\nComes with 6 building inspiration cards to create fun buildable animals and a Getting Started card for teachers with 5 activity ideas for a great start to fun classroom activities.\nDevelops essential 21st century skills such as problem-solving, collaboration and fine motor skills, and introduces cause and effect, symmetry and 3D shaperecognition.\nCreate funny and playful creatures that are easy to build.\nPart of the LEGO® Education Early Learning system of holistic learning for preschoolers. If you are an educator buying these products for schools or to deliver other accredited learning, please click on the link below for more information on how to source and use these solutions to deliver learning outcomes tailored to your local education requirements, such as options on classroom packs, professional development offerings and advice on classroom solutions. https://education.lego.com/en-gb/shop/find-distributor Are you a home user, looking for a way to provide home learning activities for children of all ages? Whether they’re in the classroom or the living room children have big imaginations, innate curiosity, and a desire to explore and take risks. All you need are the resources to tap into them. LEGO Education wants to help. Hands-on learning provides a medium for building ideas and models whilepracticing important skills such as communication, collaboration, critical thinking and creativity. For more than 40 years, LEGO Education has been developing educational solutions based on a well-established educational theory that children learn best and remember more through hands-on experiences. Our products aren't toys - instead home use of LEGO Education Learning Resources is intended to be a highly rewarding education experience that supplements locally applicable curriculum needs. LEGO Education offers pre and post-sale support to ensure LEGO Education resources are used as effectively as possible in a learning environment. Contact our Customer Services team."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/tower-crane-construction-10933","description":"The LEGO® DUPLO® Construction Tower Crane & Construction (10933) preschool playset is filled with vehicles, activities and characters to inspire role-play and develop skills.\n\nA busy building site toy full of play possibilities\nThere’s a full day of activities for little construction workers to explore at the bustling building site. With a big bulldozer, mini bulldozer, dump truck, digger and crane toys, toddlers and parents can work together to deliver supplies, build a tower and clear rubble off the street. And when it’s time for lunch, there’s an on-site hotdog stand to visit!\n\nDiverse and feature-packed set\nWith 5 contemporary characters – a female painter and crane driver, 2 male construction workers and a hotdog guy – plus lots of cool features, such as light and sound bricks and the bulldozer's push-and-go friction motor, the set engages, entertains and inspires young imaginations. To expand the play benefits even further, combine it with other LEGO DUPLO Construction sets.\n\nThe LEGO® DUPLO® Construction Tower Crane & Construction (10933) playset is a busy building site packed with amazing vehicles, awesome activities and a diverse range of characters to inspire role-play and develop skills.\nIncludes 5 contemporary figures and 4 vehicles – a big bulldozer, mini bulldozer, dump truck, digger and a crane – incorporating cool features, such as a Push & Go friction motor, sounds, lights and a working winch.\nLights and sound brings the busy site to life as kids lift the toilet building into position with the crane, deliver supplies and clear rubble off the street. And when it’s time for a break, check out the hotdog stand!\nIf you’re looking for the best gift for a toddler’s growing needs, this feature-packed building-site toy has everything a little construction worker aged 2 and up would want from a hands-on, functional digger set.\nThe main building with the crane attached measures over 15” (40cm) high, 7” (20cm) wide and 9” (25cm) deep, inspiring imaginative play on an epic scale with pieces that are perfect for little hands to pick up and place.\nThe play is powered by kids’ imaginations; the lights and sounds are powered by 3 LR41 (button cell) and 3 LR44 (button cell) – all of which are included in the set.\nClear, simple instructions are included to ensure parents and youngsters can build, play and get maximum enjoyment from every feature in this versatile playset as soon as they open the box.\nLEGO® DUPLO® open-ended playsets are designed to entertain, stimulate and inspire the minds of preschoolers with familiar scenes, fun characters and toddler-friendly pieces.\nLEGO® DUPLO® building sets are easy for little fingers to pick up, place and pull apart because they meet the very highest industry standards – and it's been that way since 1969.\nThe LEGO Group drops, heats, crushes, twists and analyzes the bricks and pieces that make up LEGO® DUPLO® playsets to be sure every little builder's toy meets the highest global safety standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/cargo-train-10875","description":"The LEGO® DUPLO® Cargo Train is now even easier for your toddler to control and interact with in multiple ways. Young children can become the train driver with the Push & Go motor — a gentle push either forwards or backwards sends the train on its way and a firm hold or lift off the tracks will make it stop. Help them place the 5 colored action bricks along the track to sound the horn, turn the lights on and off, pause and refuel, change direction and stop the train wherever they like. With a harbor, boat, café, loading station, 2 cranes, 3 DUPLO figures plus an animal figure and lots of cool track pieces included in this LEGO DUPLO set, preschoolers can enjoy classic, fun train play. Download the optional app to unlock even more play possibilities, including remote-control function and fun activities to complete with your toddler!\n\nIncludes cargo train driver, captain, and shopkeeper LEGO® DUPLO® figures, plus a seagull figure.\nFeatures a buildable Push & Go locomotive with lights and sounds, 2 cargo trucks with tipping function, 5 color-coded action bricks, harbor area with small crane and boat, large crane, café, loading/unloading station and 24 pieces of track including switches, hills, a crossing and stops.\nAccessory elements include a gas pump, coffee machine, cup, chocolate bar, milk bottle, fishing net, bread, bananas, parcel, cash register, wrench, fish and a menu.\nAny toddler can start the train with a gentle push forwards or backwards, and stop it by placing their hand firmly on top of the engine.\nShow your child how to place the 5 colored action bricks and move them around the track to make the train sound the horn, turn on the lights, refuel, change direction or stop.\nHelp your child load and unload the tipping cargo containers using the moving crane.\nPush the train to send it towards the harbor and collect the fish from the boat.\nEnjoy shop role-play with your child as the train driver stops for lunch at the café.\nExtend the play possibilities by downloading the free app with remote-control function and fun activities for young children to complete.\nThe train and tracks included in this set are compatible with your child's existing LEGO® DUPLO® train collection.\nTry floating the little boat in the bath! WARNING: The locomotive and batteries must NOT be placed in or used near water.\nDownload the optional app at the App Store, Google Play Store or Amazon Kindle Store. Learn more at LEGO.com/devicecheck.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nThis product requires batteries (not included). Please refer to the product packaging for type and quantity.\nCombine with the 10872 Train Bridge and Tracks, 10874 Steam Train and 10882 Train Tracks for even more track combinations and LEGO® DUPLO® train fun.\nCargo Train with cargo trucks measures over 3” (10cm) high, 18” (47cm) long and 3” (8cm) wide.\nStation measures over 7” (18cm) high, 5” (15cm) wide and 5” (13cm) deep.\nLarge crane measures over 13” (35cm) high, 6” (16cm) wide and 6” (16cm) deep.\nBoat measures over 6” (17cm) high, 7” (19cm) long and 5” (13cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/happy-childhood-moments-10943","description":"LEGO® DUPLO® Town Happy Childhood Moments (10943) introduces preschoolers to 2 exciting events – Chinese New Year celebrations and the first day at kindergarten. With 2 alternative building designs, this educational toy provides toddlers with endless playful learning opportunities.\n\nPlay that prepares children and reassures parents\nParents and children can share precious developmental moments as they explore the set's 2 alternative arrangements. Kids play out Chinese New Year family traditions – including exchanging their red envelopes and eating dumplings – and practice and prepare for the daily routines of kindergarten. As they role-play these real-life events, kids acquire essential knowledge, build fine motor abilities, improve social skills and develop emotional intelligence – which will benefit them when they experience these events in real life.\n\nHands-on educational toys for toddlers\nLEGO DUPLO playsets put open-ended fun, self-expression and joyful learning into preschoolers' hands.\n\nLEGO® DUPLO® Town Happy Childhood Moments (10943) is a premium, 2-in-1 playset which teaches preschoolers about 2 big family events: Chinese New Year celebrations and the first day at kindergarten.\nThe playset is packed with high-quality features, including opening doors and windows, textiles for the beds, opening drawers, a dim sum table to rotate and a slide for figures to ride down.\nAs kids role-play Chinese New Year family traditions and the daily routines of kindergarten, they develop skills that will benefit them when they experience the events in real life.\nFor ages 2 and up. A stand-out, feature-packed gift that lets preschoolers play out and learn about the fun details of the big occasions in their life.\nThe Chinese New Year playset measures over 11 in. (28 cm) high, 17 in. (44 cm) wide and 17 in. (44 cm) deep; and the kindergarten over 8 in. (21 cm) high, 17 in. (44 cm) wide and 15 in. (40 cm) deep.\nThere's so much for kids to learn as they play: numbers, letters, time, daily habits, food preparation, bedtime routines, potty training… as well as the importance of family and friends.\nParents and grandparents will enjoy this playset almost as much as the children, as they enact family reunions, role-play cherished traditions and soothe any anxiety about starting kindergarten.\nIntroduce preschoolers to familiar scenarios, fun characters and playful learning with LEGO® DUPLO® Town playsets. These toys are expertly designed to develop young minds through open-ended play.\nLEGO® DUPLO® components meet rigorous industry quality standards to ensure they are easy for little fingers to pick up, place and pull apart – and it’s been that way since 1969.\nLEGO® DUPLO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they fulfil stringent child safety standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/world-animals-10907","description":"Introduce your toddler to a world of animals and environments with the LEGO® DUPLO® 10907 World Animals playset! Take a safari across the African savannah and pretend to photograph lions and giraffes, spot cute woodland creatures as you canoe along a woodland river, build a sandcastle on a tropical beach, go whale watching at the south pole… With a captivating range of toy animals, buildings, vehicles, characters and accessories, this globe-spanning educational toy for toddlers contains endless opportunities to engage and inspire any preschooler.\n\nIncludes 6 LEGO® DUPLO® figures: a traveler, pilot, surfer dad and child, and a canoer dad and child.\nAlso includes 15 DUPLO® toy animal figures: an adult and baby giraffe, adult and baby lion, adult and baby panda, adult and baby deer, adult and baby whale, penguin, toucan, fish, rabbit and a squirrel.\nThis toddlers' adventure toy features a surf van, airplane and canoe, plus 5 buildable environments representing 4 unique and distinctive worlds: a forest, a savannah, a tropical beach and Antarctica.\nAccessory elements include a surfboard, camera, travel case, spade and drinking mug.\nSavannah measures over 6” (17cm) high, 8” (22cm) wide and 2” (6cm) deep.\nTemple measures over 7” (20cm) high, 10” (27cm) wide and 3” (9cm) deep.\nCar measures over 3” (9cm) high, 5” (14cm) long and 2” (6cm) wide.\nAirplane measures over 4” (11cm) high, 7” (18cm) long and 7” (19cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/big-fair-10840","description":"Play out weekend family fun with modern LEGO® DUPLO® figures in the bright and colorful Big Fair. Toddlers will love to building the Ferris wheel and turning it to watch the cars go round, rotating the carousel with gearwheel function and 4 horses to ride on, and playing with the big wavy slides again and again. They can also drive the little train and visit the ice cream kiosk, detach the giant ice cream and give it to mom or dad! Includes 5 DUPLO figures.\n\nIncludes 5 LEGO® DUPLO® figures: 2 adults and 3 children.\nFeatures a Ferris wheel with 3 cars and turning function, rotating carousel with 4 horse figures and gearwheel function, stand with 2 wavy slides, train with carriage, ice cream kiosk with table and chairs, and a restroom block with toilet and sink.\nIncludes bricks decorated as ice creams, orange juice, measuring chart, toilet paper and soap bottles.\nAccessory elements include a camera, balloons, whipped cream and a cup.\nHelp your child use the turning functions to spin the Ferris wheel and carousel.\nToddlers will enjoy sliding the LEGO® DUPLO® figures down the wavy slide or pushing them along in the train.\nUse the modern characters, accessories and decorated bricks to play out family fun in a fun fair environment.\nLEGO® DUPLO® products are specially designed to be safe and suitable for small hands.\nThis set offers an age-appropriate build and play experience for ages 2-5.\nFerris wheel measures over 14” (38cm) high, 7” (19cm) wide and 6” (16cm) deep.\nCarousel measures over 7” (20cm) high, 7” (21cm) wide and 8” (19cm) deep.\nIce cream kiosk measures over 9” (24cm) high, 4” (12cm) wide and 3” (7cm) deep.\nTrain measures over 3” (9cm) high, 9” (24cm) long and 3” (6cm) wide.\nCombine with the 10839 Shooting Gallery to extend the fair environment.\nThere are several My Town products to collect and play out family fun in a recognizable LEGO® DUPLO® world."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/creative-animals-10934","description":"All kids love animals, right? And with these 9 adorable animals from around the world, they can build and play while developing key creative, imaginative and practical skills. Toddlers’ first animal playset Youngsters relate to the recognizable animal friends, so when they build and play, it benefits their emotional development as well as their fine motor skills. As they rearrange the figures and accessories, they role-play stories, expand their imagination and develop their visual-spatial awareness. Little animal lovers will have endless imaginative fun with these adorable friends. And parents and carers can share precious developmental milestones as they join in the fun. Educational building toys for toddlers LEGO® DUPLO® sets bring familiar scenes to life with colorful, easy-to-handle, safe pieces that excite toddlers' imaginations and put creative control right into preschoolers' hands.\nAs kids build and play with the adorable animal figures in their different habitats, they develop key creative, imaginative and practical skills that will last a lifetime.\nThis 175-piece set contains colorful bricks and pieces that build into a monkey, tiger, toucan, panda, elephant, giraffe, crocodile, penguin and whale, plus 3 awesome environments: Arctic, jungle and savannah.\nIt's easy for little hands to pick up and place these toddler-friendly pieces. With 9 animals and 3 habitats to build, there’s enjoy endless imaginative fun to enjoy (but look out for the crocodile’s opening mouth!).\nLittle animal lovers will go wild for these 9 animal friends. With safe, easy-to-handle pieces, this versatile educational toy makes a great Christmas, birthday or any-other-day gift for toddlers aged 18 months and up.\nWith the penguin measuring over 3” (8cm) high and the palm tree over 5” (13cm) high, this animal-figure playset provides hands-on play on a generous scale. Combine with other LEGO® DUPLO® sets for even more fun.\nThe hands-on play can begin straightaway. No batteries needed – all the open-ended imaginative fun is fueled by kids’ unlimited imaginations!\nSimple instructions provide ideas and inspiration for parents and toddlers. Once the creative building and imaginative role-play begins, the shared pleasure and developmental benefits will never end.\nIntroduce preschoolers to stimulating, open-ended play with LEGO® DUPLO® playsets. Toddler-friendly bricks with familiar scenes, animals and objects combine to make great gifts for kids with curious minds.\nLEGO® DUPLO® toddler playsets meet the highest industry standards and our meticulous quality testing. This ensures bricks are easy for little hands to pick up, place and pull apart – and it's been that way since 1969.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® DUPLO® bricks and pieces to make sure every kids' DUPLO playset meets the highest global safety and quality standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/modular-playhouse-10929","description":"All kids love playing house and pretending to be mom and dad. And, with this easy-to-build, open and accessible dollhouse, you can join in the fun too! Big family dollhouse playset This colorful, contemporary dollhouse for toddlers provides many opportunities to play and learn. Teach toddlers about everyday life, such as cooking, mealtime and bedtime routines as you both share imaginative role-play fun. There's mom, dad and child figures, plus a pet dog and a teddy bear – all designed to inspire a comforting emotional attachment in toddlers. Filled with familiar details and infinite fun, you’ll share endless precious developmental moments as you explore play possibilities together. For even more fun, you can rebuild the same pieces as a tower house, and then again as a residential house! Great educational toy for toddlers With recognizable characters and familiar scenes, LEGO® DUPLO® learning toys give kids hands-on, open-ended, role-play fun with endless developmental benefits.\nWith this easy-to-assemble, open and accessible, 3-in-1 dollhouse playset, toddlers develop their fine motor, social and emotional skills as they build, play, redesign and play again.\nThis versatile playhouse has a kitchen, living room, bathroom and a bedroom. It's packed with realistic details, such as an opening fridge. Includes mom, dad, child, dog and teddy bear figures, plus many fun accessories.\nTeach toddlers about everyday life, such as cooking, mealtime and bedtime routines. Rebuild as a tower house, and then again as a residential house! Share magical role-play fun as you explore play possibilities together.\nKids will love playing out imaginative stories with this 3-in-1 playhouse. This great gift for toddlers aged 2 and over provides so much for them to explore, discover and learn.\nThe main playhouse measures over 14” (36cm) high, 15” (39cm) wide and 3” (10cm) deep. To expand the play possibilities even further, integrate this versatile playset with other LEGO® DUPLO® playsets.\nPowered by kids’ imaginations! Hands-on, battery-free toys boost kids’ creative, imaginative and practical skills, and it gives them the satisfaction of making fun things happen ‘by myself’.\nOpen this 3-in-1 dollhouse’s box and the building, playing and learning begins immediately. Simple instructions for parents and toddlers provide ideas and inspiration for instant enjoyment.\nIntroduce preschoolers to learning with open-ended creative play that inspires young minds.With familiar scenes, fun characters and easy-to-handle pieces, LEGO® DUPLO® playsets are ideal developmental toys for toddlers.\nLEGO® DUPLO® playsets meet the highest industry standards, which ensures they are easy for little fingers to pick up, place and pull apart – it's been that way since 1969.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® DUPLO® bricks and pieces to make sure every building set meets the highest global safety and quality standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/steam-train-10874","description":"The LEGO® DUPLO® 10874 Steam Train is now even easier for your toddler to control and interact with in multiple ways. Young children can become the train driver with the Push & Go motor — a gentle push either forwards or backwards sends the train on its way and a firm hold or lift off the tracks will make it stop. Help them place the 5 colored action bricks along the track to sound the horn, turn the lights on and off, pause and refuel, change direction and stop the train wherever they like. With a train station, coal tipper, 2 DUPLO figures plus an animal figure and a simple toy train track included in this LEGO DUPLO set, preschoolers can enjoy classic, fun train play. Download the optional app to unlock even more play possibilities, including remote-control function and fun activities to complete with your toddler!\n\nIncludes train driver and child LEGO® DUPLO® figures, plus a squirrel figure.\nFeatures a buildable Push & Go locomotive with lights and sounds, passenger carriage, 5 color-coded action bricks, train station, coal tipper, tree and 16 pieces of track.\nAccessory elements include a refueling can, suitcase, bread and a spade.\nAny toddler can start the steam train with a gentle push forwards or backwards, and stop it by placing their hand firmly on top of the engine.\nShow your child how to place and move the 5 colored action bricks around the track so the train follows their instructions to sound the horn, turn on the lights, refuel, change direction or stop.\nDevelop imagination and early role-play skills using the LEGO® DUPLO® figures to create endless journeys and adventures.\nExtend the play possibilities of this LEGO® DUPLO® set by downloading the free app with remote-control function and fun activities for young children to complete.\nThe train and tracks included in this set are compatible with your child’s existing LEGO® DUPLO® train collection.\nDownload the optional app at the App Store, Google Play Store or Amazon Kindle Store. Learn more at LEGO.com/devicecheck.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nThis product requires batteries (not included). Please refer to the product packaging for type and quantity.\nCombine with the 10872 Train Bridge and Tracks, 10875 Cargo Train and 10882 Train Tracks for even more track combinations and LEGO® DUPLO® train fun.\nSteam train with passenger car measures over 3” (10cm) high, 11” (30cm) long and 2” (7cm) wide.\nStation measures over 5” (15cm) high, 4” (12cm) wide and 2” (6cm) deep."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/tropical-island-10906","description":"Encourage your toddler’s emotional development and fine motor skills with LEGO® DUPLO® Town 10906 Tropical Island, with imaginative play exploring a world of wild animals, fun features and jungle adventure! There’s a pulley system to lift supplies up to the family tree house, a turning bridge to move into position and a vine for the monkey toy to swing on. With a host of colorful LEGO DUPLO animal toys joining a caretaker, a traveler and his son, this large and varied educational toddler toy provides endless opportunities for your preschooler to play, learn and express themselves.\n\nA LEGO® DUPLO® animal set with 3 DUPLO figures: a caretaker, a traveler and a child, plus 6 animal figures: an adult and baby elephant, adult and baby tiger, monkey and a toucan.\nThis fun educational toy for toddlers features a jungle tree house with pulley system, caretaker's building, and a turning bridge.\nAccessory elements include a camera, bunch of bananas, pineapple and a variety of jungle vegetation.\nTree-house measures over 10” (27cm) high, 10” (26cm) wide and 4” (12cm) deep.\nCaretaker’s building measures over 7” (19cm) high, 5” (13cm) wide and 3” (10cm) deep."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/deluxe-brick-box-10914","description":"Inspire endless creative play and countless developmental benefits with the diverse and versatile LEGO® DUPLO® Deluxe Brick Box – colorful bricks and special pieces designed to excite, enthuse and engage young minds. Preschool LEGO building toy – with its own storage box! Inside the sturdy toy box, you'll find inspiration and ideas to engage and excite young minds. There's a window, 1-2-3 number bricks and, of course, an amazing assortment of LEGO bricks in a rainbow of cool colors. As parents and carers join in connecting the bricks and pieces to make imaginative models, they share precious developmental milestones with their little builders. Educational building toys for toddlers LEGO DUPLO playsets make great gifts for toddlers. With colorful, easy-to-hold pieces that excite imaginations and encourage open-ended play, they put creative control right into the hands of preschool kids.\nMotivate young minds with this toddler-friendly assortment of LEGO® DUPLO® bricks and pieces. With endless hands-on creative possibilities, the developmental benefits are enormous.\nFuel imaginations with 85 colorful bricks including fun pieces, such as a window and 1-2-3 number bricks. With such a versatile toy, kids will never stop playing and learning.\nWith a modern design for the buildings, people and objects, it's easy for parents and carers to share toddlers' precious developmentalmilestones as they work together to build, create and imagine.\nWith colorful bricks and pieces that are easy for small hands to pick up and place, this educational toy for toddlers makes a great Christmas, birthday or any-other-day gift for toddlers aged 18 months and up.\nThe colorful assortment of bricks, pieces, number and people are conveniently stored in a yellow storage box with a LEGO® DUPLO® style 8-stud lid. Combine the contents with other DUPLO sets for even more fun.\nNo batteries needed. The hands-on play can begin right away. Kids’ non-stop creative fun is fueled purely by their ever-expanding imaginations!\nA simple guide provides parents and toddlers with ideas and inspiration to get them building. And once it starts, the creative construction, imaginative role-play and developmental benefits will never stop.\nLEGO® DUPLO® playsets make great gifts for preschoolers. They are carefully designed to be perfect in every way for budding builders, providing endlessstimulating, open-ended play for curious young minds.\nLEGO® DUPLO® building toys meet the highest industry standards plus our own rigorous quality criteria to ensure bricks are easy for little hands to pick up, place and pull apart – and it’s been that way since 1969!\nLEGO® DUPLO® bricks and pieces are dropped, heated, bitten and tested in every way imaginable, so you can be certain that your DUPLO building toy meets the highest global safety and quality standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/fire-station-10903","description":"Play out real-life scenarios in LEGO® DUPLO® Town: a recognizable world with modern DUPLO figures. Visit the easy-to-build 10903 Fire Station and enjoy pretend play, helping the firefighters as they practice putting out the campfire and climbing the ladder to rescue the station dog in the tower. When the call comes in, help your toddler jump the firefighters into the fire truck, turn on the flashing light and siren, and head off on another daring rescue! Includes 2 DUPLO figures plus a dog figure.\n\nIncludes 2 LEGO® DUPLO® firefighter figures plus a dog figure.\nFeatures an easy-to-build fire station toy with tower and a fire truck toy for toddlers with lights and siren sound.\nAccessory elements include a ladder, hose, fire extinguisher, axe and a campfire.\nPress the button on the kids' fire truck toy to activate the siren and lights.\nJoin in with firefighter training at the station, then rush to the rescue in the red fire truck toy!\nUse the modern characters, accessories and decorated bricks to have fun while helping your toddler learn about everything firefighters do for us.\nHelp your child develop fine motor skills as they build this toy fire station playset.\nThis firefighter toy for kids makes an ideal gift for preschool children.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nThere are lots of LEGO® DUPLO® Town products to collect and play out your child's everyday life in a recognizable DUPLO world.\nCombine with the 10901 Fire Truck for even more firefighter-themed fun.\nFire station measures over 10” (26cm) high, 9” (25cm) wide and 4” (12cm) deep.\nFire truck measures over 3” (10cm) high, 5” (14cm) long and 2” (7cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/frozen-ice-castle-10899","description":"Join Disney’s Anna, Elsa and Olaf at the LEGO® DUPLO® l Disney 10899 Frozen Ice Castle to share imaginative play and precious developmental milestones with your preschooler. As toddlers role-play with their favorite Disney Frozen characters, they improve their language and fine motor skills, and develop social and emotional awareness. Talk about Elsa's relationship with her sister Anna. Enjoy open-ended creative fun with Olaf the snowman. With a multicolored light brick feature illuminating the castle at the push of a button, you and your little one will have endless enjoyment recreating scenes from Disney’s Frozen movie and dreaming up stories of your own with this sparkling Ice Castle toddler toy building set.\n\nIncludes 3 LEGO® DUPLO® figures: Anna, Elsa and Olaf.\nThis Disney Frozen castle toy features a slide, table, chairs and kitchen equipment. A special button-operated light brick provides multicolored illumination for the castle.\nHelp your child master basic construction skills and improve their fine motor abilities as the building bricks are assembled and re-positioned for endless imaginative play.\nThis buildable toys for toddlers is designed to encourage role-play and storytelling to help your child develop language, social and emotional skills.\nThe Disney Frozen Ice Castle measures over 11” (28cm) high, 7” (19cm) wide and 6” (16cm) deep."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/creative-fun-10887","description":"Young children will love to build a rainbow of colorful models with the LEGO® DUPLO® 10887 Creative Fun building set, developing fine motor and cognitive skills as they go. With 120 classic DUPLO building bricks in bright colors, this set is the perfect preschool toy to inspire creativity for kids, allowing you to connect with them through free-building fun. This great building set includes ideas for easy-to-build toy parrots, a castle, balloons, an apple and a boat—after that the sky's the limit! DUPLO bricks are specially designed to be fun and safe for small hands.\n\nFeatures 120 brightly colored LEGO® DUPLO® bricks for creative building fun.\nIncludes a child LEGO® DUPLO® figure and a selection of decorated bricks as story starters.\nHelp your child explore creativity and master basic construction skills with open-ended building fun.\nUse the building ideas to create 2 toy parrots (big and small), a boat, balloons, apple or a big castle.\nA great construction toy to build anything a child can imagine, from buildings and vehicles to animal toys.\nToddlers will love learning through play, developing language and social skills and creating pretend play stories with their models.\nThis preschool learning toy makes an ideal gift for toddlers, or a great supplement to their existing LEGO® DUPLO® collection.\nThe endless creative play possibilities of LEGO® DUPLO® toys set the stage for toddlers to become creative thinkers.\nLEGO® DUPLO® products are specially designed to be fun and easy for small hands."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/bakery-10928","description":"All kids love a trip to the bakery! And now preschoolers can enjoy endless pretend play at the LEGO® DUPLO® Bakery, with its colorful café and decorated delivery van. Educational toy bakery for toddlers This colorful, contemporary bakery serves up a tasty mix of imaginative play and developmental benefits for toddlers and parents to share! There's a mixing machine and oven for your little baker to get to work. There are café customers to serve with a choice of yummy-looking cakes. Then it'stime to make deliveries in the push-along delivery van. There’s so much to see, do and learn with this busy developmental toy, it’s one of the best ways to improve toddlers’ fine motor, social and emotional skills. Great pretend play gifts for toddlers With recognizable characters and familiar scenes, LEGO DUPLO learning toys give kids hands-on, open-ended, role-play fun with endless developmental benefits.\nToddlers develop fine motor, social and emotional skills as they build, play, redesign and play again with this busy bakery playset. Kids cook and serve food in the toy café, then drive the van to deliver cupcakes!\nBoys and girls will love playing out imaginative stories with this LEGO® DUPLO® Bakery with café and delivery van. With this great gift for toddlers aged 2 and over, pretend play is served all day!\nThe main building measures over 5” (15cm) high, 7” (19cm) wide and 4” (11cm) deep. Integrate this adaptable playset with other LEGO® DUPLO® sets to expand kids’ pretend play and learning possibilities even further.\nThis educational food-based toy for toddlers is entirely battery-free. It is powered solely by kids’ imaginations! LEGO® DUPLO® battery-free, hands-on toys kickstart young kids' creative, imaginative and practical learning.\nThe foody fun starts straight from the box. Simple instructions provide ideas and inspiration to help parents and toddlers get the best play experience and developmental benefits from this versatile toy.\nIntroduce preschoolers to learning with open-ended creative play that inspires young minds. With familiar scenes, fun characters and easy-to-handle pieces, LEGO® DUPLO® playsets are ideal first building toys for toddlers.\nLEGO® DUPLO® playsets meet the highest industry standards, which ensures they are easy for little fingers to pick up, place and pull apart – it's been that way since 1969.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® DUPLO® bricks and pieces to make sure every building set meets the highest global safety and quality standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/ariel-s-undersea-castle-10922","description":"LEGO® DUPLO® │ Disney Ariel's Undersea Castle (10922) entertains and stimulates young minds, developing social and emotional skills with a mermaid’s playground full of fun features and role-play stories.\n\nDevelopmental play with Disney’s The Little Mermaid\nFeaturing popular kids' movie characters Ariel and Flounder, this versatile toy is designed to encourage imaginative role play and inspire developmental progress. Turning Ariel and Flounder around on the carousel helps to build toddlers' fine motor skills. There’s also a slide to play on, a xylophone to make pretend music with, and a sunken treasure chest to open.\n\nCharacters kids love in settings they’ll adore\nWith familiar figures, favorite locations and lots of fun features, LEGO® DUPLO® │ Disney building toys provide preschoolers with the perfect introduction to playful learning – and provide parents and caregivers with a chance to share precious developmental milestones with their little Disney fan.\n\nTake toddlers to an undersea world of fun features and role-play adventures with Ariel and Flounder from Disney’s The Little Mermaid movie. Designed to stimulate and inspire the minds of mermaids and humans alike!\nMuch-loved kids’ movie characters Ariel and Flounder will encourage toddlers' emotional development; and the playground is packed with cool features and accessories to inspire role-play stories.\nKids develop their fine motor skills and creative thinking as they turn Ariel and Flounder around on the carousel, play on the slide, make pretend music on the xylophone and unlock the sunken treasure chest!\nThis versatile preschooler playset contains elements that are easy for small hands to pick up and place. A great Christmas, birthday or any-day-of-the-year gift for boys and girls aged 2 and up.\nLEGO® DUPLO® │ Disney Ariel's Undersea Castle (10922) measures over 11” (28cm) high, 7” (20cm) wide and 5” (13cm) deep and combines easily with other DUPLO playsets for evenmore imaginative play possibilities.\nNo batteries needed. Battery-free, hands-on play stimulates, engages and entertains young children, unlocking countless developmental benefits as the fun is fueled purely by their own imaginations.\nParents and caregivers can use the simple instructions included to share the set-building fun with their toddler. Also, the different elements can be rearranged to create endless new play possibilities.\nLEGO® DUPLO® │ Disney playsets are designed to stimulate and inspire preschoolers using popular movie characters in familiar settings, while parents and caregivers share precious developmental milestones.\nLEGO® DUPLO® building sets meet the highest industry standards to ensure they are easy for little fingers to pick up, place and pull apart – and it's been that way since 1969.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® DUPLO® bricks and pieces to make sure every little builder's DUPLO playset meets the highest global safety and quality standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/batcave-10919","description":"When THE JOKER™ escapes from jail, your little super hero joins Batman™ and Robin™ as they try to capture him and put him back where he belongs. This means lots of fun-packed action, imaginative role play and a chance for toddlers to develop super-power skills!\n\nDevelopmental play with Batman and Robin\nLEGO® DUPLO® Batman Batcave™ (10919) features Batman, Robin and THE JOKER in a versatile playset designed to encourage creative play and stimulate developmental benefits. Infants build fine motor skills as they maneuver the Batmobile™ toy through the gate and open and close the jail door. Role-playing the interaction between the 3 characters encourages social and emotional development.\n\nIconic characters and endless, pretend-play action\nFeaturing favorite super heroes and Super-Villains, cool gadgets and amazing vehicles, LEGO DUPLO Batman starter sets provide toddlers with endless developmental play and give parents an opportunity to share precious moments with their little superhero.\n\nLEGO® DUPLO® Batman™ Batcave™ (10919) combines developmental learning with action-packed adventures in a super-fun playset designed to unleash your little super hero’s super powers!\nThe Batcave™ provides the setting for role-play adventures with THE JOKER™, Batman™ and Robin™. There's also a jail with an opening and closing gate, and a cool-looking Batmobile™ toy to inspire stories on the move.\nPreschoolers use their fine motor skills and problem-solving abilities to catch THE JOKER™ and return him to jail. But, with THE JOKER’s slime shooter and Batman’s high-speed Batmobile™, anything can happen!\nThis exciting infant toy uses elements designed to be easy for small hands to pick up and place. It’s an ideal LEGO® starter set for boys and girls aged 2 and up who enjoy mechanical toys.\nThe Batcave™ measures over 5” (14cm) high, 8” (22cm) wide and 3” (9cm) deep and the Batmobile™ toy is over 4” (12cm) long. To create even more play possibilities, the set combines easily with other LEGO® DUPLO® playsets.\nNo batteries needed. The hands-on fun starts right away, unlocking developmental benefits with play designed to stimulate young minds.\nThe simple instructions included make it easy for parents and caregivers to share the construction fun with their toddler.\nLEGO® DUPLO® Batman™ playsets use super heroes, Super-Villains, cool gadgets and amazing vehicles from the Batman movies to deliver developmental benefits to preschoolers and precious moments for parents to share.\nLEGO® DUPLO® building sets are easy for little fingers to pick up, place and pull apart because they meet the very highest industry standards – and it’s been that way since 1969.\nLEGO® DUPLO® bricks and pieces are stringently tested to make sure every little builder's DUPLO playset meets the highest safety and quality standards on the planet."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/brick-box-10913","description":"This fun-filled developmental toy is packed with bricks and pieces that encourage toddlers to explore hands-on creativity and imaginative play. Familiar objects stimulate young minds and colorful shapes invite free-building fun, making this LEGO® DUPLO® starter set the perfect way to inspire any young builder. Educational toy for toddlers! Inside the sturdy storage box, you'll find a car with moving wheels, a roof, window, flowers, bread, DUPLO people figures, 1,2,3 numbered bricks… along with an assortment of original bricks in a rainbow of inviting colors. As parents share the joy of combining the bricks and pieces into endless imaginative play possibilities, they experience first-hand their little builder’s precious developmental milestones. Great gifts for preschoolers! DUPLO playsets put open-ended play and self-expression into the hands of budding builders. With colorful, easy-to-hold pieces that excite toddlers' imaginations, they're safe, clean and easy to take wherever you go.\nAs they create and play with the toddler-friendly mix of LEGO® DUPLO® bricks and pieces, your little builder will develop creative thinking and problem-solving abilities, visual-spatial awareness and fine motor skills.\nIncludes 65 colorful bricks plus familiar pieces to stimulate toddlers' minds, including a car with moving wheels, a roof, window, flowers, bread, DUPLO® people figures and 1-2-3 number-learning bricks.\nAs parents and carers join in the fun of combining the bricks and pieces to create endless imaginative toys and play possibilities, they experience their little builder’s precious developmental milestones.\nWith safe, colorful, easy-to-handle bricks and pieces, this educational toy for toddlers makes a great Christmas, birthday or any-other-day gift for boys and girls aged 18 months and up.\nAll the captivating colors, shapes, objects, people and numbers are conveniently stored in an attractive LEGO® DUPLO® box. Combine them with other DUPLO sets for even more imaginative fun.\nThis building toy is powered by kids’ imaginations – no batteries needed! Hands-on, battery-free toys boost kids’ fine motor and problem-solving skills, and it puts creative control right in their hands.\nOpen the storage box and the imaginative play starts right away! A simple guide provides parents and toddlers with inspiration – and, once kids start building, the imaginative pay will never stop!\nLEGO® DUPLO® playsets make great gifts for preschoolers. They fuel kids' imaginations, encouraging open-ended play and delivering developmental benefits to toddlers.\nLEGO® DUPLO® starter sets meet the highest industry standards, ensuring they are easy for little hands to pick up, place and pull apart – and it’s been that way since 1969!\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® DUPLO® bricks and pieces to ensure every DUPLO building toy meets the highest global safety and quality standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/lightning-mcqueen-s-race-day-10924","description":"Turbocharge toddlers’ imaginations with the Lightning McQueen’s Race Day (10924) building toy. As kids explore role-play fun with Lightning McQueen and Mater from the popular Disney and Pixar Cars movies, they build key fine motor and emotional skills.\n\nBuild, play and learn\nFeaturing recognizable characters from the Disney and Pixar Cars movies, this 2-in-1 playset is designed to fuel kids' creative thinking and drive their developmental progress. Maneuvering the cars is a great way for small hands to develop fine motor skills. And when the race is over, it’s time to place the vehicles on the fixing table for some essential repairs.\n\nRole-play with much-loved characters\nWith familiar figures, cool settings and lots of fun features, LEGO® DUPLO® │ Disney and Pixar building toys inspire kids to engage and interact as they play, and give parents and caregivers the perfect opportunity to share precious developmental milestones with their little racing driver.\n\nThe race is on for fun with the LEGO® DUPLO® │ Disney and Pixar Cars Lightning McQueen’s Race Day playset (10924). It’s the perfect toy to turbocharge toddlers’ imaginations and accelerate developmental benefits.\nLighting McQueen and Mater, from the Disney and Pixar Cars movies, stimulate toddlers' emotional development. Familiar racetrack and repair workshop settings inspire endless imaginative role play.\nWhether driving Lightning McQueen to a Piston Cup victory, towing him with Mater's truck hook, or doing repairs in the toy workshop – kids develop fine motor skills as they role-play endless imaginative stories.\nThe pieces in this playset are designed to be easy for small hands to pick up, place, rearrange and use creatively. It makes a great Christmas, birthday or any-other-day gift for boys and girls aged 2 and up.\nLightning McQueen measures over 1” (4cm) high, 2” (6cm) long and 3” (10cm) wide. Mater measures over 5” (13cm) high, 4” (12cm) long and 4” (12cm) wide. The playset combines with other LEGO® DUPLO® sets for even more fun.\nNo batteries needed. The role-play fun is powered purely by kids’ imaginations. Battery-free, hands-on play is stimulating, engaging and entertaining – and it unlocks countless developmental benefits in young minds.\nSimple instructions make it quick, easy and fun for parents and caregivers to assemble the playset alongside their little builder. Also, rearranging the different elements creates continual new play possibilities.\nLEGO® DUPLO® │ Disney and Pixar playsets engage, entertain and inspire preschoolers with popular movie characters in stimulating settings, while parents and caregivers join in and share precious developmental milestones.\nLEGO® DUPLO® building sets meet the highest industry standards to ensure the toys are easy for kids' little fingers to pick up, place and pull apart – and it's been that way since 1969.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® DUPLO® bricks and pieces to make sure every little builder’s DUPLO playset meets the highest global safety and quality standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/mickey-minnie-birthday-train-10941","description":"Celebrate a toddler’s birthday in style with the delightful LEGO® DUPLO® ǀ Disney Mickey & Minnie Birthday Train (10941). Packed with developmental activities and featuring favorite Disney characters, this premium building playset is the perfect way to introduce preschoolers to numbers, creative construction and Disney magic!\n\nPlayful learning for young minds\nToddlers join Disney's Mickey Mouse, Minnie Mouse and Pluto as they drive the birthday train, stopping off to play and learn with the onboard activities. This colorful construction set improves fine motor skills as kids assemble the train and stack the number bricks; inspires creativity as they decorate the wagons; and develops social skills as they role-play with the lovable Disney characters.\n\nBuild skills with well-known Disney characters\nAll LEGO DUPLO │ Disney construction sets are expertly designed with imaginative features and iconic characters so parents and toddlers can share endless play and precious developmentalmilestones.\n\nLEGO® DUPLO® ǀ Disney Mickey & Minnie Birthday Train (10941) is a premium building playset for preschoolers, packed with developmental activities, imaginative play possibilities and Disney magic!\nIncludes iconic Disney characters Mickey Mouse, Minnie Mouse and Pluto, a 3-section buildable train, buildable birthday cake with candle, 5 stackable number bricks and accessories.\nKids develop fine motor skills as they build and play with the train; recognize numbers as they stack the bricks; and build social and emotional awareness as they role-play with Disney characters.\nFor ages 2 and up. This stand-out gift will make any toddler’s birthday a celebration to remember.\nTrain measures over 6 in. (15.5 cm) high, 14 in. (35.5 cm) long and 5.5 in. (13.5 cm) wide. This versatile, toddler-friendly construction toy can be played with in a wide variety of entertaining ways.\nExpertly designed with elements that are easy for little hands to pick up and place, and fun accessories that encourage role play: a guitar, flexible balloons, gifts and Minnie’s fabric dress.\nSimple printed instructions make it easy for parents to share an enjoyable building experience with their little one.\nAll LEGO® DUPLO® │ Disney building playsets are expertly designed with imaginative features and familiar characters, so parents and toddlers can enjoy endless play and share developmental milestones.\nLEGO® DUPLO® components meet strict industry standards to ensure they are easy for little fingers to pick up, place and pull apart – and it’s been that way since 1969.\nLEGO® DUPLO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they fulfill stringent child safety standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/police-station-10902","description":"Play out real-life scenarios in LEGO® DUPLO® Town: a recognizable world with modern DUPLO figures. Preschoolers will love creating stories through pretend play at the easy-to-build 10902 Police Station. Help the police officers whizz out in the police car with flashing lights and siren sound to catch the crook on the run with the police officer's doughnuts! Then take him back to the toy police station and lock him safely in the jail cell. Includes 3 DUPLO figures.\n\nIncludes 3 LEGO® DUPLO® figures: 2 police officers and a crook.\nFeatures an easy-to-build police station with opening cell door and a toy police car with lights and siren sound.\nAccessory elements include a mug, plus bricks decorated as doughnuts and a security camera.\nPress the button to activate the police car siren and lights.\nCatch the crook and take him to the toy police station with jail.\nUse the modern characters, accessories and decorated bricks to have fun while helping your toddler learn about the police and how they help us.\nHelp your child master basic construction skills with this easy-to-build model.\nThis police toy for kids makes an ideal gift for preschool children.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nThere are several LEGO® DUPLO® Town products to collect and play out your child's everyday life in a recognizable DUPLO world.\nCombine with the 10900 Police Bike for even more police-themed fun.\nPolice station measures over 6” (17cm) high, 9” (25cm) wide and 3” (10cm) deep.\nPolice car measures over 4” (11cm) high, 5” (15cm) long and 2” (7cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/super-heroes-lab-10921","description":"Stimulate creativity and inspire imagination with this versatile superhero construction toy for toddlers. Popular Marvel Avengers characters and cool equipment and vehicles come together to create a developmental playset that’s full of fun! Kids’ superhero learning toy! Toddlers can have fun with Iron Man, Spider-Man and Captain America toys in Iron Man's laboratory. Using a crane, spinning turntable, wrench and control panel, little superheroes can fix Captain America's motorcycle, lift and move heavy loads and pull the Spider-Man figure along for a fun ride behind the motorcycle! And, while preschoolers are busy having fun with this colorful Marvel superhero toy, they’re also developing their cognitive thinking, spatial reasoning, creativity and fine motor skills. Great gifts for toddlers! LEGO DUPLO® toys combine iconic themes, recognizable settings, popular characters and toddler-friendly bricks in a range of playsets that inspire young minds through playful learning and creative fun.\nEncourage toddlers’ imagination, creativity and developmental benefits with popular superheroes from the blockbuster Marvel Avengers movies. Anything can happen when superheroes work together in Iron Man’s lab.\nKids can assemble Iron Man’s laboratory workshop – with its moving crane, spinning turntable, wrench and control panel – and team up with Spider-Man, Captain America and Iron Man to carry out repairs and have some fun!\nThere's Captain America's motorcycle to fix, heavy loads to lift and shift – kids can even pull Spider-Man along for a ride behind the motorcycle (watch out for his web!). For even more fun, combine with other playsets.\nA fun-packed starter set for budding builders and little superheroes. With safe, toddler-friendly pieces, this colorful playset makes a great Christmas, birthday or any-other-day gift for kids aged 2 and over.\nWith a maximum height of over 5” (13cm), this versatile playset is big enough for serious play and compact enough for the superhero action wherever kids go.\nNo batteries required. This toddlers’ developmental toy is powered by their imagination. Battery-free toys boost critical thinking skills and give kids the satisfaction of making fun things happen ‘by myself’!\nSimple instructions for parents and toddlers ensure the imaginative fun begins as soon as the Iron Man toy comes out of the box. No time-consuming setting up – just instant delighted smiles and captivated minds.\nLEGO® DUPLO® playsets make great gifts for toddlers because they encourage open-ended creative play that introduces real-life scenarios, familiar characters, cute animals and free-thinking fun.\nLEGO® DUPLO® construction toys for toddlers meet the highest industry standards, ensuring they are easy for little hands to pick up, place and pull apart – and it's been that way since 1969!\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® DUPLO® bricks and pieces to make sure every little builder's DUPLO playset meets the highest global safety and quality standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/airport-10871","description":"Play out real-life scenarios in LEGO® DUPLO® Town: a recognizable world with modern DUPLO figures. Help your little pilot get ready for take-off at the 10871 Airport! It’s easy for preschoolers to build the boarding gate, luggage slide and revolving air traffic control tower. Toddlers will love to help the pilot get all her passengers aboard the buildable plane and head for the skies! Includes 3 DUPLO figures.\n\nIncludes 3 LEGO® DUPLO® figures: a pilot, dad and a child.\nFeatures an airport building with luggage slide, boarding gate and revolving air traffic control tower, plus a buildable plane with wheels.\nAccessory elements include a suitcase and a gift box brick.\nHead to the airport and check in your luggage down the luggage slide.\nHelp the pilot perform safety checks on her plane before leaving the airport.\nClimb into the air traffic control tower and give the signal for takeoff!\nUse the modern characters, accessories and decorated bricks to have fun while role-playing what happens at the airport before your toddler’s first trip on a plane with this versatile toy.\nHelp your child master basic construction skills with this easy-to-build model.\nMakes an ideal gift for preschool children.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nAirport measures over 8” (22cm) high, 5” (14cm) wide and 4” (11cm) deep.\nPlane measures over 3” (9cm) high, 7” (18cm) long and 6” (17cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/alphabet-truck-10915","description":"With the LEGO® DUPLO® Alphabet Truck, preschoolers can combine creative building, imaginative play and learning the alphabet. It’s the ultimate playful learning toy for toddlers! Kids’ alphabet learning toy Toddlers improve their fine motor skills as they stack the letter bricks onto the back of the truck. When they role-play imaginative adventures with the boy, girl and bear, they develop their visual-spatial awareness. The 26 letter bricks provide lots of opportunities to become familiar with the letters of the alphabet and improve language skills. And as parents and carers join in the fun, they share precious developmental milestones with their little builder. Irresistible educational building toys for toddlers LEGO DUPLO playsets put open-ended play, self-expression and learning into toddlers' hands. They're designed to be the best toys for preschoolers' needs – so little hands can't wait to get hold of the toddler-friendly bricks and start building!\nIntroduce toddlers to their ABC with this alphabet bricks learning toy. This versatile gift for kids inspires creative building, imaginative play and alphabet learning – all in one truck full of imaginative fun!\nAs well as loading and unloading the truck with 26 toddler-friendly bricks – displaying all the letters of the English alphabet – a boy, girl and adorable teddy bear are here to share imaginative role-play adventures.\nToddlers improve their fine motor skills as they stack letterbricks onto the truck. As they do that, they become familiar with the letters of the alphabet and soon learn to spell basic words (F-U-N!).\nWith its cute characters and colorful, easy-to-handle bricks, this educational toddlers’ toy makes a great Christmas, birthday or any-other-day gift for boys and girls aged 18 months and up.\nThe truck measures over 4” (12cm) high and 2” (7cm) long, providing an A-to-Z of playful learning on a generous scale. Combine with other LEGO® DUPLO® sets for even more fun.\nYou don’t need batteries to fuel the LEGO® DUPLO® Alphabet Truck – just kids’ imaginations. Hands-on, battery-free toys put creative play into kids’ hands, developing their fine motor skills and spatial awareness.\nOpen the playset’s box and the building, playing and learning begins immediately. Simple instructions for parents and toddlers provide ideas and inspiration for instant enjoyment.\nIntroduce preschoolers to learning with open-ended creative play that inspires youngminds. With familiar scenes, fun characters and easy-to-handle pieces, LEGO® DUPLO® playsets are ideal developmental toys for toddlers.\nLEGO® DUPLO® playsets meet the highest industry standards, which ensures they are easy for little fingers to pick up, place and pull apart – it's been that way since 1969.\nAt the LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® DUPLO® bricks and pieces to make sure every building set meets the highest global safety and quality standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/train-bridge-and-tracks-10872","description":"Add this LEGO® DUPLO® 10872 Train Bridge and Tracks set to any new or existing DUPLO train set and develop early construction skills as your toddler builds the tall bridge and arranges the toy train track pieces in any way they like. Help your preschooler place the yellow action brick on the track to make compatible DUPLO trains sound a horn as they drive over it. Also includes a LEGO DUPLO construction worker figure, 2 loose bricks, a spade and a suitcase to extend the role-play and story-telling fun.\n\nIncludes a construction worker LEGO® DUPLO® figure with spade and suitcase accessory elements.\nFeatures 8 straight track pieces, 4 sloped pieces to make the bridge and a yellow (horn sound) action brick.\nUse this set with the 10874 Steam Train or 10875 Cargo Train to extend the possibilities of your LEGO® DUPLO® train collection.\nShow your child how easy it is to place the yellow action brick on the track to make any compatible LEGO® DUPLO® train, such as the 10874 Steam Train or 10875 Cargo Train, sound the horn as it passes over.\nThe tracks included in this set are compatible with your child’s existing LEGO® DUPLO® train collection.\nIncludes 2 loose brick, spade and suitcase elements to extend the role-play and story-telling options.\nThese toy train tracks make an ideal gift for preschool train fans.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nCombine with 10882 Train Tracks for even more track combinations and LEGO® DUPLO® train fun.\nBridge measures over 4” (12cm) high at its highest point."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/elsa-and-olaf-s-tea-party-10920","description":"This versatile Disney Frozen building toy for toddlers provides a world of play and educational possibilities. Playful, buildable learning toy for young kids and Frozen fans! While they have fun, toddlers progress toward key developmental milestones. They relate to Elsa and Olaf, so role-play boosts emotional development. They can role-play a range of scenarios, from a tea party to hide and go seek among the ice blocks, which develop their creative and visual-spatial awareness. Each piece is easy for little hands to pick up and place, so kids can rearrange the set to create stories of their own – great for imagination and fine motor skills. LEGO® DUPLO® starter sets and developmental toys These charming buildable playsets combine iconic themes, familiar settings, well-known characters and toddler-friendly bricks to stimulate preschooler development with creative fun. As play progresses from acting out simple scenes to role-playing make-believe stories, parents can join in and share precious moments with their children.\nInspire imaginative adventures and playful learning with Disney’s Elsa and Olaf from the blockbuster Frozen movies. The fun starts straight from the box – the developmental benefits last a lifetime!\nDisney’s Elsa and her adorable snowman friend, Olaf, are playing in the snow and building an icehouse! With a teapot, hot chocolate and cakes on the table, the scene is set for a super-cool tea party!\nChildren can explore imaginative fun with Disney's Elsa and Olaf. As they role-play endlessadventures, they also build their creative-thinking, fine-motor, visual-spatial and emotional skills.\nA great LEGO® starter set for budding builders and little Disney Frozen fans. With safe, toddler-friendly pieces, this buildable imaginative playset makes a great Christmas, birthday or any-other-day gift for kids aged 2 and up.\nWith the assembled ice house measuring over 3” (12cm) high, this captivating construction playset is big enough for serious play and small enough to pack up and take wherever kids go.\nNo batteries needed. Because it’s powered solely by kids’ imaginations, this great developmental toy boosts critical thinking and problem-solving skills. It gives kids control over the action… and the fun never ends!\nOpen the box and the imaginative role-play begins. There's no complex setting up and no fiddly pieces to assemble. Simple instructions ensure instant delighted smiles and captivated minds.\nIntroduce preschoolers to real-life scenarios, familiar characters, cute animals and free-thinking fun with LEGO® DUPLO® gifts for kids – buildable playsets that encourage open-ended creative play and grow young minds.\nLEGO® DUPLO® building sets meet the highest industry standards. This ensures they are easy for little fingers to pick up, place and pull apart – and it's been that way since 1969!\nAt The LEGO Group, we drop, squash, twist, heat, bend, scratch and stretch LEGO® DUPLO® bricks and pieces to make sure every little builder's DUPLO playset meets the highest global safety and quality standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/fire-engine-10901","description":"Play out real-life scenarios in LEGO® DUPLO® Town: a recognizable world with modern DUPLO figures. Help your little firefighter rush to the rescue in the 10901 Fire Truck for kids with flashing blue light and siren sound! This fire truck toy is easy to build with an opening drawer and a ladder. Toddlers will love to help the firefighter rescue the cat from the buildable tree! Includes 2 DUPLO figures and a cat figure.\n\nIncludes 2 LEGO® DUPLO® figures: a firefighter and a child, plus a cat figure.\nFeatures a fire truck for children with flashing light and siren sound, tilting ladder and an opening drawer, plus a buildable tree.\nPress the button to activate the lights and sounds, and speed to the rescue in this red fire truck toy for toddlers!\nHelp the brave firefighter climb the ladder to rescue the cat in the tree.\nUse the modern characters to have fun while role-playing rescue situations and celebrating real-life heroes.\nHelp your child master basic construction skills with this easy-to-build model.\nThis firefighter toy makes an ideal gift for preschool children.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nThere are several LEGO® DUPLO® Town products to collect and play out your child's everyday life in a recognizable DUPLO world.\nCombine with the 10903 Fire Station for even more firefighter-themed fun.\nFire truck measures over 3” (10cm) high, 5” (14cm) long and 2” (7cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/heart-box-10909","description":"This exciting mix of LEGO® DUPLO® bricks is bursting with ideas and inspiration! As parents and toddlers build, play and build again, this imaginative learning toy will kickstart kids’ creative building and deliver developmental benefits that last a lifetime. Unleash kids' creativity with this stimulating starter set Little hands can't wait to get hold of the toddler-friendly bricks and start building. Simple instructions ensure the imaginative play starts without delay. There's a house, ice cream, whale, flower, helicopter and duck Each easy-to-build model provides lots to talk about and imaginative stories to role-play. The creative fun continues as kids mix the bricks to build their own creations. Build valuable skills a first LEGO DUPLO set LEGO DUPLO playsets put open-ended play and self-expression into the hands of budding builders. With recognizable settings, familiar characters and toddler-friendly bricks, they inspire preschoolers with a boundless enthusiasm for playful learning.\nYour little builder will love this colorful mix of LEGO® DUPLO® bricks. With 15 fun models and endless free-building creativity, this versatile playset is bursting with imaginative possibilities for any toddler.\nIncludes 80 colorful, toddler-friendly bricks that build into 15 easy-to-make fun models, including a house, ice cream, whale, flower… And as kids build, play and imagine, they'll learn skills that last a lifetime.\nShare fun and learning with your little builder. Start with the 15 simple models. Let them put the ‘I love’ LEGO® letters in front of their favorite (will it be ice cream?). Then help them make creations of their own!\nWith cute, colorful models made with safe, easy-to-handle bricks, this educational toddler toy makes a great Christmas, birthday or any-other-day gift for boys and girls aged 18 months and up.\nEach of the 15 starter models is a cute object that toddlers will recognize from everyday life. Combine the pieces with other LEGO® DUPLO® sets foreven more creative possibilities.\nNo batteries needed. The building fun is powered by kids’ imaginations – so it never ends! Hands-on, battery-free toys boost kids’ fine motor and problem-solving skills, and it puts creative play right in their hands.\nOpen the box and start playing immediately. Simple instructions for parents and toddlers show how to assemble the easy-to-build models. And once kids begin building, the fun will never stop!\nLEGO® DUPLO® playsets make great gifts for toddlers. They encourage open-ended play and deliver developmental benefits using real-life scenarios, familiar characters, cute animals and free-thinking fun.\nLEGO® DUPLO® preschool learning toys meet the highest industry standards, ensuring they are easy for little hands to pick up, place and pull apart – and it's been that way since 1969!\nAt The LEGO Group, we drop, squash, twist, heat, bend, scratch and stretch LEGO® DUPLO® bricks and pieces to make sure every little builder's DUPLO playset meets the highest global safety and quality standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/minnie-s-birthday-party-10873","description":"Little Disney fans will love to help Minnie Mouse celebrate in style with LEGO® DUPLO® 10873 Minnie’s Birthday Party! Play with them as they drive Minnie in her cute pink car to the party venue, where Figaro the cat is waiting to get the party started. This LEGO DUPLO set is perfect for endless role-play with a birthday celebration theme, and comes with a giant buildable birthday cake plus 2 bricks decorated as presents. Includes a LEGO DUPLO figure: Minnie Mouse, plus a DUPLO cat figure.\n\nIncludes a LEGO® DUPLO® figure: Disney’s Minnie Mouse plus a Figaro the cat DUPLO figure.\nFeatures a party venue with an opening window, table, chair and buildable birthday cake, plus a car.\nAccessory elements include a Minnie Mouse portrait tile for the wall and 2 bricks decorated as birthday gifts.\nPreschoolers will love to build the cake and help Figaro throw an amazing party for Minnie Mouse.\nUse this set to play out the special parts of any birthday party with your toddler.\nHelp your child master basic construction skills with this easy-to-build LEGO® DUPLO® l Disney toy.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nParty venue measures over 5” (13cm) high, 4” (12cm) wide and 2” (6cm) deep.\nCar measures over 1” (4cm) high, 3” (10cm) long and 2” (6cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/my-first-car-creations-10886","description":"Preschoolers will love to build and rebuild colorful vehicles with LEGO® DUPLO® 10886 My First Car Creations. Help them sort the colors to build a toy helicopter, taxi, garbage truck and Fire Truck for toddlers, or mix up all the bricks and create endless easy-to-build car creations together by combining just a few chunky DUPLO bricks, developing fine motor skills as you go. This toddler toy car set is great for developing imagination as preschoolers learn to create and move with classic car play. DUPLO bricks are specially designed to be fun and safe for small hands.\n\nFeatures 4 buildable LEGO® DUPLO® vehicles: a fire truck, helicopter, taxi and a garbage truck.\nIncludes a brick decorated as a traffic light and decorated bricks with different windows, drivers and passengers.\nCreate and connect with your young child and work on fine motor skills as you build iconic vehicles.\nInspire little imaginations as they create all sorts of wonderful, colorful cars of their own!\nEncourage social and emotional skills as toddlers enjoy role-play fun with the decorated characters traveling in these cute toy cars for kids.\nThese toy cars and trucks for toddlers make an ideal gift for preschool children.\nThe endless creative play possibilities of LEGO® DUPLO® toys set the stage for toddlers to become creative thinkers.\nLEGO® DUPLO® products are specially designed to be fun and easy for small hands.\nFire truck measures over 4” (11cm) high, 3” (9cm) long and 2” (6cm) wide.\nHelicopter measures over 3” (9cm) high, 3” (9cm) long and 2” (6cm) wide.\nTaxi measures over 2” (6cm) high, 3” (9cm) long and 2” (6cm) wide.\nGarbage truck measures over 2” (7cm) high, 3” (10cm) long and 2” (6cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/number-train-10847","description":"Introduce STEM toys early with the LEGO® DUPLO® Number Train. It’s a colorful introduction to numbers and counting. Your toddler will love to build and rebuild this developmental toy, learning early number recognition as they go! This set is the perfect educational gift for little ones and a great introduction to the LEGO STEM sets. With two child DUPLO® figures and a cat figure, the set provides endless storytelling and creativity for little minds. If you’re looking for a learning toy or STEM gift, the Number Train is your best bet, and DUPLO® bricks are designed to be safe and suitable for little hands.\n\nIncludes two child LEGO® DUPLO® figures, plus a cat figure.\nFeatures a buildable locomotive and three wagons.\nIncludes bricks decorated with numbers 0 to 9.\nUse the decorated bricks to teach your child about numbers and counting.\nEncourage building and role-play.\nLEGO® DUPLO® products are specially designed to be safe and easy for little hands.\nThis set offers an age-appropriate build and play experience for ages 1½-3 years.\nTrain with wagons attached measures over 3” (10cm) high, 14” (37cm) long and 2” (6cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/submarine-adventure-10910","description":"Enjoy imaginative play with your toddler and help them develop key skills on a LEGO® DUPLO® Town 10910 Submarine Adventure! This educational bath toy for toddlers provides lots to learn and talk about as young children pretend to film the whale and fish with the toy camera. At bathtime, the toy submarine floats and bubbles on the surface as the whale glides by and the fish blows bubbles below. With 2 diver figures to share the fun… who knows where your next underwater adventure will take you and your little submariner.\n\nThis educational bath toy for toddlers includes 2 LEGO® DUPLO® diver figures, plus clown fish, whale and seagull figures.\nLEGO® DUPLO® Submarine Adventure features a brightly colored toy submarine and a fish, both of which produce bubbles when immersed underwater, and a buildable arch with seaweed.\nAccessory elements include swim fins, snorkel mask and underwater camera for the divers.\nThe set can be used in water and on dry land.\nToy submarine measures over 3” (10cm) high, 6” (17cm) long and 3” (10cm) wide.\nBuildable arch and seaweed feature measures over 5” (13cm) high, 5” (15cm) wide and 3” (8cm) deep."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/toy-story-train-10894","description":"Inspire imagination and role-play adventures with your little Disney•Pixar Toy Story fan, as Woody and Buzz Lightyear take a ride on the LEGO® DUPLO® l Disney•Pixar 10894 Toy Story Train. Teach them about teamwork and help build social and emotional skills as these two iconic characters work together to protect the bank vault from the evil Dr. Porkchop, who is featured on a ‘Wanted' poster. This classic buildable steam train toy is easy to build, helping preschoolers develop early construction and fine motor skills in a much-loved Pixar setting. Includes 2 LEGO DUPLO figures: Woody and Buzz Lightyear.\n\nIncludes 2 LEGO® DUPLO® figures: Woody and Buzz Lightyear with detachable wings.\nFeatures a LEGO® DUPLO® steam train with opening roofs and a separate cactus.\nAccessory elements include a bank vault, lasso and bricks decorated as money and a ‘Wanted' sign—great story starters!\nHelp your child master basic construction skills with this easy-to-build Disney\nPixar Toy Story Train set for toddlers.\nYoung children will love to push Woody around on the steam train and attach Buzz Lightyear's wings to fly him in for backup.\nEncourage language development and social and emotional skills through role-play with favorite Disney\nPixar Toy Story characters.\nThe endless creative play possibilities of LEGO® DUPLO® building toys set the stage for toddlers to become creative thinkers.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nMakes an ideal gift for preschoolers.\nSteam train measures over 5” (14cm) high, 7” (19cm) long and 2” (6cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/train-tracks-10882","description":"Open up endless possibilities for your toddler to make a cool track for any new or existing DUPLO train set with these LEGO® DUPLO® 10882 Train Tracks. With level crossings, stops, switches and a combination of curved and straight track pieces there is so much they can do! Preschoolers will also love to place the red action brick on the track and make any compatible DUPLO train (including 10874 Steam Train or 10875 Cargo Train) stop when it reaches it.\n\nFeatures a straight piece and 10 curved pieces of track, plus 2 stops, 2 switches, a level crossing and a red (stop train) action brick.\nUse this set with the 10874 Steam Train or 10875 Cargo Train to extend the possibilities of your LEGO® DUPLO® train collection.\nShow your preschooler how easy it is to place the red action brick on the track to make any compatible train, such as the 10874 Steam Train or 10875 Cargo Train, stop when it reaches it.\nThe toy train tracks included in this set make an ideal gift for LEGO® DUPLO® train fans and are compatible with your child’s existing LEGO® DUPLO® train collection (the action bricks are not compatible with older DUPLO trains).\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nCombine with 10872 Train Bridge and Tracks for even more track combinations and LEGO® DUPLO® train fun."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/truck-tracked-excavator-10931","description":"LEGO® DUPLO® Truck & Tracked Excavator (10931) encourages little builders to explore endless open-ended play. As they act out imaginative construction-site scenes with the toy truck, digger and 2 construction workers, toddlers develop valuable physical and cognitive skills that last a lifetime.\n\nConstruction-site toy with vehicles and workers\nWith 2 construction-worker figures, a truck with a tip function and an excavator with a rotating digger, toddlers and parents have all they need to getthe job done. Kids develop their fine motor skills as they maneuver and operate the vehicles to carry out various construction-site tasks. There are toy boulders to scoop up into the truck. But watch out, the boulder can easily split open!\n\nWhat’s the best building toy for young kids and toddlers?\nThe range of LEGO DUPLO Construction playsets has been designed to provide preschoolers with toys that stimulate and satisfy their growing needs. Sets can be combined to increase the play benefits.\nParents and preschoolers can act out construction-site stories together with the LEGO® DUPLO® Truck & Tracked Excavator (10931). As they explore open-ended play, toddlers build developmental skills that last a lifetime.\nIncludes 2 contemporary construction-worker figures, a push-along truck with a tip function, a push-along excavator with a rotating digger, and a toy boulder that kids can open up.\nParents and caregivers share developmental milestones with their little builder as they join in the imaginative construction-site fun. Fine motor skills and problem-solving abilities develop as kids operate the vehicles.\nIf you’re looking for the best toy for a toddler’s growing needs, this building-site set is packed with features and functions to stimulate and inspire the minds of curious kids aged 2 and up.\nThe truck measures over 4” (11cm) high, 5” (14cm) long and 2” (7cm) wide and the excavator measures over 4” (12cm) high, 7” (18cm) long and 2” (7cm) wide – the perfect size for little hands to pick up and place.\nNo batteries needed. The LEGO® DUPLO® Truck & Tracked Excavator playset is powered by kids’ imaginations – so the hands-on, creative fun never ends!\nClear instructions help to maximize the fun and the developmental benefits – so parents and toddlers are sure to get the most from the versatile playset as soon as they open the box.\nLEGO® DUPLO® playsets are designed to entertain, stimulate and inspire the minds of preschoolers. With familiar scenes, fun characters and toddler-friendly pieces, they unleash young imaginations with open-ended play.\nSince 1969, LEGO® DUPLO® toddler toys have met the highest industry standards. This ensures they are easy for little fingers to pick up, place and pull apart – every time.\nThe LEGO Group drops, heats, crushes, twists and analyzes the bricks and pieces that make up LEGO® DUPLO® playsets to be sure every little builder's toy meets the highest global safety standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/bedroom-10926","description":"There’s endless imaginative role-play for kids to enjoy with this LEGO® DUPLO® Bedroom toy. Even the house-shaped box is part of the play experience. Bedroom playset developmental toy Young minds will be engaged and entertained with this versatile bedroom-in-a-box playset. With contemporary colors and 2 detailed girl figures, toddlers develop their fine motor skills role-playing endless fun activities. There's a teddy bear to cuddle, a guitar to sing along to and the top bunk even has its own slide! When the clock shows it’s time for sleep, put the girls to bed, then – time to wake up! – the fun continues in the morning. As parents and carers join in the building and playtime fun, they share their little ones’ precious developmental milestones. Pretend play learning toys – great gifts for kids! LEGO DUPLO educational toys for toddler put open-ended play into preschoolers hands. With relatable characters and creative building fun, DUPLO toys make ideal kids' first LEGO sets.\nThe house-shaped box containing this playset transforms into a fun-packed bedroom, filled with colorful toys and cool pretend-play figures for toddlers to share endless imaginative fun with.\nThis educational building toy for toddlers includes 2 contemporary-looking girl figures plus a toy guitar, alarm clock and a cuddly teddy bear – even the house-shaped box is great for play and storage.\nToddlers build fine motor skills and role-play imaginative stories as they join 2 young girl figures for pretend sleepover play in the LEGO® DUPLO® Bedroom. Will the fun activities stop when it’s time for bed?\nToddlers build fine motor skills and role-play imaginative stories as they join 2 girl figures for pretend play in the LEGO® DUPLO® Bedroom. For extra fun, combine this set with LEGO DUPLO Town Playroom (10925).\nIf you want a learning toy for young kids, this playset has cute characters, colorful, easy-to-handle bricks and endless play possibilities – making it a great educational building toy for toddlers aged 2 years and over.\nThe bunk-beds with slide measure over 4” (11cm) high, 5” (13cm) wide and 2” (6cm) deep. The house-shaped box can be used to store all the bricks and pieces, and lets adults take the imaginative play wherever kids go.\nThis playset is battery-free. Hands-on toys boost kids' creative, imaginative and practical skills. It gives them the satisfaction of making fun things happen ‘by myself' – and it means the fun never ends.\nThe play begins immediately. Just open the house-shaped box and go! For further learning fun, check out LEGO® DUPLO® Lullabies and other DUPLO songs at LEGO.com/DUPLO/Songs.\nLEGO® DUPLO® Town toys put educational, imaginative, open-ended play in the hands of preschoolers and toddlers. These ingenious DUPLO starter sets combine key developmental benefits with fun toys that kids love.\nMeeting the highest industry standards, LEGO® DUPLO® sets are easy for little fingers to pick up, place and pull apart – and it's been that way since 1969.\nAt The LEGO Gorup, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® DUPLO® bricks and pieces to make sure every one of our kids’ construction toys meets the highest global safety and quality standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/lego-duplo-large-green-building-plate-2304","description":"Even big imaginations need a place to start--and our baseplates do the job.\n\nMeasures 15\" (38.1cm) x 15\" (38.1cm).\nBricks not included."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/playroom-10925","description":"The LEGO® DUPLO® Playroom is packed with imaginative role-play possibilities. Even the house-shaped box is part of the play experience. With modern colors, cool features and detailed characters, young minds and little hands will be engaged and entertained for hours! Toddlers' educational developmental toy Children improve their fine motor skills and role-play imaginative stories as they join a boy and girl in the playroom. The toy's pretend school area provides plenty of opportunity for basic preschool learning. There’s even a birthday to celebrate – with toys, ice-cream, present and balloons. As parents and carers join in the building and playtime fun, they share their little ones’ precious developmental milestones. Pretend play gifts for kids LEGO DUPLO imaginative kids' playsets put open-ended play, self-expression and learning into little hands. These educational toys for toddlers and preschoolers encourage learning through pretend play, relatable characters and creative building.\nThe box containing this playset transforms into a versatile playroom, filled with colorful toys and detailed characters to educate and entertain toddlers with endless role-play fun.\nThe house-shaped box is great for play and storage. It contains all the bricks and pieces kids need to role-play a birthday party and lots more besides. Includes contemporary figures and numerous toys and accessories.\nToddlers can role-play imaginative stories in the LEGO® DUPLO® Playroom, including learningin the toy school and celebrating at the birthday party. For extra fun, combine this set with LEGO® DUPLO® Town Bedroom (10926).\nWith its cute characters and colorful, easy-to-handle bricks, this educational toy for toddlers makes a great gift for kids aged 2 years and up and makes any day a birthday party day!\nThe playroom with furniture measures over 3” (10cm) high, 4” (12cm) wide and 2” (6cm) deep. The house-shaped box can be used to store all the bricks and pieces, and lets adults take the imaginative play wherever kids go.\nPowered by kids’ imaginations! Hands-on, battery-free toys boost kids’ creative, imaginative and practical skills, and it gives them the satisfaction of making fun things happen ‘by myself’.\nOpen the set’s house-shaped box and the imaginative play begins immediately. For further learning fun, check out the DUPLO Birthday song and other DUPLO songs at LEGO.com/DUPLO/Songs.\nIntroduce preschoolers to familiar scenarios, cute characters and free-thinking fun with LEGO® DUPLO® Town. These ingenious DUPLO starter sets encourage open-ended pretend play that improves young minds.\nLEGO® DUPLO® playsets meet the highest industry standards, which ensures they are easy for little fingers to pick up, place and pull apart – it's been that way since 1969.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® DUPLO® bricks and pieces to make sure every building set meets the highest global safety and quality standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/bulldozer-10930","description":"The LEGO® DUPLO® Construction Bulldozer (10930) inspires toddlers to build, bulldoze and enjoy endless open-ended creative play. As they role-play construction stories with this functional toy, they develop physical and cognitive skills that last a lifetime.\n\nConstruction worker and vehicle toy for kids\nFeaturing a construction worker figure in a hi-visibility vest, this cute, movable bulldozer provides a great opportunity for toddlers and parents to work together as a team. Kids build theirfine motor skills driving the truck to the construction site and raising the boulder in the scoop. But, be careful, that boulder could crack open at any moment.\n\nLooking for the best creative building toy for toddlers?\nThe wide variety of LEGO DUPLO playsets provides parents and preschoolers with many precious moments to share. Designed to give toddlers the best toys for their growing needs, LEGO DUPLO sets deliver developmental play that encourages kids' self-expression and learning.\n\nAs toddlers role-play imaginative building-site stories with the LEGO® DUPLO® Construction Bulldozer (10930), they also build developmental skills that last a lifetime!\nIncludes a cute, movable bulldozer with a hand-operated, lift-up scoop, a boulder that cracks open, a sign to warn the traffic, and a construction worker figure in a hi-visibility vest.\nParents and caregivers share imaginative role-play with their little builder as kids develop their fine motor skills driving the truck to the construction site and scooping up a boulder.\nIf you want to give a toddler the best toy for their growing needs, this movable LEGO® DUPLO® Bulldozer makes a great kids’ gift for young vehicle-lovers and fans of construction sites aged 2 years old and up.\nThe Bulldozer measures over 3” (10cm) high, 6” (17cm) long and 2” (7cm) wide – the perfect size to take the imaginative play wherever kids go. Combine with other LEGO® DUPLO® Construction sets for even more fun.\nNo batteries are needed for this hands-on playset. The LEGO® DUPLO® Bulldozer is fueled solely by kids’ imaginations – so it never stops!\nSimple instructions include ideas and inspiration to ensure parents and toddlers can maximize the fun and developmental benefits of this versatile toy straight from the box.\nAll LEGO® DUPLO® playsets feature familiar scenes, fun characters and easy-to-handle pieces designed to unlock preschoolers' imaginations with building, learning and open-ended play.\nLEGO® DUPLO® toy building sets meet the highest industry standards to ensure they are easy for little fingers to pick up, place and pull apart – and it’s been that way since 1969.\nThe LEGO Group drops, heats, crushes, twists and analyzes the bricks and pieces that make up LEGO® DUPLO® playsets to be sure every little builder's toy meets the highest global safety standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/pizza-stand-10927","description":"Enjoy pretend play with pizza! The LEGO® DUPLO® Pizza Stand is an ideal first building playset, providing toddlers with lots to learn and enjoy. Feed young minds with a toy pizza set! Every kid can recognize a pizza – and this contemporary pizza stand toy serves up a delicious mix of fun play and developmental benefits for toddlers and parents to share! Your little pizza maker can help the cook hold up the pizza to attract customers; serve pizza to the table; sit the cook on the chair to eat his favorite snack (pizza!) while the cute dog looks on enviously. With cool colors and a great level of detail, including a wood-style countertop, the versatile LEGO DUPLO Pizza Stand can be rearranged and redesigned for endless role-play fun. Pretend play learning toys – great gifts for toddlers! With relatable characters and familiar scenarios, LEGO DUPLO educational toys for toddlers put open-ended play and self-expression into preschoolers hands – encouraging fine motor skills and social & emotional development.\nThe versatile LEGO® DUPLO® Pizza Stand provides toddlers, parents and carers with lots of role-play fun to share together. This toy’s an ideal LEGO starter set, packed with playful learning for kids to enjoy.\nAs the pizza guy cooks a yummy pizza at his toy food stand, a cute dog looks on hopefully. The pizza stand is colorful and contemporary, with a wood-style countertop, and includes a menu, table, chair – and pizza!\nToddlers develop fine motor and social & emotional skills as they build, play, redesign and play again with this busy food playset. Cook and serve delicious pizza. Does the doggy deserve a slice?\nBoys and girls will love playing out imaginative stories with this fun pizza stand. They’re serving pretend play all day at this fun-filled mini-restaurant! Great gift for toddlers aged 2 and over.\nThe pizza stand measures over 4” (11cm) high, 3” (9cm) wide and 2” (7cm) deep. This adaptable playset integrates seamlessly with other LEGO® DUPLO® sets to expand kids'pretend play and learning possibilities.\nThis educational toy for toddlers and preschoolers is battery-free – so the foody fun never ends! LEGO® DUPLO® hands-on toys kickstart young kids’ creative, imaginative and practical thinking.\nSimple, clear instructions ensure kids can create and enjoy this easy-to-assemble LEGO® DUPLO® toy pizzeria immediately. Then, the more they play, the more their imagination will conjure up exciting new possibilities.\nWith easy-to-handle bricks and friendly, familiar characters, LEGO® DUPLO® Town toys develop kids’ creative-thinking and fine motor skills while delivering endless imaginative play.\nLEGO® DUPLO® toys meet the highest industry standards, so they are consistent, compatible and connect and pull apart perfectly every time – and it's been that way since 1969.\nLEGO® DUPLO® bricks and pieces are tested to the extremes to ensure they meet the highest global safety and quality standards, and you can be sure the toy is absolutely safe for your child."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/plane-10908","description":"Play out real-life scenarios in LEGO® DUPLO® Town: a recognizable world with modern DUPLO figures. Show your child how to help the pilot fix up the 10908 Plane in his workshop, using the toy wrench and oilcan. Toddlers will love to make the cute red toy airplane take off and fly it through the air, spinning the propeller as they go! This educational toy includes a pilot DUPLO figure.\n\nIncludes a pilot LEGO® DUPLO® figure.\nFeatures a red plane with spinning propeller and a small workshop table with chair.\nAccessory elements include an oilcan, wrench, mug and a music system decorated brick.\nEnjoy endless role-play fun with your child and develop their fine motor skills, as you help them use the tools to get the toy airplane ready for takeoff.\nTake the handy little propeller aircraft for your toddler to fly around wherever you go!\nToddlers will love learning through play, developing language and social skills as they create pretend play stories.\nLEGO® DUPLO® learning toys are specially designed to be fun and easy for little hands.\nThere are several LEGO® DUPLO® Town products to collect and play out your child's everyday life in a recognizable DUPLO world.\nPlane measures over 2” (7cm) high, 5” (14cm) long and 5” (15cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/police-bike-10900","description":"Play out real-life scenarios in LEGO® DUPLO® Town: a recognizable world with modern DUPLO figures. Toddlers will love zooming through town on the 10900 Police Bike! Help them understand everyday scenarios as the police officer DUPLO figure uses the stop and go sign to control busy traffic, then let him take a rest in the police kiosk before climbing back on the police motorcycle and heading to his next job. This police toy is easy to build and helps develop fine motor skills.\n\nIncludes a police officer LEGO® DUPLO® figure.\nFeatures a police bike toy and a police kiosk with opening window.\nAlso includes a reversible stop and go sign element.\nHave endless police-themed fun as your preschooler drives the police motorcycle toy around, looking for people to help!\nEncourage language development and pretend play as young children learn through playing out police rescue and traffic control situations.\nThis police toy for kids makes an ideal gift for preschool children.\nLEGO® DUPLO® products are easy to build and specially designed to be safe and suitable for small hands.\nThere are several LEGO® DUPLO® Town products to collect and play out your child’s everyday life in a recognizable DUPLO world.\nCombine with the 10902 Police Station for even more police-themed fun.\nPolice motorbike toy measures over 1” (5cm) high, 3” (9cm) long and 1” (4cm) wide.\nPolice kiosk measures over 3” (10cm) high, 2” (6cm) wide and 1” (3cm) deep."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/duplo-photo-frame-40269","description":"Display your favorite drawings and photos with this LEGO® DUPLO® Land Photo Frame, featuring colorful detailing and a buildable stand with detachable DUPLO figure."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/wrecking-ball-demolition-10932","description":"The LEGO® DUPLO® Construction Wrecking Ball Demolition (10932) toy provides open-ended play with an adjustable crane, tipper truck and bulldozer toy.\n\nWrecking ball demolition toy for toddlers\nPreschoolers will develop fine motor and cognitive skills and strengthen their social and emotional awareness with 3 construction workers, a crane that moves up and down and from side to side, a bulldozer with heavy-duty tracks and opening cabin, a dump truck, a small house and accessories including boulders and signs. Parents can share endless fun with toddlers swinging the wrecking ball to demolish the small house, clearing the site with the bulldozer, delivering new construction supplies with the truck and building the house back up again.\n\nWhat’s the best toy construction set for toddlers?\nThe range of LEGO DUPLO Construction playsets are designed to provide preschoolers with toys that stimulate and satisfy their growing needs. Sets can be combined to increase the play benefits even further.\n\nThe LEGO® DUPLO® Construction Wrecking Ball Demolition (10932) playset lets parents and preschoolers operate 3 awesome construction vehicles to knock down a building and clear up the mess.\nIncludes male and female contemporary construction worker figures, an adjustable crane, dump truck, bulldozer with heavy-duty tracks, a small house and a selection of boulders.\nParents and toddlers work together to swing the wrecking ball from side to side and demolish the small house, clear the site with the bulldozer, and deliver new building supplies with the truck.\nIf you’re looking for the best construction-site toy for toddlers, this creative building playset has LEGO® DUPLO® vehicles, construction workers and scenery to engage, educate and entertain kids aged 2 and up.\nThe crane measures over 11” (28cm) high, 3” (10cm) long and 4” (12cm) wide – large enough for serious work and small enough for little fingers to get to grips with. Combines with other LEGO® DUPLO® Construction sets.\nNo batteries are required for this playset. All that’s needed is a kid’s imagination, and the hands-on, open-ended play will go on and on!\nSimple instructions help parents and toddlers make the most of the toy straight from the box – maximizing the set's play possibilities and developmental benefits.\nAll LEGO® DUPLO® playsets use fun, familiar scenes and easy-to-handle pieces to unleash young imaginations and unlock creative potential with building, learning and open-ended fun.\nLEGO® DUPLO® toy construction sets meet the highest industry standards, so you can be sure that the pieces are always easy for little fingers to pick up, place and pull apart – and it’s been that way since 1969.\nThe LEGO Group drops, heats, crushes, twists and analyzes the bricks and pieces that make up LEGO® DUPLO® playsets to be sure every little builder's toy meets the highest global safety standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/steam-park-45024","description":".\nKey Features\n295 LEGO® DUPLO® bricks, including gears, tracks, pulleys, boats, and figures\n8 double-sided building inspiration cards with 16 models to build\nBuild slides, carousels, shooting galleries, and much more!\n5 activity idea cards to inspire playful learning\nOnline Teacher Guide with 6 STEAM lessons\nA selection of online learn-to-build mini tutorial videos\nA great way to expand existing LEGO® DUPLO® sets Key Learning Values\nCause and effect\nObserving and describing\nProblem solving\nDeveloping imagination\nCreating representations\nRole-play\nCollaboration\nCommunication If you are an educator buying these products for schools or to deliver other accredited learning, please click on the link below for more information on how to source and use these solutions to deliver learning outcomes tailored to your local education requirements, such as options on classroom packs, professional development offerings and advice on classroom solutions. https://education.lego.com/en-gb/shop/find-distributor Are you a home user, looking for a way to provide home learning activities for children of all ages? Whether they’re in the classroom or the living room children have big imaginations, innate curiosity, and a desire to explore and take risks. All you need are the resources to tap into them. LEGO Education wants to help. Hands-on learning provides a medium for building ideas and models while practicing important skills such as communication, collaboration, critical thinking and creativity. For more than 40 years, LEGO Education has been developing educational solutions based on a well-established educational theory that children learn best and remember more through hands-on experiences. Our products aren’t toys - instead home use of LEGO Education Learning Resources is intended to be a highly rewarding education experience that supplements locally applicable curriculum needs. LEGO Education offers pre and post-sale support to ensure LEGO Education resources are used as effectively as possible in a learning environment. Contact our Customer Services team."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/mickey-s-vacation-house-10889","description":"Head to LEGO® DUPLO® l Disney 10889 Mickey’s Vacation House for open-ended imaginative play with Disney Mickey Mouse and friends. With the reversible roof bricks turned to show their red-hot summer side, preschoolers will love watering flowers with Minnie Mouse, flying an airplane with Goofy and drinking tea at the garden table. Turn the reversible roof bricks to show their snowy white winter side, and your toddler can enjoy sleighing with Mickey and sharing a hot drink by the fireplace. The easy-to-handle building bricks develop kids’ social and emotional awareness plus early construction and fine motor skills. With 4 DUPLO figures and so many ways to play and learn, this fun-packed Mickey Mouse and Minnie Mouse toy construction set is ideal for sharing precious moments with your toddler.\n\nThis educational Disney Mickey Mouse and Minnie Mouse toddler building toy includes a sleigh for the characters to ride on.\nIncludes 4 LEGO® DUPLO® figures: Mickey Mouse, Minnie Mouse, Goofy and Pluto.\nTwo-sided summer/winter roof-tile bricks let kids switch between seasons.\nHelp your child master basic construction skills and improve their fine motor abilities as the building bricks are assembled and re-positioned for endless imaginative play.\nThis buildable toy for toddlers is designed to encourage role-play and storytelling to help your child develop language, social and emotional skills.\nMickey’s playhouse measures over 9” (25cm) high, 7” (19cm) wide and 5” (13cm) deep.\nAirplane measures over 2” (7cm) high, 5” (15cm) long and 5” (15cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/lego-duplo-all-in-one-box-of-fun-10572","description":"The LEGO® DUPLO® All-In-One Box of Fun set has a whole load of DUPLO bricks for fun building and rebuilding for creative play. At its heart is a buildable wagon base with rounded edges and wheels that really turn. This comprehensive set also includes 2 opening window elements, a cute dog and numbered bricks with corresponding decorated bricks to help your child develop their counting skills. There are even extra classic DUPLO bricks for more creative fun. Includes a boy DUPLO figure.\n\nLet your imagination run wild with this colorful collection of LEGO DUPLO elements in a handy storage case!\nIncludes one DUPLO boy figure and dog figure\nLEGO DUPLO Doc brick building toys are compatible with all other LEGO DUPLO construction sets for creative building\nHouse measures over 5\" high, 4\" wide and 3\" deep. Wagon measures over 1\" high, 3\" long and 2\" wide. Dog stands over 1\" tall. Boy stands over 1\" tall\n65 pieces – For boys and girls between the ages of 1.5 and 5 years old"},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/my-first-animal-brick-box-10863","description":"Toddlers will have so much fun building their own animal train with the LEGO® DUPLO® 10863 My First Animal Brick Box! Help them sort the bricks into different colors and talk about each iconic animal as you build them together: an elephant with a slide for a trunk, a crocodile with hinged jaws, a lion with opening mouth, a giraffe with a bendy neck and a white bird. The bright and chunky DUPLO bricks are specially designed to be fun and safe for small hands and come in a handy storage box.\n\nFeatures 5 buildable animals: an elephant on wheels with a slide for a trunk, a crocodile on wheels with hinged jaws, a lion on wheels with opening mouth, a giraffe on wheels with a bendy neck and a bird.\nHave fun together as your child learns how to recognize and sort colors, and help develop language skills by talking about the iconic animals as you build them.\nJoin 4 of the animals together to make an animal parade and drive the train around the room.\nInspire creative play and imagination as toddlers make up their own stories about the animals with this versatile toy.\nUse the handy storage box to keep all your LEGO® DUPLO® bricks together.\nMakes an ideal gift for preschool children.\nLEGO® DUPLO® products are specially designed to be fun and easy for small hands.\nElephant measures over 4” (12cm) high, 7” (19cm) long and 2” (6cm) wide.\nCrocodile measures over 4” (12cm) high, 3” (8cm) long and 4” (12cm) wide.\nLion measures over 4” (12cm) high, 7” (19cm) long and 2” (6cm) wide.\nGiraffe measures over 6” (16cm) high, 4” (12cm) long and 2” (6cm) wide.\nBird measures over 4” (11cm) high, 3” (9cm) wide and 4” (11cm) deep.\nCombine with 10859 My First Ladybug to extend the animal train."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/mickey-minnie-birthday-parade-10597","description":"All aboard the Mickey Mouse Clubhouse birthday train as Mickey and Minnie throw a parade in your honor! Load up the train with everything you need for the perfect birthday party—a buildable cake, balloons and decorated gift bricks. How old are you today? With decorated age bricks numbered from 1 to 5, Mickey and Minnie can bring birthday fun year after year. Young children will love the endless birthday role-play opportunities and developing their construction skills with the big, bright LEGO® DUPLO® bricks designed especially for budding builders. Includes 2 DUPLO figures: Mickey Mouse and Minnie Mouse.\n\nBuild a birthday train featuring your favorite Disney characters, including a buildable birthday cake, balloons, a candle and three gift-decorated bricks\nIncludes two DUPLO figures, Mickey and Minnie Mouse\nLEGO DUPLO Disney building toys are compatible with all LEGO DUPLO sets for creative building\nTrain measures over 7” high, 13” long and 2” wide.\n24 pieces – For boys and girls between the ages of 2 and 5 years old"},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/my-first-fun-puzzle-10885","description":"The LEGO® DUPLO® 10885 My First Fun Puzzle toy for toddlers is an easy and entertaining start to matching, building and stacking bricks for very young children. Create and connect with your preschooler as you help them sort the bricks into colors and stack them in the right order to complete these easy-to-build favorite animal puzzles for kids. Then take them apart, mix them up and inspire imagination as you encourage them to come up with goofy animal creations of their own! The DUPLO bricks included with this fun brick puzzle toddler toy are specially designed to be safe for little hands.\n\nFeatures 5 buildable LEGO® DUPLO® animal puzzles for kids: a flamingo, zebra, giraffe, crocodile and a tiger.\nHelp your child master basic construction and fine motor skills as they stack the bricks to complete these easy puzzles for kids.\nEncourage language development and social and emotional skills as children learn through play with the cute animals.\nThe endless creative play possibilities of LEGO® DUPLO® toys set the stage for toddlers to become creative thinkers.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nThis stacking toy makes an ideal gift for preschoolers.\nEach animal measures over 4” (12cm) high, 2” (6cm) wide and 1” (3cm) deep."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/truck-tracked-excavator-10812","description":"Little diggers will love operating these easy-to-build construction machines. Move the Tracked Excavator over uneven land and dig with its big shovel. Take its working, flexible arm apart to make it shorter and then load up the Truck with its tipping function to drive the rubble away! LEGO® DUPLO® bricks are specially designed to be safe for little hands. Includes 2 construction worker DUPLO figures.\n\nIncludes 2 construction worker LEGO® DUPLO® figures with safety helmets.\nFeatures a Truck with tipping function and a Tracked Excavator with moving tracks, rotating cabin and big shovel on a posable arm, plus extra bricks for scooping.\nHelp your child construct, bend and flex the special posable arm system on the Tracked Excavator for digging and scooping all day long.\nAccessories include a roadwork sign and a shovel.\nHave fun while nurturing early building skills and encouraging role-play with the 2 LEGO® DUPLO® figures.\nThese 2 exciting vehicles are simple to build so the digging can start sooner!\nLEGO® DUPLO® products are specially designed to be safe and suitable for little hands.\nTruck measures over 4” (12cm) high, 7” (19cm) long and 2” (7cm) wide.\nTracked Excavator measures over 4” (12cm) high, 9” (25cm) long and 2” (7cm) wide.\nCombine with the 10811 Backhoe Loader and 10813 Big Construction Site for even more digging and building fun."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/my-first-balancing-animals-10884","description":"Toddlers will have loads of fun learning to build and balance with the LEGO® DUPLO® 10884 My First Balancing Animals! Have fun stacking the brightly colored jungle animals on the seesaw in lots of different ways and see how it makes this cute balancing toy tip! The colorful monkey, elephant, tiger and panda animals are easy to build and rebuild with chunky DUPLO bricks, and there are 2 extra bricks to help balance the seesaw or place underneath to hold it steady. DUPLO bricks are specially designed to be safe for little hands.\n\nFeatures a seesaw balancing element and 4 buildable animal puzzles: a monkey, tiger, elephant and a panda, plus 2 extra bricks.\nHave fun building the 3D animal puzzles with your young child and develop their language skills as you talk about different jungle animals.\nStack the animals on this toddler balance toy and move them around to see how it tips.\nUse the extra bricks to hold the seesaw steady and display this colorful animal toy for kids!\nThe endless creative play possibilities of LEGO® DUPLO® toys set the stage for toddlers to become creative thinkers.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nThis animal playset makes an ideal gift for preschoolers.\nEach animal measures over 2” (8cm) high, 2” (6cm) wide and 1” (3cm) deep.\nSeesaw balancing element measures over 1” (4cm) high, 7” (19cm) long and 2” (6cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/baby-animals-10904","description":"Share precious developmental milestones with your toddler and open up a world of imaginative play with the LEGO® DUPLO® Town 10904 Baby Animals toy. This educational toy for toddlers includes a cute baby panda snacking on bamboo, a rare baby white tiger admiring a pretty pink flower, a baby giraffe nibbling the leaves on a tree and an adorable baby elephant who's come to play with his friends. The easy-to-handle animal figures and building bricks develop toddlers' social and emotional understanding and their early construction and fine motor skills.\n\nLEGO® DUPLO® animal set featuring 4 cute baby animal toys: a panda, white tiger, giraffe and elephant.\nThis fun toddler toy includes a bamboo stick, a pink flower and a little tree accessory element.\nToy tiger measures over 1” (5cm) high, 2” (6cm) long and 1” (3cm) wide.\nToy panda measures over 1” (4cm) high, 1” (4cm) long and 1” (3cm) wide.\nToy giraffe measures over 3” (9cm) high, 2” (7cm) long and 1” (3cm) wide.\nToy elephant measures over 1” (4cm) high, 3” (8cm) long and 1” (3cm) wide.\nTree measures over 3” (8cm) high, 2” (6cm) long and 2” (6cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/farm-animals-10870","description":"Little animal lovers will enjoy looking after this selection of LEGO® DUPLO® 10870 Farm Animals. Help them put the chicken in its coop, lead the piglet and calf to the feeding trough and water bucket, and pet the friendly cat. The chicken coop is simple for preschoolers to build and great practice for early construction skills. Includes 4 animal figures.\n\nIncludes 4 animal figures: a calf, piglet, chicken and a cat.\nFeatures a chicken coop with opening door.\nAccessory elements include a trough, water bucket, flower and a pitchfork, plus a hay decorated brick as a story starter.\nFeed the animals using the trough and water bucket.\nPut the chicken to bed in its coop.\nHelp your child role-play and create their own animal stories with this versatile educational toy.\nUse this set to play and have fun while helping your toddler learn about farm animals and how to care for them.\nHelp your child master basic construction skills with this easy-to-build model.\nMakes an ideal gift for preschool children.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nCombine with 10869 Farm Adventures and 10868 Farm Pony Stable for more fun on the farm.\nChicken coop measures over 3” (9cm) high, 2” (6cm) wide and 2” (6cm) deep."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/my-first-mickey-build-10898","description":"Toddlers will love to build and rebuild their favorite Disney character with LEGO® DUPLO® 10898 My First Mickey Build! This 3D puzzle is easy to build from chunky DUPLO bricks. Help your preschooler develop fine motor skills as they stack up the body parts in a simple tower construction to make a Disney Juniors Mickey Mouse toy they'll play with over and over again. Young children can express their creativity through rebuilding Mickey with 2 different outfits: daytime clothes or pajamas with a sleep hat. DUPLO bricks are specially designed to be fun and safe for small hands.\n\nFeatures a 3D buildable Disney Juniors Mickey Mouse puzzle.\nIncludes interchangeable day and nighttime outfits with a sleep hat for Mickey Mouse.\nHelp your young child learn to build with this simple model of their favorite character that helps develop their fine motor skills.\nInspire fun and creative play for kids with their favorite Disney character.\nDevelop language and social and emotional skills as toddlers have endless role-play fun with Mickey Mouse.\nThis LEGO® DUPLO® l Disney Juniors Mickey Mouse learning toy makes an ideal gift for preschool children.\nThe endless creative play possibilities of LEGO® DUPLO® educational toys for kids set the stage for toddlers to become creative thinkers.\nLEGO® DUPLO® products are specially designed to be fun and easy for small hands.\nMickey puzzle (with hat) measures over 6” (16cm) high, 3” (9cm) wide and 1” (5cm) deep."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/my-first-minnie-build-10897","description":"Little Disney fans will love LEGO® DUPLO® 10897 My First Minnie Build—a 3D Minnie Mouse puzzle to make from chunky DUPLO bricks. The simple tower construction makes this Disney Juniors Minnie Mouse toy easy to build, as your toddler stacks up the parts in the correct order to make the whole body. It comes with a hair bow and 2 different outfits to mix and match, inspiring creativity for kids as they rebuild Minnie in different looks. DUPLO bricks are specially designed to be fun and safe for small hands.\n\nFeatures a 3D buildable Disney Juniors Minnie Mouse puzzle.\nIncludes a hair bow and an extra interchangeable outfit for Minnie Mouse.\nHelp your child learn to build and develop fine motor skills with this simple puzzle.\nInspire role-play fun and storytelling with this iconic Disney character, helping your child pick up language development and social and emotional skills along the way.\nThis LEGO® DUPLO® l Disney Juniors Minnie Mouse toy makes an ideal gift for preschool children.\nThe endless creative play possibilities of LEGO® DUPLO® educational toys for kids set the stage for toddlers to become creative thinkers.\nLEGO® DUPLO® products are specially designed to be fun and easy for small hands.\nMeasures over 5” (15cm) high, 3” (9cm) wide and 1” (5cm) deep."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/my-first-tow-truck-10883","description":"Your child will love to rescue the broken-down car over and over again with LEGO® DUPLO® 10883 My First Tow Truck for toddlers. It’s easy to build and develops fine motor skills, while the toy tow truck and car have window bricks decorated with characters to encourage role-play. This compact little set is a great preschool toy to take and play wherever you go! DUPLO bricks are specially designed to be safe for little hands.\n\nFeatures a tow truck for kids with hook and a car.\nAlso includes a traffic cone element.\nHelp your child master basic construction skills with these 2 simple vehicles, then hook the car onto the toy truck and drive it away!\nEncourage language development and pretend play as young children play out breakdown and rescue situations.\nThe endless creative play possibilities of LEGO® DUPLO® toys set the stage for toddlers to become creative thinkers.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nMakes an ideal preschool toy for toddlers.\nTow truck toy measures over 1” (7cm) high, 3” (12cm) long and 2” (6cm) wide.\nCar measures over 2” (6cm) high, 3” (9cm) long and 2” (6cm) wide."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/fire-truck-10917","description":"Toddlers drive the red fire truck to its next exciting mission! This popular kids’ toy provides an easy-build, fun-filled play experience that supports toddlers’ first developmental milestones. Kids’ fire truck learning toy Work together to role-play all kinds of exciting, imaginative rescue missions with this cute, push-along fire truck. The easy-to-handle red truck puts control in toddlers' hands as they race to the scene of the emergency. Their fine motor skills develop as they position the ladder and move it up and down. With boy and girl firefighters aboard the truck, this fun toy teaches kids all about working together as a team to get the job done. LEGO® DUPLO® developmental toys LEGO DUPLO playsets let preschoolers and parents share precious developmental milestones. Designed to be the best toys for toddlers' needs, they provide irresistible open-ended play to encourage kids' self-expression and learning.\nAdventure awaits little firefighters as they drive the red fire truck to its next exciting mission! This fun toy set teaches toddlers all about working together as a team to get the job done.\nThe fire truck provides toddlers with a first LEGO® DUPLO® building set. The 4-wheel truck pushes along on, with boy and girl passenger decorations in the windows, and there's a movable ladder to set up for the rescue.\nThere are endless exciting rescue missions to role-play. Toddlers can drive the truck to the emergency, move the ladder up and down, then work together to assist anyone in need of help.\nAny little firefighter will want to get their hands on this fire truck toy set. Great Christmas, birthday or any-other-day gift for kids aged 18 months and up.\nThe fire truck measures over 3” (9cm) long, 2” (7cm) high and 2” (6cm) wide – just the right size to take the play wherever kids go. Combine with other LEGO® DUPLO® sets for even more fun.\nNo batteries needed. The LEGO® DUPLO® Fire Truck is fueled by kids’ imaginations – so the fun never ends!\nThe fire truck fun starts right from the box. Simple instructions provide ideas and inspiration to help parents and toddlers get the best developmental benefits from this versatile toy.\nIntroduce preschoolers to building and learning with LEGO® DUPLO® playsets. Designed to deliver open-ended creative play that inspires young minds, they feature familiar scenes, fun characters and easy-to-handle pieces.\nLEGO® DUPLO® building sets meet the highest industry standards. This means they are perfect for little fingers to pick up, place and pull apart – and it’s been that way since 1969!\nAt The LEGO Group, we drop, squash, twist, heat, bend, scratch and stretch LEGO® DUPLO® bricks and pieces to ensure they meet the highest global safety and quality standards for your little builder."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/tow-truck-10918","description":"Toddlers will pass all kinds of developmental milestones as they drive the blue tow truck to its next rescue mission! This small construction vehicle is a great first LEGO® toy to inspire young minds. Kids’ tow truck learning toy This cute, push-along tow truck with adjustable crane is a great way for toddlers and parents work together as a team to help others in difficulty. Kids can push the truck to the scene of the emergency, then use their fine motor skills to position the cone then raise and lower the crane hook. With boy and girl decorations in the windows of the tow truck, this fun toy teaches kids how to work together as a team to get the job done. Educational construction toys for toddlers With LEGO® DUPLO® playsets, preschoolers and parents can share precious developmental moments. Designed to give toddlers the best toys for their needs, LEGO DUPLO sets deliver open-ended play that encourages kids' self-expression and learning.\nAs toddlers push the blue tow truck to its next rescue mission, they learn all about working together as a team to help others and get the job done! Great kids’ first construction and developmental toy.\nThis LEGO® DUPLO® starter set includes a 4-wheel, push-along tow truck with boy and girl passenger decorations in the windows and a crane with a hook for kids to raise and lower as they carry out rescues.\nToddlers can drive the tow truck to the scene of the emergency, move the crane's hook up and down, then assist anyone in need of help. There are endless exciting rescue missions to role-play!\nAny little car-lover or roadside superhero will want to get their hands on this push-along tow truck playset. Great Christmas, birthday or any-other-day gift for kids aged 18 months and up.\nThe tow truck measures over 3” (9cm) long, 2” (7cm) high and 2” (6cm) wide – the perfect size to take the imaginative play wherever kids go. Combine with other LEGO® DUPLO® sets for even more fun.\nThe LEGO® DUPLO® Tow Truck is fueled by kids’ imaginations – so no batteries are needed to enjoy endless tow-truck adventures.\nThe tow truck fun starts straight from the box. Simple instructions provide ideas and inspiration to help parents and toddlers maximize the fun and developmental benefits from this versatile toy.\nLEGO® DUPLO® playsets unlock preschoolers' imaginations with building, learning and open-ended play. Designed to inspire young minds, the playsets feature familiar scenes, fun characters and easy-to-handle pieces.\nEver since 1969, LEGO® DUPLO® playsets have met the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® DUPLO® bricks and pieces to make sure every building set for kids meets the highest global safety and quality standards."},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/lego-duplo-farm-30326","description":"Open the bag to reveal a LEGO® DUPLO® figure or farm animal, plus 2 bricks and a flower to add to your DUPLO collection. Will you find a boy, girl, calf, goat or a hen?"},{"theme":"duplo","themeUrl":"https://www.lego.com/en-us/themes/duplo","productUrl":"https://www.lego.com/en-us/product/lego-duplo-tableware-853920","description":"Bring out this bright and fun LEGO® DUPLO® 853920 Tableware set with a cup, large plate and a smaller deep plate to make every mealtime more colorful for your child. Made from PP plastic material, this durable toddler tableware set features favorite LEGO® DUPLO® animal and food illustrations.\n\nFeatures a plastic plate, bowl and cup decorated with favorite LEGO® DUPLO® animal and food illustrations.\nMake mealtimes fun with this bright and colorful kids tableware.\nDishwasher and microwave safe.\nLarge plate diameter measures over 7” (20cm).\nDeep plate diameter measures over 5” (15cm).\nCup measures over 3” (9cm) high."}]