[{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/heartlake-city-shopping-mall-41450","description":"Delight shopping-crazy kids with the Heartlake City Shopping Mall (41450) toy. It comes with 6 characters, including a new-for-January-2021 micro-doll. Kids will love exploring the stores and food court with Emma and her family.\n\nThe ultimate shopping trip\nThis mall isn't just about clothes. There are 5 stores reflecting a kids' broad interests, from food and music, to tech and toys. It also comes with 2 separate play pieces to extend the fun. The photo booth and fashion turntable are separate from the main model, making them great interactive toys for kids – they’re small enough to pop in a bag for LEGO® fun at a friend’s house or at school.\n\nPlayset to be proud of\nKids will relish the challenge of creating this 1,032-piece set – the building process will be as much fun as the play! The 3-story set will take center stage in any kids' room and is sure to wow friends who come to play. Transport kids to Heartlake City, a place where the best days are spent hanging out with family and friends.\n\nAn extensive shopping toy, with stores, a photo booth, toy fashion stand and a food court, comes packed with clever details so kids can recreate a family day out at the Heartlake City mall.\nLEGO® Friends Heartlake City Shopping Mall (41450) includes 6 characters – 4 LEGO Friends mini-dolls, a micro-doll and a baby figure – plus accessories to bring the imaginative shopping play to life.\nThe mall has 5 stores covering a range of kids' interests, from tech and music, to fashion and toys. On the 3rd floor of this playset is a food court with a bubble-tea stand and a noodle restaurant.\nThere are lots of neat details including an ATM and baby-changing station, stores stocked with realistic accessories, a moving escalator and a slide to connect the second and third floors.\nDelight little builders aged 8+ who love to shop with this birthday or special occasion gift. This is a fantastic friendship toy that lets kids pretend to hang out at the mall with their BFFs.\nMeasuring over 10 in. (26 cm) high, 15 in. (40 cm) wide and 6 in. (16 cm) deep, this 1,032-piece interactive toy for kids will make a stunning centerpiece that will impress friends who come to play.\nIntroduce children to the world of LEGO® Friends, where everyone is welcome and kids will find a playmate who's just like them.\nLEGO® Friends sets meet stringent industry standards to ensure they are compatible and connect and pull apart consistently every time – it's been that way since 1958.\nLEGO® Friends Heartlake City sets are tested to the max to make sure they meet stringent global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/andrea-s-family-house-41449","description":"For a gift with real impact, try LEGO® Friends Andrea’s Family House (41449). Fantastically detailed, from the solar panels on the roof to the mini keyboard in the garage studio, this premium playset will delight LEGO Friends fans and wow buddies who come to play.\n\nRooms galore to explore\nKids can hang out in Andrea's bedroom or make cupcakes in the kitchen with the cute cooking accessories. There's a heart-shaped pool and a cool garage studio with musical toys where Andrea and her friends can put on a show for the neighborhood! The roof features solar panels, helping the family live in a modern way, and the top floor is removable, making it easy for little fingers to explore the features.\n\nSo many parts to play!\nThe set comes with 5 LEGO Friends mini-dolls – including Liz, Andrea's little sister, a new-for-January-2021 micro-doll – so there are limitless ways for kids to play out LEGO family life. Introduce kids to Heartlake City where kids will find a best friend who's just like them!\n\nWow little builders with the 3-story LEGO® Friends Andrea’s Family Home (41449). Kids can explore the cool features and act out family life within the walls of this premium-quality playset.\nWith 5 LEGO® Friends mini-dolls, this beautifully styled set includes a whole family of characters, including a new-for-January-2021 micro-doll, to inspire limitless family role-play fun.\nKids can put on a music show for the neighbors from the garage studio, hang out in Andrea's bedroom, pretend to take a dip in the pool or make a meal in the modern kitchen diner.\nEnvironmentally conscious kids will love how this house is fit for the future, thanks to its solar panels on the roof. Like all LEGO® Friends house sets it comes packed with cool accessories.\nCleverly designed to make play easier, the playset's top floor is removable so the downstairs level is accessible. In the kitchen the work bench swings out to let little fingers in.\nLooking for a birthday gift to impress a kid who's into dolls’ houses? Boys and girls aged 6+ will love to unwrap this premium toy and share the playing-house fun with their friends.\nMeasuring over 7 in. (20 cm) high, 10 in. (26 cm) wide and 4 in. (12 cm) deep, this creative gift makes an eye-catching display without taking up too much room.\nIntroduce trend-setting kids to the welcoming world of LEGO® Friends, where everyone's included and every face fits.\nThis LEGO® house playset meets stringent industry standards to ensure its bricks are compatible and connect and pull apart consistently every time – it’s been that way since 1958.\nThe bricks and components of this mini-dolls’ house are tested to the max to ensure they meet stringent global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/heartlake-city-movie-theater-41448","description":"Treat kids to a red-carpet play experience as they imagine attending a movie premier at the LEGO® Friends Heartlake City Movie Theater (41448). This gift for kids features an art deco-style cinema packed with authentic details, such as a VIP area, popcorn kiosk and slushy cups. It comes complete with a starlet, ready to sign autographs for adoring fans. Everything in a toy a kid needs to transport them to a glamorous night at the movies.\n\nIn the director's chair\nThe model is hinged so kids can open it out to reveal a VIP screening room with exclusive seats for 5 of their most fabulous friends. The characters can ‘view’ the film on the screen, but this also flips to accommodate a cell phone, so kids can play director by showing their very own movies.\n\nRealistic role-play adventures\nLEGO Heartlake City birthday gifts for kids come packed with real-world details and relatable characters. They encourage kids to conjure up a creative world of role-play fun, alone or with their friends and family.\n\nDazzle a movie-mad youngster with LEGO® Friends Heartlake City Movie Theater (41448). It’s premier night at this vintage-style cinema, with a red carpet and a glamorous LEGO Friends movie star!\nThis hinged toy playset features a ticket desk and red-carpet area on one side and opens out to form a screening room, restroom and popcorn kiosk. Includes LEGO® Friends Andrea and 2 other mini-dolls.\nKids can role-play superfan Andrea or movie star Amelia, or they can pretend to sell tickets andpopcorn. Movie-mad kids can imagine they’re a VIP watching the premier or operate the toy projector.\nThe Heartlake City cinema lets kids screen their own movie creations for the mini-dolls by resting a cell phone against the screen, which also flips to support a tablet.\nAs with all LEGO® Friends sets, this model is packed with cool accessories to make the action come alive – this set includes tickets, paper and pen, popcorn, slushy cups and cash bills.\nPut a smile on the face of movie-mad kids aged 7+ with a birthday, Christmas or special-occasion gift of this interactive Heartlake City movie theater toy.\nMeasuring over 6.5 in. (17 cm) high, 10 in. (27 cm) wide and 7 in. (19 cm) deep, this kids’ movie toy makes a head-turning centerpiece that will take pride of place in any bedroom.\nLEGO® Friends toys come with relatable characters and are packed with adorable toy accessories to set imaginations soaring.\nAll new LEGO® Friends sets meet stringent industry standards toensure they are compatible, and connect and pull apart consistently every time – it’s been that way since 1958.\nPopular LEGO® toys are tested to the max to make sure they meet stringent global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/heartlake-city-park-41447","description":"Give little builders an invitation to a fabulous party at the LEGO® Friends Heartlake City Park (41447) playset. Kids who like nothing more than hanging out with friends will love pretending to help Henry celebrate his birthday with his buddies.\n\nThe delight is in the detail\nWith lots of play starters, plus 3 mini-dolls and 1 micro-doll, this LEGO Friends set lets kids use their creativity to come up with fun friendship stories. They can bash the piñata for kids and release the candy, join their friends on the gazebo’s spinning dancefloor or sail around the lake in the elegant swan boat. It also has a wealth of cute accessories, such as LEGO balloons, a kite with a flexible tail and a nut for the squirrel, to help fire the imaginative play.\n\nEveryone is welcome to play\nIntroduce little builders to the world of Heartlake City, where children will find friends who are just like them and where every kid's invited to join in the fun.\n\nDo you know a child who loves celebrating? Make their day with the creative gift of LEGO® Friends Heartlake City Park (41447)! Packed with features, it gives kids hours of imaginative friendship play.\nThis set comes with 3 LEGO® Friends mini-dolls and 1 micro-doll, plus a squirrel figure, so there's loads of role-play to be had with this birthday gift for kids.\nFrom pounding the piñata to boogying on the dancefloor, kids can recreate their favorite party activities. If the fun gets too much, they can cool off with a boat ride on the lake.\nKids will fall for the cute details. The piñata is packed with candy; the kite has a flexible tail; and the dancefloor has a spinning function so the mini-dolls look like they’re dancing.\nThe ideal birthday present for kids aged 6+, this set also makes a great special occasion gift or just-because treat. Clear instructions mean little building experience is required.\nMeasuring over 5.5 in. (14 cm) high, 11.5 in. (30 cm) wide and 4.5 in. (12 cm) deep, this 432-piece set packs loads of play into neat dimensions.\nHeartlake City gifts for kids are filled with realistic details to help kids play out real-world scenarios and explore their passions with the very best of friends.\nThe building components of this LEGO® new toy meet stringent industry standards to ensure they are compatible and connect and pull apart consistently every time – it's been that way since 1958.\nThis popular LEGO® toy is tested to the max to make sure it meets rigorous global safety standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/heartlake-city-vet-clinic-41446","description":"Do you know a kid who loves character role play and caring for animals? The Heartlake City Vet Clinic (41446) is just the creative gift for them! It comes with a total of 8 – yes, 8! – LEGO® Friends characters, including mini-dolls and a range of baby animal toys, so kids can play out any role they want.\n\nPacked with features to spark hours of play\nThe model comprises a reception area, a stable for LEGO Friends Mia's horse, an examination room stocked with children's vet kit and a look-out balcony. The set also comes with a road scene to add an element of rescue drama to the LEGO Friends animal play. Kids can pretend to be Savannah bringing her guide dog in for a check-up, look after the cute baby animals in the clinic or act out an exciting horseback rescue. And as with all the popular Heartlake City toys, boys and girls can explore their passions in the company of their BFFs.\n\nKids can channel their love of creatures into creative play with the Heartlake City Vet Clinic (41446), where they can be the hero of the day, or simply care for animals in need.\nThis quick-to-build set includes 8 characters so kids can play out open-ended stories of animal care. There are 3 mini-dolls, a guide dog, horse toy with saddle, kitten, puppy and a baby turtle.\nKids can join Donna the vet as she looks after the baby animal toys in the clinic, help Savannah bring her guide dog in, or join Mia on horseback as she saves the baby turtle from the busy road.\nAn everyday gift for kids that lets boys and girls aged 6+ express their caring side. Includes clear instructions so kids with any level of building ability can quickly start to enjoy the animal fun.\nThe set measures over 6 in. (16 cm) high and 6 in. (16 cm) wide – small enough to keep out on display so kids can dip in and out of the fun, caring play.\nNew for January 2021 is a baby cat and dog, plus Bella, a horse toy whose movable head lets kids help her reach down to eat the food Mia has put out in her stable.\nThe LEGO® bricks in the set combine with all other LEGO sets for limitless play and hours of creativity.\nWith the popular Heartlake City toy playsets kids can pursue their passions and explore relationships in the company of the relatable LEGO® Friends characters.\nLEGO® components meet stringent industry standards to ensure they are compatible and connect and pull apart consistently every time – it’s been that way since 1958.\nLEGO® bricks and components are tested to the max to make sure they meet stringent global safety standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/heartlake-city-organic-cafe-41444","description":"Looking for a creative birthday gift for a kid who cares about the planet? The LEGO® Friends Heartlake City Organic Café (41444) will keep them entertained for hours. Not only can they pretend to whip up tasty creations in the toy kitchen, but this sustainability toy also lets them imagine growing the ingredients in the café's garden.\n\nModern way to play\nThis café and kitchen set is brimming with clever details to delight any environmentally conscious kid. Boys and girls can help LEGO Friends Mia sort the waste at the recycling station. The cute juice bike means mini-dolls can travel around Heartlake City, sharing their delicious drinks in an emission-free way!\n\nWelcome to Heartlake City\nWith LEGO Friends, kids can explore their passions, embark on exciting missions or simply experience the joy of friendship in the company of relatable characters who are just like them.\n\nPacked with play starters, Heartlake City Organic Café (41444) comes with a toy kitchen garden and a juice delivery bike for boys and girls who want to build a better planet, brick by brick.\nIncludes 3 mini-dolls for limitless role-play fun, including a new-for-January 2021 grandpa mini-doll and granddaughter micro-doll, plus cute details and realistic features for kids to explore.\nKids can pretend to grow fruit and veg, bake bread, build sandwiches, serve customers, sort recycling and hang out with friends. They can extend the play by delivering drinks on the juice bike.\nPerfect, feature-packed present for kids who care for the environment. Foodie boys and girls will have hours of fun preparing tasty treats with this creative gift, which is ideal for ages 6 and up.\nThis café playset measures over 4 in. (11 cm) high, 10 in. (27 cm) wide and 3 in. (10 cm) deep, so it takes up little space when kept out on display.\nPacked with accessories to get creative juices flowing,this playset comes with an oven, blender, coffee machine, sandwich display shelf and lots of food elements to make the café play come to life.\nIntroduce youngsters to the world of popular Heartlake City toys, where they’ll meet characters who care as much for the planet we live on as they do about their friends.\nLEGO® building components meet stringent industry standards to ensure they are compatible, and connect and pull apart consistently every time – it's been that way since 1958.\nThis LEGO® food playset’s bricks and components are tested to the max to make sure they meet stringent global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/vet-clinic-ambulance-41445","description":"Want to keep a pet-obsessed child playing happily for hours? Gift them the Vet Clinic Ambulance (41445) toy. Packed with features and including 2 mini-dolls, this LEGO® Friends animal rescue toy makes a great impulse gift for boys and girls who love playing with pets.\n\nPick-up-and-play set\nWith lots of play starters this set is perfect for fun everyday play sessions. Kids can explore the cat's tree house home or launch a rescue when the kitten falls into the river. A neat cog function turns the water into swirling rapids to dial up the drama. Kids can lower a basket to scoop up the kitten and save the day!\n\nLots of realistic details to explore\nThe ambulance has a hinged panel so there’s easy access for the creative make-believe play to continue inside. Cute accessories will help immerse kids in the nurturing, animal-care play. Introduce boys and girls to the world of LEGO Friends, where they'll learn that when working as a team with their buddies, they'll always get the job done.\n\nThe Vet Clinic Ambulance Toy (41445) contains a cute, brick-built tree house and rescue vehicle to spark animal-saving storytelling and teamwork play.\nThis LEGO® Friends animal rescue toy includes 2 mini-doll figures, cat and kitten toys and a kids' rabbit toy, as well as lots of fun children's vet kit accessories for an immersive play experience.\nPerfect for short everyday play sessions, this set has a bucket to scoop the kitten from the rapids, an ambulance packed with vet kit and a tree house that children can explore with the animal toys.\nThis fun-packed set makes a great impulse gift for animal-loving kids aged 6+ who deserve a treat. No building knowledge is needed – LEGO® Friends toys come with clear step-by-step instructions.\nThe ambulance measures over 3 in. (8 cm) high and 4 in. (12 cm) long, so it's perfectly portable for pet rescue at home or beyond! It's also compatible with other LEGO® sets for truly creative play.\nThe ambulance has a side-hinged panel so little fingers can reach in to play. It also comes with lots of vet’s kit, such as a stethoscope, x-ray, ice pack and otoscope to immerse children in the play.\nWinding bucket and spinning rapid functions add to the excitement of this animal rescue toy and help give this great-value holiday or birthday gift for kids a big-toy feel.\nThe Vet Clinic Ambulance is compatible with the Vet Clinic Rescue Buggy (41442) and Heartlake City Vet Clinic (41446), opening up a world of caring LEGO® Friends animal rescue play.\nLEGO® toy playsets meet stringent industry standards to ensure they are compatible and connect and pull apart consistently every time – it’s been that way since 1958.\nLEGO® bricks and components are tested to the max to make sure they meet rigorous global safety standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/doggy-day-care-41691","description":"Looking for a gift for a kid who loves dog toys? The LEGO® Friends Doggy Day Care (41691) set is a fantastic choice. It comes packed with details and 2 LEGO Friends mini-dolls to help animal-mad kids get lost in hours of creative story-making play.\n\nGrow vivid imaginations\nThere are loads of ways for kids to imagine having fun with the dogs in their care. They can help LEGO Friends Emma give the dogs a scrub in the pool, take them for exercise in the garden and teach them how to run through an agility tunnel. It’s packed with cute accessories kids will fall in love with – there’s a neat grooming set and even a little doggy poop to clear up!\n\nOpen up a world of creative play\nHeartlake City playsets come with relatable characters and real-world details to help little builders explore their passions with new-found friends by their side.\n\nGive kids who love baby animal toys hours of creative fun with the LEGO® Friends Doggy Day Care (41691) animal playset, where they can pretend to look after puppies while the dogs’ owners are at work.\nIncludes LEGO® Friends Emma and Roxy mini-dolls, a dog figure and a new-for-January-2021 puppy figure. Also comes with a grooming area, cash register, separate bathing pool and agility tunnel.\nThis gift for kids is brimming with scenarios for creative play. They can imagine grooming the dogs, playing with them in the garden, scrubbing them in the pool or selling dog snacks to customers.\nDelight a dog-mad kid with this animal toy. It makes the ideal birthday or Christmas gift or impromptu present for kids aged 6+. Little building experience is needed to construct this toy playset.\nThis doggy-topped set looks great on display. It measures over 5 in. (13 cm) high, 6 in. (17 cm) wide and 3 in. (9 cm) deep, so it won't take up much room and can be kept out ready for anytime play.\nThis great-value puppy toy for kids comes packed with cute accessories, such as a ball, bone, stick, cookie, box of food, shampoo and a brush – and even a poop! – to get imaginations firing.\nIntroduce little builders to Heartlake City, where they can explore their passions in the company of great friends.\nThe building components of this LEGO® new toy meet stringent industry standards to ensure they are compatible, and connect and pull apart consistently every time – it's been that waysince 1958.\nLEGO® Friends sets are tested to the max to make sure they meet rigorous global safety standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/heartlake-city-bakery-41440","description":"Help youngsters develop their building skills with this Heartlake City Bakery (41440) gift for kids. This simple café set lets kids join LEGO® Friends Stephanie and Olivia as they display their tasty treats and share them with their friends.\n\nLearn to build\nThis LEGO bakery 4+ set is packed with engaging details to ensure youngsters have a great play experience. Each bag of bricks contains a complete model and character that kids can build quickly to get the play started fast! It also comes with 2 Starter Bricks that give youngsters a partly constructed base.\n\nGreat fun for families\n4+ sets are the perfect way for adults to share the building fun with kids. It’s easy to get started – as well as a paper guide, this set comes with Instructions PLUS, available on the free LEGO Building Instructions app. It includes zoom, ghost and rotate tools to help children get to grips with the building process. It also lets them save their progress so they can jump back into the build anytime.\n\nThe great-value Heartlake City Bakery (41440) helps kids learn to build as they role-play working in a café, delivering cakes on a cool scooter and hanging out with their friends.\nThis snack-sized bakery set features 3 characters, including a cute dog figure, for limitless role-play fun. Starter Bricks also help get the building going, so there's more time to play!\nThis LEGO® Friends set is packed with cute bakery toy accessories, including a pretzel, dish, helmet, mug, ice-cream scoop,croissant, cake, pie and a bone for the dog.\nA convenient birthday present for a boy or girl aged 4+ who deserves a treat. Reward hard work with a creative everyday gift that entertains for hours and teaches construction skills.\nMeasuring over 5 in. (13 cm) wide, this set takes up little room while on display. Because it's compatible with all LEGO® bricks, it can also be expanded as kids' construction confidence grows.\nWant to give young builders an even more fun building experience? Now you can with digital Instructions PLUS! Zoom, rotate, ghost and save modes help make building a breeze.\n4+ playsets provide a fun way for youngsters to learn to build, while growing their confidence with easy building steps. They let kids and grown-ups discover the joy of building and playing together.\nLEGO® components meet strict industry quality standards to ensure they are easy for little fingers to pick up and build with – it's been that way since 1958.\nLEGO® bricks and pieces are tested in almost every way imaginable to make sure they meet stringent safety standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/vet-clinic-rescue-helicopter-41692","description":"Do you know a child who has a passion for pets? Give them this LEGO® Friends Vet Clinic Rescue Helicopter (41692) toy and let them enjoy hours of exciting bunny-saving stories.\n\nSwoop into action\nThe animal playset comes with a cute lakeside jetty, a picnic scene and a heart-shaped island on which the bunny is stranded. Kids who love cool vehicles will get in a spin for the colorful helicopter toy, which lands on the lake to rescue the rabbit. It's kitted out with a stretcher, baby bottle, syringe and revolving rotors.\n\nPlaysets with heart\nLEGO Friends sets all come with relatable characters and cute baby animal toys, which help little animal-lovers express their nurturing instincts. Introduce kids to the caring, sharing world of Heartlake City, a place of exciting missions and everyday heroes.\n\nDelight a little hero with the LEGO® Friends Vet Clinic Rescue Helicopter (41692) toy. Kids can play out limitless animal-saving stories as they swoop to rescue a stranded bunny.\nThis colorful children’s animal playset includes LEGO® Friends Stephanie and Mia mini-dolls, a rabbit and a bunny toy, and a helicopter with spinnable rotors, vet's kit and a hinged rear tailgate.\nKids can pretend to have a picnic with their pet rabbit, fly into action to rescue the bunny from an island, stretcher it to safety and care for once it’s been saved from the claws of the crab.\nThis baby animal toy makes a great birthday or Christmas gift for kids aged 6+ who love imaginative rescue play.\nThe helicopter measures over 4 in. (10 cm) high, 7 in. (19 cm) long and 1.5 in. (5 cm) wide – small enough for kids to keep out, ready for LEGO® Friends animal rescues anywhere in their bedroom!\nCompatible with Vet Clinic Rescue Buggy (41442), Vet Clinic Ambulance (41445) and Heartlake City Vet Clinic (41446) animal rescue toys to open up a world of caring LEGO® Friends play.\nIntroduce kids to Heartlake City, where kids can learn that every mission is possible with the help of their friends.\nThe building components of this LEGO® new toy meet stringent industry standards to ensure they are compatible and connect and pull apart consistently every time – it's been that way since 1958.\nLEGO® bricks and components are tested to the max to make sure they meet stringent global safety standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/olivia-s-electric-car-41443","description":"Kids who love caring for the planet are going to love LEGO® Friends Olivia’s Electric Car (41443). Let them enjoy road-trip role play as they imagine driving to the countryside. This set lets children who love vehicles – but also care for the planet – embark on hours of open-road adventure.\n\nA modern way to play\nThe colorful electric car toy fits 2 mini-dolls – Mia and Olivia – and there's space on the rear seat for puppy Elliot. Included in the set is a charging station that continues the green theme with its toy wind turbine and solar panel. Kids can then exit their pit stop leaving zero emissions in the air!\n\nToys with heart\nIntroduce little builders to the world of LEGO Friends, where they can learn to make the world a cleaner, more caring place in the company of relatable and recognizable characters. Kids can combine this toy with any other LEGO bricks they have at home, helping their imaginations really take flight.\n\nLEGO® Friends Olivia’s Electric Car (41443) is the perfect playset for kids who love vehicles and the environment. The buildable toy car sparks creative storytelling and open-ended adventures!\nThis LEGO® Friends playset includes 2 mini-dolls and a puppy figure as well as a buildable car. It also features a charging station with a toy wind turbine, plus a picnic spot.\nThe electric toy car's wheels spin so kids can ‘drive' it round. It hooks up to the charging station with a hose and kidscan spin the turbine sails to ‘generate’ the electricity.\nDelight car-crazy boys and girls who want to indulge their passion for a greener, modern way of life. It’s an ideal birthday or special-occasion creative gift for children aged 6 and up.\nThe car measures over 2 in. (6 cm) high and 4 in. (11 cm) long. The wind turbine stands over 5 in. (13 cm) high, 3 in. (9 cm) wide and 2 in. (6 cm) deep.\nPopular LEGO® Friends toys come with colorful buildings, cool toy vehicles and relatable characters that stimulate kids to explore their passions amid realistic settings.\nThe building components of this LEGO® new toy meet stringent industry standards to ensure they are compatible, and connect and pull apart consistently every time – it’s been that way since 1958.\nLEGO® bricks and components are tested to the max to make sure they meet rigorous global safety standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/emma-s-dalmatian-cube-41663","description":"Looking for a spot of LEGO® fun to reward a little builder? LEGO Friends Emma’s Dalmatian Cube (41663) toy is the portable playset that will keep animal-mad kids happy on the move. Inside this birthday gift for kids is a LEGO Friends Emma mini-doll toy, celebrating her Dalmatian puppy's birthday.\n\nDoggy treats on the go\nSmall enough to slip into a bag, this cute portable toy packs in the animal play to brighten up the longest journeys. It's also perfect for a pop of LEGO Friends fun at school recess, or on a playdate. And if you think Dalmatians are always black and white, think again! Kids will find out the color of their dog only once they open the box!\n\nPassions at play\nIntroduce kids to popular LEGO Friends Cubes toys, which let kids play out their love for animals wherever they are!\n\nProvide adventures on the move with LEGO® Friends Emma’s Dalmatian Cube 41663 portable animal toy set. Kids can play out a pet party scene then close the box of their new toy for fun on the go.\nInside this puppy toy for kids is a LEGO® Friends Emma mini-doll toy, a cute dog figure in a surprise color and a bunch of toy accessories to help stimulate kids' imaginations.\nKids can play with the animal toys inside or outside of the cube, or pack them up for fun on the go.\nThe easy builds in the cubes are a great way to introduce kids to the LEGO® Friends world. This Dalmatian toy makes the perfect impulse reward, birthday gift or holiday gift for kids aged 6+.\nThis cube measures over 2.5 in. (7 cm) high and 3 in. (8 cm) wide, making a cute little desk display thanks to its new-for-January-2021 textile ears and doggy face.\nIntroduce children to the world of Heartlake City, a place of exciting missions and fabulous friendships, where kids can explore their passions with characters who are just like them.\nThe building components of this new toy meet stringent industry standards to ensure they are compatible, and connect and pull apart consistently every time – it’s been that way since 1958.\nThe bricks and components of this LEGO® Friends set are tested to the max to make sure they meet rigorous global safety standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/mia-s-pug-cube-41664","description":"Looking for a cute treat to reward little builders? LEGO® Friends Mia’s Pug Cube (41664) is sure to give them all the feels! This birthday gift for kids has sweet ears and a doggy face. Inside the portable playset is a mini-doll, a pug pup in a surprise color, plus realistic grooming accessories so kids can pretend to care for the pooch. There's even a shovel to scoop a little poop!\n\nTake-out treats\nPopular LEGO Friends Cubes make the perfect impulse treat for dog-loving kids who love takingtheir toys outside the home. This fun LEGO set is small enough to pop in a bag to take away and share with a friend.\n\nInspire pet-care fun on the move with LEGO® Friends Mia’s Pug Cube (41664). This cute, dog-styled toy box lets kids pretend to look after a puppy. Small in size, it’s a top gift for fun on the go.\nIncludes a LEGO® Friends Mia mini-doll toy and a pug toy in a surprise color as well as a buildable cabinet to store the pug's chew bone and dog biscuit.\nKids can play with the cube's elements outside the cube, or pack them up for fun on the go.\nAn adorable, just-because, creative gift for kids aged 6+ who love to play with animal toys. These simple builds make a great first step into the exciting universe of LEGO® construction fun.\nMeasures over 3 in. (8 cm) wide and 2.5 in. (7 cm) high. Thanks to its textile ears and pug face, this pocket-sized portable toy is the perfect gift to add a dash of doggy cuteness to a kid's desk.\nIntroduce children to the world of LEGO® Friends Heartlake City, colorful playsets with relatable characters that give kids hours of solo fun and are also great to explore with their BFFs.\nThe durable, portable toy is built to withstand life on the move. LEGO® products meet stringent industry standards to ensure they’re compatible and connect and pull apart consistently every time.\nLEGO® Friends creative gifts are tested to the max to make sure they meet stringent global safety standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/olivia-s-flamingo-cube-41662","description":"Give kids an unexpected treat with LEGO® Friends Olivia’s Flamingo Cube (41662). The cute case features a flamingo face and is topped with textile ‘feathers’. Inside the box is the popular LEGO Friends Olivia toy, flamingo and frog figures, plus a host of other accessories to spark creative play.\n\nMake-believe on the move\nThis portable playset will help kids while away long journeys. Their imaginations will run wild as they play with the toy flamingo in the jungle setting. All the elements pack away into the durable, pink case and because they’re made from LEGO pieces the mini-dolls and features fix onto the base so they shouldn’t go missing on kids’ travels.\n\nLike and share\nLEGO Friends Cubes are packed with play value making them great birthday gifts for kids' classmates. The cubes are small enough to pop in a bag for a playdate or recess fun at school.\n\nLEGO® Friends Olivia’s Flamingo Cube (41662) is a portable jungle playset enclosed in a bright, flamingo-themed carry case. On-the-go jungle fun for animal-loving kids who deserve an anytime treat!\nContains the popular LEGO® Friends Olivia mini-doll toy, a flamingo toy in 1 of 4 different colors, frog figure, buildable lake scene, camera, watermelon and watermelon slice.\nKids can play with the elements outside of the cube or pack up the pieces of this portable toy for fun on the go.\nThe perfect, impromptu, special-occasion or birthday gift for kids aged 6+ who love to play with compact animal toys.\nMeasuring over 4.5 in. (11 cm) high and 3 in. (8 cm) wide, this cube makes a fun, compact desk decoration with new-for-January-2021 textile ‘feathers' and a cute flamingo face.\nIntroduce children to the world of Heartlake City, a place of creative fun and fabulous friendships, where kids will find characters just like them – and where everyone is invited!\nThe building components of this new LEGO® toy meet stringent industry standards to ensure they are compatible, and connect and pull apart consistently every time – it’s been that way since 1958.\nLEGO® Friends sets are tested to the max to ensure they meet stringent global safety standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/stephanie-s-cat-cube-41665","description":"Encourage kids’ love of animals with the just-because gift of LEGO® Friends Stephanie’s Cat Cube (41665). Inside the shell of this portable toy, boys and girls will find a LEGO Friends Stephanie mini-doll toy and her cat, which comes in 1 of 4 colors.\n\nPack-up pet care\nLet youngsters enjoy role-play fun pretending to look after the kitty as if it's their very own pet. They can try to stop the kitten toy for kids climbing the tree and bothering the bird by coaxing it back to its cat gym. LEGOFriends Cubes make the perfect travel companion. All the elements fix to the portable toy’s base, which means no more missing pieces! Back at home, this birthday gift for kids looks great on display thanks to its cute cat ears and feline features.\n\nA world of fun with friends\nLet youngsters explore their passions with the help of the LEGO Friends girls. Popular Heartlake City toys come with realistic features, cute animals and relatable characters that kids will discover are just like them.\n\nGive the impromptu gift of LEGO® Friends Stephanie’s Cat Cube (41665) portable animal toy playset. A great toy to take on a playdate, it also looks cute displayed in a bedroom.\nLEGO® Friends Cubes pack big fun into a little space. Inside this one is a LEGO Friends Stephanie mini-doll toy, a cat figure in a surprise color, a bird and a buildable kitty gym.\nKids can play with the elements outside of the cube, or pack them up for fun on the go.\nAn adorable just-because creative gift forkids aged 6+ who love to play with animal toys. These simple builds make a great first step into the exciting universe of LEGO® construction fun.\nThe cube measures over 2.5 in. (7 cm) high and 3 in. (8 cm) wide and the cute cat styling ensures kids will want to keep this portable toy out on display.\nIntroduce children to the LEGO® Friends world of Heartlake City, a place of exciting imaginative play, where kids will find characters that are just like them and everyone is welcome.\nThe building components of this new toy meet stringent industry standards to ensure they are compatible and connect and pull apart consistently every time – it’s been that way since 1958.\nThe bricks and components of this LEGO® Friends creative gift are tested to the max to make sure they meet stringent global safety standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/vet-clinic-rescue-buggy-41442","description":"Looking for a great-value, creative gift for an animal-mad kid? The Vet Clinic Rescue Buggy (41442) provides hours of exciting LEGO® Friends animal rescue play for children who love to swoop into action and save the day!\n\nFeature-packed for action fun\nThis little rescue toy has loads of cool features and accessories to inspire quick, creative play. There's a pretty riverside scene where LEGO Friends Stephanie and her dog can picnic. The tree is hinged so it can ‘trap' the dog, sparking the rescue play. The drivable quad bike has a chain to winch the fallen tree and there’s lots of cute accessories so kids can look after the saved pup.\n\nMaking miniature heroes\nThis quick-to-build vet toy is the ideal gift for kids who love to play the hero. Luckily, they won't need a heroic effort to build this set, which includes Instructions PLUS. Available in the LEGO Building Instructions app, this digital guide includes zoom, rotate and ghost modes to make the building process as clear as possible.\n\nVet Clinic Rescue Buggy (41442) is a compact pet-in-peril playset. Kids can pretend to race to the aid of an animal in trouble, freeing it from a fallen tree with an all-action quad bike.\nThis rescue toy includes 2 LEGO® Friends mini-doll characters, a new-for-January-2021 puppy figure, a cute buildable countryside picnic scene and a quad bike.\nKids can pretend to picnic and play with the puppy or ramp up the drama by making the tree fall to trap the dog. They can use the quad bike to lift the tree, freeing the pooch and saving the day!\nChildren will love the vet kit that comes with this LEGO® Friends set. It includes a feeding bottle and bone for the dog, walkie-talkie, chain to lift the tree, picnic-cloth tile, sandwich and a mug.\nA convenient holiday, Christmas or birthday present for a boy or girl aged 6+ who deserves a treat. Reward hard work with this creative everyday gift that inspires fun hours of rescue storytelling.\nThe waterfall and quad bike each measure over 2 in. (6 cm), so they’re small enough to leave out for kids to enjoy instant rescue fun whenever they want.\nWant to give young builders a building experience that’s even more fun? Now you can with digital Instructions PLUS! With zoom, rotate, ghost and save modes, it helps make building a breeze.\nThe Vet Clinic Rescue Buggy is compatible with the Vet Clinic Ambulance (41445) and Heartlake City Vet Clinic (41446), opening up a world of caring LEGO® Friends animal rescue play.\nLEGO® components meet stringent industry standards to ensure they are compatible and connect and pull apart consistently every time – it’s been that way since 1958.\nLEGO® bricks and components are tested to the max to make sure they meet stringent global safety standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/summer-fun-water-park-41430","description":"Do you know a little builder who deserves a big treat? This awesome building toy for kids who love a construction challenge and creative play. The Summer Fun Water Park toy set (41430) is packed with cool details to keep kids entertained for hours. It has not 1 but 3 slides, including a new-for-June-2020 covered tube slide.\n\nA swimmingly good time\nFor added fun there's a water cannon and a splash bucket that tips on the press of a button to douse friends below. It's not all about the water park splash fun. though. At the back of the model is a wealth of calming features to extend the play. Kids can imagine soaking in the hot tub, getting a massage or chilling in the sun loungers.\n\nHave fun with Friends\nIntroduce kids to the happy world of Heartlake City, where they can go on adventures with LEGO Friends Stephanie, Emma, Mia, Olivia and Andrea, and all the other characters from the TV show. It's a place where they'll always find creative, fun friends waiting to play.\n\nBring the fun of the water park to kids’ bedrooms with this featured-packed toy. LEGO® Friends Summer Fun Water Park set (41430) will keep kids entertained for hours as they tackle the build then explore all the details.\nLEGO® Friends Stephanie, Emma and Olivia buildable mini-doll figures are along for the ride and Mason is on hand as a lifeguard. New-for-June-2020, Pinky the flamingo figure brings a splash of color.\nThere are so many ways to play with this fun toy. Mini-dolls can zoom down the 3 slides or relax in the hot tub. Kids can imagine they’re the lifeguard keeping an eye on the swimmers or serve in the ice cream van.\nWant to keep a little builder busy? Then this will make a great birthday present or holiday gift for them! With 1001 pieces, it will stimulate kids aged 8+ and the finished set will be one they'll be proud to display.\nMeasuring over 12\" (31cm) high, 12\" (33cm) wide and 7\" (19cm) deep this is a sizeable playset but if kids want to make it even bigger, no problem! It can combine with any other LEGO® bricks they already have at home.\nThis toy needs no batteries and is powered by kids’ imaginations alone, so the summer fun role-play need never end.\nLEGO® playsets are designed to promote independent play, which is why every set comes with easy-to-follow instructions so kids can build by themselves and feel the pride of completing a construction project without help.\nLet kids embark on a LEGO® Friends summer adventure where good times and a warm welcome await. In Heartlake City youngsters will learn that with the help of their friends they can achieve whatever their hearts desire.\nLEGO® building kits meet the highest industry standards, plus the LEGO Group’s own quality criteria, which ensures they are easy for little fingers to pick up, place and pull apart – it's been that way since 1958.\nThe LEGO Group tests its bricks and pieces to make sure every building kit meets the highest global quality standards, making LEGO® sets some of the best – and safest ¬– toys for kids."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/jungle-rescue-base-41424","description":"Inspire wildlife adventure play with the Jungle Rescue Base (41424). From scanning the forest with a drone to save stricken animals to helping in the clinic, kids will find lots of ways to play with this cool jungle tree house playset. LEGO® Friends is proud to support the work of National Geographic Explorers.\n\nAll bases covered\nThis fun set has broad appeal. Kids who love dramatic, creative play will love the animal rescue story, where LEGO Friends Andrea, Mia and Olivia and the elephants save a stranded sloth. Kids can show their caring side as they take the injured animal back to the jungle tree sanctuary. Budding scientists will love using tech kit in the solar-powered watchtower to keep the jungle creatures safe.\n\nEveryone’s included\nIntroduce kids to the Jungle Rescue series, creative fun playsets will help them feel they're one of the team. To make construction even more fun, download the LEGO Building Instructions app to access Instructions PLUS where they can view their build digitally!\n\nLEGO® Friends is proud to support the work of National Geographic Explorers who use their creativity, curiosity and passion to protect endangered species in our jungles, and help build a better world for all of us.\nLet animal-mad kids embark on a LEGO® Friends adventure as they help rescue the sloth from the forest and bring it back to their tree house sanctuary with this Jungle Rescue Base (41424) playset.\nThis tree house playset includes 3 buildable mini-doll figures, plus 2 elephant and 2 sloth figures. Cool accessories, such as toy walkie-talkies, animal-rescue kit and a robot-drone, keep the play creative.\nThis rescue station playset comprises a clinic and a watchtower connected by a rope bridge. The friends can speed to save a sloth stuck in a tree in the quad bike, while the hut gives them a place to hang out.\nKids aged 8+ will find this rescue station building set a satisfyingly stretching construction challenge. It makes a top holiday gift or birthday present for kids who love looking after and playing with animals.\nThe tree house measures over 11” (28cm) high and 12” (31cm) wide and looks great on display. Kids can expand the play by adding any other LEGO® bricks, since all LEGO toys are compatible.\nNo batteries are needed to fire up the exciting jungle action – the sloth's tree ‘catches light' by way of a manual push function. That means the rescue role play can start as soon as the build's complete!\nThis awesome jungle rescue toy comes with step-by-step instructions. To boost the build fun, download the LEGO® Building Instructions app to access the intuitive Instructions PLUS so kids can zoom, rotate and view their build.\nLEGO® Friends sets meet the highest industry standards, plus the LEGO Group's own rigorous quality criteria, so they are consistent, compatible, and connect and pull apart easily – it's been that way since 1958.\nAs well as meeting the highest global safety and quality standards, LEGO® building toys are tested to the max by the LEGO Group so you can be certain you’ve bought a playset that is safe for kids to use."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/party-boat-41433","description":"The Party Boat (41433) transports kids to the beach where they can lose themselves in hours of seashore fun. This toy boat playset set comes with 3 buildable mini-doll figures and lots of summer vacation kit, so kids can act out a variety of fun beach scenarios.\n\nOcean fun in the sun\nThis water party boat packs in the play starters. Kids can imagine renting beach kit ready for the party. Budding performers will love to play Andrea, toy microphone in hand, entertaining her guests. On board they can pretend to take the helm and sail the boat or relax in the detailed cabin. Active kids can take on the part of Ethan, pounding the waves on his water scooter.\n\nEveryone’s invited to this LEGO® Friends party\nTake kids on a trip to Heartlake City, home of the LEGO Friends girl squad. Stephanie, Mia, Olivia, Emma and Andrea are waiting to welcome kids to their world of exciting adventures, everyday heroes and fabulous friendships. These playsets encourage creative play and make building fun.\n\nKnow a child who loves going to parties? Then the Party Boat playset (41433) is for them! Fire their imaginations with this building kit, which allows kids to role-play fun times with friends on a cool cruiser.\nThis toy boat set includes 3 mini-doll figures and a flamingo toy figure for plentiful play opportunities. This boat toy also comes with a water scooter, flamingo boat and a beach store to further extend the play.\nKids can pretend to be LEGO® Friends Andrea, Emma or Ethan sailingthe party boat or relaxing on deck while playing with the flamingo, serving in the store renting out beach kit or riding the water scooter.\nKids aged 7+ who love the spotlight will love being the star aboard the Party Boat (41433) toy playset. This 640-piece LEGO® set makes a great birthday present or holiday gift for kids who love collecting quirky vehicles.\nMeasuring over 4” (12cm) high and 13” (35m) long, this boat takes up little space on display. If kids want more even features they can add any other LEGO® brick they have, since all LEGO sets are compatible.\nNo batteries required! This set is powered by kids’ imaginations – there are 2 spray elements that make the boat look as if it’s moving, just to help them along the way.\nAs with all LEGO® sets, this boat toy comes with clear printed instructions that mean kids aged 7+ will find building this boat a breeze.\nTake children on a holiday getaway to Heartlake City and let their imaginations set sail on a voyage of adventure, with their best LEGO® Friends by their sides.\nLEGO® sets meet the highest industry standards, plus the LEGO Group’s own quality criteria. They’re consistent, compatible and connect and pull apart easily every time – it’s been that way since 1958.\nThe LEGO Group tests its bricks to the max to ensure that every one of its awesome toy playsets meets the highest global quality standards, making LEGO® fun toys some of the best, and safest, toys for kids."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/friendship-bus-41395","description":"Let creative kids embark on a journey of adventure with this LEGO® Friends set. Aboard this feature-packed mini-doll bus they will discover endless imaginative play options thanks to its many cool features and accessories.\nThis toy bus comes with LEGO® Friends Stephanie, Mia and Olivia mini-dolls. Creative kids can expand their imaginations as they help the girls from Heartlake City explore the fun features and mini-doll accessories.\nKids can imagine bunking up with buddies in the bedrooms, towing stricken vehicles with a winch, paddling in the onboard pool or stargazing from the top deck, which slides back to give access to the mini-doll beds.\nThis LEGO® Friends Bus (41395) makes a great birthday gift for kids aged 8+ who love quirky toy vehicles and have a little building experience. This is a stimulating build and will give a sense of pride when it’s complete.\nThis bus come with lots of mini-doll accessories but because it measures around 5” (14cm) high and 11” (30cm) wide, it can fit any other LEGO® pieces kids want to pack. All LEGO sets are compatible with this fun toy!\nDynamic play is part of the ride. Far from being a static bus model, this kid’s toy bus has wheels that really turn. But no batteries are needed – this LEGO® Friends bus is powered by imagination.\nThis bus playset comes with easy-to-follow instructions, so even if your kid’s new to LEGO® sets and building, they’ll be on the road to role-play adventures in no time at all!\nInspire kids to embark on a Heartlake City adventure, where they’ll find they can explore horizons and interests new with their besties by their side.\nEver since 1958, LEGO® bricks have met the highest industry standards, ensuring they are consistent and compatible with connections as strong as any LEGO Heartlake City friendship.\nAt The LEGO Group, we drop, squash, twist, heat, bend, scratch and stretch LEGO® bricks and pieces to make sure every LEGO building set for kids meets the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/heartlake-city-airplane-41429","description":"Let kids’ imaginations take flight with the Heartlake City Airplane (41429). Kids will love playing out holiday getaway stories in this realistic airplane playset. Just like the real thing, there are movable boarding steps, a cockpit and hand luggage compartments – there's even a trolley!\n\nExploring a world of possibility\nThis feature-packed airplane toy lets kids play out real-life scenarios. Children love nothing more than playing out the grown-up world, and with this set they can do just that, pretending to scan tickets and checking in their luggage. Clever details, such as chair-mounted TV screens, really bring the play to life. With the 3 mini-doll figures, kids can imagine being a passenger or the pilot flying the plane.\n\nIn the heart of the action\nTake your little builder on a holiday getaway to Heartlake City, a place of exciting adventures and everyday heroes, where kids will find that everyone is included in the fun and there's a character who's just like them.\nThe sky’s the limit with Heartlake City Airplane (41429). Aboard this feature-packed airplane toy kids will discover endless fun creative travel scenarios thanks to its many cool features and accessories.\nKids can create fun airplane adventures with LEGO® Friends Stephanie and Olivia buildable mini-doll figures. They can check them in and help them board or imagine flying the plane with the pilot figure in the cockpit.\nSet features a flight deck, movable food trolley with airplane snacks and bathroom area. Suitcases go in the hold. The cabin opens up to reveal hinged luggage compartments, and there’s a check in desk and flight stairs.\nThis 574-piece travel playset makes a great holiday gift for kids aged 7+ who love quirky toy vehicles and have a little building experience. This is a stimulating build and will give a sense of pride when it's complete.\nThis airplane toy measures over 5” (13cm) high, 14” (36cm) long and 12” (33cm) wide. As all LEGO sets are compatible, this awesome toy combines with any other LEGO® bricks kids have at home for a truly creative playtime!\nDynamic play is part of the ride. There are lots of cool moving parts, such as the hinged hand-luggage compartments and rolling food trolley. No batteries are needed – this vacation toy flies on kids' imagination alone!\nThis airplane model comes with easy-to-follow instructions, making it a great building set for kids new to LEGO® fun toys. Thanks to its clear printed guide they'll be taxiing towards to exciting role-play fun in no time!\nLEGO® Friends playsets help kids play out scenes from the TV show, where the girls from Heartlake City embark on exciting adventures or have fun simply hanging out with their BFFs!\nEver since 1958, LEGO® bricks have met the highest industry standards ensuring this vacation toy's components are consistent and compatible, with connections that will easily withstand the odd bit of turbulence!\nBricks and pieces of LEGO® awesome toys are testedin almost every way imaginable. This ensures each playset meets the highest global quality standards, making LEGO® sets some of the best ¬– and safest – toys for kids."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/alpaca-mountain-jungle-rescue-41432","description":"Do you know a kid who loves rescue adventure play? Help them get lost in hours of creative fun as they play out heroic scenes with the Alpaca Mountain Jungle Rescue (41432) volcano building kit. LEGO® Friends is proud to support the work of National Geographic Explorers.\n\nSo many ways to play\nKids can help the mini-dolls rescue the alpacas from the jungle's exploding volcano or explore the mountain caves and unearth natural treasures. If they prefer simply hanging out with friends, they can do that too in the toy cabin. It comes with cute food elements, animal rescue kit and research accessories, such as a toy walkie-talkie, flashlight and magnifying glass.\n\nRescue action stations\nLEGO® Friends animal rescue playsets let youngsters enjoy the excitement of taking on a mission and saving the day! They'll also love this set's enhanced building experience. Download the LEGO Building Instructions app and they can access Instructions PLUS to view their creation in zoom, rotate and visualize modes!\n\nLEGO® Friends is proud to support the work of National Geographic Explorers, who use their creativity, curiosity and passion to protect endangered species in our jungles and help build a better world for all of us.\nImmerse children in exciting mountain adventures with this colorful and detailed brick-built exploding volcano building toy for kids who love action play, exploring nature and caring for animals.\nWith Alpaca Mountain Jungle Rescue (41432), kids can play out exciting jungle stories with the help of LEGO® Friends Stephanie and Mia buildable mini-doll figures, 3 alpaca figures and cute bat and bird figures.\nKids can pretend to climb the mountain, report the eruption and whizz down the zip line to the toy cabin. They can paddle the canoe or fly the rescue helicopter toy. When the jungle rescue's over, they can explore the caves.\nThere are lots of ways to play with this 512-piece mountain adventure toy, making it a brilliant birthday present or holiday gift for boys and girls aged 7+ who love rescue adventure play and caring for animals.\nMeasuring over 8” (22cm) high and 7” (20m) wide, this volcano toy makes a great display centerpiece. It’s compatible with all LEGO® sets, so kids can combine it with any other LEGO bricks for truly creative fun.\nThis mountain playset needs no batteries. Instead, clever design brings the play to life – a button function shoots out lava elements and opalescent bricks help make the cascade's water look like it's actually falling.\nThe action begins with the build! All LEGO® toys come with a clear guide, but this one also has Instructions PLUS on the LEGO Building Instructions app, where kids can view their creation in rotate, 3D and zoom modes!\nLEGO® awesome toys have met the highest industry standards, plus the LEGO Group's own rigorous quality criteria, which ensures that they connect perfectly and pull apart easily every time – it's been that way since 1958.\nLEGO® Friends bricks and build kits are tested to the max, which means this building toy for kids meets the highest global safety and quality standards – and might even withstand a volcanic eruption!"},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/beach-house-41428","description":"Let little builders ride the wave of summer adventure fun with the LEGO® Friends Beach House (41428). This brick-built beach house is filled with kit to help youngsters get absorbed in summer vacation play. Kids can pretend to make a burger in the kitchen, pedal the paddleboat, ride the surfboard toy or stop a cheeky crab from stealing their toy camera.\n\nSunset sounds\nThis 444-piece set really crams in the fun. There's an outside shower and a bathroom where the girls can prepare to party. The roof flips up to reveal a DJ terrace complete with speakers, lights and a keyboard. Kids can imagine dancing the night away with friends at a cool beach party. After all that fun there’s a cozy bedroom, which comes with 2 bunks and a desk for the girls to get comfy in at night.\n\nJoin the LEGO Friends party\nIntroduce kids to the world of LEGO Friends. Let them explore their interests and passions with Olivia, Mia, Stephanie, Emma and Andrea. They're guaranteed to find a friend who's ‘just like them’.\n\nEntertain kids for hours with this feature-filled Beach House (41428). Packed with cool details, such as a DJ rooftop terrace, snack bar and hammock, it will immerse youngsters in endless creative play!\nKids will love to act out beach play with the buildable LEGO® Friends Mia and Andrea mini-doll figures. There's also a new-for-June 2020 flamingo figure and a dolphin figure to help them create endless summer adventures.\nKids can imagine frolicking in the waves with a toy surfboard, sunbathing on the hammock under the palm tree and relaxing with the mini-doll figures in bedroom. The hinged roof lifts revealing a DJ terrace.\nThis building toy for kids makes a top birthday, Christmas or holiday gift kids aged 6+ who love imaginative role play. This 444-piece playset will also delight those who enjoy a rewarding construction project.\nThe beach house toy measures over 6” (17cm) high, and 8” (21cm) wide and looks awesome when built and displayed. This summer fun gift for kids combines with any other LEGO® sets for extra creative fun.\nNo batteries are needed to power this set’s outdoor summer fun. All it requires is kids’ imagination for the creative play to go on and on.\nAs with all LEGO® building kits, this playset comes with clear instructions designed so kids aged 6+ can follow them and complete their build without adult help, encouraging independence and boosting confidence.\nIntroduce your young builder to the world of LEGO® Friends. A warm welcome awaits them in Heartlake City, where kids can achieve anything they set their hearts on, with their best friends by their side.\nLEGO® fun toys meet the highest industry standards plus the LEGO Group’s own quality criteria, which ensures they are easy for little fingers to pick up, place and pull apart – and it's been that way since 1958.\nThe LEGO Group tests its playsets to ensure all the bricks and pieces meet the highest global safety and quality standards, making them some of the best – and safest – toys for kids."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/heartlake-city-hospital-41394","description":"Kids can learn the value of caring for others while role-playing as a doctor, ambulance driver or patient with this LEGO® Friends Heartlake City Hospital toy playset (41394). It makes the best gift toy for children aged 6+ who will love acting out authentic scenarios in the hospital's reception area, the examination, recovery and storage rooms and its rooftop garden. So many ways to play! Buildable medical equipment, such as the X-ray scanner and microscope, plus bandage, stethoscope, syringe and thermometer accessories inspire imaginative play, as do the 3 mini-doll figures – LEGO Friends character Emma, Ethan and Dr. Maria. Add to the creative play possibilities with the toy ambulance to transport injured Ethan to the hospital, plus a stretcher and a wheelchair. Introducing LEGO Friends… LEGO Friends building sets are the best toys to encourage young kids to explore their interests with the help of the 5 girls from Heartlake City – Stephanie, Mia, Andrea, Emma and Olivia.\nKids discover the joy of caring for others when role-playing as doctor, patient and visitor Emma, and recreate real-life scenarios with this colorful and detailed LEGO® Friends Heartlake City Hospital (41394) playset.\nThe hospital’s examination room, with a buildable X-ray scanner, rooftop garden and medical accessories, plus 3 mini-doll figures – LEGO® Friends character Emma, Ethan and Dr. Maria – will spark children's creativity.\nKids will love pretending to drive the LEGO® toy ambulance, which has space for a patient and a stretcher in the back. A mini-doll wheelchair and medical accessories add to the imaginative play options.\nThere are so many ways to play with this 379-piece LEGO® set, making it a fun toy birthday gift, holiday gift or special surprise for kids aged 6+ to enjoy on their own or to share the fun with their friends.\nThe LEGO® hospital measures just over 7” (19cm) high, 8” (22cm) wide and 2” (6cm) deep, so this compact set won't take up much storage space. Kids can also combine it with other LEGO® sets for even more playtime fun.\nNo batteries are required with this building set for kids – constructed purely with LEGO® bricks, it is the best toy for powering up children’s free-thinking creativity, so the fun adventures never stop.\nThinking of buying this doctor toy for someone new to LEGO® models? No problem – it comes with easy-to-follow, step-by-step building instructions. Open the box and away they go!\nIntroduce young builders to the world of LEGO® Friends. A warm welcome awaits them in Heartlake City, where kids can explore their interests with their best friends by their side.\nLEGO® building bricks meet the highest industry standards plus our own quality criteria. Kids building this LEGO Friends playset will find the bricks connect strongly and pull apart easily every time.\nLEGO® bricks and pieces are tested in every way imaginable to guarantee that every young builder's LEGO Friends set meets the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/4-stephanie-s-house-41398","description":"Let little builders get lost in family-life role-play with LEGO® Friends 4+ Stephanie’s House (41398). They can pretend to be Stephanie hanging out in her cozy bedroom or play at being mom and dad looking after their girl and her dog Dash.\n\nAccess all areas\nThe upstairs section is removable, making it easy for little fingers to play with all the cool downstairs details. It also means 2 friends can share the fun, playing with a floor each at the same time! The house comes with lots of cute features to bring the creative fun to life, plus a miniature swing that extends play outside of the house.\n\nIdeal preschool playset\nThis LEGO 4+ set is a fun way for creative preschool kids to learn to build and includes 2 special Starter Bricks that let first-time builders take pride in constructing playsets all on their own. This set comes with Instructions Plus on the LEGO Building Instructions app, where kids can view their creation digitally to help grow their imagination and construction confidence.\n\nHelp little builders enjoy hours of imaginative play with 4+ Stephanie’s House (41398). Preschoolers will love to build then play house, recreating scenes from the LEGO® Friends TV series or inventing their own.\nThis kids’ toy comes with LEGO® Friends Stephanie, Alicia and James mini-dolls, a dog, plus all the bricks needed to build a 2-story house with a bedroom, restroom, kitchen, dining room and garden swing.\nThis building kit comes with a Starter Brick baseplate and wall element, making building simple so the family role-play fun can begin quickly. Cute accessories, such as the mini croissant, encourage creative play.\nThis is a great holiday gift for kids who love role-playing family life. The neat 170-piece set is also an ideal gift for kids aged 4+ who deserve a spur-of-the moment treat.\nMeasuring over 6” (16cm) high by 4” (12cm) wide, this 170-piece set takes up little room on display. And it's compatible with other LEGO® pieces, so kids can extend the play with any other sets they have at home.\nThis fun toy needs no batteries. Kids simply open the box and find the Starter Bricks to begin constructing this colorful and creative building!\nThis 170-piece mini-doll toy set includes a guide for build and play to help youngsters understand the purpose of the building steps and develop their confidence.\nFeaturing a Starter Brick baseplate and wall element to make building simple and boost kids' confidence, 4+ Stephanie's House is a great holiday gift to introduce younger children to the everyday heroes of LEGO® Friends.\nEver since 1958, LEGO® bricks have met the highest industry standards, plus the LEGO Group’s own quality criteria, which ensures they connect perfectly and pull apart easily when it’s time for a new build.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure that every young builder's LEGO Friends kids' toy meets the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/baking-competition-41393","description":"It’s showtime! Bring the drama of TV baking contests into kids’ bedrooms with this LEGO® Friends Baking Competition set (41393). Let them express their creativity as they decorate the toy cakes in crazy ways to impress the judges. Or role-play the judge deciding who will win the trophy. Feed imaginations This pretend play cooking set is packed with realistic kitchen equipment, play food, and cute utensils and accessories to realistically recreate the baking shows kids watch on TV. Cool functions such as the rotating cake stands and the spinning ingredients wheel help to inspire imaginative play. And the whole set is modular so kids can set it up and play with it the way they choose. Life’s sweeter with Friends Introduce children to LEGO Friends, where kids can play out the adventures of the TV series, meeting LEGO Friends characters that are just like them. In Heartlake City they'll always have a buddy they can explore their interests with, because there's always room for one more friend.\nEncourage creative play as kids help LEGO® Friends characters craft amazing LEGO cakes in this baking competition cooking toy playset. They’ll love pretending to perform under the heat of the studio cameras!\nThis feature-packed Baking Competition (41393) food playset includes 3 mini-dolls, 2 cook stations with rotating cake stands, lots of baking accessories, such as toy food and icing, and kitchen equipment.\nKids will get lost in this feature-packed LEGO® set. They can pretend to cook on the hob, role-play the judge, go behind the cameras, help put out a kitchen fire or make a new creation by adding their own LEGO bricks.\nThere are so many ways for kids aged 6+ to enjoy hours of creative food play fun with this 361-piece LEGO® set. It makes a great birthday or holiday gift for those new to LEGO toys or fans of the Friends TV show.\nThis modular set can be separated to spread the cake joy around a bedroom. But since it measures just over 5” (15cm) high and 11” (30cm) wide, it won’t take up much room when all the elements are displayed together.\nThis LEGO® Friends set comes with everything kids need to recreate a TV baking competition scene. Batteries aren’t needed to kick-start the action – the creative fun comes from kids' imaginations.\nAs with all LEGO® sets, this cooking toy comes with clear printed instructions. They are designed to be easy for kids aged 6+ to follow so they can get on and build without a grown-up's help.\nIntroduce kids to the exciting world of LEGO® Friends. It’s a place where kids can learn that it is possible to achieve their dreams when they follow their hearts.\nLEGO® building sets for kids meet the highest industry standards plus The LEGO Group’s own quality criteria, which ensures they are easy for little fingers to pull apart – and it's been that way since 1958!\nThe LEGO Group tests its bricks and pieces to the max to make sure every little builder's playset meets the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/heartlake-city-brick-box-41431","description":"Give a gift that keeps on giving with this LEGO® Heartlake City Friends Brick Box (41431). Inside the pretty purple brick box are all the elements to build 6 sets from Heartlake City. Each scene transforms into a different scene, giving hours of imaginative play as kids create, play and build again. Flexible fun x 6! There are a trio of fun scenes to build and then transform: the café playset becomes a wading pool, the colorful music shop turns into a DJ booth and performance stage, and the horse park transforms into a treehouse playset. These scenes all fit together to make the ultimate place to hang out, where the Friends girls and their small toy animals can watch a performance from their treehouse or wading pool! Discovering the world with friends Introduce your child to Heartlake City where they can explore their interests – from science and nature to music and sports – accompanied by the girls from LEGO® Friends.\n\nInspire hours of imaginative play with this LEGO® Creative box containing all the bricks needed to construct 3 scenes, each of which can be built into a second, different scene, then combined to form one cool composite Heartlake City hangout.\nThis 321-piece set becomes a toy café, a horse park and a toy music shop with fun accessories and 2 mini-dolls to encourage imaginative play. Kids can rebuild each element into a new scene or join them together.\nKids can explore a range of passions when playing with this toy playset’s 6 scenes, from animal care to performing on stage. And by adding extra LEGO® bricks from other sets they can expand their creative, imaginative play.\nThis Heartlake City Brick Box (41431) is a great birthday, holiday or anytime-surprise gift for kids aged 5+ who love toys that create open-ended play. It makes a top gift for children who have a range of interests.\nThe creative brick box measures just over 7” (18cm) high and 13” (35cm) wide, making it a convenient way to enjoy LEGO® fun away from the home. And by adding bricks from other sets, kids can get lost in a world of creative play!\nNo batteries are needed for these rebuildable toys, so the fun never ends. Kids can enjoy the feeling of independent play and being a ‘self-starter' without needing to ask grown-ups for batteries.\nThis LEGO® playset comes with clear, easy-to-follow instructions for all 6 scenes, meaning even those with little LEGO building experience will be off the blocks and playing with their fun toy in no time at all.\nIntroduce kids to Heartlake City, a world of endless possibilities where children will be immersed in open-ended play in the company of their best LEGO® Friends Olivia, Andrea, Mia, Stephanie and Emma.\nLEGO® Friends toy playsets meet the highest industry standards, which ensures they are easy for little fingers to pick up, place and pull apart – it's been that way since 1958.\nAt The LEGO Group, we drop, squash, twist, heat, bite, scratch and stretch the bricks in this and all our playsets to ensure they meet the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/tiger-hot-air-balloon-jungle-rescue-41423","description":"Let children set sail on a LEGO® Friends adventure with the Tiger Hot Air Balloon Jungle Rescue (41423). Kids can pretend to take to the skies to rescue a toy tiger cub from a waterfall. This set comes with 2 tiger cubs, plus a toy parrot and baby turtle toy. LEGO Friends is proud to support the work of National Geographic Explorers.\n\nMany ways to play\nIn this jungle rescue animal playset are a wealth of wildlife adventure play starters. Kids can observe the toy baby tigers in their cave home or explore the rocky waterfall and discover diamonds. If they want to up the drama, they can use the tilting function to upend characters into the bubbling waters and kickstart a daring hot air balloon rescue.\n\nAction stations\nThese rescue playsets let youngsters feel the thrill of embarking on an exciting mission! Even the build will be a blast – this set comes with Instructions PLUS on the LEGO Building Instructions app. Using the zoom, rotate and visualize modes, kids will feel like master builders!\nLEGO® Friends is proud to support the work of National Geographic Explorers who use their creativity, curiosity and passion to protect endangered species in our jungles, and help build a better world for all of us.\nImmerse kids in exciting wildlife adventures with this colorful and detailed brick-built toy hot air balloon set for children who love action play, exploring nature and caring for animals.\nKids can invent exciting jungle stories with the help of a brick-built, hot air balloon toy, LEGO® Friends Emma and Andrea buildable mini-doll figures, 2 baby tiger toys, plus a number of other cute animal figures.\nKids will love pretending to fly the hot air balloon toy and dangling its basket for the cubs to jump into. The waterfall features 2 functions that let kids flick characters into the water for a dynamic play experience.\nThere are lots of ways to engage with this 302-piece tiger toy set, making it a brilliant birthday, Christmas present or holiday gift for boys and girls aged 7+ who love creative animal play and fun toys.\nMeasuring over 5” (15cm) high and 4” (11cm) wide, the waterfall is the perfect size for display. And since it is compatible with all LEGO® sets, kids can combine it with any other LEGO bricks to make a truly creative playset.\nNo batteries are needed to spark this action play. Manual tilt functions bring an element of dynamic play and opalescent bricks help give the cascade the appearance of falling water.\nKids new to LEGO® toys? LEGO sets come with a clear guide to make building a breeze. This one also Instructions PLUS on the LEGO Building Instructions app, where youngsters can rotate and zoom in on their set.\nLEGO® bricks meet the highest industry standards, plus the LEGO Group's own rigorous quality criteria, which ensures that they connect perfectly and pull apart easily every time – it's been that way since 1958.\nLEGO® Friends bricks and build kits are tested to the max to ensure they meet the highest global safety and quality standards. They might even withstand a tiger cub attack!"},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/emma-s-fashion-shop-41427","description":"Kids with a passion for fashion and dressing up are going to love Emma’s Fashion Shop (41427). Set over 2 floors, this feature-packed playset houses a fashion store where kids can help the mini-dolls choose a new look courtesy of a cool style spinner that lets them mix and match outfits. Kids can then dress them in the neat rotating changing room, complete with reflective mirror.\n\nDesigned for fun!\nBudding fashionistas can play out their designer dreams in the Emma's studio where there's a sofa area where the clothing creations are dreamt up over a cup of coffee. The studio also has a sewing area and a balcony. Kids can also remove the studio for easy access to the shop below. Or two friends can play in the 2 areas at the same time!\n\nRealistic role-play adventures\nHeartlake City sets offer youngsters an exciting build-and-play experience. Introduce your little builder to the world of LEGO® Friends, where Stephanie, Mia, Emma, Olivia and Andrea are waiting to welcome any child tothe fun.\n\nLet kids play in style with Emma’s Fashion Shop (41427). There’s a store downstairs where youngsters can make-believe shopping for clothes and a tailor’s studio upstairs for designing and making pretend outfits.\nThis build kit comes with a studio and a tailor's shop, 2 buildable mini-doll figures, and fashion accessories, such as the new-for-June 2020 shiny textile skirts, scissors and fabric, sparking hours of creative play.\nKids can remove the top floor to play with the store and studio areas separately. This also gives better access to the store’s fun features, such as the spinning style selector and the revolving changing room.\nLooking for fun toy for kids aged 6+? This 343-piece set makes a great holiday gift or birthday present for boys and girls who love fashion role play, or those who love to get immersed in a rewarding building project.\nThis 2-story fashion store measures over 6” (17cm) high and 6” (16cm) wide makes an awesome toy display in any bedroom. Kids can also combine it with other LEGO® toys for even more creative playtimes.\nWith so many awesome features this shopping toy playset for kids will provide hours of entertainment, and as it needs no batteries, the fun goes on and on.\nAs with all LEGO® building kits, this fashion playset comes with clear instructions designed so kids aged 6+ can follow them and complete their build without adult help, encouraging independence and boosting confidence.\nIntroduce kids to the world of LEGO® Heartlake City, a place of exciting missions, cute pets, happy hang-outs and fabulous friendships.\nEver since 1958, LEGO® building kits have met the highest industry standards plus the LEGO Group’s own quality criteria, which ensures that little fingers can connect and pull them apart easily every time.\nLEGO® bricks and pieces are stringently tested so you can be sure that this building toy for kids meets the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/nature-glamping-41392","description":"Encourage kids’ zest for the outdoors with this LEGO® Friends Nature Glamping (41392) toy camping set. There are loads of features to keep kids playing for hours. Let them imagine cycling through the woods with LEGO Friends Olivia and Mia mini-dolls. Or they can play with the toy squirrel or pretend to stargaze with a telescope. Camping in style This is no back-to-basics camping toy. In the LEGO tent are beds and even a smartphone so the girls can send pics back to Heartlake City. Kids willlove pitching the mini-doll tent with its pretty soft plastic roof, then decorating the camp with a garland of lights. And once the toy camp is set up, they can imagine relaxing in the hot tub. Instructions de luxe It’s not just the camping in this nature gift for kids that's state-of-the-art, but the instructions too! Download the LEGO Life app to access Instructions Plus so your kid can watch their toy camp take shape in rotate, zoom and ‘ghost' modes. It's building for the digital age!\nHelp your child develop a love of the outdoors with this cute LEGO® Friends Glamping toy for nature-lovers. They’ll have hours of fun pretending to make camp, explore nature and relax with their friends.\nThis pretend camping toy includes a LEGO® tent with a soft plastic roof, 2 mini-dolls, a toy squirrel, a pretend campfire, a telescope and even a hot tub – everything a kid needs for an immersive play camp experience.\nKids will love building the tent, with its tactile, soft plastic roof, and making it cozy by laying out the beds and dressing table. Wheeling the mini-dolls around on the LEGO® bicycle adds a dynamic aspect to play.\nWith 241 pieces, Nature Glamping (41392) makes a fun birthday gift, holiday gift or a surprise toy for kids aged 6+ with a little building skill. Make a nature lover's day with an impromptu treat of this camping toy.\nMeasuring over 3” (9cm) high and 5” (15cm) wide, the tent makes a neat desk display. Kids can further brighten up their room by separating the toy tree and fire or by customizing them using bricks from other LEGO® sets.\nNo batteries are needed to power this pretend camping toy. The lights twinkle thanks to clear, colored plastic bricks – and children’s imaginations!\nIs your little builder ready for an awesome play experience? Download the LEGO® Life app and help them use Instructions PLUS to see their camping toy in zoom, rotate and ‘ghost' modes. It's building for the digital age!\nEven on a camping trip beyond the boundaries of Heartlake City, kids can still explore a world of interests and activities, with their best friends by their side.\nLEGO® sets meet the highest industry standards plus The LEGO Group’s own quality criteria. They’re consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nThe LEGO Group tests its bricks and accessories to the max to ensure that every one of its toy playsets meets the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/panda-jungle-tree-house-41422","description":"Let your kid embark on a wildlife adventure as they pretend to nurse rescued pandas with this LEGO® Friends Panda Jungle Tree House playset (41422). Looking for the best toy to keep creature-crazy kids aged 7+ entertained for hours? You found it with this tree house playground that comes complete with monkey bars and a cool slide. LEGO Friends is proud to support the work of National Geographic Explorers.\n\nFollowing in the footsteps of their best friends\nBring the popular LEGO® Friends TV series into kids’ bedrooms as little builders re-enact scenes from their favorite show. All the cute animal rescue kit helps youngsters get lost in the exciting creative play of inventing their own stories. This jungle animal playset encourages kids to learn to care for animals and the environment.\n\nBoost the building fun\nDownload the LEGO Building Instructions app and access Instructions PLUS, which let kids rotate, zoom and visualize their model before it's even built!\n\nLEGO® Friends is proud to support the work of National Geographic Explorer who use their creativity, curiosity and passion to protect endangered species in our jungles, and help build a better world for all of us.\nKnow a kid who loves caring for animals? Then the Panda Jungle Tree House (41422) is the treat for them. They'll love pretending to nurse the rescued pandas and playing with them in this fun, colorful panda playset.\nKids can spend hours role-playing the caring rescuers and acting out stories for the buildable mini-doll figures and 3 panda toys. The set features monkey bars, a seesaw and slide, making it the perfect panda playground.\nJust one of the awesome toys in the LEGO® Friends Jungle Rescue theme. Kids can help the buildable figures scan the forest, move the baby pandas around on a toy wooden cart or whizz them down the slide.\nThis 265-piece playset is the ideal birthday, holiday or anytime gift for kids aged 7+ who love wildlife adventures, or budding environmentalists who want to care for the planet and its animals!\nThe tree house measures over 6” (17cm) high and 6” (16cm) wide, making it neat enough to keep out on a desk. Its vibrantly colored jungle elements ensure it’s an eye-catching piece kids will be proud to display.\nNo batteries are required to power up this LEGO® panda set's play, so this toy is ready to go whenever kids are in the mood for some creative jungle fun.\nThis panda playset comes with clear instructions kids can follow easily. Make the build even more fun – download the LEGO® Building Instructions app and head to Instructions PLUS where kids can view their build in 3-D!\nEver since 1958, LEGO® building toys for kids have met the highest industry standards, plus the LEGO Group's own rigorous quality criteria, which ensures the bricks connect perfectly and pull apart easily.\nLEGO® bricks and pieces are tested in every way you can imagine, ensuring all LEGO Friends playsets meet the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/andrea-s-car-stage-41390","description":"What could be more exciting than cruising to a concert on the beach in a cool roadster with your besties? Help kids feel the excitement of going to see live music with their friends with LEGO® Friends Andrea’s Car & Stage (41390) — they’ll feel very grown-up indeed! LEGO Friends pop star Andrea can switch between singing into the mic and playing the saxophone, so kids can explore a range of performing talents. Sweet ride A roofless roadster is the type of car any kid aspires to drive! And this cool, candy-colored toy car for kids will take pride of place in any bedroom. There’s space for 2 mini-dolls, while fitting the speakers of the LEGO stage to the car’s LEGO boombox allows for interactive play. Build in full effect Download the LEGO Life app and let kids get the most out of their creative play. In addition to the easy-to-follow printed instructions, this set comes with Instructions PLUS, which lets them zoom, rotate and view a ‘ghost' build on their device, for building fun from every angle!\nDo you know a child who loves motors and music? Then this set is for them! Let them imagine picking up friends in a cool LEGO® car to watch a concert. Or they can pretend to be the star performing on the toy stage. v Inside the box you’ll find everything kids need to build a cool open-top LEGO® car with a LEGO boombox. There are also 2 mini-dolls, a parrot figure and a toy stage on which LEGO Friends pop star Andrea performs.\nKids can pop 2 mini-dolls in the car and drive them around. They can then decorate their ride by adding the toy stage’s speakers to the LEGO® boombox. They’ll also love customizing Andrea’s look by dressing her in a fabric skirt.\nBoys and girls aged 6+ who seek the spotlight will love being the star with Andrea's Car & Stage (41390) toy playset. This LEGO® set makes a great birthday or holiday gift for kids wanting to add to their toy car garage.\nThe LEGO® car is just over 1” (4cm) high and 4” (12cm) long – small enough to pop into a backpack to take on a playdate. And to make it really stand out, kids can customize it with bricks from their other LEGO sets.\nAndrea’s stage is garlanded with lights. These don’t need batteries to twinkle, just children’s imaginations, so the creative play can start straight away.\nAll LEGO® sets come with easy-to-follow printed instructions, but this one also uses Instructions PLUS. Simply download the LEGO Life app and help your child see their construction come to life in a digital dimension!\nIntroduce your child to the welcoming world of Heartlake City and let their imagination set sail on a voyage of adventure, with their best LEGO® friends by their side.\nLEGO® sets meet the highest industry standards plus our own quality criteria. They’re consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nThe LEGO Group tests its bricks and accessories to the max to ensure that every one of its toy playsets meets the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/baby-elephant-jungle-rescue-41421","description":"Let kids play the hero as they race to rescue a baby elephant from the swamp! Baby Elephant Jungle Rescue (41421) is packed with features to inspire imaginative play. Working as a team with the LEGO® Friends girls, kids can get lost in hours of adventure play. LEGO Friends is proud to support the work of National Geographic Explorers.\n\nRolling into action\nVehicle-mad kids will love driving to the drama in the cool toy truck. It has a spade to dig at the mud and a hook to drag the animal fromthe swamp. A neat toy trailer hitches to the purple toy truck to tow the calf to safety. This is a great holiday gift for kids who love action-packed role play. The LEGO Friends animal rescue playsets also broaden kids’ horizons as they lose themselves in creative action fun.\n\nHigh-tech building help\nInstructions PLUS is available in the free LEGO Building Instructions app. This digital interactive guide has zoom and rotate viewing tools to help kids build. It's a super-cool way to construct!\n\nLEGO® Friends is proud to support the work of National Geographic Explorers who use their creativity, curiosity and passion to protect endangered species in our jungles, and help build a better world for all of us.\nTreat animal-loving children to the gift of a jungle adventure with this Baby Elephant Jungle Rescue (41421) set, which includes a forest scene and a truck, designed to inspire open-ended, creative play.\nThis set comes with 2 buildable mini-doll figures, a baby elephant toy and a range of cool accessories, such as a toy walkie-talkie and toy baby feeding bottle, which will inspire hours of hands-on, creative fun.\nKids can use the toy walkie-talkie to call for help, drive the truck to the swamp, haul the elephant toy out of the mud with the winch, then feed and care for it while they drive back to safety.\nNeed a brilliant birthday present or holiday gift for animal-mad kids aged 6+? Then look no further. This playset is a great way to introduce youngsters to LEGO® Friends or to thrill fans who already love the TV series.\nThe jungle scene measures over 3” (10cm) high and 3” (9cm) wide, so it’s easy to store. It’s compatible with all LEGO® sets, so kids can drive the purple toy truck off to join any other LEGO set they already own.\nNo batteries are required to complete this jungle mission – just grit, determination and LEGO® Friends Stephanie and Emma on your team.\nLEGO® sets come with clear instructions, making them the best building toys forkids. Head to Instructions PLUS in the LEGO Building Instructions app where kids can zoom, rotate and visualize this model as they build.\nEver since 1958, LEGO® bricks have met the highest industry standards, plus the LEGO Group’s own rigorous quality criteria, which ensures they connect perfectly and pull apart easily when it's time for a rebuild.\nLEGO® bricks and pieces are tested to the max to ensure that all LEGO Friends playsets meet the highest global safety and quality standards. They may even be baby elephant-proof…"},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/heartlake-city-hair-salon-41391","description":"Where better to meet up with friends and share a gossip than at the salon? This toy hair styling set is brimming with scenarios for imaginative play. There’s a whole host of cute hairdressing toy salon accessories, such as toy hair dryers and toy wigs, to get imaginations sparking. With LEGO® Friends Heartlake City Hair Salon (41391) kids can role-play the client or the stylist – there's loads of crazy cuts waiting to be made. Action stations Wonderfully detailed stations allow kids to see the mini-doll figures progress through the pretend hair salon. Cute features include a shell-shaped sink, a hair-cutting chair, a styling station and a cash register. Purple bangs anyone? Instructions volumized All LEGO sets come with super-simple printed instructions, but the Heartlake City Hair Salon also features a fully enhanced building experience. Download the LEGO Life app and go to Instructions PLUS to access zoom, rotate and ‘ghost' modes. It's building for the digital age!\nGive little stylists hours of creative play with LEGO® Friends Heartlake City Hair Salon. They can pretend to cut and style their friends’ hair or imagine they are the client going to the play hair salon for a new do!\nThe set is packed with features to get imaginations firing. There are 2 mini-dolls, 2 hairdressing chairs, a hair-washing sink and lots of accessories, such as toy brushes and toy wigs, to create a realistic salon experience.\nKids will have loads of fun watching the mini-doll figure’s transformation as she progresses through the stations of the salon. And to ramp up the fun they can make over the minifigures from any other LEGO® set too!\nWith 235 pieces, Heartlake City Hair Salon (41391) is an ideal gift for kids with a little building experience and a lot of imagination. It makes a great birthday, holiday or special-occasion gift for kids aged 6 and up.\nMeasuring just over 4” (11cm) high and 6” (17cm) long, this play hair salon is compact enough to keep ondisplay for constant entertainment. Or kids can combine it with other LEGO® sets for truly creative play.\nNo batteries are needed to power up the Heartlake City Hair Salon. The creative fun comes alive with a simple set of instructions, a little building experience and a child's active imagination.\nIs your little builder ready for an awesome play experience? Download the LEGO® Life app and help them use Instructions PLUS to see their hair salon in zoom, rotate and ‘ghost' modes. It's building for the digital age!\nIntroduce little builders to the world of Heartlake City, where the girls from LEGO® Friends are waiting to accompany them on their imagination’s most exciting adventures!\nLEGO® sets meet the highest industry standards plus The LEGO Group's own quality criteria. They're consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® Friends sets, bricks and accessories are tested to the max to ensure that every LEGO toy playset meets the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/heartlake-city-park-cafe-41426","description":"Know a kid who loves hanging out with their friends? Give the gift of the Heartlake City Park (41426) and every day they can make-believe catching up with their buddies in this Parisian-styled hang-out.\n\nSo many ways to play\nFoodie kids will love playing with the toy coffee shop accessories imagining they're the server whipping up smoothies and waffles to give to hungry customers. This building toy's kitchen is filled with neat details. The hinged waffle iron, drinks blender and cooking ingredients all help get kids’ creative juices flowing. Youngsters can also pretend to be Mia on her skateboard toy, playing with the squirrel toy while she waits for a snack.\n\nToys with heart\nLEGO Friends sets transport scenes from the TV show’s Heartlake City into kids' bedrooms, where they can recreate stories they loved or invent those of their own. In the company of LEGO Friends Mia, Stephanie, Andrea, Emma and Olivia, kids can explore their passions with friends that are ‘just like them'.\n\nWhet appetites for hours of creative fun food play with this Heartlake City Park Café (41426). Kids can play the server with a toy menu, prepare the toy food, or imagine being the customer enjoying a snack.\nThis café playset comes with 2 mini-dolls, a squirrel figure, a kitchen with a toy waffle iron and blender and lots of toy coffee shop accessories that help kids get lost in play and develop their story-telling skills.\nKids can pretend to make the food, wait the table or play the customer. And as this LEGO® park café is compatible with all LEGO sets and bricks, the ways in which they can customize their set are limitless.\nMakes a great holiday, birthday or impulse gift for kids aged 6+ who love food play. With 224 pieces it serves up a satisfying but achievable construction project for kids new to LEGO® building toys.\nThe café building measures over 4” (11cm) high, and 5” (14cm) long so it takes little room to keep out on display. And who wouldn't want to show off this pretty Parisian-style eatery complete with cute French doors?\nKids will want no delay to the creative park play so good news, this coffee shop playset requires no batteries, meaning the fun can start straightaway.\nLike all awesome LEGO® Friends toys, the Heartlake City Park Café comes with clear instructions that kids aged 6+ will find easy to follow. So, take a break while your little builder takes care of the construction!\nHelp youngsters explore their interests with colorful LEGO® Friends Heartlake City playsets. With them kids can recreate scenes from the TV series or invent stories of their own.\nLEGO® building kits meet the highest industry standards. They’re consistent, compatible and connect easily every time, and it’s been that way since 1958.\nLEGO® Friends sets are stringently tested to make sure every building kit meets the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/olivia-s-flower-garden-41425","description":"Nurture youngsters’ love of nature with LEGO® Friends Olivia’s Flower Garden (41425). Let kids imagine they’re exploring the countryside in search of rare flowers for Olivia to study. They’ll have fun driving the vehicle round, while back at Olivia's greenhouse they can pretend to help LEGO Friends Zobo the robot care for the blooms using the garden accessories.\n\nBring a pop of color to playtime\nComprising 92 pieces this pretend play garden is a cinch to construct, even for kids with little brick-building experience, making this a great birthday present for those new to LEGO toys. The beautiful toy plants will brighten up any desk, while the set’s neat size means it takes up little room on display.\n\nSay hello to the girls from LEGO Friends\nWelcome to the world of Heartlake City a place where little ones can embark on exciting missions, explore their interests or just enjoy hanging out with five fabulous girls – Mia, Olivia, Emma, Stephanie and Andrea – and all their animal friends.\n\nKnow a kid with a green thumb? Bring their love of the outdoors indoors with this colorful LEGO® flower garden fun toy. Let them embark on a plant hunt with Olivia, then tend their finds in her greenhouse.\nOlivia’s Flower Garden (41425) includes a buildable mini-doll figure, a farmer robot figure, a cute hamster figure, a plant-collecting toy vehicle and a greenhouse where kids can pretend to grow blooms and fruit.\nLet kids get lost in creative play as they imagine driving round in the cool vehicle collecting toy plants and using the cute gardening kit to look after and study them back at Olivia’s greenhouse.\nComprising 92 pieces, this starter building kit is quick to construct so imaginative role play gets underway in minutes, making it a great birthday or Christmas present, or an anytime gift for budding botanists aged 6+.\nThe toy vehicle measures over 1” (4cm) high, and 2” (6cm) long and the greenhouse just over 2” (7cm) high and 1” (4cm) wide, so this set pops easilyinto a backpack for quick plant-play at recess or at a friend’s house.\nNo batteries are needed to power this fun toy, so there’s no delay to the creative play. Just add kids’ imaginations and watch the plant-hunting mission come to life.\nIntroduce kids to the fun-filled world of LEGO® Friends. Through small, quick-to-build sets, or larger feature-packed products, children can act out scenes from the TV series or create their own stories.\nLEGO® building toys for kids meet the highest industry standards and quality criteria to ensure that all LEGO bricks and pieces are consistent, compatible and connect and pull apart easily every time.\nThe LEGO Group drops, heats, crushes, twists and analyzes its building bricks and pieces to make sure that every playset meets the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/puppy-playground-41396","description":"Little kids will have hours of fun role-playing LEGO® Friends’ Mia and caring for the cute puppy figures Cookie and Coco with this Puppy Playground toy playset (41396). The best gift toy for animal-loving kids aged 4+, it features a slide, skateboard and spinning merry-go-round for the LEGO dog figures, plus a variety of fun toy accessories to spark imaginative play. Welcome to 4+! This 4+ puppy toy for kids is a fun way for preschoolers and youngsters to learn to build with LEGO bricks. The LEGO slide has a Starter Brick base to make building simple. The playset includes easy-to-follow guides to building and playing to help even first-time builders construct models all on their own and gain a huge confidence boost. Instructions PLUS To add to kids' build experience, Instructions PLUS are available in the free LEGO Life app for this puppy toy for kids. This digital interactive guide has zoom and rotate viewing tools to help kids create the LEGO brick models. It's a super-cool way to build!\nIntroduce younger children to the joy of LEGO® building and caring for pets with this colorful Puppy Playground (41396 ) toy playset, featuring a puppy slide with a Starter Brick to make building easier for little ones.\nKids will enjoy hours of fun role-playing with the Mia mini-doll figure with her dogs Cookie and Coco in Heartlake City Park, guiding a puppy down the slide on a LEGO® skateboard or spinning them on the merry-go-round.\nAccessories such as Mia's sunglasses, plus the brush, bowl, dog biscuit, 2 bones and 2 bows for the dog figures, add to the creative fun. The models combine brilliantly with other LEGO sets for extra imaginative play.\nWith easy-to-build models, Mia from the LEGO® Friends TV series and cute LEGO pets, this 57-piece animal toy playset makes the best birthday, holiday or surprise gift toy for kids (especially dog-lovers) aged 4+.\nThe puppy slide measures over 4” (11cm) high, 3” (9cm) long and 1” (5cm) wide, so it can easily be packed into a bag along with the other builds and fun toy accessories to keep little kids entertained wherever you go.\nNo batteries required! This LEGO® starter set is powered by children’s imaginations, so they can develop their storytelling skills while enjoying lots of creative play with the LEGO dog figures.\nMake building this dog toy playset extra fun for kids with intuitive Instructions PLUS from the LEGO® Life app. Even younger builders can zoom, rotate and visualize this model as they create the real-life version.\nFeaturing Starter Brick bases to make building simpler and boost their confidence, LEGO® 4+ sets are a top gift to introduce younger children to various LEGO themes, movie favorites, TV characters and everyday heroes.\nEver since 1958, LEGO® bricks have met the highest industry standards plus The LEGO Group's own quality criteria, which ensures they connect perfectly and pull apart easily when it's time for a new build.\nLEGO® bricks and pieces are dropped, heated, bitten and tested in every way you can imagine, ensuring that every young builder’s LEGO Friends toy playset meets the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/friends-club-house-pod-5005236","description":"Be mission-ready with the LEGO® Friends Club House Pod, featuring a Stephanie mini-doll figure with exclusive outfit, hamster figure, plus a piece of mission equipment for each of the 5 friends."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/cat-grooming-car-41439","description":"Help youngsters develop building skills while caring for animals with the Cat Grooming Car (41439). With this simple set, kids can join LEGO® Friends Emma and Mia as they pick up cats in need of a trim in their toy vehicle and take them back to their salon for a pamper session.\n\nLearn to build\nThe 4+ set is packed with engaging details to ensure youngsters have a great play experience. Each bag of bricks contains a complete model and character that kids can build quickly to get the play started fast! It also comes with a Starter Brick that gives youngsters a partly constructed base.\n\nGreat fun for families\n4+ sets are the perfect way for adults to share the building fun with youngsters. It’s easy to get started – as well as a paper guide, this set comes with Instructions PLUS. Available on the LEGO Building Instructions app, it includes zoom, ghost and rotate tools to help children understand the building process. It also lets them save their progress so they can jump back into the build anytime.\n\nTop-value Cat Grooming Car (41439) gets kids off the blocks and building as they have fun imagining collecting cats in a kitty-styled car and giving them a makeover at a salon.\nThis compact cat toy for kids includes LEGO® Friends Emma and Mia, plus cat and kitten toys for limitless role-play fun. A Starter Brick gets the building going, so there's more time to play!\nLike all LEGO® Friends sets, this toy is packed with cute accessories, including a cat biscuit and a kitten feeding bottle.\nA convenient birthday present for a boy or girl aged 4+ who deserves a treat. Reward hard work with a creative everyday gift that entertains for hours and teaches construction skills.\nThe car measures over 3 in. (10 cm) wide, and the salon over 2 in. (6 cm) wide. Because it's compatible with all LEGO® bricks, it can also be expanded as kids' construction confidence grows.\nWant to give young builders a building experience that's even more fun? Now you can with digital Instructions PLUS! Zoom, rotate, ghost and save modes help make building a breeze.\n4+ sets provide a fun way for children to learn to build, while growing their confidence with easy building steps. They let kids and grown-ups discover the joy of building and playing together.\nLEGO® components meet strict industry quality standards to ensure they are easy for little fingers to pick up and build with – it's been that way since 1958.\nLEGO® toy playsets are tested in almost every way imaginable to make surethey meet stringent safety standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/andrea-s-dj-pod-853775","description":"Prepare for your next exciting gig with Andrea’s DJ Pod. This portable pod contains an Andrea mini-doll figure, a pet bird figure, buildable DJ equipment and assorted disco accessory elements to inspire lots of LEGO® Friends fun wherever you go.\n\nFeatures a portable plastic pod in purple with an Andrea mini-doll figure, pet bird figure, buildable DJ equipment and assorted disco accessory elements inside.\nCheck out 853774 Olivia’s Satellite Pod, 853776 Emma’s Photo Studio Pod, 853777 Mia's Exploration Pod and 853778 Stephanie's Pool Pod for more on-the-go LEGO® Friends fun.\nMeasures over 2” (6cm) high, 2” (6cm) wide and 1” (3cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/emma-s-photo-studio-pod-853776","description":"Open up a world of creativity with Emma’s Photo Studio Pod. This portable pod contains an Emma mini-doll figure, a pet cat figure, buildable photo studio equipment and assorted accessory elements to inspire endless LEGO® Friends fun wherever you go.\n\nFeatures a portable plastic pod in purple with an Emma mini-doll figure, pet cat figure, buildable photo studio equipment and assorted accessory elements inside.\nCheck out 853774 Olivia’s Satellite Pod, 853775 Andrea’s DJ Pod, 853777 Mia’s Exploration Pod and 853778 Stephanie's Pool Pod for more on-the-go LEGO® Friends fun.\nMeasures over 2” (6cm) high, 2” (6cm) wide and 1” (3cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/mia-s-exploration-pod-853777","description":"Take Mia’s Exploration Pod with you wherever you go. This portable pod contains a Mia mini-doll figure, a pet bunny figure, buildable nature exploration equipment and assorted accessory elements to inspire endless LEGO® Friends role-play adventures.\n\nFeatures a portable plastic pod in purple with a Mia mini-doll figure, pet bunny figure, buildable nature exploration equipment and assorted accessory elements inside.\nCheck out 853774 Olivia’s Satellite Pod, 853775 Andrea’s DJ Pod, 853776 Emma's Photo Studio Pod and 853778 Stephanie's Pool Pod for more on-the-go LEGO® Friends fun.\nMeasures over 2” (6cm) high, 2” (6cm) wide and 1” (3cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/olivia-s-satellite-pod-853774","description":"Open Olivia’s Satellite Pod and show off your scientific side. This portable pod contains an Olivia mini-doll figure, her pet robot Zobo, buildable satellite equipment and assorted accessory elements to inspire exciting LEGO® Friends adventures wherever you go.\n\nFeatures a portable plastic pod in purple with an Olivia mini-doll figure, Zobo robot, buildable satellite equipment and assorted accessory elements inside.\nCheck out 853775 Andrea’s DJ Pod, 853776 Emma’s Photo Studio Pod, 853777 Mia’s Exploration Pod and 853778 Stephanie's Pool Pod for more on-the-go LEGO® Friends fun.\nMeasures over 2” (6cm) high, 2” (6cm) wide and 1” (3cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/stephanie-s-pool-pod-853778","description":"Make a splash wherever you go with Stephanie’s Pool Pod. This portable pod contains a Stephanie mini-doll figure, a pet dog figure, buildable pool/swimming equipment and assorted accessory elements to inspire lots of LEGO® Friends role-play fun.\n\nFeatures a portable plastic pod in purple with a Stephanie mini-doll figure, pet dog figure, buildable pool/swimming equipment and assorted accessory elements inside.\nCheck out 853774 Olivia’s Satellite Pod, 853775 Andrea’s DJ Pod, 853776 Emma’s Photo Studio Pod and 853777 Mia's Exploration Pod for more on-the-go LEGO® Friends fun.\nMeasures over 2” (6cm) high, 2” (6cm) wide and 1” (3cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/mia-s-water-fun-30410","description":"Mia is enjoying a day at Heartlake City Resort water park. While zooming round on her cool water scooter she spots a turtle. Cruise up to it carefully to say hello!"},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/olivia-s-remote-control-boat-30403","description":"Olivia is testing out her remote-control boat in the lake at Heartlake City Park. Spin the flagpole to help her move the boat around the flag."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/andrea-s-bunny-cube-41666","description":"Know a little animal-lover who deserves a treat? Gift them LEGO® Friends Andrea’s Bunny Cube (41666) rabbit toy for kids and give them a surprise that’ll delight them. This portable play cube has a cute bunny face sitting below a pair of pointy bunny ears. Inside, kids will find a buildable rabbit hutch, tree and mushroom. The creative accessories will also help inspire caring animal play.\n\nLike and share\nLEGO Friends Cubes are the ideal portable animal toys to take on a playdate. All the elements pack up into the box as well as fixing to the cube’s base, so there’ll be no missing pieces when it’s played with on the move! It’s small in size, so kids can take this bunny toy on a playdate to enjoy with friends. LEGO Friends animal cubes help boys and girls explore their passion for creatures in the company of the relatable Heartlake City girls.\n\nLEGO® Friends animal cubes make the perfect just-because gift for kids who love creative anytime fun. The Andrea’s Bunny Cube (41666) portable set inspires nurturing play and looks great on display.\nThe cube includes a LEGO® Friends Andrea mini-doll toy, a bunny figure in 1 of 4 different colors, a buildable hutch, mushroom and tree, plus a basket of toy accessories to help fire imaginations.\nKids can remove the elements from the LEGO® Friends Cube and pack them up for fun on the go or to enjoy the bunny play with a friend.\nA great little birthday gift for kids aged 6+ who love caring for animals, this perfect impulse gift provides the first step into the wider LEGO® universe.\nAt over 2.5 in (8 cm) long and 5 in. (13 cm) high, this cube packs lots of LEGO® fun into compact dimensions. With its cute bunny face and new-for-January-2021 textile ears, it looks great on display.\nPopular Heartlake City toys allow caring kids to enjoy animal play in the company of the relatable LEGO® Friends characters.\nThe building components of this LEGO® new toy meet stringent industry standards to ensure they are compatible, and connect and pull apart consistently every time – it’s been that way since 1958.\nThe bricks and components of LEGO® creative gifts are tested to the max to make sure they meet stringent global safety standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/heartlake-city-amusement-pier-41375","description":"Roll up for the fun of the fair with LEGO® Friends 41375 Heartlake City Amusement Pier. This amusement park toy set allows your little builder to immerse themselves in the excitement of a theme park experience. It includes a ticket kiosk and turnstiles where the friends can enter and exit. There's a spin-the-wheel stall where fairgoers can try to win treats. The carousel ride features 3 chairs, which fly round in a blur thanks to a spinning, twisting function. The star attraction, however, is the pirate ghost ship where your young Friends fan can enjoy chills and thrills as they whizz round the pirate shipwreck. As the car travels through the amusement park ride’s spooky textile foils, it plunges into a world of bats, skeletons and scorpions. This building toy for kids includes 5 mini-dolls, plus 2 animal figures and 2 skeleton figures for hours of imaginative play.\n\nAmusement park toy set includes 5 mini-doll figures: Olivia, Emma, Stephanie, Zack and Chloe, plus a dolphin, bird and 2 skeleton figures.\nFeatures a ticket kiosk, snack stall, spin-the-wheel game, swing chair carousel, and a pirate ghost ship ride.\nPirate ghost ship features a height ruler, entrance barrier, boat-shaped car and a roller coaster track through lots of spooky scenes.\nAmusement park set's accessory elements include popcorn, ice cream, waffle, entrance ticket, money, cell phone, handbag, cookie, cupcakes, pizza and a teddy bear.\nPirate ghost ship ride accessory elements include new-for-2019 foil curtains and sails, ship’s wheel, golden cup and bottle, lanterns, swords, treasure chest, gem elements, cooking pot, fishing rod, giant clam, octopus and jellyfish, gold coins, spider, scorpion, bat, sea creature elements, camera, light brick, coral element and an anchor.\nThis product requires 2 x LR 41 1.5 V batteries, which are included.\nKids can spin the wheel and win a prize.\nClever features, such as the height-measuring bar, give the set a realistic feel and allow for immersive play.\nWith the fair as a backdrop, your child can explore social situations and imagine what it’s like to meet up with friends and hang out, prizes in hand.\nYoungsters will enjoy the spooky thrills of the ghost ship and its skeleton crew.\nMultiple elements provide countless different play scenarios.\nCombine with 41373 Funny Octopus Ride and 41337 Underwater Loop to extend the funfair play.\nLEGO® Friends playsets encourage imaginative play, and make building creative and fun.\nMakes an ideal Christmas gift or gift for the holiday season for creative kids.\nThis set is part of the LEGO® Friends world of everyday heroes and exciting real-world scenarios.\nPirate ghost ship measures over 11” (30cm) high, 6” (17cm) wide and 15” (40cm) deep.\nCarousel measures over 10” (26cm) high, 7” (18cm) wide and 7” (18cm) deep.\nIncludes LEGO® Light Brick."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/rescue-mission-boat-41381","description":"Give the gift of endless hours of exciting animal rescue adventures with LEGO® Friends 41381 Rescue Mission Boat creative toy. Your little explorer will be able to play out a multitude of animal-saving scenarios with this highly equipped toy boat. There is a speedboat bay with launching function, swiveling crane with a stretcher for transporting sick animals, lookout position and a cockpit area. The deck is removeable to allow access to the cabin, which includes a lab, kitchen and a bedroom complete with toilet. Extending the play further is a separate heart-shaped island where a hidden water-reactive textile map hides the location of the underwater treasure chest. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This LEGO boat includes 3 mini-doll figures, plus a narwhal toy figure and a robot figure.\n\nIncludes 3 mini-doll figures: Olivia, Andrea and Mia, plus Zobo the robot and a narwhal figure.\nFeatures a 3-level motor cruiser, heart-shaped island and underwater coral scene.\nMotor cruiser features a speed boat launcher, swiveling and removable boat crane with hook winding function, cockpit, horns, search lights, security camera, satellite dish, lab, kitchen area, bedroom and toilet and a look-out deck.\nHeart-shaped island features a beach, ship wreckage and treasure box with a water-reactive textile map.\nUnderwater coral scene includes treasure chest with gemstone elements.\nAccessory elements include a water-reactive textile treasure map, coral and sea creature elements, underwater camera, medical instruments, diving helmet, flippers, life vests, ball, cups, glasses, cherry, laptop, cell phone, telescope, and 3 shades of gem elements.\nLet your youngster role-play the hero with this rescue boat toy.\nHelp your little builder learn the importance of looking after animals.\nThe science lab area, where the girls can test the specimens they have collected from the sea, will appeal to budding marine biologists.\nTreasure hunt elements add another dimension to the imaginative play.\nMyriad features allow your youngster's imagination to have endless horizons.\nThis set is part of the LEGO® Friends world of everyday heroes and exciting real-world scenarios.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nLEGO® Friends playsets encourage imaginative play, and make building creative and fun.\nThis set is part of the LEGO® Friends world of everyday heroes and exciting real-world scenarios.\nLEGO® Friends sets make ideal Christmas gifts or gifts for the holiday season for creative kids.\nLEGO® Friends ship measures over 6” (17cm) high, 15” (40cm) long and 4” (12cm) wide.\nSpeedboat measures over 1” (3cm) high, 3” (9cm) long and 1” (5cm) wide."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/mia-s-house-41369","description":"Get back to nature with a visit to Mia’s family home. Tucked away in the forest, LEGO® Friends 41369 Mia’s House comprises a kitchen, bathroom and a living room, as well as Mia’s bedroom, accessed by a cool exterior climbing wall. Remove the bedroom floor for easy play inside the toy house. Outside there's a table and chairs, a well to fetch water for Mia's horse Metzie, and a grooming area where she can be groomed. This mini-doll house is the perfect set to role-play family life, and let imaginations run free. Includes 3 mini-doll figures: Mia, mom Ann and dad Angus, plus 2 animal figures.\n\nIncludes 3 mini-doll figures: LEGO Friends® Mia, her mom Ann and her dad Angus, plus 2 animal figures: a rabbit and a horse.\nFeatures a 2-story cabin-style house including Mia’s bedroom, living room, bathroom with sink and toilet and a kitchen. There's also a climbing wall with a hidden entrance to Mia's bedroom, and a well outside with a bucket.\nMia's bedroom features a bunk bed, lamp, desk and a chair.\nKitchen features an oven, hob and a dining area.\nAccessory elements include a mixer, spatula, bowl, baguette, frying pan, sunny-side-up egg, plate, cutlery, 3 cups, 3 cupcake cases and a baking tray, saddle, bridle, helmet, roller skates, beehive, cell phone and a camera.\nPlay out family life with Mom and Dad in this toy cabin house.\nCare for Metzie the horse, and feed the rabbit in the outside grooming area.\nRemove Mia's bedroom floor for full kitchen access, and help Mom and Dad prepare lunch.\nHelp Mia practice her wildlife photography with the camera.\nClamber up the climbing wall into Mia’s room when it’s time for bed.\nLEGO® Friends sets encourage creative play, and make building imaginative and fun.\nMeasures over 8” (22cm) high, 12” (31cm) wide and 3” (9cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/heartlake-city-restaurant-41379","description":"Playing at being grown up is easy with LEGO® Friends 41379 Heartlake City Restaurant. Realistic features, such as the salad bar, reception area and stone-style pizza oven pave the way for hours of imaginative play as your little builder acts out dining with friends at a restaurant. Or creative kids can role-play the chef, preparing the food in the kitchen and serving the guests sitting at the al fresco balcony table. Inside, the salad bar is movable to create space to allow access for freer play within the restaurant, while outside the play is extended as kids imagine that Chico the cat goes hunting in the dumpster for scraps with his new feline friend that lives at the restaurant. For a final dimension of imaginary fun with this creative toy, let your child invent the identity of the elusive graffiti artist, who comes to the restaurant at night and leaves their tag. This fun construction set includes 3 mini-dolls: Emma, Ethan and a chef, plus 2 LEGO cat figures.\n\nIncludes a 3 LEGO® mini-dolls: LEGO Friends Emma, Ethan and a chef figure, plus 2 LEGO cats.\nRestaurant playset features a 2-story restaurant, LEGO scooter and separate salad cart.\nLEGO® Friends restaurant features a pizza oven, reception, balcony dining area, kitchen, WC, dumpster and outside seating area.\nAccessory elements include 2 fish, menu, notepad, 2 helmets, 2 spray cans, graffiti stickers, flowers, toilet roll, kitchen utensils, pizza and pasta decorated tiles, fire extinguisher, 3 forks, 3 knives and 3 plates and a pen.\nKitchen accessory elements include a pizza pan, spatula, baking pan, frying pan, gravy boat and a whisk.\nSalad bar accessory elements include LEGO® food such as 2 baguettes, salad elements, oil bottle, and 3 cupcakes.\nCombine LEGO® Friends 41379 Heartlake City Restaurant buildable toy with all other original LEGO sets and LEGO bricks for truly creative building.\nKids will love being immersed in working in a busy restaurant.\nRealistic features make the LEGO® role-play come alive.\nHelps children explore social scenarios.\nThis toy restaurant makes an ideal Christmas gift or gift for the holiday season for creative kids.\nThis construction set is part of the LEGO® Friends world of everyday heroes and exciting real-world scenarios.\nRestaurant measures over 6” (17cm) high, 9” (24cm) wide and 4” (12cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/lighthouse-rescue-center-41380","description":"Let your kid get totally immersed in adventure action play with LEGO® Friends 41380 Lighthouse Rescue Center playset. This rescue center toy has a multitude of features, including a lab, sea lion play area, rest area, TV room, office and an observation deck with a lamp that can be lit by pressing the lighthouse roof. Rescued sea lions access the lighthouse clinic using a clever hinged pool that swings through 180 degrees to bring the sea lions into the clinic. Also included is a water scooter for rescuing the sea animals and a mini island where the sea lion is trapped in an abandoned shack, which has a fun button function your child can push to set the sea lion free. There is also a treasure map hidden there—the clever textile reveals its secrets when brushed with water. This lighthouse toy provides a raft of scenarios that allow imaginations to run free and nurturing play to come to the fore. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This fun construction set includes 2 mini-dolls, plus 5 animal figures.\n\nThis set includes 2 mini-doll figures: Mia and Emma, plus 1 dolphin, 1 bird, 1 turtle and 2 sea lion figures.\nFeatures a 4-story building with an examination area, lab, sea lion play area, rest area, TV room, office, observation deck and a jetty.\nExamination area features a hinged pool to bring the sea lions into the clinic from the outside and a sea lion X-ray area.\nSeparate island features a wood-effect shack with planks that fall away at the press of a button to release the trapped sea lion.\nAccessory elements include a water-reactive textile treasure map, light brick, medical instruments, sea creature and coral elements, life vest, fins, diving helmet, fishing rod and line, fish, walkie-talkie, magnifying glass, ball, camera, telescope, satellite dish and a Heartlake City cup.\nThis product requires 2 x LR 41 1.5 V batteries, which are included.\nLet your youngster role-play the rescuer!\nKids can pretend to keep ships safe from the shore with the lighthouse's flashing light brick.\nInspire your little builder to set sail on a LEGO® rescue mission.\nHelp your child to explore how to care for an animal’s wellbeing.\nWater-reactive textile treasure map adds an element of surprise.\nLEGO® Friends toys encourage imaginative play, and make building creative and fun.\nCombine this rescue center toy with the LEGO® Friends 41381 Rescue Mission Boat, 41376 Turtles Rescue Mission and 41378 Dolphins Rescue Mission sets to extend the action-packed fun.\nLEGO® Friends sets make an ideal Christmas gift or gift for the holiday season for creative kids.\nUse the LEGO® Life app to access this constructions set’s intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nThis set is part of the LEGO® Friends world of everyday heroes and exciting real-world scenarios.\nLighthouse model measures over 11” (29cm) high, 9” (25cm) wide and 5” (13cm) deep.\nWater scooter measures over 1” (3cm) high, 2” (7cm) long and 1” (4cm) wide."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/andrea-s-pool-party-41374","description":"Make a splash with LEGO® Friends 41374 Andrea’s Pool Party. This LEGO Friends pool party is the coolest ticket in town as there’s so much going on to fire your child’s imagination. Let your little builder pretend to be Andrea and host this LEGO pool party, mixing tunes or singing from the DJ box. Or they can imagine that they are Stephanie, chilling out and enjoying all the fun features. This pool party playset has an aquarium, slide, waterfall, wave machine and a juice bar. When it's time to dry out there’s a changing room and a toilet. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This toy for girls and boys includes 2 mini-doll figures.\n\nIncludes 2 mini-doll figures: Andrea and Stephanie.\nFeatures a buildable pool with a slide, waterfall, sprung springboard, bubble pool, rotating DJ box, shower area with lockers, toilet and an aquarium.\nJuice bar comes with 2 bar stools and can be played with separately at the side or fixed in the toy swimming pool as a swim-up bar.\nWave machine features a set of speakers, surfboard and a twistable dial function to recreate a wave motion.\nAccessory elements include a fruit bowl, blender, banana, carrot, glasses with cherries, surfboard, records, water guns with shooting action, bow tie, hair brush, fins and a fish.\nKids will love to pretend to be Andrea, singing to her friends.\nBy rotating the wave machine’s dial, kids can pretend to make the girls surf.\nFun details such as pistols that ‘shoot' water, help enhance the play.\nPool party scenario helps young children to act out and explore social situations.\nMakes an ideal Christmas gift or gift for the holiday season for creative kids.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nLEGO® Friends toys encourage imaginative play, and make building creative and fun.\nThis set is part of the LEGO® Friends world of everyday heroes and exciting real-world scenarios, making it a great gift for kids.\nLEGO® pool complex measures over 5” (15cm) high, 11” (29cm) wide and 7” (20cm) deep.\nWave machine measures over 2” (7cm) high, 1” (4cm) wide and 1” (5cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/friendship-box-41346","description":"The LEGO® Friends 41346 Friendship Box contains enough colorful LEGO pieces to build 5 different life-sized accessories at once. There’s a microphone, camera with button-activated light-brick 'flash', trophy, walkie-talkies and a robot in this exciting LEGO® Friends set for endless Heartlake City role-play fun.\n\nFeatures 5 buildable, life-sized LEGO® Friends accessories: a microphone, camera with button-activated light-brick 'flash', trophy, walkie-talkies and a robot.\nOpen the Friendship Box to find loads of colorful LEGO® pieces… and then get building!\nThis fun LEGO® Friends set allows you to play Heartlake City with your friends—which of the 5 girls will you be today?\nMicrophone measures over 5” (14cm) high, 1” (5cm) wide and 1” (5cm) deep.\nEach walkie-talkie measures over 5” (15cm) high and 1” (4cm) wide.\nCamera measures over 3” (8cm) high, 3” (10cm) wide and 2” (7cm) deep.\nTrophy measures over 4” (12cm) high, 2” (7cm) wide and 1” (4cm) deep.\nRobot measures over 6” (16cm) high, 3” (8cm) wide and 3” (8cm) deep.\nIncludes LEGO® Light Brick."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/dolphins-rescue-mission-41378","description":"Let your little builder get immersed in a race to a rescue a trapped dolphin and find the hidden treasure with LEGO® Friends 41378 Dolphins Rescue Mission creative toy. This dolphin playset allows kids to act out an underwater LEGO rescue mission as Stephanie dives in her cool submersible craft to free a stricken dolphin from a shipwreck. The shipwreck's mast is hinged so Stephanie can lift it to free the dolphin with the grabbing arm of her craft. A hidden gem-filled treasure chest adds another dimension to the action, as does the textile pirate’s map that reveals secret information when brushed with water. But who will find the map first, Stephanie or bad-girl Kacey? The only certainty is the fun your Friends fan will have as they decide who wins this LEGO treasure hunt! Construction set includes 2 mini-doll figures, plus 2 dolphin figures for hours of imaginative play.\n\nIncludes 2 mini-doll figures: Stephanie and Kacey, plus 2 dolphin figures.\nFeatures a toy submarine with a viewing sphere with hinged windscreen, plus an underwater scooter, shipwreck with hinged mast, and a mini island with a treasure trunk.\nAccessory elements include a water-reactive textile treasure map, 2 wigs, 2 diving helmets, coral and sea creature elements, treasure chest with gems, ball, bottle, fins, syringe, baby bottle and a grabbing tool.\nInspire your little builder to set sail on a LEGO® rescue mission.\nHelp your child to explore how to care for an animal’s wellbeing with this creative toy.\nKids will love to act out the exciting race to the treasure between Stephanie and Kacey.\nWater-reactive textile treasure map adds an element of surprise.\nCombine this dolphin playset with other LEGO® Friends animal rescue toys such as the 41376 Turtles Rescue Mission, 41380 Lighthouse Rescue Center and 41381 Rescue Mission Boat sets to extend the action-packed fun.\nUse the LEGO® Life app to access this building kit’s intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nLEGO® Friends sets encourage imaginative play, and make building creative and fun.\nThis toy for girls and boys is part of the LEGO® Friends world of everyday heroes and exciting real-world scenarios.\nSubmarine rescue vehicle measures over 3” (8cm) high, 5” (14cm) long and 4” (11cm) wide.\nShipwreck measures over 5” (13cm) high, 7” (20cm) long and 4” (11cm) wide."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/funny-octopus-ride-41373","description":"Transport your youngster to the excitement of the amusement pier on the LEGO® Friends 41373 Funny Octopus Ride. Kids will love recreating the thrill of a fairground ride with this LEGO Friends set. It features an octopus body and at the end of its tentacles are 4 cars shaped like cute sea creatures. By turning the octopus's top hat, the cars fly up and down, and round and round. Included is a buildable carnival ticket booth that also sells popcorn and helps to encourage imaginative play. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This amusement park playset includes 2 mini-doll figures, plus a bird figure.\n\nAmusement park set includes 2 mini-doll figures: Andrea and Ethan, plus a bird figure.\nFeatures an octopus fairground ride with a spinning function, 4 cars shaped like sea creatures and a kiosk.\nAmusement park toy accessory elements include sunglasses, camera, ticket and popcorn.\nOctopus's hat has a twisting function that allows the cars to fly round.\nKids can pretend to be Andrea, taking some action shots of Ethan on the ride.\nCombine with 41375 Heartlake City Amusement Pier and 41337 Underwater Loop to extend the funfair play.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nLEGO® Friends playsets encourage imaginative play, and make building creative and fun.\nThis octopus carnival ride makes an ideal Christmas gift or gift for the holiday season for creative kids.\nThis set is part of the LEGO® Friends world of everyday heroes and exciting real-world scenarios.\nAmusement park toy set measures over 7” (18cm) high, 10” (27cm) wide and 9” (24cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/stephanie-s-horse-jumping-41367","description":"Play at being a showjumping champion with LEGO® Friends 41567 Stephanie’s Horse Jumping set. Before the contest lovingly wash and prepare the horses at the toy horse stable. Once the competition starts ride around the course, navigating the horse jump toys and taking care not to knock off the rails. Spectators can take in the event from the viewing balcony. The action is captured on a TV camera then beamed up to a screen on the balcony. Competitors then take their place on the podium for the trophy-giving. Includes 2 mini-dolls: Stephanie and Zack, plus 2 horse figures.\n\nIncludes 2 mini-dolls: Stephanie and Zack, plus 2 horse figures.\nFeatures 2 stables, a grooming and washing area, viewing balcony, horseshoe podium and jumps.\nAccessory elements include a TV camera, binoculars, pitchfork, carrots, hay, 2 saddles and 2 bridles.\nGrooming accessory elements pack includes brushes, sponge, spray bottle, rosettes, bows and a comb.\nUse the grooming area to clean and care for the toy horses.\nHelp LEGO® Friends Stephanie and Zack canter around the course on the horse toy figures for kids, tackling the jumps.\nRelax on the balcony while watching the equestrian action play out beneath.\nLEGO® Friends sets encourage creative play, and make building imaginative and fun.\nStables measure over 6” (17cm) high, 9” (24cm) wide and 3” (10cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/heartlake-city-supermarket-41362","description":"It’s time to do the weekly shop at the LEGO® 41362 4+ Heartlake City Supermarket. Let your little shopper role-play a visit to the store with this creative playset. They can drive to the supermarket, decide what to buy, load the shopping cart then pay at the checkout. And when the shopping's done it's time to relax at the sundae bar with friends. This LEGO 4+ set is specially designed to be fun and easy for preschoolers and youngsters with a cool store stocked with food and a car made with a special Starter Brick base that lets even first-time builders experience the pride of constructing buildings, vehicles and more, all on their own. The included simple guide to build and play will also help your young shopper understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO brick building in a familiar LEGO Friends setting. This simple LEGO toy grocery store includes a car, separate slush bar, and lots of food items for endless hours of imaginative and role-play fun. Construction set includes 2 mini-doll figures.\n\nLEGO® 4+ sets are specially designed to be fun and easy for youngsters, and to help grow their confidence with simple building steps for the perfect start to LEGO brick building.\nIncludes 2 mini-doll figures: Stephanie and Olivia.\nThis supermarket playset features an easy-to-build car toy, supermarket with cash register and a separate sundae bar.\nAccessory elements include a kids' supermarket cart, fish, sundaes in glasses, croissant, popsicle, carrot, bottle, apple, banana, orange juice, milk, cereal box and a cash bill element.\nThis pretend supermarket features a Starter Brick base to quickly get your child building and playing in an exciting LEGO® Friends world of adventures.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ playsets were previously branded as LEGO Juniors and are compatible with all LEGO construction sets for creative building.\nMakes an ideal Christmas gift or gift for the holiday season for preschoolers and creative kids.\nThis construction set is part of the LEGO® Friends world of everyday heroes and exciting real-world scenarios.\nSupermarket measures over 3” (9cm) high, 6” (17cm) wide and 3” (8cm) deep.\nCar measures over 1” (4cm) high, 3” (8cm) long and 1” (4cm) wide."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/lego-friends-advent-calendar-41420","description":"Make the Christmas countdown even more exciting with the LEGO® Friends Advent Calendar (41420). Kids will find a new buildable surprise hiding behind each door. The calendar is filled with super-cute Christmas characters, all of which belong to three themes: Emma's room, Santa's toy workshop and a winter wonderland. As kids open the doors they will progress through each setting, adding to the feeling of excitement.\n\nPlay or display\nKids can decorate their rooms with the models, which includea LEGO Friends Mrs Claus and 2 elf mini-doll figures or play with the items together to make for a more creative narrative play. There are also action features, such as a fun snowball-launching catapult and a toy skateboard that rolls.\n\n24 festive LEGO Friends moments\nThe fun toys are simple to build and come with clear instructions so kids aged 6+ can construct the gifts quickly and get on with the creative play. Introduce kids to Heartlake City, a place of great friendships and very merry Christmases!\n\nMake the countdown to Christmas even more exciting with the LEGO® Friends Advent Calendar (41420). Each door reveals a new gift for kids to build. Each model makes for a great decoration, or all 24 can be played with together.\nKids’ advent calendar comes with a LEGO® Friends Emma, Mrs Claus and 2 elf mini-doll figures, as well as a buildable toy penguin and a host of other cool buildable festive treats. Some models also come with fun, dynamic features.\nNot only can kids use these modelsas decorations but kids can also play with each fun toy as part of a narrative theme – LEGO® Friends Emma’s room, Santa’s workshop and a winter wonderland – to help spark creative play.\n236-piece set makes a great pre-Christmas present for kids who want their fun advent calendar to give more than a fleeting moment of joy. The simple builds are perfect for youngsters aged 6+ to construct independently.\nThe box measures over 9” (25cm) high, 14” (37cm) wide and 2” (6cm) deep and stands securely when displayed. Kids can add the Christmas magic to other LEGO® models they own because the awesome toys are compatible with all LEGO sets.\nNo batteries are needed to get the winter wonderland advent calendar play under way. A cute manual function launches the fun catapult's snowballs and the toy skateboard rolls with the flick of a finger!\nAs with all LEGO® playsets, this Christmas LEGO set comes with clear printed instructions. They are designed to be easy for kids aged 6+ to follow so they can get on and build without a grown-up’s help.\nIntroduce kids to the exciting world of LEGO® Friends. It’s a place of creative fun, fabulous friendships and everyday heroes, where kids can learn that they can achieve their dreams when they follow their heart.\nLEGO® building sets for kids meet the highest industry standards plus the LEGO Group's own quality criteria, which ensures they are easy for little fingers to pull apart – and it's been that way since 1958!\nThe LEGO Group has tested its bricks and buildable mini-doll figures of this Christmas countdown calendar playset to the max to make sure every kids’ playset meets the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/mia-s-horse-trailer-41371","description":"It’s time to enjoy some fresh forest air on horseback with LEGO® Friends 41371 Mia’s Horse Trailer playset. Realistic features will encourage your animal-lover to role-play what it’s like to own a horse. The toy horse trailer has a hinged tailgate that the horse can walk up. A hinged side makes it easy to load all the horse-riding gear the girls need. The playset comes with a LEGO 4x4 for towing the trailer to the woods. The girls can explore the forest on horseback, looking for wildlife as they go. When the exercise is over your Friends fan can show their nurturing side by grooming the white horse toy and feeding her some hay. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This toy horse trailer and truck includes 2 mini-doll figures, plus 2 animal figures.\n\nThis horse toy for kids includes 2 mini-doll figures: Mia and Emma, plus a toy horse and a rabbit figure.\nFeatures a buildable 4x4 buggy and LEGO® Friends horse trailer toy with a hinged side panel and tailgate, a buildable forest scene for the rabbit and a box of horse care accessories.\nAccessory elements include a horse blanket, saddle, bridle, riding helmet, carrot, hay, brush, bow and sunglasses.\nKids can role-play hitching up the horse trailer toy, then going to pick up Emma in Mia's ATV.\nHelp your youngster express their caring side by feeding the horse a carrot and some hay.\nMultiple play scenarios let imaginations roam free amid the wildlife setting.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nLEGO® Friends horse sets encourage imaginative play, and make building creative and fun.\nMakes an ideal Christmas gift or gift for the holiday season for creative kids.\nThis set is part of the LEGO® Friends world of everyday heroes and exciting real-world scenarios.\nATV measures over 2” (6cm) high, 3” (9cm) long and 1” (5cm) wide.\nTrailer measures over 3” (8cm) high, 5” (13cm) long and 3” (8cm) wide."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/mia-s-tree-house-41335","description":"This LEGO® Friends 41335 Mia’s Tree House construction toy is packed with features and details to create hours of fun for Mia, her brother, and any friends who might come to visit. There’s a folding ladder, scramble net and a zip wire for access to and from the second floor, plus a water gun, a book of ghost stories, artwork tiles, board game, pizza, sports equipment, Mia's skateboard and much more inside. Includes 2 mini-dolls plus 2 animal figures.\n\nIncludes Mia and Daniel mini-doll figures, plus Mimì the bunny and Cinnamon the bird figures.\nFeatures a tree house accessed by ladder or scramble net, attic with opening roof and storage box, tree trunk with storage box and a bunny house.\nAccessory elements include a skateboard, water gun, torch, ghost stories book, artwork tiles, pizza, ‘I love Heartlake City' mug, board game, map of Heartlake City Park, boomerang, love letter tile, ball, bird nest, egg and a carrot.\nWhizz down the zip wire and then scramble back up the net to the tree house.\nPrepare an exciting night in for Mia’s friends with ghost stories by torchlight, board games and pizza, then discover Daniel’s box of belongings in the attic!\nTake the skateboard for a spin in Heartlake City Park, or have fun outside the tree house with the sports equipment with this great construction toy.\nHelp animal-lover Mia look after her pet bunny in her house and the cute little bird nesting in the tree.\nTree house measures over 6” (16cm) high, 6” (17cm) wide and 6” (16cm) deep.\nBunny house measures over 1” (3cm) high, 1” (4cm) wide and 1” (3cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/olivia-s-cupcake-cafe-41366","description":"Technology and food combine at the LEGO® Friends 41366 Olivia’s Cupcake Café with lots of super-cool gadgets for imaginative kids’ role-play. Inspired by the sushi restaurants of Heartlake City’s tech district, the cupcake shop features a server that rotates using gear wheels. The LEGO Friends Cupcake Café also has a cool cupcake-dispensing machine, indoor and outdoor dining areas, and a kitchen with an oven, sink, and cake-making utensils. For even more creative play, this café playset also comes with a little scooter to deliver cupcake toys all over Heartlake City. Includes 2 mini-doll figures: Olivia and Emma, plus a robot figure.\n\nIncludes 2 mini-doll figures: LEGO® Friends Olivia and LEGO Friends Emma, plus a Zobo the robot figure.\nThis pretend play toy features a serving area with rotating function, a cupcake-making machine with dispensing function, kitchen with a sink and oven, outdoor table and a delivery scooter.\nAccessory elements include cupcakes, a whisk, cooking ingredients, cake-decorating tool, pot, wrench, blender, coffee machine, cash register, bill, parasol, milk machine and a cup.\nCreate and decorate mouth-watering cupcakes in the kitchen with this fun cooking play set.\nUse the cool dispensing machine to buy a cupcake, or choose one from the sushi-style rotating server that you can decorate with the included holographic stickers to make it flash when it turns.\nLEGO® Friends sets encourage creative play, and make building imaginative and fun.\nCafé measures over 5” (13cm) high, 7” (19cm) wide and 4” (11cm) deep.\nToy scooter measures over 1” (5cm) high, 2” (7cm) long and 1” (3cm) wide."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/stephanie-s-gymnastics-show-41372","description":"It’s competition time with LEGO® Friends 41372 Stephanie’s Gymnastics Show. Give the gift of endless fun with this multi-event LEGO gymnastics arena. This creative building set for kids features 3 disciplines: the trampoline, parallel bars and floor, each of which can be fixed to the main stage when it's performance time. The trampoline has a cool ‘jump' function button—press it to launch the girls into the air. They can perform even more aerial acrobatics on the parallel bars—each bar spins to send the gymnasts wheeling round. There is a different piece of kit for each girl’s floor routine—a ribbon and a hoop. A revolving platform allows the crowd to see the competitors from every angle. They can then go back to the locker room to refuel and await the results before collecting their medals on the podium! Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This construction set includes 2 mini-doll figures and makes for hours of imaginative play.\n\nGymnastics toy includes 2 mini-doll figures: Stephanie and Mia.\nFeatures various gymnastic equipment and a main stage with a rotating platform, speakers, leaderboard with sticker decorations, podium and a locker room.\nGymnastic equipment includes a trampoline playset with jumping function and spinning parallel bars.\nAccessory elements include a ribbon on a stick, hoop, chalk bowl, 2 golden medals, 2 water bottles, chocolate bar and a banana.\nMain stage rotates so gymnasts' moves can be seen from all angles.\nKids can interchange the gymnastic equipment on the main stage, depending on which event is being performed.\nTrampoline’s press-button function launches the competitors into the air.\nLet your budding gymnast imagine what it's like to be awarded a medal on the podium.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nLEGO® Friends sets encourage imaginative play, and make building creative and fun.\nMakes an ideal Christmas gift or gift for the holiday season for creative kids.\nThis set is part of the LEGO® Friends world of everyday heroes and exciting real-world scenarios.\nMain LEGO® gymnastics stage measures over 4” (12cm) high, 4” (12cm) wide and 4” (12cm) deep.\nTrampoline measures over 2” (6cm) wide and 4” (12cm) deep.\nParallel bars measure over 3” (8cm) high, 2” (6cm) wide and 3” (8cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/underwater-loop-41337","description":"Let your child experience the fun of the fair with the LEGO® Friends 41337 Underwater Loop. Realistic features, such as the kiosk where tickets can be bought with bill or coin elements, help recreate the atmosphere of the amusement park. By twisting the function knob children will love watching the chairs, which fit 3 LEGO mini-dolls each, spin and wobble. Kids can then extend the play by pretending to serve at the cotton candy stall, imagining how fun it is to create the sticky pink treats. With a giant crab on top of the kiosk and turtle- and fish-shaped chairs, this LEGO amusement park ride is ocean-themed and looks pretty displayed in a bedroom. This fun playset includes 2 mini-dolls: LEGO Friends Mia and LEGO Friends Vicky.\n\nBuilding kit includes 2 mini-doll figures: LEGO® Friends Mia and LEGO Friends Vicky.\nSea-themed toy features a rotating chair fairground ride, ticket kiosk and a cotton candy toy stall.\nAccessory elements include a ticket, cash coin and bill, underwater elements, pearl element, trident, hair bow, sunglasses and cotton candy toy elements.\nCombine with the LEGO® Friends 41373 Funny Octopus Ride and 41375 Heartlake City Amusement Pier LEGO rides to extend the action-packed fun.\nThis fun-packed sea creature toy ride makes an ideal Christmas gift or gift for the holiday season for creative kids.\nThis construction set is part of the LEGO® Friends world of everyday heroes and exciting real-world scenarios.\nAmusement park toy measures over 6” (17cm) high, 4” (12cm) wide and 3” (9cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/juice-truck-41397","description":"Let little chefs get in a spin about this easy-to-build LEGO® Friends Juice Truck toy (41397). This set for ages 4+ has a wealth of play starters to keep kids entertained for hours, from whizzing up smoothies to chilling on the beach or playing with dolphin toys. This kids' food truck looks great as a desk display or can be driven around a bedroom to wherever the next shot of fruity fun is needed! First steps into the LEGO universe This LEGO Friends 4+ set is a fun way for preschoolers to learn to build. It includes a special Starter Brick chassis that lets even first-time builders feel the pride of constructing a toy truck all on their own. A guiding hand Includes a simple guide to constructing and playing that helps youngsters understand building steps, and grows their imagination and confidence – it's a great way to introduce kids to LEGO brick construction. Download the LEGO Life app and let kids view this LEGO Friends set in Instructions PLUS. In the various modes they will see their creation really come to life.\nEasy-to-build food fun toy that lets little kids explore the joy of making healthy food and drinks. Includes a simple but colorful open-sided truck and a LEGO® beach – all designed especially for little fingers to construct.\nThis Juice Truck (41397) includes a beach scene as well as LEGO® Friends Emma and Andrea mini-dolls, and 2 dolphin figures. 4+ sets help kids learn to develop their construction confidence through simple building steps.\n4+ sets get kids building quickly. They include Starter Bricks that speed up the build and help kids hone early construction skills. With this simple building toy, kids add bricks to the chassis, then they’re ready to roll!\nThis kids’ food truck toy makes an ideal LEGO® gift for preschoolers and young kids who have little brick-building experience. They can use it to interact with characters they recognize from the LEGO Friends TV series.\nThis toy playset will give preschoolers a manageable yet satisfying construction challenge. It measures just over 5” (14cm) long, so kids will be proud to display this neat little toy truck in their room.\nNo batteries are needed to power this food truck playset, just an eagerness to get on the road and start selling smoothies to Heartlake City with LEGO® Friends Emma!\nBreak down barriers to building with the LEGO® Life app. Download it to access Instructions PLUS. Scan in this playset's code and use the various viewing modes to help kids watch their creation come to life!\nLet your budding builder spend time with the girls from Heartlake City, a place where kids can embark on a world of adventure with their best friends by their side.\nSince 1958, LEGO® toys have met the highest industry standards plus The LEGO Group’s own quality criteria, which ensures they are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are tested to extremes to guarantee every building set for kids meets the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/mia-s-foal-stable-41361","description":"Let your child express their nurturing side with LEGO® Friends 41361 4+ Mia’s Foal Stable. This LEGO 4+ horse farm toy is specially designed to be fun and easy for preschoolers and youngsters, with animal figures for role-play fun, as well as a tractor for LEGO Friends Mia to drive around this farm toy, a tack room in the toy horse barn and a fenced paddock. The special Starter Brick base lets even first-time builders experience the pride of constructing buildings, vehicles and more, all on their own. The included simple guide to build and play will also help your young animal-lover understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO brick building in a familiar LEGO Friends setting.\n\nLEGO® 4+ sets are specially designed to be fun and easy for youngsters and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nIncludes a LEGO® Friends Mia mini-doll figure, plus 2 foal figures and a rabbit figure.\nThis set features an easy-to-build toy horse stable, tractor, bunny house and foal pen.\nAccessory elements for this horse and stable toy include a brush, spade, storage box, carrot, hay and an apple.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ playsets were previously branded as LEGO Juniors and are compatible with all LEGO construction sets for creative building.\nThis horse toy for kids makes an ideal gift for preschoolers and youngsters.\nLEGO® Friends horse stable measures over 2” (6cm) high, 5” (14cm) wide and 3” (8cm) deep.\nTractor measures over 1” (4cm) high, 3” (10cm) long and 1” (5cm) wide."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/turtles-rescue-mission-41376","description":"Inspire your animal-lover to be the hero of the day with LEGO® Friends 41376 Turtles Rescue Mission island toy playset. This rescue toy set includes a cool amphibious vehicle that can sail out to sea to the stranded baby turtles from the island, then drive them back to the beachside clinic. With its examination bed and a medicine area, the clinic lets your little one express their nurturing side as they nurse the turtles back to strength. Beneath the clinic is a sand play area where the baby turtles can frolic under the watchful eye of their mother. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This building toy for creative kids includes one mini-doll figure, a robot figure, plus 4 turtle figures.\n\nIncludes an Olivia mini-doll figure, plus a Zobo the robot figure and 4 turtle toys.\nFeatures an amphibious toy car, a beachside clinic on stilts with an examination area and a sand playground, and an island.\nAccessory elements include 2 turtle egg shells, life vest, safety ring, megaphone, milk bottle, syringe, orange juice, watermelon and a ball.\nInspire your little builder to set sail on a LEGO® rescue mission.\nHelp your child to explore how to care for an animal's wellbeing.\nCombine this LEGO® Friends set with adventure toys 41378 Dolphins Rescue Mission, 41380 Lighthouse Rescue Center and 41381 Rescue Mission Boat to extend the action-packed fun.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nLEGO® Friends sets encourage imaginative play, and make building creative and fun.\nMakes an ideal Christmas gift or gift for the holiday season for creative kids.\nThis toy for girls and boys is part of the LEGO® Friends world of everyday heroes and exciting real-world scenarios.\nAmphibious vehicle measures over 1” (4cm) high, 3” (10cm) long and 2” (6cm) wide.\nClinic measures over 4” (12cm) high, 5” (15cm) wide and 3” (9cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/emma-s-mobile-vet-clinic-41360","description":"Let your budding vet display their pet care with LEGO® Friends 41360 4+ Emma’s Mobile Vet Clinic. This LEGO 4+ veterinarian playset is specially designed to be fun and easy for preschoolers and youngsters, with a cool animal ambulance made with a special Starter Brick base that lets even first-time builders experience the pride of constructing buildings, vehicles and more, all on their own. The included simple guide to build and play will also help your young animal lover understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO brick building in a familiar LEGO Friends setting. This simple LEGO vet kit for kids includes veterinarian toys, such as a bed to examine the poorly pet, syringe, brush, dog bone and a baby bottle for endless hours of nurturing role-play, a LEGO Friends Emma mini-doll figure, plus a mini pug figure.\n\nLEGO® 4+ sets are specially designed to be fun and easy for youngsters and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nThis LEGO® Friends vet clinic includes an Emma mini-doll figure, plus a dog figure.\nThis vet playset features a vet's van and separate examination bed.\nAccessory elements include a lamp, brush, syringe, dog bone, plate and a feeding bottle.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ play sets were previously branded as LEGO Juniors and are compatible with all LEGO construction sets for creative building.\nMakes an ideal gift for preschoolers and youngsters.\nMeasures over 1” (4cm) high, 3” (9cm) long and 1” (5cm) wide."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/ice-cream-cart-41389","description":"Let little builders enjoy cool food play on a hot day with LEGO® Friends Ice Cream Cart (41389). This ice cream toy set comes with scoops, cones and popsicle tops for creative mix-and-match flavor fun. Kids can buddy up with the LEGO® Friends Stephanie mini-doll to help her sell her tasty frozen treats. And this ice cream cart toy's neat enough to pop into a bag for imaginative fun on the go. All the feels for the wheels If your kid likes vehicles they'll fall in love with the cute cart andLEGO scooter. The cart unhitches from the scooter for a more dynamic play experience. This LEGO set also helps promote imaginative play as kids decide where Stephanie is zipping off to next. Best times are spent with best friends LEGO Friends sets allow youngsters to role-play hanging out with pals and their cute LEGO pets! All LEGO sets come with easy-to-follow printed instructions, but this one also features Instructions PLUS! Using the zoom, rotate and visualize modes on the LEGO Life app, even younger kids will feel like master builders!\nThis LEGO® ice cream cart toy (41389) makes a top gift for any kid who loves food play. It will get their creative juices flowing as they imagine making and selling delicious treats – or they can role-play the customer.\nThis set contains 97 pieces so play starts quickly. Kids can display the toy food how they want, with the Stephanie mini-doll serving behind the cart and Dash the dog playing out front – or the other way around!\nYour little server can play with the vehicles together or separately as the mini ice cream cart unhitches from the LEGO® scooter. They can mix and match the toy food to give the customer whatever flavor they desire!\nThis is a top gift for boys and girls aged 6 and up who deserve a little surprise treat. The instructions are short and sweet, so even those with little building experience can make a cool food toy real fast!\nAt just over 2” (7cm) high and 5” (14cm) long, this snack-sized treat takes up little room as a desk display and is small enoughto take on a playdate. Or kids can mix it with any other LEGO® set for truly creative play!\nThis is not a static LEGO® Friends set – all the wheels really turn. No batteries are needed, though, because this cute-looking kids’ ice cream cart moves on pulling power alone!\nIs your little builder ready for an awesome play experience? Download the LEGO® Life app and help them use Instructions PLUS to see their ice cream set in zoom, rotate and ‘ghost' modes. It's building for the digital age!\nIntroduce your young builder to the world of LEGO® Friends. A warm welcome awaits them in Heartlake City, where kids can achieve anything they set their hearts on, with their best friends by their side.\nLEGO® toy playsets meet the highest industry standards, plus our own quality criteria, which ensures they are easy for little fingers to pick up, place and pull apart – it's been that way since 1958.\nThe LEGO Group tests its bricks and pieces to make sure every building set meets the highest global safety and quality standards."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/olivia-s-hamster-playground-41383","description":"LEGO® Friends 41383 Olivia’s Hamster Playground is a small and easy-to-build LEGO Friends animal set featuring a clever hamster wheel with a spinning function. The tiny hamster motorcycle fits into the front so it looks like Harry is riding his motorbike round the wheel! It is built on a circular base that can be fitted onto the stage of LEGO Friends 41368 Andrea's Talent Show. Remove the motorbike from the wheel and drive it around the playground, which also comprises a ramp, slalom and a hoop. Includes a LEGO® Friends Olivia mini-doll figure, plus 3 hamster figures\n\nIncludes a LEGO® Friends Olivia mini-doll figure, plus Rumble, Harry and Molly the hamster figures.\nFeatures a spinning hamster wheel and a hamster car and motorcycle.\nAccessory elements include slalom cones, a playground sign and hoop.\nWow the crowds with your amazing performing pet hamsters on their mini vehicles!\nLead the LEGO Friends hamsters through the slalom, over the ramp and on to the amazing spinning wheel.\nFit the circular base onto the stage of LEGO Friends 41368 Andrea's Talent Show.\nLEGO® Friends sets encourage creative play, and make building imaginative and fun.\nWheel measures over 2” (7cm) high, 2” (6cm) wide and 2” (6cm) deep."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/friends-storage-box-40266","description":"Store all your favorite LEGO® Friends accessories in this cute, buildable storage box with opening lid, pullout drawer and decorative stickers."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/chocolate-box-flower-30411","description":"Build this cute heart-shaped box of chocolates and pretty purple tulip. Keep them for yourself or give to a friend to show them how special they are."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/lego-friends-ceramic-mug-853891","description":"Kids can cozy up with their favorite friends over a hot drink with this LEGO® Friends 853891 Ceramic Mug. This eye-catching white mug features a pretty handle shaped like a heart and is decorated with a graphic of the fabulous five friends—Andrea, Olivia, Emma, Stephanie and Mia.\n\nWhite ceramic 300ml mug features a heart-shaped handle and is decorated with an image of Andrea, Olivia, Emma, Stephanie and Mia.\nCup measures over 3” (8cm) tall and 3” (8cm) in diameter."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/creative-rings-853780","description":"Design and customize these LEGO® Friends 853780 Creative Rings for your special friends and family, and make one for yourself too! With 4 rings in 2 different sizes and 58 different LEGO elements to decorate and re-decorate however you like, you can mix and match endless new ring designs. There are even 4 foil pieces to add some extra sparkle!\n\nFeatures 4 colored ring studs in 2 different sizes, 58 LEGO® decoration elements and 4 foil pieces.\nAlso includes a leaflet for decoration inspiration."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/friends-tumbler-with-straw-853889","description":"Take a break from the action in Heartlake City and cool off with this LEGO® 853889 Friends Tumbler with Straw. Graphics of Olivia, Stephanie, Mia, Andrea and Emma decorate the cup, while the straw stays protected with the slide-open cover inspired by the LEGO brick separator element. When you're ready to drink, pull it back and up pops the straw! Just wash to reuse, so you always have the girls with you, helping you care for the environment.\n\nFeatures LEGO® Friends graphics on a durable plastic, 500ml-capacity tumbler with a screw-top lid, slide-open straw protection cover and a transparent straw.\nSlide the brick-separator element to the side to drink from the tumbler.\nMeasures over 6” (16cm) high."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/friends-creative-bag-charms-853881","description":"Give the gift of your heart to your best friend with this LEGO® Friends 853881 Creative Bag Charms set. Decorate and customize the 2 charms with the LEGO elements to show the style you both share, and put them together to form a whole heart. Attach the pretty half-heart charms to your backpacks with the durable purple strings so everyone can see the special bond you share.\n\nIncludes 2 LEGO bag charms with strings, 14 elements and 2 sticker sheets for decoration.\nPut the 2 friendship charms together to form a whole heart!"},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/friends-bag-charm-854000","description":"Give the perfect anytime treat to the little animal-lover in your life with this LEGO® Friends Bag Charm (854000). This cute pink narwhal key chain will bring a pop of color to any kid’s bag. Your youngster can imagine they’ve been part of the LEGO Friends team that has rescued the narwhal and that they now have the important job of caring for it. This cute little fun toy is the ideal travel companion to spark hours of story making at a friend's house or at recess.\nDelight animal-loving youngsters with this LEGO® Friends Bag Charm (854000). This pink narwhal key chain is the perfect gift to brighten up a school bag.\nMakes a fun anytime treat for kids aged 6+ who love colorful key chains or those who love to play nurturing make-believe games.\nThis key chain measures over 2” (7cm) wide and 1” (5cm) long, so it's large enough to be seen but small enough not to get in the way!"},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/olivia-keyring-853883","description":"Take the LEGO® Friends 853883 Olivia Key Chain with you wherever you go, and whenever you’re in a tight spot Olivia can help work things out. There’s nothing this science-mad LEGO Friends girl likes more than applying her analytical mind to figuring out fixes. Attach her to your backpack with the durable ring and chain, and let her problem-solving spirit accompany you on your travels.\n\nIncludes an Olivia mini-doll figure attached to a durable metal chain and ring.\nAttach it to your keys or backpack.\nMini-doll figure is not detachable from metal chain."},{"theme":"friends","themeUrl":"https://www.lego.com/en-us/themes/friends","productUrl":"https://www.lego.com/en-us/product/stephanie-keyring-853882","description":"There’s nothing Stephanie loves more than heading off on a mission to help people. So take the LEGO® Friends 853882 Stephanie Key Chain with you wherever you go and channel her boundless enthusiasm and caring helpfulness. Attach her to your backpack with the durable ring and chain and you're ready to go, wherever adventure calls.\n\nIncludes a Stephanie mini-doll figure attached to a durable metal chain and ring.\nAttach it to your backpack or keys.\nMini-doll figure is not detachable from metal chain."}]