[{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hogwarts-clock-tower-75948","description":"Transport fans of Harry Potter™ aged 9 and over to a magical world inside the LEGO® Harry Potter 75948 Hogwarts™ Clock Tower set. With 8 minifigures and iconic locations from Harry Potter and the Prisoner of Azkaban™ and Harry Potter and the Goblet of Fire™, kids will be immersed in a world of imaginative play. Whether visiting Dumbledore's office or attending a Defense Against the Dark Arts lesson, traveling through time by resetting the tower clock or unwinding at the Yule Ball by operating the ‘dance’ function… once they enter the Hogwarts Clock Tower, they’ll never want to leave!\n\nIncludes 8 new-for-June-2019 Harry Potter™ minifigures: Harry Potter, Ron Weasley™, Hermione Granger™, Fleur Delacour, Cedric Diggory, Viktor Krum, Albus Dumbledore™ and Madame Maxime.\nAll figures come with wands and their Yule Ball costumes.\nThis LEGO® Harry Potter™ toy playset features the 3-level Hogwarts™ Clock Tower, Entrance Hall, Defense Against the Dark Arts classroom, Hospital Wing, Prefects' Bathroom, Dumbledore's Office and a section of icy decorations for the Yule Ball.\nFeatures a clock-changing mechanism for kids to create Time-Turner time travel adventures, and a ‘dance’ function to get the Yule Ball really moving!\nThe Entrance Hall includes a chest and the Goblet of Fire.\nThe Defense Against the Dark Arts classroom includes a table, chair, potions, glass case, book, desk with inkpot with a quill, buildable lamp and a blackboard.\nThe Hospital Wing includes 2 beds and 2 buildable lamps.\nThe Prefects' Bathroom features a mermaid stained-glass window.\nDumbledore’s Office includes a chair and desk with inkpot and quill, the Pensieve and the sword of Gryffindor.\nThe Yule Ball scene includes 2 icy tables with 2 glasses, buildable icy sculpture and a Christmas Tree.\nHogwarts™ Clock Tower measures over 13” (35cm) high, 13” (34cm) wide and 7” (18cm) deep."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hogwarts-moment-charms-class-76385","description":"LEGO® Harry Potter™ Hogwarts™ Moment: Charms Class (76385) is a Hogwarts™ classroom inside the covers of a brick-built book playset. When kids lift the cover, they are transported to Professor Flitwick’s spell-casting Charms lesson.\n\nA portable Hogwarts classroom\nWith a host of features to inspire endless imaginative role play, this fun-packed playset will cast a spell over any Harry Potter fan! There's a built-in blackboard, bookshelf and fireplace, and a variety of furniture and equipment to lift out and expand the play space. Kids can combine this enchanting Harry Potter playset with others in the collection – each opening to reveal a different Hogwarts classroom adventure. All the sets in this series have distinctively colored covers and unique motifs, and interlock to form a 360-degree Hogwarts play experience.\n\nMagical treats for young witches and wizards\nThe extensive range of LEGO Harry Potter playsets provide enchanting gifts that will delight any fan of the popular movies.\n\nLEGO® Harry Potter™ Hogwarts™ Moment: Charms Class (76385) is a brick-built playbook that opens to reveal Professor Flitwick’s spell-casting lesson from the Harry Potter movies.\nIncludes Harry Potter™, Cho Chang and Professor Flitwick minifigures, blackboard, bookshelf, fireplace, spell book and lots of authentic accessories.\nKids open the cover to enter Professor Flitwick's Charms lesson. There are lots of magical supplies to practice with and lots of fun accessories to extend the playeven more.\nFor ages 8 and up. An enchanting treat for young witches and wizards looking for a different way to enjoy Harry Potter™ excitement.\nThis magical Hogwarts™ Moment set measures over 5 in. (12 cm) high, 3 in. (8 cm) wide and 1.5 in. (4 cm) deep – perfect for play and display, and easy to carry around.\nFeatures authentic accessories that kids will recognize from the Harry Potter™ movies, such as a feather and textbook to help students learn the levitation charm.\nThere are more sets in the series for kids to collect. Each one recreates a thrilling lesson in a famous Hogwarts™ classroom. The playsets interlock to create a 360-degree environment.\nThe wide assortment of LEGO® Harry Potter™ sets is packed with popular characters, cool features and familiar locations from the magical movies. Great gifts to inspire imaginative play.\nLEGO® bricks and pieces meet demanding industry standards to ensure they are consistent, compatible and connect and pull apart perfectlyevery time – and it’s been that way since 1958.\nLEGO® sets are rigorously tested to make sure they meet stringent global safety standards."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hogwarts-moment-potions-class-76383","description":"LEGO® Harry Potter™ Hogwarts™ Moment: Potions Class (76383) is a Hogwarts™ classroom playset hidden inside a brick-built playbook. Kids open the cover to be transported to Professor Snape’s Potions lesson.\n\nPortable potion-making playset\nThis magical set is bursting with features and accessories to inspire imaginative role play. Some are built-in, such as the shelves, and some are loose, like the furniture and blackboard, which lift out to expand the play space. This enchanting Harry Potter playset combines with others in the collection. Each opens to transport the child to a different Hogwarts classroom adventure and features a distinctively colored cover decorated with a unique motif. The full range also connect to create a 360-degree Hogwarts play experience.\n\nMagical treats to inspire kids' imaginations\nIf you're looking for an amazing gift for a Harry Potter fan, the wide range of LEGO Harry Potter playsets offer a choice of captivating gifts that will enchant any young witch or wizard.\n\nLEGO® Harry Potter™ Hogwarts™ Moment: Potions Class (76383) is a brick-built playbook that opens and unfolds to reveal the dungeon Potions classroom from the Harry Potter movies.\nIncludes Draco Malfoy™, Seamus Finnigan and Professor Snape™ minifigures, a potion book, blackboard, armchair, table, secret chamber and a dungeon backdrop.\nKids lift the cover to enter Professor Snape's Potions lesson. There is potion-making equipment to practice with – and a secret chamber to explore!\nFor ages 8 and up. Suitable for young witches and wizards looking for a new way to enjoy a Harry Potter™ adventure.\nThis magical Hogwarts™ Moment set measures over 5 in. (12 cm) high, 3 in. (8 cm) wide and 1.5 in. (4 cm) deep – the perfect size for play, portability and placing on a kid's bookshelf.\nFeatures authentic accessories, such as a spoon, knife, cup, pot and a purple potion, plus a dungeon setting that kids will recognize from the Harry Potter™ movies.\nThere are more magical sets like this to collect, each designed to recreate a different Hogwarts™ classroom. When placed together, they connect to create an innovative 360-degree play space.\nAll LEGO® Harry Potter™ sets contain favorite characters, fun features and familiar locations from the popular movies. Captivating, convenient and a magical gift for any young witch or wizard.\nLEGO® pieces fulfil rigorous industry quality standards that ensure they are consistent, compatible and connect and pull apart perfectly every time – and it’s been that way since 1958.\nLEGO® sets are dropped, heated, crushed, twisted and analyzed to make sure they satisfy rigorous global safety standards."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hogwarts-moment-transfiguration-class-76382","description":"LEGO® Harry Potter™ Hogwarts™ Moment: Transfiguration Class (76382) is an instant playset hidden inside a brick-built playbook. Kids open it up and immediately join a lesson in Professor McGonagall's Transfiguration classroom.\n\nHogwarts magic for kids to enjoy wherever they go\nThis spellbinding set is filled with features and accessories to inspire endless enchanting role play. Some are built-in, such as the storage cupboard, while some are loose, like the furniture and blackboard, which lift out to expand the play space. This magical Harry Potter set also combines with others in the collection. Each is designed with a distinctive color and unique motif and opens to transport the child to a different Hogwarts classroom adventure. The full range also connect to create a 360-degree Hogwarts play experience.\n\nEnchanting gifts for curious kids\nIf you're looking for a truly magical treat, LEGO Harry Potter playsets offer a range of captivating gifts that will delight any young witch or wizard.\n\nLEGO® Harry Potter™ Hogwarts™ Moment: Transfiguration Class (76382) is a brick-built playbook that opens to reveal a Hogwarts Transfiguration classroom playset from the Harry Potter movies.\nIncludes Hermione Granger™, Ron Weasley™ and Professor McGonagall™ minifigures, a blackboard, 2 desks, 2 chairs, treasure chest, storage cupboard, spell book and lots of authentic accessories.\nKids open the set's cover to enter Professor McGonagall's Transfiguration lesson. There are lots of magical supplies to practice with – but Ron needs help when his pet rat turns into a goblet!\nFor ages 8 and up. Suitable for young witches and wizards looking for a new way to enjoy a Harry Potter™ adventure.\nThis magical Hogwarts™ Moment set measures over 5 in. (12 cm) high, 3 in. (8 cm) wide and 1.5 in. (4 cm) deep, a perfect size for pick-up-and-play portable convenience.\nFeatures several accessories for extra imaginative fun, such as a teacup, silver goblet and a frog for transfiguration practice, plus Ron's pet rat, Scabbers.\nThere are a series of these magical sets to collect, each designed and decorated to recreate a different Hogwarts™ classroom. Together, they interlock to create an innovative 360-degree play space.\nAll LEGO® Harry Potter™ sets contain favorite characters, fun features and familiar locations from the popular movies. Captivating, convenient and a magical gift for any young witch or wizard.\nLEGO® components fulfil stringent industry quality standards to ensure they are consistent, compatible and connect and pull apart perfectly every time – and it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they satisfy rigorous global safety standards."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hogwarts-castle-71043","description":"Make the magic come alive at the LEGO® Harry Potter™ 71043 Hogwarts™ Castle! This highly detailed LEGO Harry Potter collectible has over 6,000 pieces and offers a rewarding build experience. It comes packed with highlights from the Harry Potter series, where you will discover towers, turrets, chambers, classrooms, creatures, the Whomping Willow™ and Hagrid´s hut, plus many more iconic features. And with 4 minifigures, 27 microfigures featuring students, professors and statues, plus 5 Dementors, this advanced building set makes the perfect Harry Potter gift.\n\nIncludes 4 minifigures: Godric Gryffindor, Helga Hufflepuff, Salazar Slytherin and Rowena Ravenclaw, with a buildable minifigure display stand.\nAlso features 27 microfigures: Harry Potter™, Ron Weasley™, Hermione Granger™, Draco Malfoy™, Albus Dumbledore™, Professor Snape™, Professor McGonagall™, Remus Lupin, Professor Dolores Umbridge™, Argus Filch, Lord Voldemort™, Bellatrix Lestrange, 3 students from each of the 4 houses, 2 chess pieces and the Architect of Hogwarts™ statue and 5 Dementors, plus Aragog the spider and the Basilisk figures, and a buildable Hungarian Horntail dragon.\nFeatures a buildable microscale model of Hogwarts™ Castle, hut of Hagrid™, Whomping Willow™ tree and 5 boats.\nHogwarts™ Castle features the Great Hall with buildable ‘stained glass windows’, house banners, benches, tables, flaming torches and moving staircases; potions classroom with racks of jar elements; Defence Against the Dark Arts classroom with assorted potion jars, gramophone and a closet containing a boggart; Chessboard Chamber with chess piece elements; Room of Requirement with assorted elements, including the Goblet of Fire and the vanishing cabinet; Chamber of Secrets™ with the Basilisk and Tom Riddle’s Diary; hidden Devils Snare room with vine elements; Gryffindor™ common room with fireplace and seating; Professor Dolores Umbridge’s office with desk, chair and pink furnishings; library with bookcase and desks; and Professor Dumbledore’s office with the Griffin statue entrance and Memory cabinet.\nHagrid’s hut features Aragog the spider and buildable pumpkins.\nThe Whomping Willow™ includes the buildable blue Flying Ford Anglia car in its spinning branches.\nAlso includes 5 buildable boats.\nTake a seat in the Great Hall and feast with the Hogwarts™ professors and students!\nSneak your way into the Chamber of Secrets™ through the secret entrance and face the Basilisk!\nAttend a Defence Against the Dark Arts class to learn how to protect yourself from dark magic!\nClimb the moving staircase!\nStudy for your Ordinary Wizarding Level exams in the library.\nAccessory elements include the Sword of Gryffindor™, Helga Hufflepuff´s cup, wands, potions, house banners, flames, a cauldron and 2 magnifying glasses.\nMicrofigure accessories include 2 chess statues and the Architect of Hogwarts™ statue.\nHogwarts™ Castle measures over 22” (58cm) high, 27” (69cm) wide and 16” (43cm) deep."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/attack-on-the-burrow-75980","description":"LEGO® Harry Potter™ Attack on the Burrow (75980) brings imaginative dollhouse role play together with one of the most dramatic scenes in the whole Harry Potter saga.\n\nWill Death Eaters burn down The Burrow?\nThere’s so much to do and discover in The Burrow, the Weasley family house, that one side of the highly detailed dollhouse toy opens up to provide lots more space for kids to play. With 8 minifigures, play can begin right away. As kids recreate the famous scene where the evil Death Eaters, Bellatrix Lestrange and Fenrir Greyback, attack, fire elements can be used to recreate the fire that devastates the building.\n\nChoosing Harry Potter gifts for kids\nIf you’re looking for a cool building toy, LEGO Harry Potter sets are based around thrilling scenes from the popular movies. With collectible minifigures, familiar locations and amazing features, these sets put the Wizarding World of Harry Potter right into children's hands.\n\nKids bring a crazy houseful of action-packed magic to life with the iconic LEGO® Harry Potter™ Attack on the Burrow (75980) dollhouse as they recreate Christmas celebrations and a scary fire-assault on the house.\nIncludes 8 LEGO® minifigures – Ron, Ginny, Arthur and Molly Weasley™, Nymphadora Tonks, Bellatrix Lestrange, Fenrir Greyback and Harry Potter™ – plus lots of features, functions and accessories, and special fire elements.\nThere's fun, excitement and adventure when youngsters explore the feature-packed Weasley house and take on the evil Death Eaters when they try to capture Harry by setting the house on fire.\nThis collectible LEGO® Harry Potter™ dollhouse toy makes a great birthday or Christmas gift. It will enchant, entertain and inspire endless, magical, role-play adventures for boys and girls aged 9 and up.\nThe Weasley family house measures over 13” (34cm) high, 8” (22cm) wide and 7” (18cm) deep. The playset's scale and level of detail make it ideal for hands-on play, and it also looks great on display in any kid’s room.\nThis cool building toy doesn’t need batteries – which means kids can enjoy Harry Potter™ magical fun and adventure that never ends.\nSimple, clear instructions are provided to ensure kids can enjoy a rewarding building experience and imaginative play straight from the box.\nLEGO® Harry Potter™ toys contain favorite characters, amazing creatures and familiar locations from the popular movies. They're an ideal gift for any childwanting to be part of the movie magic.\nLEGO® playsets meet the highest industry standards, which means every building brick is consistent, compatible and connects and pulls apart perfectly every time – no need for magic! – and it’s been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure they meet the highest safety standards in the world and are perfectly safe for your little witch, wizard or Muggle."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hogwarts-astronomy-tower-75969","description":"LEGO® Harry Potter™ Hogwarts™ Astronomy Tower (75969) is filled to the turrets with iconic locations, cool characters and authentic detail from the Harry Potter movies.\n\nToy brick castle bursting with Harry Potter movie action\nThis LEGO Hogwarts playset gives kids the freedom to explore the many fascinating rooms of a magical castle with Harry Potter, Hermione Granger™, Horace Slughorn, Luna Lovegood™, Neville Longbottom™, Ron Weasley™, Lavender Brown, Draco Malfoy™ and Hedwig™. With so manyfamiliar places and popular characters, kids can relive scenes and stories from movies, including Harry Potter and the Half-Blood Prince™, and conjure up endless adventures of their own.\n\nCollectible toys, magical minifigures and non-stop action\nIf you're looking for a top gift for a family member or best friend, LEGO Harry Potter toys offer endless imaginative fun for kids who love building and playing with LEGO bricks.\n\nKids can role-play magical Hogwarts™ stories with favorite characters, iconic locations and realistic details when they enter the LEGO® Harry Potter™ Hogwarts Astronomy Tower (75969).\nThis Hogwarts™ gift set includes many famous Harry Potter™ movie locations, 8 popular minifigures, a Hedwig™ toy and lots of authentic accessories, including mandrake plants, letters, wands and a book of potions.\nKids can be part of the magic when they visit the Potions master's classroom and attend his party, check out a mandrake in the greenhouse, explore Ravenclaw dormitory then head to the tallest tower for Astronomy class.\nWith LEGO® minifigures including Draco Malfoy™ and Neville Longbottom™, this unique Harry Potter™ toy construction set is a cool gift for kids aged 9 and up.\nThe model measures over 15” (40cm) high, 11” (29cm) wide and 6” (17cm) deep and connects seamlessly with LEGO® Hogwarts™ sets 75953, 75954 and 75948 (limited availability for some sets).\nNo batteries needed. This hands-on Harry Potter™ building set provides endless imaginative fun fueled purely by children’s imaginations. And, when the action stops, the model looks awesome on display in any kid’s room.\nSimple instructions get kids building and playing right away. As they explore the magical toy castle playset, young imaginations will be inspired to dream up endless imaginative role-play possibilities.\nLEGO® Harry Potter™ building sets bring the excitement of the movies to life! With popular characters and creatures, cool locations and amazing features and accessories, they put Harry Potter magic into kids’ hands.\nLEGO® building sets meet the highest industry standards, which means every brick is consistent, compatible and connects and pulls apart perfectly every time – no need for magic! – and it's been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure every building set meets the highest safety standards in the world. That's why they make great gifts for kids!"},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hogwarts-great-hall-75954","description":"Build and recreate a magical fantasy realm from the Harry Potter™ movies with this detailed 4-level LEGO® 75954 Hogwarts™ Great Hall Harry Potter building kit, featuring a fireplace, benches, tables and reversible house banners, plus the Grand Staircase tower with a spiral staircase, potions room, treasure room, sorting hat, Mirror of Erised™ and lots of magical artifact accessory elements. This fantasy role-playing castle toy includes 10 minifigures and buildable Basilisk and Fawkes™ creatures, plus Hedwig™ and Scabbers™ figures.\n\nIncludes 10 minifigures: Harry Potter™, Ron Weasley™, Hermione Granger™, Draco Malfoy™, Susan Bones, Professor McGonagall™, Professor Quirrell with dual Lord Voldemort™ face, Hagrid™, Albus Dumbledore™ and Nearly Headless Nick, plus buildable Basilisk and Fawkes™ creatures, and Hedwig™ and Scabbers™ figures.\nFeatures the buildable Great Hall and a tower.\nThe Great Hall features tables, head table with seats, fireplace, 2 reversible house banners and 4 ‘floating' candles, food (turkey leg, ice cream and a small cake), brooms, trophy cup and a teapot.\n4-level tower features movable Grand Staircase spiral steps at its base, potions room, treasure room with chest and a turret featuring the Mirror of Erised™ with changeable pictures and roosting spot for Fawkes™.\nAlso includes a boat with hanging lantern.\nPlace the students in the boat and sail to Hogwarts™ castle.\nHelp Hermione and Susan create magical potions.\nFeast in the Great Hall and use the sorting hat to select the students’ houses!\nWelcome the new students with Hagrid™ and Professors Dumbledore™ and McGonagall™.\nUse the magic wands to pitch Harry against Draco in the Dueling Club!\nSwoop Fawkes™ into battle and help Harry battle the giant Basilisk serpent.\nGaze into the Mirror of Erised™ with Ron and change the picture.\nTurn Quirinus Quirrell into Lord Voldemort™ by rotating his head!\nRecreate iconic scenes from the Harry Potter™ movies.\nAccessory elements include 7 wands, 3 tumblers, an umbrella, lantern, broom, sorting hat, cauldrons, potions, candles, 2 wizard brooms, food, trophy, teapot, chest and a spider.\nCombines with the 75953 Hogwarts™ Whomping Willow™ for even bigger LEGO® Harry Potter™ adventures.\nHogwarts™ Great Hall measures over 14” (37cm) high, 11” (30cm) wide and 7” (18cm) deep."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hogwarts-express-75955","description":"Step aboard the iconic LEGO® Harry Potter™ 75955 Hogwarts™ Express train from King’s Cross Station, featuring a railway bridge with a clock and steps leading to Platform 9¾™, moving brick wall entrance, ‘Wanted’ poster and Daily Prophet newspapers, plus a train toy and carriage with 4 seats and removable side panel and roof. Order candy from the Trolley Witch, fly the Dementor™ into the carriage and recreate fantasy realm scenes from blockbuster Harry Potter™ movies. This great LEGO Harry Potter gift also includes 5 minifigures plus Dementor and Scabbers™ figures.\n\nIncludes 5 minifigures: Harry Potter™, Ron Weasley™, Hermione Granger™, Remus Lupin and the Trolley Witch, plus Dementor™ and Scabbers™ figures.\nFeatures the iconic King’s Cross Platform 9¾™ and Hogwarts™ Express train.\nPlatform features a railway bridge with a clock, steps that lead to a moving brick wall entrance, newspaper stand with 2 Daily Prophet newspapers, and a ‘Wanted' poster.\nHogwarts™ Express train includes a carriage with 4 seats, removable side panel and roof, plus the Trolley Witch with sweets trolley.\nRemove the train carriage roof and side panel to place the minifigures in their seats.\nOrder a chocolate frog and more candy from the Trolley Witch.\nAccessory elements include 3 pieces of luggage, 4 wands, chocolate frog, ice cream, 2 newspapers, King's Cross Station sign, Platform 9¾™ sign and a ‘Wanted' poster.\nSwoop a Dementor™ into the carriage to torment Harry, then cast a spell with a wand to send it away!\nRecreate iconic scenes from the Harry Potter™ movies.\nPlatform measures over 5” (13cm) high, 12” (31cm) wide and 6” (17cm) deep.\nHogwarts™ Express measures over 3” (9cm) high, 18” (46cm) long and 1” (5cm) wide."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/4-privet-drive-75968","description":"LEGO® Harry Potter™ 4 Privet Drive (75968) takes kids into one of the most infamous houses in all the Harry Potter movies.\n\nToy house with minifigures and magical movie scenes\nHarry Potter fans will have endless fun with Harry, Ron Weasley™, Dudley Dursley, Vernon Dursley, Petunia Dursley and Dobby™ minifigures. They'll enjoy imaginative play all over the fully equipped 2-story house, including locating Harry's secret cupboard under the stairs and activating the flood of Hogwarts™ acceptanceletters through the letter box.\n\nCollectible Harry Potter flying car toy\nThe magical excitement continues outdoors when Ron appears at the upstairs window with the flying Ford Anglia. Kids open the trunk to attach a chain to its hook and, very soon, the window is dragged off and Harry escapes!\n\nChoosing the best Harry Potter gift\nIf you're looking for the best children's toy, LEGO Harry Potter gifts offer endless imaginative fun with collectible minifigures and amazing features.\n\nKids can recreate all the incredible events that happen at the Dursley’s family home in Privet Drive and, with so many minifigures and fun features to inspire them, create endless Harry Potter™ adventures of their own.\nIncludes 6 minifigures – Harry Potter™, Ron Weasley™, Dudley Dursley, Vernon Dursley, Petunia Dursley and Dobby™ – Hedwig™ the owl, a flying car with opening roof, doors and trunk, plus loads of authentic accessories.\nLEGO® Harry Potter™ 4 Privet Drive (75968) recreates lots of exciting movie scenes, including Harry’s cupboard under the stairs, mail pouring in from the fireplace and Harry’s escape in the flying Ford Anglia.\nThis dollhouse playset will engage and entertain boys and girls aged 8 and up. The collectible building toy inspires imaginative stories and role-playing games with minifigures and more from the Harry Potter™ movies.\nThe house measures over 6” (17cm) high, 6” (16cm) wide and 4” (12cm) deep and the car is over 4” (12cm) long. The large scale and authentic detail make this playset ideal for display as well as hands-on play.\nThis collectible Harry Potter™ children’s building toy doesn’t need batteries. Kids can enjoy hands-on fun, playing anywhere, anytime, independently or with friends and family.\nSimple, clear instructions are provided to ensure kids can build and play without delay. And as they explore the dollhouse set, young imaginations will be inspired to dream up endless imaginative play possibilities.\nLEGO® Harry Potter™ toys make great gifts for kids wanting the best way to bring the movies to life! Filled with favorite characters, creatures and locations, LEGO Harry Potter playsets put the magic into kids’ hands.\nLEGO® playsets meet the highest industry standards, which means every building brick is consistent, compatible and connects and pulls apart perfectly every time – no need for magic! – and it's been that way since 1958.\nYou can rely on LEGO® bricks and pieces to be absolutely safe for your child. They are dropped, heated, crushed, twisted and analyzed to ensure they meet the highest safety standards in the world."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hogwarts-whomping-willow-75953","description":"Help Harry and Ron race to Hogwarts™ in this action-packed LEGO® Harry Potter™ 75953 Hogwarts Whomping Willow™ set, as seen in Harry Potter and the Chamber of Secrets. Fly the Ford Anglia into the spinning branches of the Whomping Willow, then help the young wizards escape to join Hermione at Hogwarts, featuring a dormitory, potions classroom, Professor Snape's office and an owlery. This fantastic Harry Potter building kit includes 6 minifigures and a Hedwig™ owl figure.\n\nIncludes 6 minifigures: Harry Potter™, Ron Weasley™, Hermione Granger™, Seamus Finnigan, Argus Filch and Severus Snape™, plus a Hedwig™ owl figure.\nFeatures the buildable Whomping Willow™ tree, Flying Ford Anglia car and Hogwarts™ castle section.\nWhomping Willow™ features spinning branches and the Shrieking Shack tunnel entrance.\nFlying Ford Anglia features 2 opening doors and an opening trunk with suitcases.\n3-level Hogwarts™ castle section features a gate, parapet walk, 3 turrets, dormitory with 2 beds, potions classroom with worktable and Severus Snape’s office.\nSpin the tree’s branches to capture the car, then throw it to the ground to release Ron and Harry and drive through the castle gate.\nPatrol the ramparts with Argus Filch and his lantern.\nMix potions with Professor Snape™ in the classroom.\nAccessory elements include potions, cauldrons, 2 suitcases, 5 wands, candles, a lantern, Daily Prophet newspaper and magic spell page, broom, tables, chair, tools and 2 inkpots with a quill.\nCombines with the 75954 Hogwarts™ Great Hall for even bigger LEGO® Harry Potter™ adventures.\nRecreate iconic scenes from the Harry Potter™ movies.\nWhomping Willow™ measures over 7” (18cm) high, 7” (20cm) wide and 7” (20cm) deep.\nFlying Ford Anglia measures over 1” (5cm) high, 4” (11cm) long and 2” (6cm) wide.\nHogwarts™ castle section measures over 10” (27cm) high, 13” (35cm) wide and 3” (8cm) deep."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hagrid-s-hut-buckbeak-s-rescue-75947","description":"Young witches and wizards can recreate magical scenes from Harry Potter™ and the Prisoner of Azkaban™ with the LEGO® Harry Potter 75947 Hagrid’s Hut: Buckbeak’s Rescue playset. This cool toy for kids gives Harry Potter fans aged 8 and over endless opportunities for imaginative role-play. They can explore the detailed interior of Hagrid's hut, hide behind Hagrid's pumpkin patch when the Minister of Magic and the Executioner arrive, then rescue Buckbeak™ the Hippogriff from the Executioner's axe. The magical adventures will never end with this Harry Potter LEGO set. Includes 6 minifigures, a buildable Buckbeak figure with moveable wings and head and a host of accessories and features including a button-operated light brick for the fireplace.\n\nIncludes 6 LEGO® Harry Potter™ minifigures: Hagrid™ and new-for-June-2019 Harry Potter, Ron Weasley™, Hermione Granger™, Executioner and the Minister of Magic plus a Buckbeak™ the Hippogriff figure with moveable wings and head, restrained by a removable chain.\nThis LEGO® Harry Potter™ set features Hagrid's 2-section buildable woodland hut with pumpkin patch outside.\nLEGO® Hagrid´s Hut's desk room includes a desk with chair, candle, chest, chocolate frog, Daily Prophet newspaper and a spider.\nLEGO® Hagrid´s Hut’s main room includes a table with 2 chairs, buildable armchair, chimney with light brick, egg in a bowl, bag, display case, Hagrid’s pink umbrella, shovel, teapot, spoon, pan, meat cleaver, lasso, broom and a bucket.\nAlso includes pumpkins, lantern, axe, 3 wands, the Minister of Magic's hat and a removable chain for Buckbeak™.\nLEGO® Hagrid´s Hut measures over 6” (16cm) high, 9” (23cm) wide and 4” (12cm) deep.\nBuckbeak™ figure with wings open measures over 1” (5cm) high, 2” (7cm) long and 4” (12cm) wide."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hedwig-75979","description":"Bring the magical personality and elegant movement of Hedwig™, the celebrated snowy owl from the Harry Potter™ movies, to life. The collectible LEGO® Harry Potter Hedwig (75979) display toy offers a rewarding building experience and looks magnificent on show.\n\nBuildable Hedwig the owl with ‘flying' wings\nWith a wingspan of over 13” (34cm), this 630-piece brick-build model shows Hedwig in flight, delivering an important letter. Once the build is complete, a turn of a handle causes the jointedwings to move gracefully up and down. The collectible model stands on a sturdy base with a detachable LEGO Harry Potter minifigure and another, smaller, Hedwig the owl toy with wings spread open.\n\nCollectible Harry Potter toys – great Christmas or birthday gifts\nIf you're looking for a cool gift or popular buildable model for kids or Harry Potter fans of any age, the range of LEGO Harry Potter toys are sure to provide endless magical pleasure.\n\nHarry Potter™ fans will be captivated by the collectible LEGO® Hedwig™ (75979) toy. The model includes impressive detail and a mechanism that makes the jointed wings move gracefully up and down.\nThis authentic toy shows Hedwig™ the snowy owl delivering an important letter from Hogwarts™. Also included is a detachable LEGO® Harry Potter™ minifigure and a mini Hedwig toy.\nThe detailed model is displayed in flight. Turning the handle at the rear operates a mechanism that drives the toy's wings up and down, with the cleverly designed joints producing a realistic beating appearance.\nIf you’re looking for a cool Harry Potter™ gift for kids or a building challenge that will appeal to LEGO® fans of any age, this Hedwig the owl toy is an ideal Christmas or birthday present for anyone aged 10 and up.\nWith a wingspan of over 13” (34cm) and a beak-to-tail measurement of over 7” (20cm), this mechanical Hedwig™ collectible LEGO® set makes an impressive display that is sure to be the center of attention.\nThis LEGO® Harry Potter™ set doesn’t need any batteries. The moving wings are powered purely by a hand-turned mechanism at the rear of the toy.\nClear instructions ensure the construction process is problem-free, delivering a rewarding building experience and a feeling of great satisfaction on seeing the result.\nFor a perfect gift for any fan of the movies, the range of LEGO® Harry Potter™ building sets bring memorable scenes to life as cool, collectible, popular toysthat put the magic in kids’ hands.\nAll LEGO® buildable toys meet the highest global industry standards, ensuring all components are consistent, compatible and connect and pull apart easily every time – no magic required!\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure every building set meets the world's foremost safety standards."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/the-knight-bus-75957","description":"Give your young witch or wizard the ride of their life aboard the LEGO® Harry Potter™ 75957 Knight Bus™! When kids catch the purple triple-decker bus, they know they’re in for a wild ride. With a hinged side panel for easy access to the interior, and a removable roof to reveal the upper deck, this magical toy bus playset is bursting with play potential. Once Harry's trunk has been loaded, it's time to hold tight. As the vehicle races away, swerving around corners and bouncing over bumps, kids will love how the bed slides back and forth and the chandelier swings from the ceiling. Includes 3 minifigures.\n\nIncludes 3 new-for-June-2019 LEGO® Harry Potter™ minifigures: Harry Potter, Stan Shunpike and Ernie Prang.\nThis 3-level LEGO® bus features an opening hinged side panel and a removable roof to maximize play potential.\nAlso includes a sliding bed and swinging chandelier that move as the bus swerves and turns.\nThe cheeky Shrunken Head and Harry Potter's chest containing a wand, letter, chocolate bar and a potion bottle add to the action and inspire imaginative play.\nThe Knight Bus™ measures over 6” (16cm) high, 6” (16cm) long and 2” (6cm) wide."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hogwarts-room-of-requirement-75966","description":"LEGO® Harry Potter™ Hogwarts™ Room of Requirement (75966) transports young witches and wizards into a magical world as they join a group of friends on a secret mission to overcome powerful dark magic.\n\nHarry Potter and the Order of the Phoenix™ role-play toy\nFans of Harry Potter can recreate classic movie moments and conjure up imaginative adventures of their own with Harry, Hermione Granger™ and Luna Lovegood™. Dumbledore's Army are practicing spells in the mysterious Room of Requirement. Kids can help Harry teach the Patronus charm. There’s a Hare for Luna and an Otter for Hermione. Power shooters fit into the minifigures’ hands and fire at the mechanical Death Eater toy. With a host of cool features and accessories, the magical fun will never end!\n\nMagic, mystery and endless adventure\nLEGO Harry Potter sets recreate action-packed scenes from the movies. With favorite characters, mythical creatures and familiar locations, these enchanting playsets bring the Wizarding World to life!\n\nKids can role-play favorite Hogwarts™ stories with Dumbledore’s Army as they practice spells for their secret mission to defeat the forces of evil.\nIncludes 3 minifigures with wands – Harry Potter™, Hermione Granger™, Luna Lovegood™ – 2 animal Patronuses, power shooter, dummy Death Eater and a detailed room with a pillar, board and fireplace.\nKids slide a panel then enter a hidden door for secret Defense Against the Dark Arts practice with Harry Potter™ and friends. There they can conjure up Patronuses, fire shooters and use cool features for imaginative fun.\nThe LEGO® Harry Potter™ Hogwarts™ Room of Requirement (75966) children’s building toy will transport boys and girls aged 7 and up to a world of magical make-believe and imaginative adventures at Hogwarts School of Witchcraft and Wizardry.\nThe full model, when connected, measures over 2\" (7cm) high, 7\" (19cm) long and 2\" (6cm) deep. The different sections of the set can be attached in a variety of configurations to inspire new ways to play.\nThis cool Harry Potter™ toy doesn’t need batteries, so kids get creative fun, imaginative role play and hands-on action and adventure whenever and wherever they want it.\nSimple, clear instructions get kids building and playing right away – and the fun doesn't stop there. The 3 cool minifigures look great on display or incorporated with other LEGO® Harry Potter™ sets.\nLEGO® Harry Potter™ toys bring thrilling scenes from the movies to life! With popular characters, amazing creatures and cool locations, these feature-packed sets put the world of Harry Potter into kids’ hands.\nEver since 1958, LEGO® bricks have met the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – no need to use magic!\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure every building set meets the highest safety standards in the world."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hogwarts-students-acc-set-40419","description":"Make any child’s Harry Potter™ role-play fun even more magical with the LEGO® Harry Potter Hogwarts™ Students Accessory Set (40419). From Gryffindor™, Harry Potter carries his wand and Marauder’s map. From Slytherin™, Draco Malfoy™ clutches a wand and an apple. From Hufflepuff™, Hannah Abbott holds her wand and a lantern. From Ravenclaw™, Cho Chang has a wand and a book – and there's even a bookshelf for the book to sit on when she's finished reading.\nIncludes 4 Hogwarts™ student minifigures dressed in their House uniforms with accessories to enhance the play possibilities of any LEGO® Harry Potter™ playset.\nThe Harry Potter™ minifigure has a wand and Marauder’s map; the Draco Malfoy™ minifigure has a wand and an apple; the Hannah Abbott minifigure has a wand and lantern; and the Cho Chang minifigure has a wand and a book.\nAlso includes a buildable bookshelf.\nWith 53 pieces, this versatile set is suitable for anyone aged 6 and up."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/forbidden-forest-umbridge-s-encounter-75967","description":"Harry Potter™ fans can create a magical world of giants, centaurs and enchanted trees as they enter the Forbidden Forest with LEGO® Harry Potter Forbidden Forest: Umbridge’s Encounter (75967).\n\nMinifigures and magical creatures in the Forbidden Forest\nKids enter the Forbidden Forest with 3 minifigures – Harry Potter, Hermione Granger™ and Dolores Umbridge™ – and cast a spell to open the large tree and reveal a selection of accessories: A lantern, bone and turkey leg. There are 2 centaur figures and a posable giant Grawp that kids can use to pick up Umbridge and take her… wherever they want. Young witches and wizards will love acting out classic moments from Harry Potter movies and dreaming up magical adventures.\n\nChoosing the best toy for Harry Potter fans\nIf you're looking for a special birthday or Christmas gift, LEGO Harry Potter toys recreate memorable scenes from the movies with favorite characters and cool creatures that'll put the Wizarding World right into your kids' hands.\n\nThis popular Harry Potter and the Order of the Phoenix™ toy inspires kids’ creative thinking, problem solving and role-play fun as young witches and wizards recreate Forbidden Forest adventures.\nHarry Potter™ fans bring the magic to life with 3 minifigures – Harry Potter, Hermione Granger™, Dolores Umbridge™ – 2 centaurs, a posable Grawp giant and an opening tree containing a lantern, bone and a turkey leg.\nEngage and entertain kids with a journey into the Forbidden Forest where they encounter an opening tree with surprises inside, magical creatures and a plot to deal with the cruel Dolores Umbridge™ once and for all!\nLEGO® Harry Potter™ Forbidden Forest: Umbridge’s Encounter (75967) is a popular birthday gift for kids aged 7 and up who like action-packed playsets and cool building brick toys.\nThe tree, when closed, measures over 4” (12cm) high and Grawp stands over 5” (13cm) high, providing a magical large-scale model for use as part of kids' role-play adventures or on display in their rooms.\nNo batteries needed. This hands-on Harry Potter™ toy gives kids endless imaginative fun, whenever and wherever they want it.\nGet kids building and playing immediately with simple, clear instructions. For even more fun, kids can combine this playset with other LEGO® Harry Potter™ toys.\nWith popular characters, amazing creatures and cool locations, LEGO® Harry Potter™ toys bring thrilling scenes from the movies to life! With these feature-packed sets, the magic is in kids' hands.\nLEGO® construction toys meet the highest industry standards to ensure every brick is consistent and compatible, connecting and pulling apart perfectly every time – no magic required!\nAll LEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure each one meets the highest safety standards in the world."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/harry-potter-hogwarts-crests-31201","description":"Harry Potter™ fans seeking a project to reflect their passion can build 1 of 4 crests with this LEGO® Art Harry Potter Hogwarts™ Crests (31201) wall art set and enjoy a relaxing escape into an iconic world.\n\nStress reliever\nBuild a tile mosaic picture of the Hogwarts crest of your choice – Gryffindor™, Slytherin™, Hufflepuff™ or Ravenclaw™ – with this 4,249-piece wall art set. As you build, listen to the included Soundtrack and learn more about the houses and the world of Harry Potter. Readyfor a change? Rebuild it into a new crest or collect all 4 sets to create the ultimate Hogwarts crest.\n\nCreative hobbies for adults\nYou don’t have to be an artist or LEGO collector to appreciate the beauty and creativity of this set. Once it’s complete, you can display it with pride in your home or office. This LEGO Art set is part of a collection of building kits focused on art, music, design and architecture, which make great gifts for any adult (including yourself) seeking a new hobby or project.\n\nReflect your love of all things Hogwarts™ with this stunning LEGO® Art Harry Potter™ Hogwarts Crests (31201) set, which lets you build and display 1 of 4 detailed house crests.\nEscape the daily grind with this LEGO® set, featuring 4,249 pieces, including 9 canvas wall decor plates, exclusive Harry Potter™ logo tile, brick-built frame, unique hanging element and tile tool.\nThis set immerses you in your passion for both arts and crafts and the Harry Potter™ series while you relax and recharge. With the included Soundtrack, you learn more about the houses as you build.\nCelebrate your love of magic and adventure by building and displaying this unique mosaic wall art. To extend the stress relief, combine 4 of the sets to create the ultimate Hogwarts™ crest.\nThis piece measures over 15.5 in. (40 cm) square, has 4 building options and makes a relaxing activity for you or any other Harry Potter™ enthusiasts in your life who also love DIY art projects.\nThe coffee-table-qualityinstructions guide you through the project and offer a stress-relieving road map through the art, along with some creative LEGO® relaxation.\nPerfect for adults to display on a wall or shelf, LEGO® Art kits offer you a rewarding building experience while you explore your passion for creative arts and crafts.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it's been that way since 1958.\nLEGO® components are dropped, squashed, twisted, heated, bent, scratched and stretched to make sure this Hogwarts™ Crests wall decor piece meets stringent global safety standards."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/harry-potter-keyring-854114","description":"Fans of the Harry Potter™ movies will be enchanted by this LEGO® Harry Potter Key Chain (854114). Securely attached to a strong metal chain with a durable metal ring is a genuine LEGO Harry Potter minifigure wearing his familiar Gryffindor™ uniform. Young witches and wizards can attach the iconic character to their keys, backpacks, lunchboxes and more to make every day magical.\nFeatures a LEGO® Harry Potter™ minifigure attached to a durable metal ring and chain. The minifigure is fixed firmly to the metal chain and cannot be removed.\nMetal ring attaches easily and securely to keys, backpacks, lunchboxes and more.\nMeasures over 3 in. (9 cm) high, 1 in. (4cm) wide and under 1 in. (1cm) deep. Suitable for kids aged 6 and up."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hermione-keyring-854115","description":"Young witches and wizards will love this LEGO® Hermione Granger™ Key Chain (854115). A genuine LEGO Hermione Granger minifigure wearing the familiar Gryffindor™ uniform is attached to a strong metal chain with a durable metal ring. Fans of the Harry Potter™ movies can attach the smart student witch to their keys, backpacks, lunchboxes and more. A great way to make every day magical.\nFeatures a LEGO® Hermione Granger™ minifigure attached to a durable metal ring and chain. The minifigure is fixed firmly to the metal chain and cannot be removed.\nMetal ring attaches easily and securely to keys, backpacks, lunchboxes and more.\nMeasures over 3 in. (9 cm) high, 1 in. (4cm) wide and under 1 in. (1cm) deep. Suitable for kids aged 6 and up."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/ron-keyring-854116","description":"Fans of the Harry Potter™ movies can make every day magical with this LEGO® Ron Weasley™ Key Chain (854116). A genuine LEGO Ron Weasley minifigure wearing the familiar Gryffindor™ uniform is attached to a strong metal chain with a durable metal ring that young witches and wizards can fix securely to keys, backpacks, lunchboxes and more.\nFeatures a LEGO® Ron Weasley™ minifigure attached to a durable metal ring and chain. The minifigure is fixed firmly to the metal chain and cannot be removed.\nMetal ring attaches easily and securely to keys, backpacks, lunchboxes and more.\nMeasures over 3 in. (9 cm) high, 1 in. (4cm) wide and under 1 in. (1cm) deep. Suitable for kids aged 6 and up."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/diagon-alley-75978","description":"LEGO® Harry Potter™ Diagon Alley™ (75978) is a superb recreation of London’s most magical shopping street for fans of the Harry Potter movies aged 16 and up.\n\nIconic stores packed with authentic movie details\nMeasuring more than a meter wide, the impressive model captures the scale and ambience of the bustling magic-supplies hub. Behind magnificent facades lie intriguing interiors, fascinating features and familiar characters. Check out the wands at Ollivanders™; drop in on Gilderoy Lockhart™'s book-signing event at Flourish & Blotts™ bookseller; obtain a love potion from Weasleys' Wizard Wheezes™; and peruse the products and paraphernalia at Scribbulus™ Writing Implements, Quality Quidditch™ Supplies, Florean Fortescue's Ice Cream Parlor and the Daily Prophet™.\n\nCool collectible building toys\nThe extensive range of LEGO models and playsets provide fans of the Harry Potter Universe with endless imaginative fun and creative display possibilities.\n\nThis large LEGO® Harry Potter™ Diagon Alley™ (75978) display model gives fans of the Harry Potter movies aged 16 and up a chance to recreate magical London’s most magical shopping street.\nIncludes Ollivanders™ Wand Shop, Scribbulus™ Writing Implements, Quality Quidditch™ Supplies, Florean Fortescue's Ice Cream Parlor, Flourish & Blotts™ bookseller, Weasleys' Wizard Wheezes™ and the Daily Prophet™ entrance.\nAuthentic accessories and familiar minifigures from the Harry Potter™ movies makeit possible to create a ‘living model’ with endless possibilities to rearrange and create new narratives.\nThis challenging and rewarding construction set makes a great Christmas or birthday gift for kids, Harry Potter™ fans, model enthusiasts and lovers of LEGO® brick building aged 16 and up.\nMeasuring over 11” (29cm) high, 40” (102cm) wide and 5” (13cm) deep, this LEGO® Harry Potter™ Diagon Alley™ set is crammed to the rooftops with authentic details.\nNo batteries required. This modular construction set provides a hands-on, fulfilling building experience. Even the famous hat-lifting entrance to Weasleys' Wizard Wheezes™ is powered by hand.\nIf you’re thinking of buying this remarkable model as a gift for someone new to LEGO® building kits, don't worry – it comes with easy-to-follow, printed building instructions. Open the box and let the building fun begin!\nLEGO® Harry Potter™ sets contain favorite characters, amazing features and familiar locations from the popular movies. They make ideal gifts for anyone wanting to recreate the movie magic.\nLEGO® construction toys meet the highest industry standards to ensure every brick is consistent and compatible, connecting and pulling apart perfectly every time – no magic required!\nAll LEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure each one meets the highest safety standards in the world."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hogwarts-moment-herbology-class-76384","description":"LEGO® Harry Potter™ Hogwarts™ Moment: Herbology Class (76384) is a classroom playset inside a brick-built playbook. Kids open the cover and instantly enter Professor Sprout’s Herbology lesson in the Hogwarts greenhouse.\n\nA pick-up-and-play Hogwarts Herbology class\nThis portable playset is filled with familiar features from the Harry Potter movies. Some are built-in, such as the storage cupboard, and some are loose, like the watering station, which lifts out to expand the play space. This captivating Harry Potter playset can be combined with other playsets in the collection – each opening to reveal a different Hogwarts classroom adventure. Designed with distinctive colors and a unique motif, the playsets all connect to create a 360-degree Hogwarts play space for kids to explore.\n\nMagical gifts for Harry Potter fans\nLooking for a treat for a Harry Potter enthusiast? There are lots of LEGO Harry Potter playsets to choose from – each designed to enchant and inspire kids' imaginations.\n\nLEGO® Harry Potter™ Hogwarts™ Moment: Herbology Class (76384) is a brick-built playbook that opens and unfolds to reveal the Hogwarts greenhouse, where a Herbology lesson is taking place.\nIncludes Cedric Diggory, Neville Longbottom™ and Professor Sprout minifigures, a spell book, pumpkin patch, watering station with bucket and golden faucet, and a greenhouse backdrop.\nKids lift the cover to enter Professor Sprout's Herbology lesson. There is gardening equipment and enchanted plants to practice with – and safety warnings about the monstrous Mandrake!\nFor ages 8 and up. A great gift for young witches and wizards looking for a different way to experience Harry Potter™ magic and excitement.\nThis magical Hogwarts™ Moment set measures over 5 in. (12 cm) high, 3 in. (8 cm) wide and 1.5 in. (4 cm) deep – an ideal size for pick-up-and-play portability. It looks cool on a bookshelf, too.\nFeatures authentic accessories, such as a silver spade and pruning scissors, and a greenhouse setting that kids will know from famous scenes in the Harry Potter™ movies.\nThere are other sets in the series to collect. Designed to recreate different magical classrooms, they can be placed together to produce a 360-degree Hogwarts™ play experience.\nAll LEGO® Harry Potter™ sets are bursting with characters, features and locations from the magical movies to enchant and inspire endless imaginative play.\nLEGO® building components meet stringent industry standards to ensure they are compatible and connect and pull apart consistently every time – it’s been that way since 1958.\nLEGO® sets are tested to the max to make sure they meet stringent global safety standards."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/beauxbatons-carriage-arrival-at-hogwarts-poudlard-75958","description":"Imaginations will take flight with the LEGO® Harry Potter™ 75958 Beauxbatons’ Carriage: Arrival at Hogwarts™ building kit. Young witches and wizards will relive the thrilling scene from Harry Potter and the Goblet of Fire™ where the magnificent flying carriage makes its hair-raising journey to Hogwarts, with Hagrid™ waiting to guide it safely in to land. Once on the ground, the carriage rebuilds into a 2-floor bedroom and tea-drinking area—the perfect place to plan new adventures with Madame Maxime, Fleur Delacour and Gabrielle Delacour. With 4 minifigures and 2 flying horses with moveable wings, legs and heads, the Beauxbatons’ carriage will transport any Harry Potter fan to a magical world of imaginative play.\n\nThis LEGO® Harry Potter™ toy includes 4 minifigures: Hagrid™, Madame Maxime, Fleur Delacour and Gabrielle Delacour.\nThe buildable toy carriage has an opening door to enable access to the interior.\nOn land, the ornate flying carriage rebuilds as a 2-floor living space, with 2 banquettes and a buildable table on the first floor and 2 beds and a shelf with 2 drawers on the second floor.\n2 winged horses (called Abraxans) have poseable heads, legs and wings.\nHagrid™ wears his Yule Ball costume, Fleur Delacour and Gabrielle Delacour each wear their student uniform and have a wand.\nAccessory elements include a chest, 4 lanterns (attached to the carriage), a letter, 4 tea cups and a teapot, a bottle to feed the horses and 2 paddles used by Hagrid™ to guide the carriage in to land.\nToy carriage with horses measures over 5” (13cm) high, 11” (30cm) long and 8” (21cm) wide.\nToy carriage without horses measures over 5” (13cm) high, 7” (18cm) long and 3” (8cm) wide.\nToy carriage rebuilt as 2-floor accommodation measures over 7” (20cm) high."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/lego-harry-potter-advent-calendar-75981","description":"Celebrate Christmas in the Wizarding World with this magical LEGO® Harry Potter™ Advent Calendar (75981). Behind each of the 24 doors is a different toy or figure from the Harry Potter series. As the big day gets closer, kids can recreate Hogwarts™ holiday scenes – including the amazing Yule Ball!\n\nLEGO Harry Potter and the Goblet of Fire™ sets\nKids can combine the 24 advent calendar gifts to recreate favorite scenes from the Harry Potter movies and role-play stories and adventures of their own. The calendar contains minifigures – including Harry Potter, Hermione Granger™, Ron Weasley™, Padma Patil, Parvati Patil and Cho Chang – and buildable models, such as a miniature Beauxbaton’s carriage and a dining table with ice-castle centerpiece.\n\nCool collectible building toys\nThe extensive range of LEGO Harry Potter models and playsets provide fans of the series with endless imaginative fun and creative display possibilities.\n\nGive LEGO® Harry Potter™ fans a magical build-up to Christmas with the toy-a-day LEGO Harry Potter Advent Calendar (75981). Behind each of the 24 doors is a different Harry Potter toy to build, play with and display.\nIncludes Harry Potter™, Hermione Granger™, Ron Weasley™, Padma Patil, Parvati Patil and Cho Chang minifigures, plus buildable models such as a miniature Beauxbaton's carriage and dining table with ice-castle centerpiece.\nAs the big day gets closer, kids can recreate Hogwarts™ holiday scenes – including the amazing Yule Ball!\nThis magical, festive calendar is a perfect pre-Christmas gift for kids aged 7 and up – with 24 days of surprises and imaginative Harry Potter™ fun that lasts all year long.\nThe 24 Harry Potter™ gifts found within this special holiday calendar can be built together with all other original LEGO® sets and LEGO bricks for endless creative building.\nNo batteries required. This set of 24 mini-builds offers hands-on, imaginative play that never runs out!\nPacked with many cool Harry Potter™ toys to inspire imaginative play through Christmas and beyond.\nLEGO® Harry Potter™ sets contain favorite characters, amazing features and familiar locations from the popular movies. They make ideal gifts for anyone wanting to recreate the movie magic.\nLEGO® construction toys meet the highest industry standards to ensure every brick is consistent and compatible, connecting and pulling apart perfectly every time – no magic required!\nAll LEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure each one meets the highest safety standards in the world."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/quidditch-match-75956","description":"Play the most exhilarating wizarding sport with this 75956 Quidditch™ Match LEGO® Harry Potter™ play set. Join Harry, Hermione and Professor Snape™ at the games, featuring Gryffindor™, Slytherin™, Ravenclaw™ and Hufflepuff™ house towers with viewing stands and play feature functions, plus a base with Bludger stud shooter and 3 goalposts with a moving Keeper function to guard the rings. Use the broom's mounted shooting function to shoot the Quaffle through the rings and recreate the famous Quidditch games from the blockbuster Harry Potter movies, or make up your own fun challenges with this fun-packed LEGO Harry Potter toy.\n\nIncludes 6 minifigures: Harry Potter™, Hermione Granger™, Severus Snape™, Oliver Wood, Lucian Bole and Marcus Flint.\nFeatures Gryffindor™ house tower with an opening hatch, Slytherin™ house tower with a pop-up fire spell function, Ravenclaw™ house tower with a removable megaphone element, Hufflepuff™ house tower with scoreboard, and a base with 3 goalposts and rings, moving Keeper function and Bludger stud shooter.\nUnpack the Quaffle, Golden Snitch™, Bludgers and bat, and prepare to play!\nUse the Gryffindor™ house tower’s opening hatch to enter a player onto the Quidditch™ pitch.\nThrow the Quaffle in the air to signal the start of the Quidditch™ match, then shoot the Bludger to knock the players off their brooms.\nFire the broom's mounted shooter to launch the Quaffle through a ring!\nMove the goalpost function to position the keeper in front of the rings.\nHelp Hermione cast a spell on Professor Snape™ using the pop-up fire function on the Slytherin™ house tower.\nUse the megaphone and shout support for your team from the Ravenclaw™ house tower.\nKeep score with the Hufflepuff™ house tower’s scoreboard.\nAccessory elements include a chest, 2 wands, 4 brooms, Quaffle, Golden Snitch™, bat, 2 Bludgers, trophy, megaphone and scoreboard.\nEach tower measures over 7” (18cm) high, 1” (4cm) wide and 1” (4cm) deep."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/hungarian-horntail-triwizard-challenge-75946","description":"Give your young Harry Potter™ fan the chance to battle one of the most dangerous dragons in the wizarding world. The LEGO® Harry Potter 75946 Hungarian Horntail Triwizard Challenge is a gift for kids filled with magical adventures. Anyone aged 8 and over will love helping Harry compete against rival students from other schools of magic, as they strive to retrieve the mysterious golden egg. But that's not all. There's a Hungarian Horntail dragon to defeat! With its moveable limbs and wings, it'll take quick-thinking wizardry to outmaneuver this ferocious beast. With 4 minifigures included, this Harry Potter LEGO dragon set will inspire endless imaginative adventures.\n\nIncludes 4 new-for-June-2019 LEGO® Harry Potter™ minifigures: Harry Potter, Fleur Delacour, Cedric Diggory and Viktor Krum, each with their own wand.\nThis hot Harry Potter™ toy features a posable Hungarian Horntail dragon with flames in its mouth and movable limbs and wings, plus a buildable opening tent for the champions to wait their turn in the Triwizard Tournament, as seen in the Harry Potter and the Goblet of Fire™ movie. All characters have wands, and inside the tent is a bed, 2 cups, a small shelf and potion bottle.\nAlso includes Harry’s Firebolt racing broomstick, a rocky environment containing the golden egg, and a chain to attach the dragon.\nHungarian Horntail with wings open measures over 2” (7cm) high, 10” (27cm) long and 13” (34cm) wide.\nThe tent (closed) measures over 2” (7cm) high, 8” (10cm) wide and 2” (7cm) deep.\nThe tent (opened) measures over 2” (7cm) high, 5” (14cm) wide and 1” (5cm) deep."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/expecto-patronum-75945","description":"Transport fans of Harry Potter™ aged 7 and over to a magical world of wizards, Dementors™ and mythical creatures with this LEGO® Harry Potter 75945 Expecto Patronum building set. Kids will love the details in the Great Lake Forbidden Forest scene, firing the Expecto Patronum spell at the 2 Dementor minifigures, and summoning Harry's Patronus charm—a new-for-June-2019 stag figure—to ward them off his godfather, Sirius Black™. With 4 minifigures and endless magical possibilities, this Harry Potter LEGO set will conjure up a magical world of imaginative play.\n\nIncludes 4 LEGO® Harry Potter™ minifigures: new-for-June-2019 Harry Potter, new-for-June-2019 Sirius Black™ and 2 Dementors™.\nThis LEGO® Harry Potter™ set features a forest scene with a small lakeside build and 2 buildable trees with a spell-cast shooting function, plus a new-for-June-2019 semi-transparent glittering stag figure with room for a minifigure on top.\nAlso includes Harry's wand to cast the Expecto Patronum spell, as used in the Harry Potter™ and the Prisoner of Azkaban™ movie.\nLarger tree measures over 5” (13cm) high, 3” (8cm) wide and 1” (4cm) deep.\nStag figure stands over 2” (7cm) tall."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/the-rise-of-voldemort-75965","description":"There’s magic, adventure and action with LEGO® Harry Potter™ 75965 The Rise of Voldemort™. In this iconic scene from Harry Potter and the Goblet of Fire™, Harry is trapped on Tom Riddle’s tombstone in a spooky graveyard while the deceitful Peter Pettigrew mixes a potion. Voldemort magically appears with the pull of a brick lever and summons a Death Eater™. After releasing Harry from the tombstone, they start to duel. This awesome gift for kids is full of spells, surprises and spectacular battles—so young witches and wizards will need all their Defense Against the Dark Arts skills to help Harry escape!\n\nIncludes 4 minifigures: Harry Potter™ with wand and Triwizard Challenge outfit, Lord Voldemort™ with wand, Peter Pettigrew with wand and a Death Eater™.\nThis building set for kids features the Little Hangleton graveyard from Harry Potter™ and the Goblet of Fire™ with tombstones and vegetation.\nPull the brick lever to raise the Voldemort™ figure from a hidden compartment beneath the ground into an upright position.\nAccessories include a cauldron, bone, dagger and the Triwizard Cup.\nThis LEGO® Harry Potter ™ set measures over 3” (10cm) high, 6” (17cm) wide and 5” (14cm) deep."},{"theme":"harry-potter","themeUrl":"https://www.lego.com/en-us/themes/harry-potter","productUrl":"https://www.lego.com/en-us/product/harry-potter-series-2-71028","description":"Magic can be found everywhere! Kids and fans will love these awesome LEGO® Minifigures (71028) Harry Potter™ Series 2 collectible bags. Each mystery bag contains 1 of 16 different toy characters from the Harry Potter series.\n\nAmazing character lineup for creative activities\nFans young and old can collect, play with or display some great character toys from the Harry Potter series, including Harry Potter, Hermione Granger™, Ron Weasley™, Ginny Weasley™, Fred Weasley, George Weasley, Luna Lovegood™, Moaning Myrtle, Griphook, Headmaster Albus Dumbledore™, Professor Sprout, Neville Longbottom™, Kingsley Shacklebolt, Bellatrix Lestrange, Lily Potter and James Potter.\n\nCool accessories and collectible toys\nEach of the finely crafted, highly detailed minifigures comes in a sealed mystery bag with 1 or more accessory elements to add to the action, including some never-before-seen accessories for certain characters, plus a collector’s leaflet with character information.\n\nImmerse fans in wizarding role play with these cool LEGO® Minifigures (71028) Harry Potter™ Series 2 sets. Play starts straight out of the bag! These make great gifts and collectibles for fans of any age.\nWhat’s in the bag? Kids can find characters from the Harry Potter™ movies to add to their LEGO® Minifigures (71028) collection or Harry Potter sets. Each minifigure comes with 1 or more accessories and an information leaflet.\nThese awesome minifigures are great for imaginative play, where kids can adventure with their favorite characters in current sets that they own, make them part of new stories with other models or collect them to display.\nAny Harry Potter™ fan will love these unique collectible toys. The detailed LEGO® Minifigures and their accessories will thrill any kid and make a great gift for boys and girls aged 5 and up.\nSmall yet mighty! These mystery bags each contain 1 of 16 awesome Harry Potter™ universe minifigure toys, complete with one or more accessories. Totally portable and ready for play or display.\nAre you Hufflepuff, Slytherin, Ravenclaw or Gryffindor? Powered by a child’s imagination for hours of fun! Battery-free toys help boost kids’ creative and group play skills and lets them imagine new stories on their own.\nOpen the bag and the play begins with assembling the minifigure. Easy-to-follow instructions make building a snap, giving kids the joy of constructing their own fun collectible toy - and loads of creative play.\nGive youngsters iconic characters for play or display with LEGO® Minifigures collectibles. These fun, mini playsets offer open-ended play that helps build children’s creativity and imagination skills.\nLEGO® bricks meet the highest industry standards and quality criteria, so they are consistent, compatible and connect and come apart easily every time – it’s been that way since 1958.\nLEGO® bricks are dropped, heated, crushed, twisted and analyzed to make sure every kid’s building toy meets the highest global safety and quality standards."}]