[{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/medieval-blacksmith-21325","description":"Take a break from modern life and build this magnificent LEGO® Ideas Medieval Blacksmith (21325) display model. The architectural details of a 3-level building from the Middle Ages are lovingly recreated in LEGO style. The roof and top 2 levels lift off for easy viewing of the fully furnished bedroom and kitchen, plus a workshop packed with items you’d have seen in a real medieval blacksmith’s smithy. Other features include a glowing forge with a LEGO light brick, plus a garden with buildable models of an apple tree and a well. Minifigures and more There are 4 minifigures to bring the scene to life: a blacksmith, archer and 2 Black Falcon Knights with 4 swords, 3 shields and a halberd, plus a posable horse figure with a buildable cart, dog and frog figures. Stylish gift Part of a collection of inspiring LEGO sets designed to help adults relax in a creative way, this building kit makes a wonderful gift for yourself or the LEGO fan or hobbyist in your life.\nCapture the architectural details of a medieval blacksmith’s workplace and home when you take time out from modern life to build this evocative LEGO® Ideas display model (21325).\nIncludes 4 minifigures: a blacksmith, archer and 2 Black Falcon Knights with 4 swords, 3 shields and a halberd, plus a posable horse figure with a buildable cart and dog and frog figures.\nThis 3-level building has a removable roof and the top 2 levels lift off for easy access to the fully furnished bedroom, kitchen and workshop. The garden features an apple tree model and a well.\nThe workshop is packed with accessory elements such as tools, coal and armour. Press the bellows to activate the LEGO® light brick in the blacksmith’s coal forge and make it glow.\nMeasures over 10.5 in. (27 cm) high, 10.5 in. (27 cm) wide and 8 in. (21 cm) deep. An impressive buildable model to photograph and share, it makes a top gift for yourself or LEGO® fans and hobbyists.\nAn LR41 battery is included for the LEGO® light brick in this building set for adults.\nThis collectible 2,164-piece model comes with an illustrated booklet featuring the set’s fan designer and LEGO® designers, plus clear instructions so even LEGO newcomers can build confidently.\nThis LEGO® Ideas building set for adults is part of a collection of inspirational model kits designed for the discerning hobbyist who enjoys mindful DIY projects in their spare time.\nLEGO® components meet strict industry standards to ensure that they are compatible and connect consistently and strongly.\nLEGO® bricks and pieces are tested in almost every way imaginable to meet stringent global safety standards."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/pirates-of-barracuda-bay-21322","description":"Rekindle nostalgic memories of childhood LEGO® construction projects with this LEGO Ideas Pirates of Barracuda Bay (21322) shipwreck island model for display and play. Enjoy some calm, quality time alone building – or share the fun with others.\n\nRebuild into a classic\nDiscover the captain’s cabin, food store, kitchen, bedrooms, supply dock, farm, toilet, jail cell, tavern and hidden treasure, plus lots of fun accessories, 8 pirate minifigures, assorted animal figures and 2 skeleton figures to inspire action-packed stories. This set includes an island that can be split in half and rearranged. The shipwreck can also be dismantled and reassembled to make a ship inspired by the Black Seas Barracuda pirate ship LEGO model from 1989.\n\nFan-tastic ideas!\nLEGO Ideas offers a diverse array of sets, all created by LEGO fans and voted for by LEGO fans. Inspired by real life, action heroes, iconic movies, popular TV series or totally original concepts, there are cool model kits for people of all ages.\n\nBuild and play with or display this LEGO® Ideas Pirates of Barracuda Bay (21322) shipwreck island model. The island can also be split in half and rearranged, revealing buried pirate treasure.\nThe set has 8 minifigures including Captain Redbeard, Lady Anchor, Robin Loot and twins Port and Starboard for pirate role-play action, plus a shark, pig, 2 parrots, 3 crabs, 2 frogs and 2 skeleton figures.\nRooms including a captain’s cabin, kitchen, tavern, bedroom and jail cell are filled with accessories. The shipwreck also rebuilds into a ship inspired by the 1989 LEGO® model, Captain Redbeard’s Black Seas Barracuda.\nThis 2,545-piece pirate building set makes a great birthday or holiday gift for pirate and LEGO® enthusiasts. It will give you a stress-relieving break from the daily grind – and hours of refreshing, creative fun.\nThis cool pirate shipwreck island model measures over 23” (59cm) high, 25” (64cm) wide and 12” (32cm) deep. It’s sure to make a big impression whether displayed at home or as an office desk toy.\nNo batteries required – this pirate ship playset offers an immersive build with LEGO® bricks only. So forget your worries, find your building zen and create a beautiful display model!\nThinking of buying this pirate building set for someone new to LEGO® model kits? No worries. It comes with step-by-step, illustrated instructions so they can take on this challenging build with swashbuckling confidence.\nLEGO® Ideas sets are created by LEGO fans and voted for by LEGO fans. The theme offers an infinitely diverse array of collectible construction sets for display and creative play. There’s something to delight all ages!\nLEGO® building bricks meet the highest industry standards, which ensures they are consistent, compatible, connect strongly and pull apart easily every time – it’s been that way since 1958.\nLEGO® bricks are tested in just about every way you can imagine, ensuring that each model kit meets the highest safety standards and that this pirate island is as robust as it is impressive to look at."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/123-sesame-street-21324","description":"Sesame Street has been a family-favorite TV show for more than 50 years. Now you can create a colorful, LEGO® brick version of 123 Sesame Street and relive classic scenes with this awesome LEGO Ideas (21324) build-and-display set for adults.\n\nInstantly recognizable details\nThe 123 Sesame Street building features Bert and Ernie’s apartment, Elmo’s bedroom and Bert’s rooftop bird house, and is packed with authentic details and accessories to delight fans. To complete the iconic street corner scene, there is Hooper’s Store, Big Bird’s nest, Oscar the Grouch’s trash can and much more. This set includes Sesame Street character minifigures Elmo, Cookie Monster, Bert and Ernie, plus Oscar the Grouch and Big Bird figures, to spark imaginative fun.\n\nWonderful gift idea\nPart of a collection of LEGO building sets designed to help adults relax in a mindful, creative way, this model kit makes a super gift for yourself, your family and any Sesame Street fan, LEGO enthusiast or hobbyist in your life.\n\nYou can tell everyone how to get to Sesame Street and spark nostalgic memories when you build and display this LEGO® Ideas (21324) set, featuring the iconic 123 Sesame Street building and Hooper’s Store.\nThe set features Elmo, Cookie Monster, Bert and Ernie minifigures, plus Oscar the Grouch and Big Bird figures. Also includes Slimey the Worm, Dorothy the Goldfish, Radar the Teddy Bear and Rubber Ducky figures.\nThe 123 Sesame Street model features Elmo’s bedroom and Bert and Ernie’s apartment, including the iconic portrait of the pair and Ernie’s bath, plus lots more authentic details and accessory elements to delight fans.\nThe Sesame Street corner also includes Hooper’s Store, Big Bird’s nest, Oscar the Grouch’s trash can and more, making this 1,367-piece building kit a fun way to spend quality time on your own or with the family.\nThe model measures over 9.4” (24cm) high, 14.2” (36.2cm) wide and 8.2” (21cm) deep. An eye-catching display piece for your home, it also makes the best LEGO® gift for Sesame Street fans and hobbyists in your life.\nBehind Sesame Street is Sesame Workshop, a nonprofit organization with a mission to help kids everywhere grow smarter, stronger, and kinder.\nClear instructions help you to build confidently and enjoy the process, even if you are a LEGO® newcomer. Also included is an illustrated booklet about the history of Sesame Street, the set’s fan designer and more.\nThis LEGO® Ideas set for adults is part of a collection of inspiring buildable models designed for you, the discerning hobbyist, as you look for fun, creative activities to escape the daily grind and focus the mind.\nLEGO® bricks meet the highest industry standards. This means that they are consistent, compatible and connect and pull apart easily every time – it’s been that way since 1958.\nLEGO® building bricks and pieces are dropped, crushed, twisted, heated and rigorously analyzed to ensure that every LEGO set meets the highest safety standards."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/international-space-station-21321","description":"Build and display this spectacular LEGO® Ideas 21321 ISS (International Space Station). Packed with authentic ISS details, including a posable Canadarm2 and 2 rotating joints that coincide with 8 adjustable ‘solar panels’, this 864-piece set is a wonderful gift idea for space enthusiasts, adult LEGO fans or any experienced builder.\n\nBeautiful centerpiece\nThis awesome LEGO spaceship model comes with a display stand, a buildable mini NASA space shuttle and 3 mini cargo spacecrafts, plus 2 astronaut microfigures to create a striking centerpiece in any room. Illustrated instructions are included, plus a 148-page building instructions booklet with fascinating ISS facts and information about the LEGO fan who created this space model kit and its LEGO designer.\n\nAmazing ideas!\nThe infinitely diverse array of LEGO Ideas sets are all created by LEGO fans and voted for by LEGO fans. Inspired by real life, action heroes, iconic movies, popular TV series or totally original concepts, there is something to delightall ages.\nChallenge your construction skills with this LEGO® Ideas ISS (21321) display model, featuring 2 rotating joints with 8 adjustable ‘solar panels’, posable Canadarm2 and other authentic details to discover as you build.\nThis ISS model comes with a stand, 2 astronaut microfigures, a brick-built mini NASA space shuttle and 3 mini cargo spacecrafts to create a spectacular display and rekindle nostalgic memories of childhood LEGO® projects.\nAlso includes a 148-page building instructions booklet featuring fascinating facts about the International Space Station, the spaceship model’s fan creator and LEGO® designer, and a celebration of the LEGO Ideas theme’s 10th anniversary.\nA super treat for yourself, birthday present or holiday gift idea for space fans, adults aged 16+ or any experienced LEGO® builder, this 864-piece set offers hours of creative fun, whether built solo or with friends.\nThis ISS (International Space Station) toy building kit for adults, measuring over 7” (20cm) high, 12” (31cm) long and 19” (49cm) wide, makes a beautiful display model that will catch the eye of every passerby.\nThis battery-free building set offers a stress-relieving, immersive and fun creative experience. So zone out, find your building zen and enjoy some me-time constructing a wonderful display model!\nThinking of buying this International Space Station model for a newcomer to LEGO® sets? No worries. It comes with step-by-step instructions so they can take on this challenging build with confidence.\nLEGO® Ideas sets are created by LEGO fans and voted for by LEGO fans. Adults and children will be delighted by the infinitely diverse array of collectible construction toys for display and creative play.\nLEGO® building bricks meet the highest industry standards, so you can be assured that they are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure that this LEGO Ideas building kit for adults meets the highest global safety standards."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/central-perk-21319","description":"Celebrate the 25th anniversary of Friends, the legendary American TV sitcom, with this highly collectible LEGO® Ideas 21319 CENTRAL PERK set! This wonderful LEGO recreation of the café TV studio set is packed with authentic details, making it a must-have Friends memorabilia item for fans. The iconic seating area with a couch, armchair and 2 chairs for the friends is removable for easy play. And check out the stage where Phoebe performed her songs on guitar (and where Ross once played his keyboard and everyone except Phoebe thought he was terrible). The 7 new-for-September-2019 LEGO toy minifigures of Ross, Rachel, Chandler, Monica, Joey, Phoebe and CENTRAL PERK’s long-suffering manager Gunther each come with accessories to role-play famously hilarious scenes. An ideal Friends-themed gift for your own friends and family who love the TV show, this hot toy is great for play and will grab attention when displayed in any room.\n\nThis LEGO® Ideas set includes 7 new-for-September-2019 minifigures: Ross Geller, Rachel Green, Chandler Bing, Monica Geller, Joey Tribbiani, Phoebe Buffay and Gunther.\nThe CENTRAL PERK café construction toy features the iconic main seating area including a sofa, armchair, 2 chairs and a table; service area with a brick-built coffee machine, service counter, cash register, cookie jar with 2 cookie elements, menu board element and other authentic items; a stage for musical performances with a sofa; extra seats and tables; 3 pillar elements in a new-for-September-2019 green color; umbrella stand with 2 umbrella elements; window with ‘CENTRAL PERK’ logo decoration; entrance doors; and 2 brick-built TV studio light rigs with translucent light-style elements.\nThe seating area for the show’s star characters is removable for easy play.\nThe minifigures each have their own items inspired by the TV series, including Ross’s brick-built keyboard and the following accessory elements: Rachel’s tray and coffee cup, Monica’s muffin, Joey’s pizza box, pizza slice and ‘man bag’, Chandler’s laptop, Phoebe’s guitar and Gunther’s broom.\nOther accessory elements in this café playset include a newspaper, 15 coffee cups and a ‘Reserved’ sign, plus 3 vases and buildable flowers.\nThis Friends memorabilia LEGO® building toy includes 1,079 pieces.\nThis LEGO® Ideas set comes with a booklet with building instructions and information about this awesome set’s fan creator and LEGO designer.\nBuild and display this Friends collectible construction toy or recreate your favorite scenes from the classic American sitcom.\nThis Friends-themed gift toy measures over 4” (11cm) high, 11” (29cm) wide and 8” (22cm) deep and will make an eye-catching centerpiece in any room."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/dinosaur-fossils-21320","description":"Learn about life on Earth millions of years ago and create a stunning centerpiece with this collectible LEGO® Ideas 21320 Dinosaur Fossils toy building kit for adults. This 910-piece set offers an immersive, creative building experience for natural history enthusiasts who will appreciate the authentic details of the 2 dinosaur skeleton models (Tyrannosaurus rex and Triceratops) and the pterosaur reptile (Pteranodon) skeleton toy. The models are built to 1:32 scale, can be adjusted into lifelike poses and each one comes with its own stand so they can be placed alongside the included sapiens skeleton figure for a museum-style display. To complete the set, there’s also a paleontologist toy minifigure with various accessories for imaginative role-play fun. All in all, this archaeology toy makes a great dinosaur gift for adults to build solo or to share their passion for natural history with family and friends.\n\nA wonderfully detailed dinosaur fossils set featuring buildable, posable, 1:32 scale toy models of Tyrannosaurus rex, Triceratops and Pteranodon skeletons, each with display stands to create LEGO® style natural history museum exhibits.\nAlso includes a sapiens skeleton figure with a display stand, and a paleontologist toy minifigure with a buildable crate, plus dinosaur egg, bone, hat and book elements for creative role-play.\nThis collectible LEGO® Ideas dinosaur toy set includes 910 pieces for an immersive, rewarding building experience.\nNew to LEGO® building? Don’t worry. This paleontologist kit comes with a booklet featuring easy-to-follow building instructions, fascinating facts about the Tyrannosaurus rex, Triceratops and Pteranodon, and information about the set's fan creator and LEGO designer.\nMakes a wonderful paleontologist gift toy for LEGO® builders aged 16+ and anyone with a passion for natural history and dinosaurs.\nThe pterosaur and dinosaur skeleton toy models make an eye-catching display. The T. rex toy skeleton is the biggest of the 3, measuring over 7” (20cm) tall and 15” (40cm) long."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/lego-nasa-apollo-saturn-v-92176","description":"You were born to explore the universe! Build and inspire the next generation of astronauts with LEGO® Space rockets and vehicles – Let’s Go!\n\nDisplay and role-play with this majestic meter-high LEGO brick model of the NASA Apollo Saturn V. Packed with authentic details, it features 3 removable rocket stages, including the S-IVB third stage with the lunar lander and lunar orbiter. The set also includes 3 stands to display the model horizontally, 3 new-for-June-2017 astronaut microfigures for role-play recreations of the Moon landings, plus a booklet about the manned Apollo missions and the fan designers of this educational and inspirational LEGO Ideas set.\n\nFeatures a meter-high (approximately 1:110 scale) model of the NASA Apollo Saturn V with a removable S-IC first rocket stage with main rocket engine details, removable S-II second rocket stage with rocket engine details, removable S-IVB third rocket stage with the Apollo spacecraft and rescue rocket at top of the whole spacecraft, plus 3 stands to display the model horizontally.\nThe Apollo spacecraft features the lunar lander and the lunar orbiter.\nAlso includes 3 new-for-June-2017 astronaut microfigures.\nGreat for display and role-playing the manned Apollo Moon missions.\nIncludes a booklet about the manned Apollo Moon missions and the fan designers of this set.\nThis set includes over 1,900 pieces.\nMeasures over 39\" (100cm) high and 6” (17cm) in diameter."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/ship-in-a-bottle-92177","description":"Continue a nautical tradition when you build the LEGO® Ideas 21313 Ship in a Bottle, featuring a highly detailed ship with the captain’s quarters, cannons, masts, crow’s nest and printed sail elements. Place the ship inside the LEGO brick-built bottle with a buildable cork, wax seal element and water-style elements inside, then display the model on the stand featuring the ship's ‘Leviathan' nameplate, built-in ‘compass' (non-functioning) with compass rose and spinning needle, and globe elements. This construction toy also includes a booklet about the fan creator and LEGO designers of this wonderfully nostalgic set.\nFeatures a LEGO® brick-built bottle, ship and a display stand.\nBottle features a detailed, buildable cork with new-for-February 2018 wax-seal-style element and over 280 translucent-blue, water-style elements inside.\nShip features a raised deck at the stern, captain's quarters, 6 cannons, 3 masts, a crow's nest and assorted elements including printed sails and the ship's flag.\nDisplay stand features the ship's ‘Leviathan' nameplate, a built-in ‘compass' (non-functioning) with detailedcompass rose and spinning gold-colored needle, 2 globe elements and gold-colored detailing.\nIncludes a booklet with building instructions, plus information about the set’s fan creator and LEGO® designers.\nBottle on stand measures over 3\" (10cm) high, 12” (31cm) wide and 3” (10cm) deep.\nShip measures over 3\" (8cm) high, 5” (14cm) long and 1” (5cm) wide."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/winnie-the-pooh-21326","description":"Take time out and rekindle joyful childhood memories with this LEGO® Ideas set (21326) featuring Disney Winnie the Pooh and a delightful LEGO brick recreation of Pooh Bear’s house under a big oak tree in Hundred Acre Wood. Great to build alone or with family, the house opens at the back for easy access to the authentic details inside, including Pooh’s buildable armchair, Pooh-Coo clock, Poohsticks, honey pot elements and much more. You can also create the effect of bees flying around beehives in the branches of the tree, like in the stories.\n\nPopular characters\nThe model comes with Disney’s Winnie the Pooh, Piglet, Tigger and Rabbit minifigures, plus an Eeyore LEGO figure. The friends each have an accessory, including Winnie the Pooh’s buildable red balloon, to recreate classic scenes.\n\nSpecial gift\nPart of a collection of premium-quality LEGO building kits for adults, this set makes a charming gift for yourself, a Disney Winnie the Pooh enthusiast, LEGO fan or any hobbyist.\nEnjoy me-time or quality family time and spark childhood memories with this LEGO® Ideas display set (21326) featuring Disney Winnie the Pooh and Pooh Bear’s house in Hundred Acre Wood.\nIncludes 5 characters: Winnie the Pooh, Piglet, Tigger and Rabbit minifigures, plus an Eeyore LEGO® figure, each with iconic accessories, including Pooh Bear’s buildable red balloon.\nThe house opens at the back for easy access to the authentic accessories inside including a buildable armchair, Pooh-coo clock and elements including a Pooh Bear storybook, honey pots and Poohsticks.\nSit Pooh Bear on the log by the buildable fire and, with his balloon, help him ‘float’ up to see the bees ‘buzzing’ around the 2 beehives in the tree.\nAn ideal birthday or holiday gift for LEGO® fans, hobbyists and anyone who loves Winnie the Pooh, this display model measures over 9 in. (24 cm) high, 7 in. (18 cm) wide and 8 in. (22 cm) deep.\nPerfect for solo building or sharing your childhood passion for LEGO® building and Winnie the Pooh with your family – you’ll want to photograph and share pictures of this charming buildable model.\nThis 1,265-piece set comes with an illustrated booklet featuring details about the set’s fan designer and LEGO® designers, plus step-by-step instructions so even LEGO newcomers can build confidently.\nThis LEGO® Ideas │ Disney set for adults is part of a collection of unique LEGO Ideas models, each created by a fan designer, voted for by thousands of LEGO fans and produced by the LEGO Group.\nEver since 1958, LEGO® components have met strict industry standards to ensure that they connect consistently and securely for robust builds.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and rigorously analyzed to make sure that they meet stringent global safety standards."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/chandler-keyring-854118","description":"Evoke memories of hilarious Friends scenes with this LEGO® Ideas Chandler Key Chain (854118). Affixed to a durable metal ring and chain, the Chandler Bing minifigure has an outfit just like the one the wisecracking character wore to his job (doing whatever his job was!) in early episodes of the long-running American TV sitcom. A super gift idea for any Friends fan, it is easy to attach to keys or a bag so the owner will have a fun buddy with them at all times.\nThis LEGO® Ideas key chain (854118) features a Chandler Bing minifigure attached to a durable metal ring and chain. The minifigure is fixed to the metal chain and cannot be removed.\nMetal ring attaches easily and securely to keys, backpacks and more.\nMeasuring over 3 in. (9 cm) long, it is suitable for ages 6 and up and makes a delightful little gift for Friends fans young or old, including owners of the LEGO® Ideas CENTRAL PERK (21319) set."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/joey-keyring-854119","description":"How you doin’? Check out this LEGO® Ideas Joey Key Chain (854119)! Affixed to a durable metal ring and chain, the Joey Tribbiani minifigure has a cheeky smile on his face, just like the much-loved character from the classic American TV sitcom. A super gift idea for any Friends fan, it is easy to attach to keys or a bag so the owner can take Joey with them wherever they go.\nThis LEGO® Ideas key chain (854119) features a Joey Tribbiani minifigure attached to a durable metal ring and chain. The minifigure is fixed to the metal chain and cannot be removed.\nMetal ring attaches easily and securely to keys, backpacks and more.\nMeasures over 3 in. (9 cm) long and is suitable for ages 6 and up, so it makes a charming little gift for Friends fans young or old, including owners of the LEGO® Ideas CENTRAL PERK (21319) set."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/monica-keyring-854121","description":"Let fans of the ever-popular TV sitcom Friends display their affinity for Monica Geller with this LEGO® Ideas key chain (854121). It features a smiling Monica minifigure affixed to a durable metal ring and chain. A wonderful gift idea for any Friends enthusiast, it is easy to attach to keys or a bag so the owner can keep a much-loved friend with them wherever they go.\nThis LEGO® Ideas key chain (854121) features a Monica Geller minifigure attached to a durable metal ring and chain. The minifigure is fixed to the metal chain and cannot be removed.\nMetal ring attaches easily and securely to keys, backpacks and more.\nMeasures over 3 in. (9 cm) long. Suitable for ages 6 and up, it makes a terrific little gift for Friends fans young or old, including owners of the LEGO® Ideas CENTRAL PERK (21319) set."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/phoebe-keyring-854122","description":"Bring back memories of laugh-out-loud moments from the classic TV sitcom Friends with this LEGO® Ideas Phoebe Key Chain (854122). Attached to a durable metal ring and chain, the Phoebe Buffay minifigure has an outfit just like the one the character wore for her early musical performances at Central Perk café. A splendid gift idea for any Friends fan, it is simple to attach to keys or a bag so the owner can have a quirky friend with them at all times.\nThis LEGO® Ideas key chain (854122) features a Phoebe Buffay minifigure attached to a durable metal ring and chain. The minifigure is fixed to the metal chain and cannot be removed.\nMetal ring attaches easily and securely to keys, backpacks and more.\nMeasures over 3 in. (9 cm) long. Suitable for ages 6 and up, it makes a wonderful little gift for Friends fans young or old, including owners of the LEGO® Ideas CENTRAL PERK (21319) set."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/rachel-keyring-854120","description":"Spark memories of hilarious scenes from the classic TV sitcom Friends with this LEGO® Ideas Rachel Key Chain (854120). Attached to a durable metal ring and chain, the Rachel Green minifigure has the famous ‘Rachel hairstyle’ and a waitress outfit just like the one the character wore when she worked at Central Perk café. A delightful gift idea for any Friends fan, it is easy to attach to keys or a bag so the owner can have a beloved friend with them all the time.\nThis LEGO® Ideas key chain (854120) features a Rachel Green minifigure attached to a durable metal ring and chain. The minifigure is fixed to the metal chain and cannot be removed.\nMetal ring attaches easily and securely to keys, backpacks and more.\nMeasures over 3 in. (9 cm) long. Suitable for ages 6 and up, it makes a fabulous little gift for Friends fans young or old, including owners of the LEGO® Ideas CENTRAL PERK (21319) set."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/ross-keyring-854117","description":"Fans of the legendary American TV sitcom Friends will love this LEGO® Ideas Ross Key Chain (854117). Attached to a durable metal ring and chain, the Ross Geller minifigure has an outfit just like the one worn by the character in many famous scenes with Rachel, Joey, Monica, Chandler and Phoebe. A cute gift idea for any Friends enthusiast, it is easy to attach to keys or a backpack so the owner will have a buddy with them wherever they go.\nThis LEGO® Ideas key chain (854117) features a Ross Geller minifigure attached to a durable metal ring and chain. The minifigure is fixed to the metal chain and cannot be removed.\nMetal ring attaches easily and securely to keys, backpacks and more.\nMeasuring over 3 in. (9 cm) long and suitable for ages 6 and up, it's the perfect little gift for Friends fans young or old, including owners of the brilliant LEGO® Ideas CENTRAL PERK (21319) set."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/grand-piano-21323","description":"Do you have a passion for music? Do you like to relax by focusing on a fun, hands-on project in your free time? If so, this incredible LEGO® Ideas Grand Piano model kit (21323) is just the creative activity for you.\n\nBeautiful and playable\nFeel the pride of building a sophisticated, brick-built version of a concert grand piano that you can actually play music with! Recreate the hammer action of each piano key, the moving pedal and authentic details such as the propped-open top lid and fallboard. Turn on the motor and then you are all set to play wonderful music – select user play on the free LEGO Powered Up app to play the notes yourself or activate auto play and just listen.\n\nLEGO sets for your lifestyle\nTake some time out and enjoy creating a LEGO musical masterpiece to display in your home or workplace. Part of a collection of LEGO building sets for adults, it makes a truly special birthday present or Christmas gift for yourself, the musician, piano player or hobbyist in your life.\n\nDrum roll please as we proudly introduce the first-ever, playable LEGO® Grand Piano! Experience the hands-on pleasure of creating a highly sophisticated LEGO concert piano model and then play beautiful music with it.\nThe LEGO® Ideas Grand Piano (21323) has a removable 25-key keyboard, authentic hammer action, moving dampers and pedal, and motor. Combined with the LEGO Powered Up app, you can play a tune yourself or automatically.\nRevel in the authentic design details of this beautiful model, from the top lid that can be propped up just like a real grand piano’s, to the opening fallboard and piano leg wheels, plus a height adjustable bench.\nIf you are looking for a creative DIY project, this 3,662-piece model building kit is ideal for you. So, take some time out and click your stress away with a rewarding challenge that will leave you feeling revitalized.\nThe piano measures over 8.5” (22.5cm) high, 12” (30.5cm) wide and 13.5” (35.5cm) deep when closed. A stylish item for your home or workplace, it also makes a cool gift for musicians, music-lovers, pianists and hobbyists.\nTo power up the grand piano’s self-playing function, you’ll need 6 AAA batteries (not included) and the free LEGO® Powered Up app – choose user play to play the notes yourself or auto play to listen to 1 of 4 songs.\nClear instructions help you to build with confidence and really enjoy the process, even if you are a LEGO® newcomer. Also included is a coffee-table-style booklet about this grand piano set’s fan designer and more.\nThis LEGO® Ideas building set for adults is part of a collection of inspiring model kits designed for the discerning hobbyist who relishes an immersive, hands-on DIY project.\nSince 1958, LEGO® building bricks have met the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are rigorously tested to meet exacting safety and quality standards, so you can be sure that this collectible grand piano model is as robust as it is beautiful."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/tree-house-21318","description":"Build, display and play with this intricately detailed, 3,036-piece LEGO® Ideas 21318 Tree House playset. A complex build for experienced LEGO builders that all the family will love to play with, it features a landscape base and 3 LEGO tree house cabins—a main bedroom, bathroom and kids’ room. The tree has interchangeable sets of green summer leaf elements and yellow and brown fall leaf elements—these and various plant elements on the base are all made from sustainable-plant-based polyethylene plastic—and the treetop and cabin roofs are removable to allow easy access. The model is packed with play-inspiring features including a buildable picnic table and seats, swing, bonfire, treasure map and hidden gem element to play out a treasure hunt, and a wind-up crane on the balcony of the bedroom cabin. A great birthday gift, this unique creative toy comes with mom, dad and kids minifigures, plus a bird figure, to role-play fun family scenes. It also includes a booklet with building instructions and information about this LEGO Ideas set’s fan creator and LEGO designer.\n\nThis LEGO® Ideas set includes 4 minifigures: mom, dad and 2 children, plus a bird figure.\nThis challenging, 3,036-piece building toy features a landscape base, tree with interchangeable sets of green (summer) leaves and yellow and brown (fall) leaves, and a LEGO® Tree House with 3 cabins—main bedroom, bathroom and kids’ room.\nThe treetop and cabin roofs are removable for easy access and play.\nLandscape base features a buildable picnic table with 4 minifigure seats and assorted elements to create a picnic, plus a buildable stream, swing (hanging from the tree), bonfire, hidden gem element, plant and bush elements, and a ladder to the cabins.\nTree foliage features over 180 botanical elements made from plant-based polyethylene plastic using sustainably sourced sugarcane. Assorted plant elements around the tree are also made from this plant-based plastic. This is the first milestone in LEGO® Group’s ambitious commitment to make products using sustainable materials by 2030.\nMain bedroom cabin features a buildable bed, and assorted elements including hidden scissors (as a reference to the fan creator’s day job as a hairdresser), ship in a bottle, compass, clock plus a balcony with a hand-operated, wind-up crane to lift items up to the cabin.\nBathroom features a buildable bathtub, toilet and sink.\nKids’ room features bunk beds and assorted elements such as a book and treasure map.\nThis LEGO® Ideas creative toy comes with a booklet with building instructions and information about this awesome set’s fan creator and LEGO designer.\nMeasures over 14” (37cm) high, 10” (27cm) wide and 9” (24cm) deep."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/steamboat-willie-21317","description":"Disney Mickey Mouse fans will love this LEGO® Ideas 21317 Steamboat Willie building toy marking the 90th anniversary of the most famous cartoon character ever. Mickey Mouse made his screen debut in a 1928 black-and-white animated short film called ‘Steamboat Willie', which was also the first Disney film to have synchronized sound. This LEGO brick version of the S.S. Willie features steam pipes that move up and down and paddle wheels that rotate when the boat is pushed along. The boat's bridge has room for a minifigure and play-inspiring nautical details such as the ship’s wheel, life buoy and buildable bell. On deck there is a working crane to lift the ‘potato bin’ cargo aboard and this unique toy building set comes with new-for-April-2019 Mickey Mouse and Minnie Mouse minifigures, each with special silver-colored decoration, plus a parrot figure. An ideal LEGO set for kids and adults to recreate scenes from the original Mickey Mouse cartoon or simply build and display this striking monochrome model.\n\nBuild and display this collectible LEGO® set or recreate your favorite scenes from the classic Disney Mickey Mouse cartoon, ‘Steamboat Willie’.\nThis unique toy building set includes 2 new-for-April-2019 minifigures: Mickey Mouse and Minnie Mouse, each with silver-colored decoration, plus Mickey Mouse's parrot figure.\nThe iconic Steamboat Willie boat features a black-and-white color scheme, hidden wheels, moving steam pipes, rotating paddle wheels, adjustable crane and assorted elements including the ‘S.S. Willie’ boat name sign, ‘1928’ year sign and a ‘potato bin’.\nThe boat’s bridge has space for a minifigure, a brick-built bell and assorted elements including the ship’s wheel and life buoy.\nThe 2 steam pipes move up and down and the 2 paddle wheels rotate when the boat is pushed along.\nAccessory elements include Minnie Mouse's guitar and music sheet.\nThis LEGO® Ideas creative toy building set comes with a booklet with building instructions, fun facts about the historic 1928 animated Disney short film ‘Steamboat Willie’, and information about this awesome retro set’s fan creator and LEGO designers.\nSteamboat Willie toy boat measures over 5” (15cm) high, 10” (26cm) long and 5” (14cm) wide."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/the-flintstones-21316","description":"Enjoy modern Stone Age suburban life in Bedrock with this LEGO® Ideas 21316 The Flintstones collectible toy! A wonderfully nostalgic building toy, it features The Flintstones house and their iconic family car. The detailed house has a removable roof for easy play, an opening front door, sofa, TV, coffee table, bowling ball and bowling pin elements, plus a green garden baseplate with a buildable palm tree. Build your own Flintstones vehicle that seats 4 minifigures and features a new-for-March-2019 fabric car roof element and an attachable dinosaur rib for creative play. The first animated TV series ever to be aired in a prime-time slot, The Flintstones cartoon was first broadcast in America in 1960 and has become an enduring family favorite around the world. Recreate hilarious scenes with the included cartoon character minifigures of Fred Flintstone, wife Wilma Flintstone and their friends Barney and Betty Rubble, or simply build and display this instant classic LEGO Ideas model.\n\nThis LEGO® Ideas building toy includes 4 new-for-March-2019 The Flintstones cartoon character minifigures: Fred Flintstone, Wilma Flintstone, Barney Rubble and Betty Rubble.\nThe Flintstones home features a removable roof for easy play, an opening front door, curtains and curtain rails, sofa, TV with aerial, kitchen sink, table and phone, fireplace, painting element on the wall, coffee table with fruit bowl and fruit elements, buildable floor lamp and lampshade, crate with a bowling ball and 3 bowling pin elements, plus a green garden baseplate with a buildable palm tree, 2 flower pots, flowers, plants and 2 milk bottle elements.\nIncludes a buildable postbox with printed ‘Flintstones’ decoration, plus a letter element.\nThe LEGO® brick-built Flintstones car features 4 minifigure seats, 2 steamroller wheels, a new-for-March-2019 fabric car roof element, plus an attachable dinosaur rib.\nThis creative toy building set comes with a booklet with building instructions, fun facts about The Flintstones, and information about this awesome retro set’s fan creator and LEGO® designers.\nBuild and display this collectible construction toy or recreate your favorite scenes from the classic American animated sitcom The Flintstones.\nThe Flintstones Bedrock home measures over 4” (12cm) high, 6” (16cm) wide and 4” (12cm) deep.\nThe Flintstones car measures over 2” (6cm) high, 4” (11cm) long and 2” (7cm) wide."},{"theme":"ideas","themeUrl":"https://www.lego.com/en-us/themes/ideas","productUrl":"https://www.lego.com/en-us/product/pop-up-book-21315","description":"Build, play and display the classic fairy tales Little Red Riding Hood and Jack and the Beanstalk with LEGO® Ideas 21315 Pop-up Book! This first-ever buildable pop-up book made from LEGO bricks opens to reveal the famous scene of grandmother’s forest cottage featuring opening door, bed and kitchen area. Recreate the scene when Little Red Riding Hood meets the wolf or swap out grandmother's cottage for the scene of the giant's castle in the clouds. This collectible toy features enough bricks to build both scenes or you can even build a scene of your own and makes a perfect creative gift. This LEGO set includes a booklet with a short history of pop-up books, a condensed history of each fairy tale in the set, as well as information about its fan designers and LEGO designers.\n\nIncludes 4 new-for-November-2018 LEGO® minifigures: Little Red Riding Hood, Grandmother, the Wolf, and the Giant. Also includes 1 new-for-November-2018 microfigure: Jack.\nFirst pop-up book in LEGO® history features 2 different LEGO fairy tale stories: Little Red Riding Hood and Jack and the Beanstalk.\nBuild and display or recreate your own stories from 2 classic fairy tales with this imagination toy.\nThis LEGO® Ideas set features enough bricks to build both fairy tales in the set or you can even build your own scene.\nIncludes a booklet featuring building instructions, a brief history of pop-up books, a short history of the 2 fairy tales in the set, plus information about this amazing classic fairy tale’s fan designers and LEGO® designers.\nPop-up book measures over 7” (20cm) long and 5” (13cm) wide when closed, and over 11” (28cm) wide when open."}]