[{"theme":"jurassic-world","themeUrl":"https://www.lego.com/en-us/themes/jurassic-world","productUrl":"https://www.lego.com/en-us/product/jurassic-park-t-rex-rampage-75936","description":"Enjoy an advanced building experience and relive classic movie moments with LEGO® Jurassic World 75936 Jurassic Park: T. rex Rampage. This collectible construction toy includes 3,120 building bricks and features the original Jurassic Park’s iconic gate and a large, fully posable, brick-built T. rex dinosaur toy which is ideal for display. The trigger-activated gate is framed by a wall incorporating 7 detailed, brick-built scenes inspired by the movie, such as John Hammond's dining room, Ray Arnold’s control room and a bunker for Ian Malcolm. A must-have for Jurassic World fans, this toy construction set includes 6 minifigures and baby dinosaur figure, plus a minifigure display stand with T. rex facts plate.\n\nThis dinosaur toy set includes 6 minifigures: John Hammond, Ian Malcolm, Ellie Sattler, Alan Grant, Ray Arnold and Dennis Nedry, plus a baby dinosaur figure.\nBrick-built LEGO® T. rex dinosaur toy features snapping jaws, posable head, arms, legs and tail.\nThe brick-built LEGO® version of the original Jurassic Park's iconic gate has an opening function, jungle leaves and flame elements.\nThe wall framing the gate features a buildable dinosaur nest with 2 cracked egg elements at the top and other brick-built scenes inspired by the movie, including: a bunker with a buildable bed for Ian Malcolm, flashlight and fire extinguisher, plus ladder and display case elements; power shed for scene with Ellie Sattler; John Hammond’s dining room with table and minifigure chair, plus ice cream, spoon and 3 cookie elements; Ray Arnold's control room with a buildable desk, 3 computers and a minifigure chair; scene with a buildable bathroom; scene for Dennis Nedry with a buildable mud slide and shaving cream can.\nThis display toy model also includes a buildable minifigure display stand with T. rex facts plate.\nAccessory elements include John Hammond’s hat and cane, and Alan Grant’s hat and dinosaur claw.\nJohn Hammond, Ray Arnold and Dennis Nedry minifigures are new for June 2019.\nThis collectible toy building set includes over 3,120 pieces and makes a great dinosaur gift for adults.\nJurassic Park gate measures over 16” (42cm) high, 18” (48cm) wide and 5” (14cm) deep.\nT. rex dinosaur measures over 8” (22cm) high, 27” (69cm) long and 6” (17cm) wide."},{"theme":"jurassic-world","themeUrl":"https://www.lego.com/en-us/themes/jurassic-world","productUrl":"https://www.lego.com/en-us/product/indominus-rex-vs-ankylosaurus-75941","description":"Young builders can reimagine classic moments from the Jurassic World movie with this Indominus rex vs. Ankylosaurus (75941) playset. The gyrosphere deployment station has an entrance turnstile and a trigger to launch a gyrosphere with a minifigure inside. And kids will love playing out LEGO® Jurassic World dinosaur battles with the Indominus rex and Ankylosaurus toy figures.\n\nRole-play fun\nThere are 5 minifigures, including Owen Grady and Claire Dearing, for creative role play, and the treesin the buildable jungle scene can be knocked over with the Ankylosaurus’s swiping tail. A great gift idea for kids aged 8 and up, this building set comes with step-by-step instructions so even LEGO rookies can build confidently.\n\nDinosaur action!\nLEGO Jurassic World sets feature dinosaur figures, well-known characters, cool vehicles and more, for fans to recreate scenes from the animated series and movies, create their own unique adventures or just build and display the collectible models.\n\nReimagine scenes from the Jurassic World movie with this Indominus rex vs. Ankylosaurus (75941) building toy for kids, featuring 2 awesome dinosaurs, gyrosphere deployment station and more!\nChildren can role-play thrilling action with 5 minifigures – including Owen Grady, Claire Dearing and brothers Gray and Zach Mitchell – plus new-for-June-2020, posable Indominus rex and Ankylosaurus dinosaur figures.\nThere are so many ways to play with the gyrosphere station, which features a ticket booth, turnstile and gyrosphere-launch function, plus a jungle build with trees to knock down with the Ankylosaurus’s swiping tail.\nA cool birthday, Christmas or surprise present, this 537-piece LEGO® playset offers a fun, rewarding building challenge and creative solo- or group-play experience for boys and girls aged 8 and up.\nThe gyrosphere station measures over 4” (12cm) high, 10” (27cm) wide and 10” (27cm) deep – and this action-packed dinosaur adventure set combines brilliantly with other LEGO® Jurassic World sets for extra creative fun.\nThis construction kit is powered by children’s imaginations – no batteries required – so their adventures with Jurassic World LEGO® character minifigures and toy dinosaurs never run out of energy!\nThinking of buying this Jurassic World building toy for a kid new to LEGO® sets? No problem. It comes with step-by-step, illustrated instructions, so even beginners can build with confidence.\nLEGO® Jurassic World building sets allow kids (and adult fans) to recreate scenes from the animated series and movies, create their own unique adventures or just build and display the awesome, collectible models.\nEver since 1958, LEGO® bricks have met the highest industry standards, plus our own quality criteria, which ensures that young builders (and any dinosaur fan) can connect and pull them apart easily every time.\nLEGO® bricks and pieces are tested to the max so you can be sure that this awesome building toy for kids meets the highest global safety and quality standards – and might even survive a dinosaur attack!"},{"theme":"jurassic-world","themeUrl":"https://www.lego.com/en-us/themes/jurassic-world","productUrl":"https://www.lego.com/en-us/product/baryonyx-face-off-the-treasure-hunt-75935","description":"Drama awaits kids as they help Owen Grady and Claire Dearing pursue bad guys through the jungle in LEGO® Jurassic World 75935 Baryonyx Face-Off: The Treasure Hunt. This action-packed dinosaur playset features an offroader with space for 2 minifigures and an attachment point for a trailer which has a buildable rooftop antenna and a detailed interior, plus a buildable jungle scene that has a hidden treasure chest with a reveal function. It also includes a posable Baryonyx dinosaur figure and 4 minifigures with cool weapons and accessories to inspire imaginative play.\n\nThis LEGO® Jurassic World dinosaur toy playset for kids includes 4 minifigures: Owen Grady, Claire Dearing, Danny Nedermeyer, Sinjin Prescott, plus a Red the dog figure.\nOffroader features space for 2 minifigures, rear storage space, attachment point for the trailer, brick-built flashlight and fuel container, plus a screwdriver element.\nTrailer features a buildable antenna and assorted plant elements on the exterior, an opening door and a detailed interior with a buildable computer and bed, plus assorted elements including a coffee cup, movie camera and frying pan.\nJungle scene features a buildable palm tree, hidden treasure chest with a reveal function and 6 gem and 2 gold-colored bar elements inside, plus assorted elements including plants and 2 fish.\nPress the trigger to reveal the hidden treasure chest.\nMolded, buildable Jurassic World Baryonyx dinosaur toy figure features snapping jaws and a posable head, arms and legs.\nWeapons include Owen Grady's tranquilizer gun and Sinjin Prescott’s machete.\nAccessory elements include Sinjin Prescott’s hat, bag, map and videotape.\nDanny Nedermeyer and Sinjin Prescott minifigures are new for June 2019.\nKids can reimagine exciting scenes from the LEGO® Jurassic World animated series with this collectible toy.\nThis LEGO® building set makes a great dinosaur gift for kids.\nOffroader measures over 2” (7cm) high, 5” (13cm) long and 3” (8cm) wide.\nTrailer measures over 3” (10cm) high, 5” (14cm) long and 1” (5cm) wide.\nJungle scene build measures over 5” (14cm) high, 5” (14cm) wide and 3” (8cm) deep.\nBaryonyx dinosaur figure measures 4” (12cm) high, 11” (28cm) long and 1” (4cm) wide."},{"theme":"jurassic-world","themeUrl":"https://www.lego.com/en-us/themes/jurassic-world","productUrl":"https://www.lego.com/en-us/product/gallimimus-and-pteranodon-breakout-75940","description":"Kids can build their own LEGO® Jurassic World of dinosaur-chasing action with this Gallimimus and Pteranodon Breakout (75940) toy playset. It features a toy research vehicle with a dual minifigure cockpit, net shooter, 2 detachable drones, a removable mini lab and lots of accessory elements to inspire hours of creative solo or social play.\n\nRole-play adventures\nThis building set for kids also includes 3 LEGO Jurassic World minifigures and an awesome Gallimimus dinosaur figure and Pteranodon toy figure to role-play exciting adventures. Clear, illustrated instructions mean that even if your youngster is new to LEGO toys, they can build with confidence right away.\n\nDinosaur fun!\nFeaturing molded, buildable dinosaur figures, minifigures, detailed vehicles and more, LEGO Jurassic World construction toys make awesome birthday presents for kids and fans of all ages. They can relive scenes from the animated series and movies, create new stories or just display the collectible models.\n\nKids can pretend to be dinosaur experts tracking down escaped dinosaurs with this LEGO® Jurassic World Gallimimus and Pteranodon Breakout (75940) set, featuring a research vehicle with lots of fun features.\nThis set includes 3 minifigures – Owen Grady, Claire Dearing and an ACU Trooper – plus new-for-June-2020, posable Gallimimus and Pteranodon toy figures, which children can catch with the research vehicle's net shooter.\nThe research vehicle features a dual minifigure cockpit, 2 detachable drones, a removable, foldout lab and many elements, including 2 dinosaur eggs, tranquilizing gun and needle and a drone remote, to create new stories.\nThis 391-piece LEGO® playset offers a fun and rewarding creative challenge for boys and girls aged 7 and up, and makes a super present for kids on birthdays, at Christmas or for any special occasion.\nThe buildable toy vehicle measures over 3” (10cm) high, 6” (16cm) long and 5” (14cm) wide – and this action-packed playset can be combinedwith other LEGO® Jurassic World sets for even more creative play options.\nThis fun LEGO® Jurassic World building toy is powered by creative kids’ free-thinking – no batteries required – so the dinosaur action adventures never stop!\nIs your youngster new to LEGO® sets? Don't worry. This Jurassic World dinosaur toy building kit for kids comes with easy-to-follow, illustrated instructions so they can open the box and build with confidence.\nLEGO® Jurassic World building sets are fabulous for kids and adult fans, letting them relive scenes from the animated series and movies, create new dinosaur adventures or just build and display the collectible figurines.\nYoung builders don’t need dinosaur strength to connect or pull apart LEGO® bricks! Since 1958, LEGO bricks have met the highest industry standards and our own quality criteria to ensure consistency and robust building.\nLEGO® bricks and pieces are tested in almost every way you can imagine, ensuring that each playset meets the highest global safety and quality standards – and is possibly even dinosaur-proof!"},{"theme":"jurassic-world","themeUrl":"https://www.lego.com/en-us/themes/jurassic-world","productUrl":"https://www.lego.com/en-us/product/velociraptor-biplane-rescue-mission-75942","description":"Your little adventurer can role-play as Owen Grady flying to rescue Sinjin Prescott with this LEGO® Jurassic World Velociraptor: Biplane Rescue Mission (75942) dinosaur toy playset. Ideal for preschoolers, the easy-to-build toy plane features a minifigure cockpit and chain to lift up Sinjin.\n\nDinosaur fun!\nThis dinosaur toy kit also has a posable Velociraptor and Delta baby raptor figure, treetop observation outpost with a dinosaur nest, and an off-roader vehicle, plus fun accessories to inspire creative play. The included simple guide to build and play will help any youngster grow their confidence as they learn to build with LEGO bricks.\n\nPerfect for preschoolers\nLEGO 4+ building toys make great gifts for preschool kids to introduce them to a wide universe of their movie favorites, TV characters and everyday heroes. They are specially designed with Starter Brick bases so even first-time builders can experience the pride of constructing buildings, vehicles and more, all on theirown.\n\nWith a cool biplane toy, raptors, off-roader vehicle and more, this Velociraptor: Biplane Rescue Mission (75942) playset is a fun way for preschool adventurers to learn to build and role-play LEGO® Jurassic World action.\nThe biplane has a Starter Brick chassis to make building easier and a chain element for rescue missions, and youngsters can role-play exciting stories with 2 Jurassic World minifigures – Owen Grady and Sinjin Prescott.\nIncludes a posable Velociraptor, a treetop observation outpost, a dinosaur nest for Delta the baby Velociraptor toy figure, plus accessory elements such as a treasure map, dinosaur egg and 2 diamonds for creative play.\nGreat for solo or social play and to combine with other LEGO® playsets, this 101-piece starter set makes a top Christmas or birthday present, holiday gift or special surprise for kids aged 4 and up.\nThe biplane toy measures over 2” (6cm) high, 7” (18cm) long and 6” (16cm) wide, so it easily fits into a bag with the other builds, raptors and LEGO® Jurassic World characters to keep kids entertained on their travels.\nNo batteries required! This awesome building toy for preschool kids is powered by children’s imaginations, so they can develop their creative skills while making up unlimited stories and having lots of fun.\nThinking of buying this Jurassic World dinosaur building set for a kid new to LEGO® sets? No worries. It comes with step-by-step, illustrated instructions, so even beginners can open the box and get started right away.\nLEGO® 4+ building sets introduce younger kids to a wide universe of their movie favorites, TV characters and everyday heroes, and help them to understand the purpose of building steps while boosting their confidence.\nEver since 1958, LEGO® bricks have met the highest industry standards, plus our own quality criteria, which ensures that little fingers can connect and pull them apart easily every time.\nLEGO® bricks and pieces are stringently tested so you can be sure that this dinosaur building toy for kids meets the highest global safety and quality standards – it might even be dinosaur-proof!"},{"theme":"jurassic-world","themeUrl":"https://www.lego.com/en-us/themes/jurassic-world","productUrl":"https://www.lego.com/en-us/product/dr-wu-s-lab-baby-dinosaurs-breakout-75939","description":"Kids can pretend to create new breeds of dinosaur and help Owen Grady stop dinosaur escapes with this LEGO® Jurassic World Dr. Wu's Lab: Baby Dinosaurs Breakout (75939) toy playset. It features a knock-down ‘glass’ wall function, brick-built dinosaur egg incubator, microscope and adjustable robot arm, laptop element and pop-up panel with an ‘alarm' message to inspire creative play.\n\nUnlimited adventures\nThis fun building set for kids includes 2 minifigures and new-for-June-2020 baby Ankylosaurus and Triceratops toy dinosaur figures to play out unlimited Jurassic World adventures. It also comes with step-by-step instructions so even beginners can enjoy the fun of LEGO construction.\n\nDinosaur fun!\nLEGO Jurassic World sets make brilliant birthday presents for fans of all ages. They feature molded, buildable dinosaur figures, minifigures, detailed vehicles and more to recreate scenes from the animated series and movies, play out original stories or just build and display the collectible models.\n\nHours of creative role-play fun awaits children with this Dr. Wu´s Lab: Baby Dinosaurs Breakout (75939) toy playset, featuring a detailed, brick-built version of Dr. Wu’s lab from LEGO® Jurassic World.\nKids can dream up exciting Jurassic World stories of scientific breakthroughs and dinosaur escapes with 2 minifigures – Owen Grady and Dr. Henry Wu – plus new-for-June-2020 baby Triceratops and Ankylosaurus toy figures.\nFeatures a knock-down ‘glass' wall function, brick-built dinosaur eggincubator, microscope and adjustable robot arm, laptop element, pop-up panel with an ‘alarm’ message and more to spark fans’ imaginations.\nThere are so many ways to play with this 164-piece building kit, making it a brilliant birthday present or holiday gift toy for creative boys and girls aged 6 and up to introduce them to LEGO® Jurassic World sets.\nThe lab measures over 3” (10cm) high, 8” (22cm) wide and 3” (8cm) deep – a compact size to pack in a bag for play on the go – and combines brilliantly with other LEGO® Jurassic World sets for even more play options.\nThis awesome LEGO® Jurassic World dinosaur toy is made purely with LEGO building bricks and powered by kids' creativity – no batteries required – so the playtime adventures never run out of energy!\nThinking of buying this Jurassic World dinosaur set for someone new to LEGO® toys? No worries! It comes with easy-to-follow, illustrated building instructions. Open the box and away they go!\nLEGO® Jurassic World building sets are fantastic for kids and adult fans, letting them recreate scenes from the animated series and movies, make their own dinosaur adventures or build and display the collectible models.\nLEGO® bricks meet the highest industry standards, plus our own quality criteria, which ensures that they connect perfectly and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and thoroughly analyzed, ensuring that every building toy meets the highest global safety and quality standards – and might even survive a dinosaur attack!"},{"theme":"jurassic-world","themeUrl":"https://www.lego.com/en-us/themes/jurassic-world","productUrl":"https://www.lego.com/en-us/product/t-rex-vs-dino-mech-battle-75938","description":"Action-packed dinosaur adventures are guaranteed as youngsters play out a LEGO® Jurassic World 75938 T. rex vs Dino-Mech Battle and seek hidden treasure in the Isla Nublar volcano. The buildable T. rex toy dinosaur figure and bad guy Danny Nedermeyer's Dino-Mech are both posable and have snapping jaws, while the buildable volcanic rock has an opening function to reveal a hidden treasure chest. This Jurassic World building toy also includes 4 minifigures, 4 baby velociraptor toy figures and a boat with 2 stud shooters and a tranquilizer gun to inspire kids to role-play Jurassic World scenes and create their own stories.\n\nThis LEGO® Jurassic World dinosaur toy playset includes 4 new-for-June-2019 minifigures: Owen Grady, Claire Dearing, Vic Hoskins and Danny Nedermeyer, plus 4 baby velociraptor toy figures—Blue, Delta, Echo and Charlie—and 2 bat figures.\nMolded, buildable LEGO® Jurassic World T. rex toy dinosaur figure features new-for-June-2019 colors, snapping jaws and a posable head, arms and legs.\nDino-Mech features an opening minifigure cockpit with detailed dashboard, snapping jaws, posable head, arms, claws, legs and a tail.\nLEGO® brick-built volcanic rock features lava elements, an opening function and a treasure chest with assorted treasure elements inside: 11 gold-colored coins, 4 gold-colored bars, 1 gold-colored cup and 4 gem elements.\nToy boat features 2 stud shooters, a tranquilizer gun and ammo storage container with 4 ammo elements. (Please note: boat does not float in water.)\nThis dinosaur toy playset for kids includes Vic Hoskins' tranquilizer gun.\nAccessory elements include Owen Grady’s walkie-talkie and Danny Nedermeyer’s soda can element.\nKids can reimagine thrilling scenes from the LEGO® Jurassic World animated series with this collectible toy.\nThis LEGO® Jurassic World toy construction set makes a great dinosaur gift for kids.\nJurassic World T. rex dinosaur toy figure measures over 4” (11cm) high, 11” (28cm) long and 2” (6cm) wide.\nDino-Mech measures over 5” (14cm) high, 12” (33cm) long and 5” (13cm) wide.\nVolcanic rock measures over 5” (14cm) high, 7” (20cm) wide and 5” (13cm) deep.\nToy boat measures over 5” (13cm) long and 3” (8cm) wide."},{"theme":"jurassic-world","themeUrl":"https://www.lego.com/en-us/themes/jurassic-world","productUrl":"https://www.lego.com/en-us/product/triceratops-rampage-75937","description":"Youngsters will love creating exciting dinosaur action adventures with this LEGO® Jurassic World 75937 Triceratops Rampage building set. The colorful playset includes an Egg Spinner ride with 3 dinosaur-egg seats for minifigures and a spinning function, plus a gate and waiting area for the ride. There is also a posable Triceratops toy dinosaur figure, a collapsible fence ­and a minifigure buggy to play out a dinosaur escape and pursuit. This building toy for kids includes 4 Jurassic World minifigures to inspire creative role-play.\n\nThis LEGO® Jurassic World dinosaur toy playset includes 4 new-for-June-2019 minifigures: Owen Grady, Simon Masrani, Allison Miles and a tourist.\nThe Jurassic World Egg Spinner ride features 3 buildable dinosaur-egg seats for minifigures and a spinning function, plus an entrance gate with 2 flame elements, waiting area with 2 fences, waiting sign element, steps to access the ride, trash can with a lid, and a sign with directions (to the Jurassic World gyrosphere, gift shop and museum).\nTurn the switch at the back of the Egg Spinner ride to make the eggs go round.\nMolded, buildable, new-for-June-2019 Triceratops LEGO® dinosaur toy figure features a posable head and legs.\nAlso includes a collapsible fence with a ‘Danger – Electricity' sign element, and a fence with a Triceratops information sign.\nPush the post on the collapsible fence to play out a Triceratops escape.\nBuggy has space for a minifigure, detachable wrench and walkie-talkie elements, plus a carrot (dinosaur bait) attached to a long stick.\nAlso includes the tourist’s brick-built ice cream.\nKids can reimagine exciting scenes from the LEGO® Jurassic World animated series with this collectible toy.\nThis LEGO® Jurassic World toy construction set makes a great dinosaur gift for kids.\nEgg Spinner ride measures over 4” (12cm) high, 4” (12cm) wide and 7” (19cm) deep.\nEntrance gate measures over 3” (10cm) high, 5” (14cm) wide and 1” (4cm) deep.\nTriceratops LEGO® dinosaur figure measures over 3” (8cm) high, 7” (19cm) long and 2” (6cm) wide.\nDinosaur fences measures over 3” (10cm) high, 9” (25cm) wide and 1” (5cm) deep.\nBuggy measures over 1” (3cm) high, 2” (6cm) long and 1” (4cm) wide."},{"theme":"jurassic-world","themeUrl":"https://www.lego.com/en-us/themes/jurassic-world","productUrl":"https://www.lego.com/en-us/product/dilophosaurus-outpost-attack-75931","description":"Brace the hunters for a fierce LEGO® Jurassic World™ 75931 Dilophosaurus Outpost Attack in this fun play set. Step down from the lookout tower and crane, featuring exploding gate and wall functions, crate and baby Dilophosaurus, and use the tranquilizer gun to stop the Dilophosaurus breaking through the fences. This Jurassic World toy set includes 3 minifigures, a Dilophosaurus figure plus a baby dinosaur element.\n\nIncludes 3 minifigures, a Dilophosaurus dinosaur figure and a baby dinosaur element.\nFeatures an outpost fence with a watchtower, movable crane and exploding gate and wall functions.\nDilophosaurus dinosaur figure features posable limbs, head and snapping jaws.\nActivate the exploding gate and wall functions to stage a dinosaur breakthrough!\nAlso includes a tranquilizer gun.\nAccessory elements include 2 crates, a dinosaur egg and binoculars.\nOutpost measures over 5” (14cm) high, 14” (37cm) wide and 2” (6cm) deep.\nDilophosaurus dinosaur figure stands over 2” (7cm) high."},{"theme":"jurassic-world","themeUrl":"https://www.lego.com/en-us/themes/jurassic-world","productUrl":"https://www.lego.com/en-us/product/dilophosaurus-on-the-loose-75934","description":"Thrilling adventures await children when they construct Owen Grady’s drone and fly to save Hudson Harper from an escaped dinosaur in LEGO® Jurassic World 75934 Dilophosaurus on the Loose. The drone features 4 spinning rotors and a net shooter function to aim at the Dilophosaurus dinosaur model. This building toy for kids also includes 3 minifigures, plus a market stall in the shape of a dinosaur's head with lots of accessory elements to inspire creative play.\n\nThis LEGO® Jurassic World dinosaur toy playset includes 3 minifigures: Owen Grady, Hudson Harper and a park worker, plus a new-for-June-2019 Dilophosaurus toy figure.\nDrone helicopter toy features a minifigure cockpit, 4 spinning rotors and a net shooter function.\nDinosaur-head-shaped market stall features a display container, 4 poster stickers, flag and assorted elements including a shovel, broom, net, 2 hats and 2 popcorn boxes.\nThe Dilophosaurus figure has posable jaws.\nHudson Harper and park worker minifigures are new for June 2019.\nKids can reimagine exciting scenes from the LEGO® Jurassic World animated series with this collectible toy.\nThis LEGO® toy construction set makes a great dinosaur gift for kids.\nDrone helicopter toy measures over 1” (4cm) high, 4” (11cm) long and 4” (11cm) wide.\nMarket stall measures over 3” (9cm) high, 3” (10cm) wide and 2” (6cm) deep."},{"theme":"jurassic-world","themeUrl":"https://www.lego.com/en-us/themes/jurassic-world","productUrl":"https://www.lego.com/en-us/product/baby-velociraptor-playpen-30382","description":"Train your own baby Velociraptor with this mini LEGO® Jurassic World™ play set, featuring a playpen, shelter, feeding crane, drumstick, bone and water feeder."}]