[{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/attack-on-the-spider-lair-76175","description":"The stunning LEGO® Marvel Spider-Man Attack on the Spider Lair (76175) is the first LEGO version of the superhero’s awesome HQ – part high-tech headquarters and part super-cool teenager’s room!\n\nEverything a young superhero needs\nEven superheroes need to chill-out in their room sometimes. But only Spider-Man could have a room like this! With a computer, PlayStation, basketball hoop with ball shooter, skateboard with ramp, and a drinks area, it's the ultimate teenage den. But it's much more than that. It’s also the ultimate superhero headquarters, with Peter Parker´s camera, training equipment, motorbike, Iron Spider Suit, weapons and even its own jail – all of which come in very handy when the evil super villains Green Goblin and Venom force their way inside.\n\nThere’s everything a teenage superhero needs in LEGO® Marvel Spider-Man Attack on the Spider Lair (76175) – the first LEGO version of the web-slinger’s high-tech HQ.\nIncludes Spider-Man, Green Goblin and Venom minifigures, a PC, PlayStation, basketball game, skateboard with ramp, drinks area, camera, training kit, motorbike, Iron Spider Suit, weapons and a jail.\nYoung superheroes join Spider-Man playing games in his HQ. When 2 super villains force their way in, it's time for battle. Kids must use the amazing equipment and their own skills to save the day.\nAn ideal birthday, holiday or just-because gift for Marvel movie fans aged 8 and up who want to stand out from the crowd with the premier LEGO® set Spider-Man’s HQ.\nSpider-Man’s spectacular headquarters measure over 5 in. (14 cm) high, 16 in. (41 cm) long and 6 in. (17 cm) wide and combine easily with other LEGO® Marvel Spider-Man sets.\nFeaturing fun extras, including a selection of webs to throw, security screens tomonitor and a hand-operated ball slinger for basketball practice.\nAll LEGO® Marvel Spider-Man playsets are cool and collectible and give kids the chance to relive favorite superhero movie moments and create imaginative stories of their own.\nLEGO® components satisfy stringent industry standards to ensure they are consistent, compatible and connect and pull apart correctly every time – it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they fulfill rigorous global safety standards."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/spider-man-s-monster-truck-vs-mysterio-76174","description":"With 4 iconic Marvel characters and an awesome monster truck, LEGO® Marvel Spider-Man: Spider-Man's Monster Truck vs. Mysterio (76174) is a stand-out gift that will delight any young superhero.\n\nA unique mix of superhero action\nKids who are into superheroes and super-vehicles will love this LEGO Marvel mega-set. With classic characters Spider-Man, Spider-Gwen, Doctor Octopus and Mysterio, and featuring a big, tough monster truck with working suspension and a net launcher, plus 2 armed drones – the scene is set for imaginative adventures that never end. The fun continues even when the action stops, as kids put the cool scenes they’ve created on display in their room. For extra creative fun, the free LEGO Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize as they build.\n\nLEGO® Marvel Spider-Man: Spider-Man's Monster Truck vs. Mysterio (76174) brings together 4 favorite characters from the Spider-Man movies and an almighty monster truck for spectacular superhero action and adventures.\nIncludes Spider-Man, Doctor Octopus, Mysterio and Spider-Gwen minifigures, a monster truck with super-suspension and roof-top net launcher, plus 2 buildable drones, each with 2 shooters.\nKids can build, play and create scenes with their supercool superhero action set to display in their room.\nThis perfect birthday, holiday or just-because gift is bursting with imaginative play possibilities for any young superhero aged 8 and up.\nSpider-Man’s monster truck measures over 4 in. (12 cm) high, 5 in. (15 cm) long and 3 in. (9 cm) wide and is built to endure endless dangerous and daring adventures.\nFeaturing fun extras, including Spider-Gwen’s skateboard and web elements, Mysterio’s opalescent, domed helmet, plus money for Doctor Octopus to steal.\nFor extra building fun, the free LEGO® Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize their playset as they build.\nAll LEGO® Marvel Spider-Man playsets are cool, collectible and give kids the chance to relive favorite superhero movie moments and create imaginative stories of their own.\nLEGO® components meet rigorous industry standards to ensure they are consistent, compatible and connect and pull apart correctly every time –it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global safety standards."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/spider-man-and-ghost-rider-vs-carnage-76173","description":"Let kids control a unique superhero clash involving 3 iconic Marvel characters, with LEGO® Marvel Spider-Man: Spider-Man and Ghost Rider vs. Carnage (76173).\n\nAmazing, blazing Marvel megastars!\nYoung superheroes are in for non-stop, red-hot action and adventure when teenage web-slinger Spider-Man and super villain Carnage come together with walking-inferno Ghost Rider and his flame-covered, 3-stud shooter supercharger-equipped car. This fun-packed playset will provide kids with endless excitement and entertainment as they build, play out and display scenes with the thrilling trio. For extra creative fun, the downloadable LEGO Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize their playset as they build.\n\nLEGO® Marvel Spider-Man: Spider-Man and Ghost Rider vs. Carnage (76173) is a premium playset packed with imaginative play possibilities featuring 3 iconic characters from the Marvel Universe.\nIncludes Spider-Man, Carnage and Ghost Rider minifigures. Ghost Rider’s robust, stylish car has a removable roof, removable flames and a 3-stud-shooter supercharger peeking out of its hood.\nThe trio of classic Marvel characters, plus the amazing Ghost Rider car, provide kids with endless possibilities to build, play and display as they role-play endless, imaginative superhero adventures.\nFor ages 7 and up. This stand-out set is a perfect gift idea for a young superhero’s birthday, holiday or special treat.\nGhost Rider’s car measures over 1 in. (5 cm) high, 7 in. (19 cm) long and 2 in. (7 cm) wide and looks great on display in kids’ rooms.\nUsing the extra elements provided, kids can detach the flames from Ghost Rider’s car and transform it into a sleek, black muscle car.\nFor extra building fun, the free LEGO® Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize their playset as they build.\nAll LEGO® Marvel Spider-Man playsets are premium quality and designed to deliver maximum opportunities for imaginative, developmental play.\nLEGO® components satisfy strict industry standards to ensure they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they fulfil stringent global safety standards."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/miles-morales-mech-armour-76171","description":"Any young superhero will love the LEGO® Spider-Man Miles Morales Mech Armor (76171). Featuring alternative Spider-Man Miles Morales and his buildable mech with extra-long electro-web, the hands-on imaginative play will never end.\n\nWeb-zapping Spider-Man mech adventures\nThis versatile superhero gift partners kids with Miles Morales – the Spider-Man with the electric-shock webs – for endless adventures battling super villains and saving the world. Whenever more size and power is required, kids place the Miles Morales minifigure into the cockpit of his mighty mech. The movable mech’s super-sized electro-web is the perfect way for kids to zap villains as they relive favorite movie scenes and battle other mechs in their collection. For extra fun, the downloadable LEGO Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize their playset as they build.\n\nA hands-on treat for young superheroes, LEGO® Marvel Spider-Man Miles Morales Mech Armor (76171) scales up the superhero adventures with movable limbs and extra-long electro-web to zap the bad guys.\nIncludes a Miles Morales minifigure and buildable mech, a large web that fits in the hands of both the mech and the minifigure, plus smaller webs that attach to the mech’s legs and elsewhere. When kids place the minifigure into the cockpit of the super-sized, movable mech, they can relive favorite movie scenes, create their own adventures and battle other mechs in their collection. An exciting and endlessly entertaining birthday, holiday or just-because gift for budding superheroes aged 7 and up. This durable building toy stands over 4 in. (12 cm) tall, making it perfect for hands-on role play. And, when the action stops, it looks super-cool on display in any kid’s room. For more building fun, the free LEGO® Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize their playset as they build. All LEGO® Marvel Spider-Man playsets inspire imaginative superhero adventures as kids recreate movie action, dream up stories of their own and put their hand-built scenes on display. LEGO® components meet stringent industry standards that ensure they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958. LEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they satisfy rigorous global safety standards."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/spider-man-and-sandman-showdown-76172","description":"LEGO® Marvel Spider-Man: Spider-Man and Sandman Showdown (76172) is a super-fun, super-quality playset for budding superheroes. Designed especially for ages 4 and up, it encourages shared play and delivers developmental benefits.\n\nThe best start for growing minds\nSurprise a young superhero with this LEGO 4+ set and introduce them to non-stop imaginative fun. A special Starter Brick chassis helps youngsters get started and discover the joy of constructing something “by myself”. The included simple guide to building and playing helps them (and their grown-up helpers) develop creative construction skills. For more building fun, the downloadable LEGO Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize their playset as they build.\n\nFun for all the family\nA LEGO 4+ playset is a treat for toddlers and parents alike. While adults pass on their construction skills, they share precious developmental milestones with their budding builder.\n\nLEGO® Marvel Spider-Man: Spider-Man and Sandman Showdown (76172) is a superhero treat designed to develop the imagination, dexterity and building confidence of youngsters aged 4 and up.\nIncludes Spider-Man and Sandman minifigures, a sturdy spider-buggy, a sand catapult for kids to shoot and fun accessories from the superhero movies.\nKids (and their friends) help Spider-Man stop super villain Sandman stirring up a sand tornado, then go on to recreate movie scenes and dream up endless superhero adventures of their own.\nThis LEGO® 4+ set is specially designed with a Starter Brick and simple building steps so youngsters aged 4 and up can learn to build and develop creative confidence as they go.\nThis family-playtime, superhero building toy measures over 1 in. (4 cm) high, 3 in. (9 cm) wide and 2 in. (6 cm) deep, with pieces perfectly sized for small hands to pick up and place.\nA simple building guide is provided and pieces are grouped into separate bags with a playable element and character in each one, so youngsters can enjoy their construction toy one step at a time.\nFor even more building fun, the free LEGO® Building Instructions app includes digital Instructions PLUS, which lets kids zoom, rotate and visualize their playset as they build.\nLEGO® 4+ sets introduce children to a universe of movie favorites, TV characters and everyday heroes that they will love to share with parents and other playtime partners.\nLEGO® components meet strict industry standards to ensure all 4+ sets are easy for little fingers to pick up, place and pull apart – and it’s been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they satisfy rigorous child safety standards."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/spiderjet-vs-venom-mech-76150","description":"There’s endless action when kids play with LEGO® Marvel Spider-Man Spider-Jet vs. Venom Mech (76150). When the supersized 4-armed mech’s monstrous claws reach for Spider-Man, Spider-Man Noir launches a jet-plane attack on the super villain. Superhero minifigure action – Spider-Man vs Venom! This action-packed Venom mech set with LEGO® Marvel Spider-Man minifigures will give superhero fans endless imaginative role-play fun. Kids open the mech's cockpit to place the Venom minifigure pilot inside. Movable arms and legs enable all-round mech mobility. The Spider-Jet is armed with disc shooters and flick missiles. With so much activity, this hot building toy is ideal for both individual and group play. Cool Spider-Man action playsets LEGO Marvel Spider-Man building toys give kids an infinite universe of imaginative role-play adventures. With collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, young superheroes can recreate favorite Marvel movie scenes and invent imaginative stories of their own.\nThis enormous Venom mech gives kids a giant-sized bad guy to defeat. When they put the minifigure inside the mech, the mega mechanical monster can go anywhere and grab at anything – including Spider-Man and jet planes!\nAn oversized, 4-armed version of Venom gives the villain extraordinary powers. The new-for-January-2020 Spider-man Noir action minifigure takes him on with a jet plane armed with a disc shooter and flick missiles.\nThe mech's cockpit opens for the Venom minifigure to enter. Kids position its arms and legs for action, then battle Spider-Man! Combine with other cool LEGO® Spider-Man sets for extra play options.\nBoys and girls aged 7 and up will play out endless superhero adventures with this LEGO® Marvel Spider-Man building toy. A hot action gift for kids who love Spider-Man playsets and LEGO® minifigures.\nAt over 4” (12cm) tall, this buildable mech toy inspires imaginative play on a big scale. Kids can integrate the playset with other LEGO® superhero building toys for even more imaginative make-believe possibilities.\nThis great gift for kids doesn’t need batteries. Kids can enjoy hands-on fun whenever they want. Battery-free LEGO® mech toys encourage creative thinking, imaginative role-play and problem-solving skills.\nLooking for a Spider-Man playset for someone new to LEGO® building toys? Not a problem! This Superhero Venom mech toy comes with an easy-to-follow guide to get kids building and playing without delay.\nLEGO® Marvel Spider-Man playsets deliver imaginative group and solo superhero adventures for kids wanting to recreate movie scenes, dream up adventures of their own or simply use their Marvel building toy for display.\nLEGO® toys meet the highest industry standards, so they are consistent, compatible and connect and pull apart easily (no superpowers needed!) – and it's been that way since 1958.\nAs well as meeting the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends,scratches and stretches LEGO® bricks and pieces so you can be sure the toy is safe for your child."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/venomosaurus-ambush-76151","description":"LEGO® Marvel Spider-Man Venomosaurus Ambush (76151) puts Marvel movie action into kids’ hands. This versatile playset inspires endless role play as young superheroes enact imaginative battles between Spider-Man and Venom.\n\nMarvel Spider-Man role-play adventures\nMarvel fans can recreate favorite movie scenes and devise their own imaginative adventures with Spider-Man, Iron Spider, Spider-Ham and Venom minifigures in a battle for the crucial Venom egg. The creative play steps up a gear when kids place the Venom minifigure into the mighty Venomosaurus building toy, with its vicious jaws and black web-weapons, and put Spider-Man into his mega-buggy, with its awesome weapons and super-suspension.\n\nPopular superhero construction toys\nLEGO Marvel Spider-Man playsets are filled with collectible vehicles, mechs, buildings, minifigures, weapons and gadgets. These hot building toys transport kids to a universe of superhero adventures where they build key skills as they explore and play.\n\nThe awesome LEGO® Marvel Spider-Man Venomosaurus Ambush (76151) playset puts superhero movie action, collectible minifigure construction toys and endless imaginative role-play fun into young Marvel movie fans’ hands.\nKids relive favorite Marvel movie scenes and create adventures of their own with Spider-Man, Iron Spider, Spider-Ham and Venom minifigures, as they battle for the Venom egg – inside of which is the Venomized skeleton.\nThe creative play intensifies when kids place the Venom minifigure into the Venomosaurus, with its vicious jaws and black web-weapons, and put Spider-Man into his vehicle with its awesome weapons and super-suspension.\nIt’s not just Marvel movie fans who’ll be thrilled to receive this Spider-Man building toy as a birthday present. It makes a great gift for any child aged 8 and up who loves imaginative play with hot action construction toys.\nWith the Venomosaurus building toy measuring over 7” (18cm) high, this popular playset inspires endless epic adventures and makes an awesome display in any kid’s room.\nThis cool mechanical building toy doesn’t need batteries, so kids can enjoy creative fun, imaginative role play and hands-on action whenever and wherever they want it.\nSimple, clear instructions ensure kids get building and playing right away and experience maximum enjoyment with the cool vehicles and fun features.\nLEGO® Marvel Spider-Man playsets put Marvel movie action into kids hands! With collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, these hot building toys help kids build key skills as they play.\nLEGO® building sets meet the highest industry standards, which means they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure your child’s building set meets the highest safety and quality standards in the world."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/venom-crawler-76163","description":"With LEGO® Marvel Avengers Venom Crawler (76163) young superheroes can team up with Spider-Man to take on both Carnage and archenemy Venom, who is at the controls of his monstrous Venom Crawler! Cool action vehicles and minifigures Behold, the Venom Crawler! With 8 movable legs and a rear stud shooter, this reinforced battle machine makes an awesome adversary. Even worse – the alien Symbiote at the controls has contaminated Iron Man to become Iron Venom! Spider-Man rides to the rescue in his Spider Buggy, armed with 2 stud shooters. But to make things even more challenging for our favorite webslinger, the evil Carnage jumps into the action with his battle maze weapon. Playsets for superheroes! LEGO Marvel Avengers building toys take kids to a universe of imaginative role-play excitement. With awesome vehicles, mechs, buildings, minifigures, weapons and gadgets, young superheroes can recreate favorite Marvel movie scenes and dream up adventures of their own.\nThe action and adventure are in kids’ hands when Spider-Man takes on both Carnage and archenemy Venom. The evil alien Symbiote is at the controls of the Venom Crawler – and has contaminated Iron Man to become Iron Venom!\nThe Venom Crawler has 8 movable legs and a rear stud shooter. Spider-Man's buggy has 2 stud shooters. Set includes 3 minifigures: Spider-Man, Carnage and the Iron Man/Venom hybrid, Iron Venom.\nSpider-Man is in a battle with both Carnage and archenemy Venom, who is operating the monstrous Venom Crawler! Kids will need all their superhero powers to defeat this adversary!\nYoung superheroes aged 8 and up will enjoy endless imaginative fun with this LEGO® Marvel Avengers playset. It’s a great Christmas, birthday or any-other-day gift for fans of the Marvel Avengers movies.\nThe Venom Crawler measures over 9” (24cm) long, giving kids hands-on play on a big scale. Combine this playset with other LEGO® sets for even more imaginative fun.\nNo batteries required,so kids can enjoy the playset whenever and wherever they want without losing power. These hot construction toys encourage creative thinking, imaginative role-play and problem-solving skills.\nIncludes easy-to-follow instructions that ensure the creative construction and imaginative play start as soon as kids open the box.\nBring superhero adventures to life with the exciting range of LEGO® Marvel Avengers playsets. Kids can recreate favorite movie scenes, make up stories of their own or simply put their awesome models on display.\nLEGO® construction toys meet the highest industry standards plus our own quality criteria, so they are consistent, compatible and connect and pull apart easily – no superpowers needed! It’s been that way since 1958.\nAs well as satisfying the highest global safety and quality standards, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces so you can be certain they are safe for your child."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/spider-man-mech-76146","description":"Young superheroes can recreate Marvel action with this posable LEGO® Marvel Spider-Man: Spider-Man Mech (76146). When kids place the Spider-Man minifigure inside the supersized spider-mech no bad guy is safe! Supersized Spider-Man adventures This action-packed Spider-Man mech set and LEGO minifigure will give Marvel superhero fans endless imaginative fun. The giant robot's opening cockpit allows the Spider-Man minifigure pilot to enter the mech. Movable arms and legs enable all-round mobility, and a huge villain-catching web extends from the right hand. A spider breastplate decorates the mech’s chest. For extra building fun, download the free LEGO Life interactive building app with cool zoom and rotate features. Popular LEGO building toys with Marvel magic! LEGO Marvel Spider-Man building toys open up a universe of role-play adventures. With collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, kids can recreate favorite Marvel movie scenes and devise imaginative stories of their own.\nThis amazing Spider-Man mech gives kids bigger and better superhero adventures. When they put the minifigure inside the mech, the spider-robot can go anywhere, grab anything and ensnare whoever gets in their way.\nThe mech is an oversized version of Spider-Man, with 4 spider legs extending from his back and a large villain-catching web coming from his hand. An opening cockpit allows the Spider-Man minifigure to enter the mech.\nKids can place the Spider-Man minifigure into the mech, position its arms and legs for action, then take on all the bad guys! The set integrates with other popular superhero figures and Spider-Man building toys.\nBoys and girls aged 6 and up will enjoy endless superhero adventures with this LEGO® Marvel Spider-Man building toy. A hot, action-packed gift for kids who love Spider-Man fun.\nAt over 5” (15cm) tall, this collectible Spider-Man mech inspires imaginative play on a big scale. It's great to combine with other LEGO® Marvel mechs and, when the action stops, to display in any kid’s room.\nThis action-packed playset doesn’t need batteries. Kids can enjoy hands-on fun whenever they want. Battery-free LEGO® mech toys encourage creative thinking, imaginative role-play and problem-solving skills.\nIncludes Instructions PLUS, so even young children can build their LEGO® toy independently. This fun, free interactive guide, with zoom and rotate functions, comes with the LEGO Life app for smartphones and tablets.\nLEGO® Marvel Spider-Man playsets deliver action-packed, imaginative superhero adventures for kids wanting to recreate movie scenes, dream up adventures of their own or simply use their collectible model for display.\nLEGO® toys meet the highest industry standards, so they are consistent, compatible and connect and pull apart easily (no superpowers needed!) – and it's been that way since 1958.\nAs well as meeting the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends, scratches and stretches LEGO® bricks and pieces so you can be sure your toy is safe for your child."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/spider-man-and-the-museum-break-in-40343","description":"Help Spider-Man protect the museum artefacts in LEGO® Marvel Spider-Man and the Museum Break-In, with 3 minifigures, an extra Spider-Man head element, web shield and buildable drone."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/carnage-76199","description":"LEGO® Marvel Spider-Man Carnage (76199) takes your construction skills into the Marvel Universe as you recreate the nightmarish features of the alien super villain.\n\nAuthentic details to build and display\nFrom the low, red brow to the protruding jaw packed with bayonet-like teeth, this LEGO brick replica of Carnage provides Marvel movie fans and model-making enthusiasts with a building experience that is challenging yet highly rewarding. With a stylish name plaque attached to the sturdy base, this remarkable model will look even more impressive displayed alongside other LEGO comic-book creations.\n\nLEGO brick model-making kits\nEscape the busy world and rediscover the joy of creative construction with adult LEGO building sets. Satisfying to build and stunning to display, adult LEGO kits make great birthday gifts, Christmas presents and personal treats for anyone interested in model making or comic-book culture.\n\nConstruct your own LEGO® brick replica of the merciless super villain Carnage, with LEGO Marvel Spider-Man Carnage (76199).\nThis 546-brick project captures all the monstrous alien’s authentic details – from its low, red brow to its bayonet-like teeth – and stands on a sturdy base with a stylish name plaque attached.\nThe satisfaction of a job well done will last long after the hands-on construction of this collectible piece of Marvel memorabilia is completed.\nThis build-and-display iconic super villain is the perfect project for adult Marvel movie fans and model-making enthusiasts.\nThe finished model measures over 7 in. (19 cm) high, 3 in. (9 cm) wide and 5 in. (15 cm) deep and provides a fascinating conversation starter, whether displayed in your home or workplace.\nThis premium display model provides a stress-relieving diversion for model makers as Carnage gradually emerges from the LEGO® bricks.\nHigh-quality, printed instructions are included to ensure you can embark on this fascinating construction project without delay.\nThe range of LEGO® sets created with adults in mind are designed to deliver a satisfying build-and-display experience that will captivate any model-making enthusiast.\nLEGO® building kits meet rigorous industry quality standards to ensure they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global safety standards."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/spider-man-keyring-853950","description":"Team up with a legend when you attach the LEGO® Marvel 853950 Spider-Man Key Chain to your keys or backpack. Featuring an updated design for January 2019, this Spider-Man minifigure linked to a sturdy metal ring and chain makes a fun gift for all fans of the web-slinging superhero.\n\nFeatures a LEGO® Marvel Spider-Man minifigure linked to a durable metal ring and chain.\nAttach it to your keys or backpack.\nMinifigure is not detachable from metal chain."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/stark-jet-and-the-drone-attack-76130","description":"Team up with Happy Hogan, Nick Fury, Mysterio and Spider-Man for an aerial battle in LEGO® Marvel Spider-Man 76130 Stark Jet and the Drone Attack. This action-packed Spider-Man playset features a buildable Stark Jet airplane model toy with 2 stud shooters, adjustable wings, energy bomb storage compartment, dual minifigure cockpit with a rear passenger seat for Spider-Man and an opening hatch function. Press the button on the top of the jet to drop energy bombs or let Spider-Man swoop down on his spider web string. This creative building toy also includes 2 stud-shooting drones and 4 minifigures to role-play superhero scenes from Marvel’s Spider-Man: Far From Home movie.\n\nThis building set for kids includes 4 Marvel Universe minifigures: Happy Hogan, Nick Fury, Spider-Man and Mysterio.\nStark Jet features a dual minifigure cockpit with pilot seats for Happy Hogan and Nick Fury, control panel stickers, 2 guns, plus a passenger seat for Spider-Man, opening hatch function with attachment point for Spider-Man’s spider web string element, rear storage compartment for 3 buildable energy bombs, adjustable wings and 2 stud shooters.\nPress the button on the top of the jet to open the hatch and drop bombs or let Spider-Man swoop down from the jet on his spider web string.\nEach buildable toy drone features 2 stud shooters.\nWeapons include Happy Hogan’s gun, Nick Fury’s shooter and Mysterio’s power energy elements for creative play.\nThis Marvel building toy also includes the Spider-Man minifigure’s spider web string element.\nNick Fury and Mysterio minifigures are new for May 2019.\nRecreate thrilling superhero scenes from Marvel’s Spider-Man: Far From Home movie.\nAdd 76128 Molten Man Battle and 76129 Hydro-Man Attack superhero playsets for even more Spider-Man action and imaginative play.\nStark Jet construction toy measures over 6” (10cm) high, 9” (38cm) long and 3” (25cm) wide.\nEach drone measures over 1” (4cm) long, 1” (4cm) wide and under 1” (2cm) high."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/spider-mech-vs-venom-76115","description":"Join Spider-Man and Ghost Spider on a mission to release Aunt May from Venom’s clutches in a thrilling LEGO® Marvel Spider-Man 76115 Spider Mech vs. Venom battle. Match the posable Spider Mech, featuring an opening minifigure cockpit, tech spider/web shooter and gripping claw, against the huge posable Venom Mech, with minifigure-grabbing claws. This superhero toy building kit includes 4 LEGO minifigures, Ghost Spider's hover board with 2 stud shooters, plus 9 assorted web elements to customize your builds, minifigures and weapons.\n\nIncludes 4 minifigures: Spider-Man, Ghost Spider, Venom and Aunt May.\nSpider Mech features an opening minifigure cockpit, posable joints, shooter to fire tech spider or web elements, and a gripping claw with attachment points for alternative web elements.\nVenom Mech features a minifigure cockpit, posable joints, a long tongue, and gripping claws to grab minifigures.\nAlso includes Ghost Spider's hover board with 2 stud shooters and a translucent flame exhaust element, plus 9 assorted new-for-December-2018 web elements to customize your builds, minifigures and weapons.\nAccessory elements include Aunt May’s ice cream.\nThe Spider-Man, Venom and Aunt May minifigures are new for December 2018.\nBuildable Spider Mech toy measures over 5” (14 cm) high, 4” (11cm) long and 1” (4cm) wide\nVenom Mech measures over 8” (22cm) high, 7” (18cm) long and 3” (8cm) wide"},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/spider-man-s-spider-crawler-76114","description":"Team up with Spider-Man and Spider-Man 2099 to pursue diamond thieves Sandman and Vulture in the LEGO® Marvel Spider-Man 76114 Spider-Man’s Spider Crawler. The Crawler features a lifelike spider-crawling function, 2 stud shooters and a shooter that fires tech spider or web elements. This superhero playset includes 4 LEGO minifigures with weapons, Sandman's buildable opening sandbase with hidden diamond elements and Vulture's buildable wings. Also includes 9 assorted web elements to customize your builds, minifigures and weapons for imaginative play.\n\nIncludes 4 new-for-December-2018 minifigures: Spider-Man, Spider-Man 2099, Vulture and Sandman.\nSpider-Man’s Spider Crawler features a minifigure cockpit, 8 crawling legs activated by model movement, 2 stud shooters, and a shooter to fire tech spider or web elements.\nAlso includes Sandman's buildable opening sandbase with 3 stolen diamond elements inside, a transparent display dome with a diamond element inside, and Vulture's buildable wings.\nThis LEGO® building set for kids includes 9 assorted new-for-December-2018 web elements to customize your builds, minifigures and weapons.\nWeapons include Vulture’s stud shooter and Sandman’s buildable sand mallet.\nSpider-Man’s Spider Crawler buildable mech toy measures over 3” (8cm) high, 8” (22cm) long and 5” (15cm) wide."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/molten-man-battle-76128","description":"Build an awesome fire monster and role-play a thrilling LEGO® Marvel Spider-Man 76128 Molten Man Battle. The buildable Molten Man mechanical buildable toy figure features posable joints, a gripping claw, 6-stud rapid shooter, buildable ‘melting’ objects including half a car, street lamp and a traffic light attached to its body, molten lava elements and attachment points for minifigures. This Marvel toy includes 3 minifigures—Spider-Man, Mysterio and a firefighter—with weapons and accessories to play out exciting superhero scenes from Marvel’s Spider-Man: Far From Home movie.\n\nThis Spider-Man toy building set for kids includes 3 Marvel Universe minifigures: Spider-Man, Mysterio and a firefighter.\nMolten Man buildable figure features a posable head, arms and legs, gripping claw, 6-stud rapid shooter, buildable ‘melting’ objects including half a car, street lamp and traffic light, chain, melting lava stick elements and various attachment points for minifigures.\nThis Spider-Man playset features minifigure weapons including Spider-Man’s web pack, and Mysterio’s power energy elements.\nAccessories include the firefighter’s buildable fire extinguisher for creative play.\nThe Marvel Spider-Man minifigure features new-for-May-2019 black and grey stealth suit decoration and the Mysterio minifigure is also new for May 2019.\nRecreate thrilling scenes from the Spider-Man: Far From Home movie with this creative building toy.\nAdd 76129 Hydro-Man Attack and 76130 Stark Jet and The Drone Attack construction toys for even more Spider-Man action.\nMolten Man buildable action figure toy stands over 7” (18cm) tall."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/the-menace-of-mysterio-76149","description":"LEGO® Marvel Spider-Man The Menace of Mysterio (76149) is a construction toy that introduce kids to LEGO® building, minifigure action and supercool adventures. Spider-Man helicopter and Mysterio mech playset As well as Spider-Man, Ghost Spider and Mysterio LEGO minifigures, this superhero playset includes the awesome spider-copter and Mysterio's mighty mech! The mech has wheels and movable arms to smash into the bank's vault. Kids can use the ‘claws' on Spider-Man's helicopter to grab Mysterio and zap his mech with a blast of web. A simple building guide explains the purpose of each step, and the free, downloadable LEGO Life app provides interactive zoom and rotate. Cool kids’ action playset With vehicles, mechs, buildings, minifigures, weapons and gadgets, LEGO Marvel Spider-Man building toys let little superheroes recreate favorite movie scenes and make up imaginative stories of their own.\nThere’s action, excitement and popular superhero toys in this LEGO® starter set for young builders. A great way to introduce kids to LEGO building and Marvel Spider-Man movie adventures.\nThis cool action-packed toy comes with Spider-Man, Ghost Spider and a new-for-January-2020 Mysterio minifigure. Also includes Spider-Man's helicopter, Mysterio's mech and a bank that breaks open to reveal a toy vault!\nMysterio wheels his mad mech to smash its powerful arms into the bank and grab the loot! Can Spider-Man race to the scene in his helicopter in time to stop him? Can Ghost Spider disable the mech with a blast of web?\nThis LEGO® Marvel Spider-Man building toy will make a popular gift for kids’ birthdays and at Christmas. The building challenges and group-play possibilities are perfectly suited to boys and girls aged 4 and up.\nWith the Spider-Man helicopter measuring over 5” (13cm) long and the mech over 3” (10cm) high, this superhero minifigure playset offers cool Spider-Man action with endless individual and group-play possibilities.\nYou don’t need batteries for this superhero gift – kids just pick up and play! Hands-on LEGO® building toys help kids develop their creative thinking, imaginative role-play and problem-solving skills.\nEven young kids can build this Spider-Man playset independently, thanks to Instructions PLUS. This free interactive guide has fun zoom and rotate features and comes with the LEGO Life app for smartphones and tablets.\nLEGO® MarvelSpider-Man playsets encourage imaginative role-play with action-packed, superhero adventures. Kids can recreate movie scenes, make up stories of their own, or simply group their models into a cool display.\nLEGO® bricks and pieces meet the most stringent industry standards, ensuring they're consistent, compatible and able to connect and pull apart easily – and it's been that way since 1958.\nAs well as satisfying the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends, scratches and stretches LEGO® bricks and pieces so you can be sure they're safe for your child."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/spider-man-bike-rescue-76113","description":"Speed through New York City streets and help Spider-Man and Miles Morales thwart evil Carnage’s mission to blow up the power generator in LEGO® Marvel Spider-Man 76113 Spider-Man Bike Rescue. This action-packed construction toy features a Spider-Man bike with a tech spider shooter and web gun (non-shooting), and a buildable power generator with an explode function. It also includes 3 LEGO minifigures, plus 9 assorted web elements to customize your builds, minifigures and weapons for creative play.\n\nIncludes 3 new-for-December-2018 minifigures: Spider-Man, Miles Morales and Carnage.\nSpider-Man bike features a minifigure cockpit, adjustable handlebars, big wheels, tech spider shooter and a web gun (non-shooting) with attachment point for web elements.\nBuildable power generator features an explode function, power cell elements and attachment points for web elements.\nActivate the explode function to send the power cells flying.\nThis LEGO® Marvel Spider-Man toy building set includes 9 assorted new-for-December-2018 web elements to customize your builds, minifigures and weapons.\nAccessory elements include Carnage’s tentacles.\nBuildable Spider-Man bike toy measures over 1” (5cm) high, 5” (13cm) long and 2” (6cm) wide.\nPower generator measures over 1” (3cm) high, 5” (13cm) wide and 1” (5cm) deep."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/spider-man-vs-doc-ock-76148","description":"With this LEGO® Marvel Spider-Man: Spider-Man vs. Doc Ock set (76148), young superheroes will feel as if they’re racing into action with Spider-Man and Spider-Girl on the awesome Spider-Cycle. Once they’ve worked together to defeat the evil Doctor Octopus, who knows where their imaginations will take them next? Cool action minifigures and motorcycle toy Doctor Octopus – aka Doc Ock– has 4 deadly robotic arms. But Spider-Man and his dynamic daughter Spider-Girl have the amazing Spider-Cycle.Kids will love splitting the motorcycle into 2 cool machines: Spider-Man’s high-speed bike and the giant ‘walking spider’ – always handy in a fight! There are stud shooters to fire, webs to fling and endless possibilities for individual and group play. LEGO® Spider-Man toys – great gifts for kids LEGO Marvel Spider-Man playsets open up a universe of fun-packed role-play adventures. With collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, superhero fans can relive movies, create their own stories and display the supercool models in their rooms.\nThere’s action, adventure and endless possibilities for imaginative play when young superheroes join Spider-Man, Spider-Girl and their amazing 2-in-1 motorcycle to battle the evil, 4-armed Doctor Octopus.\nWith 3 LEGO® minifigures, kids can role-play as Spider-Man, Spider-Girl and Doc Ock in an action-packed confrontation. Spider-Man's motorcycle splits into 2 to create a high-speed bike and a giant ‘walking spider'!\nDoc Ock has 4 robotic arms. But Spider-Man and Spider-Girl have the Spider-Cycle, with stud shooters and webs to fling… and that’s just the beginning! Who knows where this inspirational playset will take them next?\nWith a cool superhero action set to build that’s great for solo and group play, boys and girls aged 6 and up will enjoy endless superhero adventures with this LEGO® Marvel Spider-Man building toy.\nMeasuring over 6” (17cm) long, 5” (13cm) wide and 2” (6cm) high, Spider-Man's motorcycle easily combines with other LEGO® Marvel sets for even more superhero action. And when it’s not chasing villains, it looks great on display in any kid’s room.\nNo batteries are needed for this Spider-Man superhero playset. Kids can enjoy hands-on fun whenever and wherever they want. Battery-free LEGO® building toys encourage creative thinking and imaginative role-play.\nThinking of giving this popular Spider-Man playset to someone new to LEGO® building toys? No problem! It comes with an easy-to-follow guide to get them building and playing straight away.\nLEGO® Marvel Spider-Man playsets give superhero fans endless, action-packed, role-play enjoyment. Kids can recreate movie scenes, dream up adventures of their own or simply put their models on display.\nLEGO® toys meet the highest industry standards, so they are consistent, compatible and connect and pull apart easily (no superpowers needed!) – and it's been that way since 1958.\nAs well as meeting the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends, scratchee and stretch LEGO® bricks and pieces so you can be certain your toy is safe for your child."},{"theme":"lego-spider-man","themeUrl":"https://www.lego.com/en-us/themes/lego-spider-man","productUrl":"https://www.lego.com/en-us/product/vulture-s-trucker-robbery-76147","description":"Your little superhero can swing into action with Spider-Man to catch Vulture as the winged villain minifigure swoops down, blasts the bank truck open and steals the jewels! A great way to introduce preschoolers to LEGO® construction. Cool, buildable action toy with vehicles and minifigures This Spider-Man playset includes 3 LEGO minifigures – Spider-Man, the Vulture and a Driver – an awesome motorbike and a bank truck. The truck's rear ‘explodes' off to reveal boxes of jewels, and kids can remove the engine and rebuild it on top of the hood for a sporty look. A simple guide builds kids’ confidence by explaining the purpose of each building step. For extra fun, download the free LEGO Life interactive building app with zoom and rotate features. Super-fun superhero playsets With an awesome range of vehicles, mechs, buildings, minifigures, weapons and gadgets, LEGO Marvel Spider-Man building toys let little superheroes recreate favorite movie scenes and role-play imaginative stories of their own.\nThere’s action, excitement and familiar characters in this LEGO® starter set for young builders. It’s a great way to introduce kids to LEGO playsets and superhero adventures from the Marvel Spider-Man movies.\nThis fun-filled toy includes Spider-Man, the Vulture and Driver LEGO® minifigures, plus Spider-Man's motorbike and a bank truck with a rear that ‘explodes' off and an engine that can be rebuilt on the hood.\nWith a motorbiking superhero, a winged super villain and a bank truck full of jewels, the scene is set for endless action-packed play! And, when the action stops, the figures make a great display in any kid’s room.\nThis LEGO® Marvel Spider-Man building toy offers building challenges and group play possibilities perfectly suited to boys and girls aged 4 and up. A popular buildable LEGO toy for kids' Christmas or birthday gift.\nWith the bank truck toy measuring over 5” (15cm) long and 3” (9cm) high, this Spider-Man and Vulture minifigure playset encourages imaginative play on a big scale. Combine it with other toys for more superhero fun.\nYou don’t need batteries for this superhero playset. Kids just pick up and play! Battery-free, hands-on LEGO® building toys encourage creative thinking, imaginative role-play and problem-solving skills.\nEven young children can build this Spider-Man playset independently, thanks to Instructions PLUS. This free interactive guide with zoom and rotate functions comes with the LEGO Life app for smartphones and tablets.\nLEGO® Marvel Spider-Man playsets inspire kids to create action-packed, imaginative superhero adventures. They’re great for recreating movie scenes and dreaming up new adventures, or they can simply be used for display.\nAll LEGO® bricks and pieces meet the highest industry standards, so they are consistent, compatible and connect and pull apart easily –it's been that way since 1958.\nAs well as meeting the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends, scratches and stretches LEGO® bricks and pieces so you can be certain they're safe for your child."}]