[{"theme":"lego-education-sets","themeUrl":"https://www.lego.com/en-us/themes/lego-education-sets","productUrl":"https://www.lego.com/en-us/product/lego-education-spike-prime-set-45678","description":"The LEGO® Education SPIKE™ Prime Set is the go-to STEAM learning tool for grade 6-8 students. Combining colorful LEGO building elements, easy-to-use hardware, and an intuitive drag-and-drop coding language based on Scratch, SPIKE Prime continuously engages students through playful learning activities to think critically and solve complex problems, regardless of their learning level. From easy-entry projects to limitless creative design possibilities, SPIKE Prime helps students learn the essential STEAM and 21st century skills needed to become the innovative minds of tomorrow... while having fun!\n\nThe heart of the SPIKE Prime system is the programmable Hub. This advanced yet simple-to-use, brick-shaped device features 6 input/output ports, 5x5 light matrix, Bluetooth connectivity, a speaker, 6-axis gyro and a rechargeable battery. The SPIKE Prime Set also includes highly accurate motors and sensors that, together with a large variety of colorful LEGO building elements, let students design and build fun robots, dynamic devices and other interactive models. Many attachment points on the Hub, motors and sensors plus new, large building elements means students spend less time building and more time learning. The durable storage box and 2 sorting trays also means time spent setting up and clearing away is kept to a minimum, while the smaller trays are ideal when desk space is limited.\n\nThe intuitive coding environment for tablets and computers takes the best elements from the popular coding language based on Scratch, creating a system that teachers and students will love. In addition to Getting Started Material, the app comes with 3 unit plans of curriculum-aligned STEAM content focusing on Engineering and Computer Science. Designed for students grades 6-8 and optimized for 45-minute lessons, these units accelerate STEAM learning by consistently engaging students to think critically and to solve complex problems, regardless of their learning level. Comprehensive online lesson plans with a wealth of accessible, interactive support material gives teachers everything they need to deliver lessons with confidence, whatever their previous experience.\n\nLearn about all the cool new elements that makes SPIKE™ Prime so cool!\nSturdy storage box with sorting trays, programmable Hub, Distance Sensor, Force Sensor, Color Sensor, Large Motor, 2 Medium Motors and over 500 appealing LEGO® Technic™ elements in a fresh color palette.\nProgrammable Hub features a 5x5 light matrix, 6 input/output ports, integrated 6-axis gyro, speaker, Bluetooth connectivity and rechargeable battery.\nThe drag-and-drop coding environment for tablets and computers is rooted in the popular coding language based on Scratch used by millionsof children around the world.\nEngage students with 3 STEAM unit plans for grades 6-8 focused on Engineering and Computer Science, linked to curriculum standards, and mostly optimized for 45-minute sessions. Includes comprehensive online lesson plans and teacher support.\nApply engineering design skills at each step of the design process.\nDevelop efficient problem-solving and coding skills through decomposition of problems and algorithmic thinking.\nDesign projects that combine hardware and software components to collect and exchange data.\nWork with variables, data arrays and cloud data.\nApply critical thinking and develop life skills for the careers of tomorrow.\n\nIf you are an educator buying these products for schools or to deliver other accredited learning, please click on the link below for more information on how to source and use these solutions to deliver learning outcomes tailored to your local education requirements, such as options on classroom packs, professional development offerings and advice on classroom solutions. https://education.lego.com/shop/find-distributor\n\n \n\nAre you a home user, looking for a way to provide home learning activities for children of all ages? Whether they’re in the classroom or the living room children have big imaginations, innate curiosity, and a desire to explore and take risks. All you need are the resources to tap into them. LEGO Education wants to help. Hands-on learning provides a medium for building ideas and models while practicing important skills such as communication, collaboration, critical thinking and creativity.\n\nFor more than 40 years, LEGO Education has been developing educational solutions based on a well-established educational theory that children learn best and remember more through hands-on experiences. Our products aren’t toys - instead home use of LEGO Education Learning Resources is intended to be a highly rewarding education experience that supplements locally applicable curriculum needs.\n\nLEGO Education offers pre and post-sale support to ensure LEGO Education resources are used as effectively as possible in a learning environment. Contact our Customer Services team."},{"theme":"lego-education-sets","themeUrl":"https://www.lego.com/en-us/themes/lego-education-sets","productUrl":"https://www.lego.com/en-us/product/lego-education-my-xl-world-45028","description":"My XL World provides playful learning experiences that teach preschool children about the world around them through role-play, fun building activities and idea sharing. This LEGO® learning set also develops children’s confidence and essential social skills, such as collaboration, communication and understanding roles and responsibilities.\n\nReal-World Role-Play\nWorking in groups of 2-10, children use the colorful collection of 480 LEGO® DUPLO® bricks, figures, wheel bases, windows, doors and a building plate to build their home, a restaurant, bus stop, hospital and a fire station. They’ll also discover an airplane, car and even a submarine, and will use their imagination to build fantasy animals and make up fun stories of their own. My XL World also combines with the 45029 Animals and 45030 People accessory sets in the Early Learning system for even more playful learning fun for children.\n\nFull Teacher Support\nMy XL World includes everything that teachers need to deliver inspiring lessons, including a Getting Started card with 5 activity ideas and 10 double-sided building cards. There’s also an online Unit Plan with 8 standards-aligned lessons available at www.LEGOEducation/Start. We even offer a full-day professional development course (additional purchase required) to give teachers the best-possible start.\n\nA Holistic Approach to Learning\nLEGO Education Early Learning lays the foundation for children's learning and passion for lifelong development by stimulating their natural curiosity to explore together and learn through play. My XL World combines with other products in the Early Learning system to develop social, emotional and language skills, as well as free play and early science skills.\n\nDevelops children’s confidence and essential social skills, such as collaboration, communication, and understanding roles and responsibilities.\n480 LEGO® DUPLO® elements including a building plate, 8 figures, wheel bases, windows, doors and a collection of colorful bricks – everything needed to unleash children's imaginations.\nComes with a Getting Started card with 5 activity ideas, 10 double-sided building inspiration cards with 20 models to build, and an online teacher's guide with 8 standards-aligned lessons to help deliver inspiring lessons.\nOptional full-day professional development course available (at additional cost) to give teachers the best-possible start.\nCombines with other LEGO® Education sets – such as 45029 Animals and 45030 People accessory sets – to extend the learning fun.\nPart of the LEGO® Education Early Learning system of holistic learning for preschoolers.\nIncludes enough bricks for 10 sets of LEGO® ‘six bricks' learning activities.\n\nIf you are an educator buying these products for schools or to deliver other accredited learning, please click on the link below for more information on how to source and use these solutions to deliver learning outcomes tailored to your local education requirements, such as options on classroom packs, professional development offerings and advice on classroom solutions. https://education.lego.com/shop/find-distributor\n\n \n\nAre you a home user, looking for a way to provide home learning activities for children of all ages? Whether they’re in the classroom or the living room children have big imaginations, innate curiosity, and a desire to explore and take risks. All you need are the resources to tap into them. LEGO Education wants to help. Hands-on learning provides a medium for building ideas and models while practicing important skills such as communication, collaboration, critical thinking and creativity.\n\nFor more than 40 years, LEGO Education has been developing educational solutions based on a well-established educational theory that children learn best and remember more through hands-on experiences. Our products aren’t toys - instead home use of LEGO Education Learning Resources is intended to be a highly rewarding education experience that supplements locally applicable curriculum needs.\n\nLEGO Education offers pre and post-sale support to ensure LEGO Education resources are used as effectively as possible in a learning environment. Contact our Customer Services team."},{"theme":"lego-education-sets","themeUrl":"https://www.lego.com/en-us/themes/lego-education-sets","productUrl":"https://www.lego.com/en-us/product/lego-education-wedo-2-0-core-set-45300","description":"This set is based upon the latest science standards and was created to enhance students' curiosity and science skills. The set is delivered in a storage bin along with sorting trays, labels, a Smarthub, a Medium Motor, Motion Sensor, a Tilt Sensor, and enough building elements for two students.\n\nThe accompanying desktop and tablet supported software provides an easy-to-use programming environment and includes the WeDo 2.0 Curriculum Pack, which covers life, physical, earth, and space sciences, as well as engineering. The accompanying eLearning program helps teachers to become confident users of the WeDo 2.0 Core Set.\n\nKey learning values:\nInvestigating, modelling and designing solutions\nEngage students in science by making it real and relevant\nBasic programming skills\nCollaboration and presentation skills\nCritical thinking and problem-solving USPs:\nAvailable on both desktop and tablet devices\nIntegrated documentation tool to document projects: pictures, screen shots, videos, and written text\nInbuilt assessment\nSturdy storage bin and sorting tray for easy classroom management\n\nIf you are an educator buying these products for schools or to deliver other accredited learning, please click on the link below for more information on how to source and use these solutions to deliver learning outcomes tailored to your local education requirements, such as options on classroom packs, professional development offerings and advice on classroom solutions. https://education.lego.com/shop/find-distributor\n\n \n\nAre you a home user, looking for a way to provide home learning activities for children of all ages? Whether they’re in the classroom or the living room children have big imaginations, innate curiosity, and a desire to explore and take risks. All you need are the resources to tap into them. LEGO Education wants to help. Hands-on learning provides a medium for building ideas and models while practicing important skills such as communication, collaboration, critical thinking and creativity.\n\nFor more than 40 years, LEGO Education has been developing educational solutions based on a well-established educational theory that children learn best and remember more through hands-on experiences. Our products aren’t toys - instead home use of LEGO Education Learning Resources is intended to be a highly rewarding education experience that supplements locally applicable curriculum needs.\n\nLEGO Education offers pre and post-sale support to ensure LEGO Education resources are used as effectively as possible in a learning environment. Contact our Customer Services team."},{"theme":"lego-education-sets","themeUrl":"https://www.lego.com/en-us/themes/lego-education-sets","productUrl":"https://www.lego.com/en-us/product/coding-express-45025","description":"\nCoding Express is a creative, intuitive and versatile solution that introduces preschoolers to early coding concepts that naturally sparks their curiosity, creativity and desire to explore and learn together. Based on the ever popular train theme, the highly versatile LEGO DUPLO solution allows children to make connections and intuitively explore early coding concepts, such as sequencing, looping and conditional coding, while developing problem-solving skills , critical thinking, collaboration, and social and emotional skills.\n\n\nThe child led free optional app provides four areas for preschoolers to explore: Journeys, Characters, Music and Math. The different themed activities change the way the action bricks behave, altering the effect on the train. The activities are open ended and preschoolers will practice a variety of skills relevant for early childhood development.\n\nJourneys: Tags as destinations – sequencing events and language\nCharacters: Tags as emotional reactions – action/reaction and social and emotional development\nMusic: Tags as melodies/instruments – exploring, sequencing and looping sound\nMath: Assigning values for movement – exploring action/re-action\n\n\nThe LEGO Education Coding Express makes it intuitive and fun for preschool children to learn early coding concepts and critical 21st century skills through playful, hands-on learning with LEGO DUPLO bricks.\n\n\nKey learning objectives to develop early coding and critical 21st century skills\n\n\nEarly coding skills\nSequencing\nLooping\nConditional coding\nLanguage and literacy\nCollaboration\nProblem solving\nExpress ideas with digital elements\nFeatures 234 LEGO® DUPLO® bricks\nKey features include Push & Go train with lights and sounds, motor, color sensor that interacts with 5 colored action bricks, and 2 railroad switches\nEasy in-the-box getting started materials include: Getting Started activities, introduction guide, large poster, and 6 building inspiration cards to build 12 unique models\nTeacher Guide includes 8 online lessons: 4 lessons use the physical set and 4 lessons use the digital app\n8 short online video tutorials\nFree optional app for iOS and Android app included\nApp includes 4 themed activities; Journeys, Characters, Music and Math, that allow preschoolers to collaborate and interact with the physical toy train through a digital medium\nFace-to-face training is available for in-depth understanding of how to successfully implement the Coding Express teaching solution into your teaching\n\nIf you are an educator buying these products for schools or to deliver other accredited learning, please click on the link below for more information on how to source and use these solutions to deliver learning outcomes tailored to your local education requirements, such as options on classroom packs, professional development offerings and advice on classroom solutions. https://education.lego.com/shop/find-distributor\n\n \n\nAre you a home user, looking for a way to provide home learning activities for children of all ages? Whether they’re in the classroom or the living room children have big imaginations, innate curiosity, and a desire to explore and take risks. All you need are the resources to tap into them. LEGO Education wants to help. Hands-on learning provides a medium for building ideas and models while practicing important skills such as communication, collaboration, critical thinking and creativity.\n\nFor more than 40 years, LEGO Education has been developing educational solutions based on a well-established educational theory that children learn best and remember more through hands-on experiences. Our products aren’t toys - instead home use of LEGO Education Learning Resources is intended to be a highly rewarding education experience that supplements locally applicable curriculum needs.\n\nLEGO Education offers pre and post-sale support to ensure LEGO Education resources are used as effectively as possible in a learning environment. Contact our Customer Services team."},{"theme":"lego-education-sets","themeUrl":"https://www.lego.com/en-us/themes/lego-education-sets","productUrl":"https://www.lego.com/en-us/product/tech-machines-45002","description":"Transform your children into expert builders! With the Tech Machines set in your classroom, you'll help children develop their fine motor and problem solving skills while simultaneously unleashing their creativity as they construct classic machines.\nLearning Values:\nProblem solving\nCreativity\nFine motor skills USPs:\nIntroduces young minds to basic engineering concepts\nIncludes 4 screwdrivers with integrated screws for joining special bricks together\nIncludes 2 inspirational building cards with building instructions for 2 pieces of construction equipment\nIncludes an activity booklet with quick ideas\n\nIf you are an educator buying these products for schools or to deliver other accredited learning, please click on the link below for more information on how to source and use these solutions to deliver learning outcomes tailored to your local education requirements, such as options on classroom packs, professional development offerings and advice on classroom solutions. https://education.lego.com/shop/find-distributor\n\n \n\nAre you a home user, looking for a way to provide home learning activities for children of all ages? Whether they’re in the classroom or the living room children have big imaginations, innate curiosity, and a desire to explore and take risks. All you need are the resources to tap into them. LEGO Education wants to help. Hands-on learning provides a medium for building ideas and models while practicing important skills such as communication, collaboration, critical thinking and creativity.\n\nFor more than 40 years, LEGO Education has been developing educational solutions based on a well-established educational theory that children learn best and remember more through hands-on experiences. Our products aren’t toys - instead home use of LEGO Education Learning Resources is intended to be a highly rewarding education experience that supplements locally applicable curriculum needs.\n\nLEGO Education offers pre and post-sale support to ensure LEGO Education resources are used as effectively as possible in a learning environment. Contact our Customer Services team."},{"theme":"lego-education-sets","themeUrl":"https://www.lego.com/en-us/themes/lego-education-sets","productUrl":"https://www.lego.com/en-us/product/simple-powered-machines-set-9686","description":"This set contains a brick assortment and curriculum materials for exploring design engineering with more advanced mechanisms, structures, and forces. Use this set with the accompanying curriculum pack to promote students' fundamental STEM understanding of simple and powered machines, structures, and mechanisms. The curriculum pack provides full lessons, extension activities, and problem-solving tasks, as well as teacher guides and student worksheets.\nIf you are an educator buying these products for schools or to deliver other accredited learning, please click on the link below for more information on how to source and use these solutions to deliver learning outcomes tailored to your local education requirements, such as options on classroom packs, professional development offerings and advice on classroom solutions. https://education.lego.com/en-gb/shop/find-distributorAre you a home user, looking for a way to provide home learning activities for children of all ages?Whether they’re in the classroom or the living room children have big imaginations, innate curiosity, and a desire to explore and take risks. All you need are the resources to tap into them. LEGO Education wants to help. Hands-on learning provides a medium for building ideas and models while practicing important skills such as communication, collaboration, critical thinking and creativity. For more than 40 years, LEGO Education has been developing educational solutions based on a well-established educational theory that children learn best and remember more through hands-on experiences. Our products aren’t toys - instead home use of LEGO Education Learning Resources is intended to be a highly rewarding education experience that supplements locally applicable curriculum needs.LEGO Education offers pre and post-sale support to ensure LEGO Education resources are used as effectively as possible in a learning environment. Contact our Customer Services team."},{"theme":"lego-education-sets","themeUrl":"https://www.lego.com/en-us/themes/lego-education-sets","productUrl":"https://www.lego.com/en-us/product/tubes-45026","description":"LEGO® Education Tubes lets children explore a world of fantasy animals and other creative builds – made from Tubes! Using a colorful collection of unique tube elements, LEGO® DUPLO® bricks, balls, doors and baskets, and 6 building inspiration cards, kids can create an egg-laying hen, dragon, little pooping larva and more. Tubes develops children's 21st century skills, such as problem-solving, collaboration and fine motor skills, while introducing them to cause and effect, symmetry and 3D shape recognition. This fun Early Learning set for preschoolers also includes a Getting Started card containing 5 simple ideas to inspire playful learning with Tubes in the classroom.\n150 LEGO® DUPLO® elements, including colorful tubes, bricks, 6 balls, doors and baskets, for unlimited playful learning and creative fun for preschoolers.\nComes with 6 building inspiration cards to create fun buildable animals and a Getting Started card for teachers with 5 activity ideas for a great start to fun classroom activities.\nDevelops essential 21st century skills such as problem-solving, collaboration and fine motor skills, and introduces cause and effect, symmetry and 3D shaperecognition.\nCreate funny and playful creatures that are easy to build.\nPart of the LEGO® Education Early Learning system of holistic learning for preschoolers. If you are an educator buying these products for schools or to deliver other accredited learning, please click on the link below for more information on how to source and use these solutions to deliver learning outcomes tailored to your local education requirements, such as options on classroom packs, professional development offerings and advice on classroom solutions. https://education.lego.com/en-gb/shop/find-distributor Are you a home user, looking for a way to provide home learning activities for children of all ages? Whether they’re in the classroom or the living room children have big imaginations, innate curiosity, and a desire to explore and take risks. All you need are the resources to tap into them. LEGO Education wants to help. Hands-on learning provides a medium for building ideas and models whilepracticing important skills such as communication, collaboration, critical thinking and creativity. For more than 40 years, LEGO Education has been developing educational solutions based on a well-established educational theory that children learn best and remember more through hands-on experiences. Our products aren't toys - instead home use of LEGO Education Learning Resources is intended to be a highly rewarding education experience that supplements locally applicable curriculum needs. LEGO Education offers pre and post-sale support to ensure LEGO Education resources are used as effectively as possible in a learning environment. Contact our Customer Services team."},{"theme":"lego-education-sets","themeUrl":"https://www.lego.com/en-us/themes/lego-education-sets","productUrl":"https://www.lego.com/en-us/product/storytales-45005","description":"Promote creativity, imaginative storytelling, and language development with this unique and engaging story telling set. Children will naturally collaborate and develop speaking and listening skills as they build their stories and role play. Anyone can tell a story with StoryTales!\nLearning Values:\nStorytelling\nSpeaking and listening\nCreativityUSPs:\nEspecially designed for storytelling\nIncludes a variety of unique bricks and characters\nIncludes 3 base plates and 5 double-sided background cards\nIncludes an activity card with inspirational teaching ideas\nDownload additional free activities and building inspirations at www.LEGOEducation.com"},{"theme":"lego-education-sets","themeUrl":"https://www.lego.com/en-us/themes/lego-education-sets","productUrl":"https://www.lego.com/en-us/product/lego-education-spike-prime-expansion-set-45680","description":"Enter the exciting world of robotics competitions with the LEGO® Education SPIKE™ Prime Expansion Set (45680). With 603 elements, including large wheels, banana gears, a color sensor and a large motor, this add-on to the SPIKE Prime Set (45678) features over 10 hours of targeted STEAM learning that will inspire 6th to 8th grade students and teachers to build more advanced models and prepare them for the fun and challenging world of robotics competitions.\nLEGO® Technic™ and System elements in a fresh color palette, including 2 large wheels, banana gears, large motor and a color sensor.\nCompetition Ready unit plan with over 10 hours of STEAM learning linked to curriculum standards. Includes comprehensive online lesson plans and teacher support.\nThis set requires the SPIKE™ Prime Set (45678).\nLearn the basics of creating and programming autonomous robots using sensors.\nDevelop collaboration and teamworking skills to build a competition robot.\nSystematically test and refine programs.\nUse problem-solving skills and complete competition missions.\nApply critical thinking and develop life skills for the careers of tomorrow.\n\nIf you are an educator buying these products for schools or to deliver other accredited learning, please click on the link below for more information on how to source and use these solutions to deliver learning outcomes tailored to your local education requirements, such as options on classroom packs, professional development offerings and advice on classroom solutions. https://education.lego.com/shop/find-distributor\n\n \n\nAre you a home user, looking for a way to provide home learning activities for children of all ages? Whether they’re in the classroom or the living room children have big imaginations, innate curiosity, and a desire to explore and take risks. All you need are the resources to tap into them. LEGO Education wants to help. Hands-on learning provides a medium for building ideas and models while practicing important skills such as communication, collaboration, critical thinking and creativity.\n\nFor more than 40 years, LEGO Education has been developing educational solutions based on a well-established educational theory that children learn best and remember more through hands-on experiences. Our products aren’t toys - instead home use of LEGO Education Learning Resources is intended to be a highly rewarding education experience that supplements locally applicable curriculum needs.\n\nLEGO Education offers pre and post-sale support to ensure LEGO Education resources are used as effectively as possible in a learning environment. Contact our Customer Services team."},{"theme":"lego-education-sets","themeUrl":"https://www.lego.com/en-us/themes/lego-education-sets","productUrl":"https://www.lego.com/en-us/product/build-me-emotions-45018","description":"Build Me “Emotions” invites preschoolers to explore emotions and physical characteristics in a fun and engaging way. As children collaborate on a range of character building experiences, they recognize feelings and identify similarities and differences. Building cards provide support and inspiration so children can continue to build and rebuild characters again and again!\nA variety of shapes and exciting colors\nIncludes unique bricks with various facial expressions\n8 double-sided cards provide 16 character-templates\nAn activity card with inspirational teaching ideas\nOnline videos offer even more engaging activity ideas Primary learning values\nSense of self\nCollaboration\nRecognizing and understanding emotions"},{"theme":"lego-education-sets","themeUrl":"https://www.lego.com/en-us/themes/lego-education-sets","productUrl":"https://www.lego.com/en-us/product/lego-education-bricq-motion-essential-set-45401","description":"LEGO® Education BricQ Motion Essential engages primary school students in STEAM learning as they experiment with forces, motion and interactions in the context of sports. BricQ Motion Essential provides easy, hands-on learning experiences that spark cool “aha” moments, as students set LEGO bricks in motion without the need for technology.\n\nThis 523-piece set includes a variety of easy-build elements, gears, weight bricks, springs, 4 minifigures and more, while color-coded sorting trays ease the building process and make tidying up at the end of class quick and efficient. Replacement elements are also included, as well as 2 printed building instruction booklets with inspirational ideas that help students discover physical science in action, even those who have never built with LEGO bricks before.\n\nThis introductory STEAM experience offers 2 units of 45-minute, standards-aligned lessons (one each for lower and upper primary grades). They include everything from engaging videos and printable worksheets that excite and inspire students, to lesson plans, teacher videos, assessment rubrics and math and language arts extensions that support and scaffold teachers. BricQ Motion Essential is supported by a comprehensive professional development program.\n\n523 LEGO® elements in the set include 4 minifigures and a variety of easy-build elements, gears, weight bricks, springs, a measurement element, a paper holder and more.\nSturdy storage box with color-coded sorting trays for easy classroom management.\n2 printed building instructions for models used in the lessons plus additional building inspiration.\nReplacement elements also included.\n2 units of 7 x 45-minute lessons (1 each for lower and upper primary grades), plus math and language arts extensions for additional learning.\nInformative briefing materials in each lesson plan give even the most inexperienced teachers the confidence they need to deliver engaging lessons."},{"theme":"lego-education-sets","themeUrl":"https://www.lego.com/en-us/themes/lego-education-sets","productUrl":"https://www.lego.com/en-us/product/lego-education-bricq-motion-prime-set-45400","description":"LEGO® Education BricQ Motion Prime engages secondary school students in STEAM learning as they experiment with forces, motion and interactions in the context of sports. BricQ Motion Prime provides easy, hands-on learning experiences that spark cool “aha” moments, as students set LEGO bricks in motion without the need for technology.\n\nThis 562-piece set includes an extensive selection of special elements, such as gears, wheels, balls, weights and pneumatics, 4 minifigures and more, while color-coded sorting trays ease the building process and make tidying up at the end of class quick and efficient. Replacement elements are also included, as well as printed building instructions with inspirational ideas that help students discover physical science in action.\n\nThis introductory STEAM experience offers 1 unit of 7 x 45-minutes, standards-aligned lessons that include everything from engaging videos and printable worksheets that excite and inspire students, to lesson plans, teacher videos, assessment rubrics and math and language arts extensions that support and scaffold teachers. BricQ Motion Prime is supported by a comprehensive professional development program.\n\n562 LEGO® elements in the set include 4 minifigures and special mechanical elements, like gears, springs, wheels, balls, weight bricks, pneumatics, fan blades, measurement elements and more.\nSturdy storage box with color-coded sorting trays for easy classroom management.\nPrinted building instructions for models used in the lessons plus additional building inspiration.\nReplacement elements also included.\n1 unit of 7 x 45-minute lessons plus math and language arts extensions for additional learning.\nInformative briefing materials in each lesson plan give even the most inexperienced teachers the confidence they need to deliver engaging lessons."},{"theme":"lego-education-sets","themeUrl":"https://www.lego.com/en-us/themes/lego-education-sets","productUrl":"https://www.lego.com/en-us/product/steam-park-45024","description":".\nKey Features\n295 LEGO® DUPLO® bricks, including gears, tracks, pulleys, boats, and figures\n8 double-sided building inspiration cards with 16 models to build\nBuild slides, carousels, shooting galleries, and much more!\n5 activity idea cards to inspire playful learning\nOnline Teacher Guide with 6 STEAM lessons\nA selection of online learn-to-build mini tutorial videos\nA great way to expand existing LEGO® DUPLO® sets Key Learning Values\nCause and effect\nObserving and describing\nProblem solving\nDeveloping imagination\nCreating representations\nRole-play\nCollaboration\nCommunication If you are an educator buying these products for schools or to deliver other accredited learning, please click on the link below for more information on how to source and use these solutions to deliver learning outcomes tailored to your local education requirements, such as options on classroom packs, professional development offerings and advice on classroom solutions. https://education.lego.com/en-gb/shop/find-distributor Are you a home user, looking for a way to provide home learning activities for children of all ages? Whether they’re in the classroom or the living room children have big imaginations, innate curiosity, and a desire to explore and take risks. All you need are the resources to tap into them. LEGO Education wants to help. Hands-on learning provides a medium for building ideas and models while practicing important skills such as communication, collaboration, critical thinking and creativity. For more than 40 years, LEGO Education has been developing educational solutions based on a well-established educational theory that children learn best and remember more through hands-on experiences. Our products aren’t toys - instead home use of LEGO Education Learning Resources is intended to be a highly rewarding education experience that supplements locally applicable curriculum needs. LEGO Education offers pre and post-sale support to ensure LEGO Education resources are used as effectively as possible in a learning environment. Contact our Customer Services team."}]