[{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/attack-on-the-spider-lair-76175","description":"The stunning LEGO® Marvel Spider-Man Attack on the Spider Lair (76175) is the first LEGO version of the superhero’s awesome HQ – part high-tech headquarters and part super-cool teenager’s room!\n\nEverything a young superhero needs\nEven superheroes need to chill-out in their room sometimes. But only Spider-Man could have a room like this! With a computer, PlayStation, basketball hoop with ball shooter, skateboard with ramp, and a drinks area, it's the ultimate teenage den. But it's much more than that. It’s also the ultimate superhero headquarters, with Peter Parker´s camera, training equipment, motorbike, Iron Spider Suit, weapons and even its own jail – all of which come in very handy when the evil super villains Green Goblin and Venom force their way inside.\n\nThere’s everything a teenage superhero needs in LEGO® Marvel Spider-Man Attack on the Spider Lair (76175) – the first LEGO version of the web-slinger’s high-tech HQ.\nIncludes Spider-Man, Green Goblin and Venom minifigures, a PC, PlayStation, basketball game, skateboard with ramp, drinks area, camera, training kit, motorbike, Iron Spider Suit, weapons and a jail.\nYoung superheroes join Spider-Man playing games in his HQ. When 2 super villains force their way in, it's time for battle. Kids must use the amazing equipment and their own skills to save the day.\nAn ideal birthday, holiday or just-because gift for Marvel movie fans aged 8 and up who want to stand out from the crowd with the premier LEGO® set Spider-Man’s HQ.\nSpider-Man’s spectacular headquarters measure over 5 in. (14 cm) high, 16 in. (41 cm) long and 6 in. (17 cm) wide and combine easily with other LEGO® Marvel Spider-Man sets.\nFeaturing fun extras, including a selection of webs to throw, security screens tomonitor and a hand-operated ball slinger for basketball practice.\nAll LEGO® Marvel Spider-Man playsets are cool and collectible and give kids the chance to relive favorite superhero movie moments and create imaginative stories of their own.\nLEGO® components satisfy stringent industry standards to ensure they are consistent, compatible and connect and pull apart correctly every time – it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they fulfill rigorous global safety standards."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/spider-man-s-monster-truck-vs-mysterio-76174","description":"With 4 iconic Marvel characters and an awesome monster truck, LEGO® Marvel Spider-Man: Spider-Man's Monster Truck vs. Mysterio (76174) is a stand-out gift that will delight any young superhero.\n\nA unique mix of superhero action\nKids who are into superheroes and super-vehicles will love this LEGO Marvel mega-set. With classic characters Spider-Man, Spider-Gwen, Doctor Octopus and Mysterio, and featuring a big, tough monster truck with working suspension and a net launcher, plus 2 armed drones – the scene is set for imaginative adventures that never end. The fun continues even when the action stops, as kids put the cool scenes they’ve created on display in their room. For extra creative fun, the free LEGO Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize as they build.\n\nLEGO® Marvel Spider-Man: Spider-Man's Monster Truck vs. Mysterio (76174) brings together 4 favorite characters from the Spider-Man movies and an almighty monster truck for spectacular superhero action and adventures.\nIncludes Spider-Man, Doctor Octopus, Mysterio and Spider-Gwen minifigures, a monster truck with super-suspension and roof-top net launcher, plus 2 buildable drones, each with 2 shooters.\nKids can build, play and create scenes with their supercool superhero action set to display in their room.\nThis perfect birthday, holiday or just-because gift is bursting with imaginative play possibilities for any young superhero aged 8 and up.\nSpider-Man’s monster truck measures over 4 in. (12 cm) high, 5 in. (15 cm) long and 3 in. (9 cm) wide and is built to endure endless dangerous and daring adventures.\nFeaturing fun extras, including Spider-Gwen’s skateboard and web elements, Mysterio’s opalescent, domed helmet, plus money for Doctor Octopus to steal.\nFor extra building fun, the free LEGO® Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize their playset as they build.\nAll LEGO® Marvel Spider-Man playsets are cool, collectible and give kids the chance to relive favorite superhero movie moments and create imaginative stories of their own.\nLEGO® components meet rigorous industry standards to ensure they are consistent, compatible and connect and pull apart correctly every time –it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global safety standards."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/iron-man-vs-thanos-76170","description":"LEGO® Marvel Avengers Iron Man vs. Thanos (76170) puts superhero action into kids’ hands. This versatile, buildable action toy is designed to encourage shared play and developmental growth.Empower young superheroes!Made with budding builders in mind, 4+ sets are packed with cool details to ensure youngsters have a great play experience. Inside the box, each bag of bricks contains a complete model and character to get the play started fast. The set also includes a Starter Brick to get youngstersbuilding with a partly constructed jet. All 4+ sets come with easy-to-follow building steps and, for extra fun, the downloadable LEGO Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize the set as they build.Fun for all the familyA LEGO 4+ playset is a special treat for any child – and for the rest of the family too. As adults pass on their construction skills, they share precious developmental milestones with their little builder.\nLEGO® Marvel Avengers Iron Man vs. Thanos (76170) is an iconic superhero construction toy designed to develop the imagination, dexterity and building confidence of youngsters aged 4 and up.\nIncludes Iron Man and Thanos minifigures, a streamlined jet, gun tower and 2 energy stands, one for Iron Man and one for Thanos.\nParents and kids will enjoy lots of fun together, recreating movie scenes and dreaming up endless superhero adventures of their own as they help Iron Man take on super villain Thanos.\nThis LEGO® 4+ set is specially designed with a Starter Brick and simple building steps so youngsters aged 4 and up can learn to build and develop creative confidence as they go.\nIron Man’s jet plane measures over 2 in. (6 cm) high, 4 in. (11 cm) long and 4 in. (12 cm) wide – an ideal size for small hands to pick up, play with and take wherever they go.\nThis iconic superhero pairing is the perfect kids’ birthday gift, holiday entertainment or special treat for any day of the year.\nThe included build-and-play guide grows youngsters’ building confidence, and the free digital building tool, Instructions PLUS, lets kids zoom and rotate as they build.\nLEGO® 4+ sets introduce children to a universe of movie favorites, TV characters and everyday heroes that they will love to share with parents and other playtime partners.\nLEGO® components meet strict industry standards to ensure all 4+ sets are easy for little fingers to pick up, place and pull apart – it’s been that waysince 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they satisfy strict child safety standards."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/spider-man-and-ghost-rider-vs-carnage-76173","description":"Let kids control a unique superhero clash involving 3 iconic Marvel characters, with LEGO® Marvel Spider-Man: Spider-Man and Ghost Rider vs. Carnage (76173).\n\nAmazing, blazing Marvel megastars!\nYoung superheroes are in for non-stop, red-hot action and adventure when teenage web-slinger Spider-Man and super villain Carnage come together with walking-inferno Ghost Rider and his flame-covered, 3-stud shooter supercharger-equipped car. This fun-packed playset will provide kids with endless excitement and entertainment as they build, play out and display scenes with the thrilling trio. For extra creative fun, the downloadable LEGO Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize their playset as they build.\n\nLEGO® Marvel Spider-Man: Spider-Man and Ghost Rider vs. Carnage (76173) is a premium playset packed with imaginative play possibilities featuring 3 iconic characters from the Marvel Universe.\nIncludes Spider-Man, Carnage and Ghost Rider minifigures. Ghost Rider’s robust, stylish car has a removable roof, removable flames and a 3-stud-shooter supercharger peeking out of its hood.\nThe trio of classic Marvel characters, plus the amazing Ghost Rider car, provide kids with endless possibilities to build, play and display as they role-play endless, imaginative superhero adventures.\nFor ages 7 and up. This stand-out set is a perfect gift idea for a young superhero’s birthday, holiday or special treat.\nGhost Rider’s car measures over 1 in. (5 cm) high, 7 in. (19 cm) long and 2 in. (7 cm) wide and looks great on display in kids’ rooms.\nUsing the extra elements provided, kids can detach the flames from Ghost Rider’s car and transform it into a sleek, black muscle car.\nFor extra building fun, the free LEGO® Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize their playset as they build.\nAll LEGO® Marvel Spider-Man playsets are premium quality and designed to deliver maximum opportunities for imaginative, developmental play.\nLEGO® components satisfy strict industry standards to ensure they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they fulfil stringent global safety standards."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/captain-america-mech-armour-76168","description":"Put super-sized superhero action into kids’ hands with LEGO® Marvel Avengers Captain America Mech Armor (76168). Featuring a Captain America minifigure and mech, it’s packed with cool features to encourage imaginative play.\n\nA hands-on treat for young superheroes\nThe Captain America minifigure battles enemies with help from his indestructible shield. When extra size and strength are needed, kids can put him into the cockpit of the mighty mech. With movable arms and legs and a giant shield gripped tight in the mech’s powerful hands, budding Marvel Avengers can battle bad guys, relive favorite movie scenes and take on other mechs in the LEGO Marvel collection.\n\nLEGO® Marvel Avengers Classic Captain America Mech Armor (76168) is a super-size, superhero treat. Scale up the action with this mighty, movable mech and minifigure.\nIncludes a Captain America minifigure and a buildable mech with a large shield that fits in its gripping hand, plus a smaller shield for the minifigure that also attaches to the mech’s leg.\nKids open the mech cockpit, place the Captain America minifigure inside, then save the world with the movable mech’s super-sized shield as they battle villains and relive favorite movie scenes.\nA great birthday, holiday or just-because gift for any young superhero aged 7 and up.\nThis robust building toy stands over 4 in. (12 cm) tall. Perfect for hands-on, imaginative play and ideal for display in any kid’s room when the day’s action is over.\nThere are more LEGO® Marvel mechs to collect and combine to provide kids with endless fun recreating movie action and dreaming up stories of their own.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart consistently every time – its been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet rigorous global safety standards."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/miles-morales-mech-armour-76171","description":"Any young superhero will love the LEGO® Spider-Man Miles Morales Mech Armor (76171). Featuring alternative Spider-Man Miles Morales and his buildable mech with extra-long electro-web, the hands-on imaginative play will never end.\n\nWeb-zapping Spider-Man mech adventures\nThis versatile superhero gift partners kids with Miles Morales – the Spider-Man with the electric-shock webs – for endless adventures battling super villains and saving the world. Whenever more size and power is required, kids place the Miles Morales minifigure into the cockpit of his mighty mech. The movable mech’s super-sized electro-web is the perfect way for kids to zap villains as they relive favorite movie scenes and battle other mechs in their collection. For extra fun, the downloadable LEGO Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize their playset as they build.\n\nA hands-on treat for young superheroes, LEGO® Marvel Spider-Man Miles Morales Mech Armor (76171) scales up the superhero adventures with movable limbs and extra-long electro-web to zap the bad guys.\nIncludes a Miles Morales minifigure and buildable mech, a large web that fits in the hands of both the mech and the minifigure, plus smaller webs that attach to the mech’s legs and elsewhere. When kids place the minifigure into the cockpit of the super-sized, movable mech, they can relive favorite movie scenes, create their own adventures and battle other mechs in their collection. An exciting and endlessly entertaining birthday, holiday or just-because gift for budding superheroes aged 7 and up. This durable building toy stands over 4 in. (12 cm) tall, making it perfect for hands-on role play. And, when the action stops, it looks super-cool on display in any kid’s room. For more building fun, the free LEGO® Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize their playset as they build. All LEGO® Marvel Spider-Man playsets inspire imaginative superhero adventures as kids recreate movie action, dream up stories of their own and put their hand-built scenes on display. LEGO® components meet stringent industry standards that ensure they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958. LEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they satisfy rigorous global safety standards."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/spider-man-and-sandman-showdown-76172","description":"LEGO® Marvel Spider-Man: Spider-Man and Sandman Showdown (76172) is a super-fun, super-quality playset for budding superheroes. Designed especially for ages 4 and up, it encourages shared play and delivers developmental benefits.\n\nThe best start for growing minds\nSurprise a young superhero with this LEGO 4+ set and introduce them to non-stop imaginative fun. A special Starter Brick chassis helps youngsters get started and discover the joy of constructing something “by myself”. The included simple guide to building and playing helps them (and their grown-up helpers) develop creative construction skills. For more building fun, the downloadable LEGO Building Instructions app includes digital Instructions PLUS, which allows kids to zoom, rotate and visualize their playset as they build.\n\nFun for all the family\nA LEGO 4+ playset is a treat for toddlers and parents alike. While adults pass on their construction skills, they share precious developmental milestones with their budding builder.\n\nLEGO® Marvel Spider-Man: Spider-Man and Sandman Showdown (76172) is a superhero treat designed to develop the imagination, dexterity and building confidence of youngsters aged 4 and up.\nIncludes Spider-Man and Sandman minifigures, a sturdy spider-buggy, a sand catapult for kids to shoot and fun accessories from the superhero movies.\nKids (and their friends) help Spider-Man stop super villain Sandman stirring up a sand tornado, then go on to recreate movie scenes and dream up endless superhero adventures of their own.\nThis LEGO® 4+ set is specially designed with a Starter Brick and simple building steps so youngsters aged 4 and up can learn to build and develop creative confidence as they go.\nThis family-playtime, superhero building toy measures over 1 in. (4 cm) high, 3 in. (9 cm) wide and 2 in. (6 cm) deep, with pieces perfectly sized for small hands to pick up and place.\nA simple building guide is provided and pieces are grouped into separate bags with a playable element and character in each one, so youngsters can enjoy their construction toy one step at a time.\nFor even more building fun, the free LEGO® Building Instructions app includes digital Instructions PLUS, which lets kids zoom, rotate and visualize their playset as they build.\nLEGO® 4+ sets introduce children to a universe of movie favorites, TV characters and everyday heroes that they will love to share with parents and other playtime partners.\nLEGO® components meet strict industry standards to ensure all 4+ sets are easy for little fingers to pick up, place and pull apart – and it’s been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure they satisfy rigorous child safety standards."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/thor-mech-armour-76169","description":"Scale up the superhero action with LEGO® Marvel Avengers Classic Thor Mech Armor (76169). This super-sized, buildable, action toy features a Thor mech with movable limbs and a giant, detachable hammer.\n\nA mega gift for Marvel fans\nKids use the Thor minifigure to take on enemies, with help from his mystical hammer, then supersize the mighty warrior by putting him in the cockpit of the giant mech. The mech has movable arms and legs and a giant hammer gripped tight in its powerful hands, so Marvel Avengers fans can use it to recreate favorite movie scenes and have epic battles with other mechs in their collection.\n\nSupersize the superhero action with the mighty, LEGO® Marvel Avengers Classic Thor Mech Armor (76169) to give any budding superhero a hands-on treat.\nIncludes a Thor minifigure, a buildable mech with a large hammer that fits in its gripping hand, plus a smaller hammer for the minifigure that also attaches to the mech’s leg.\nKids can put the Thor minifigure into the mech’s opening cockpit, then use the movable mech and its super-sized hammer to role-play epic battles with a whole universe of bad guys.\nA great birthday, holiday or any-day treat for young superheroes aged 7 and up who love hands-on buildable action toys.\nStanding over 4 in. (12 cm) tall, this durable, buildable mech inspires endless imaginative role play and, when the day’s battles are over, looks cool on display in a kid’s room.\nWith other LEGO® Marvel mechs to collect and combine, there are endless play possibilities for kids to explore, letting them recreate movie action and role-play stories of their own.\nLEGO® components meet strict industry standards, so they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they satisfy stringent global safety standards."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/marvel-studios-iron-man-31199","description":"If you’re a Super Hero fan, we have a thrilling set for you. Build 1 of 3 portraits of the iconic Iron Man suits of armor with this LEGO® Art Marvel Studios Iron Man (31199) set, while you relish a creative escape from everyday life.\n\nIngenious project\nBuild 1 of 3 detailed portraits of Iron Man’s armor, the MARK III, the HULKBUSTER MARK I or the MARK LXXXV. If you want more, buy and combine 3 sets into an ultimate Iron Man piece. As part of this new LEGO building experience, listen to the included Soundtrack for stories and cool details about the set as you build. Finish the project with a Marvel Studios signature plate, then display it on a wall or shelf.\n\nArtistic mindfulness\nYou don’t need to be an artist or have loads of LEGO models to enjoy the satisfaction of completing this wall art kit. This LEGO Art set is part of a collection of building kits focused on music, art, design and architecture, which make great gifts for anyone (including yourself) seeking a new project.\n\nBuild this LEGO® Art Marvel Studios Iron Man (31199) set, featuring a model with 3 build options. Display your favorite version of Iron Man’s armor on your wall or shelf after you spend quality time making it.\nSet your creative side free with this 3,156-piece LEGO® set that includes 9 canvas wall decor plates, a Marvel Studios signature plate, brick-built LEGO frame, new hanging element and piece separator for easy rebuilding.\nRelieve stress while you create a unique LEGO® portrait of the MARK III, the HULKBUSTER MARK I or the MARK LXXXV armored Iron Man suits. With the immersive Soundtrack, you can learn unexpected details as you build.\nRevel in your love of Super Heroes while building this unique LEGO® kit. To really push your creativity, buy and combine 3 of the sets to create an ultimate Iron Man wall piece to display in your home or office.\nThis 3in1 LEGO® Art set measures over 15.5” (40cm) square. Display it on a wall or shelf, where its details help it stand out. It makes a great gift for you or another creative builder who’s into Super Heroes or Iron Man.\nNo batteries needed. This art set for adults offers an immersive build with LEGO® pieces and a unique Soundtrack. Escape your daily routine and create an incredible display piece.\nThe coffee-table-quality instructions guide you through the project, starting with a deep dive into Iron Man before you begin building. Enjoy the Soundtrack made for this LEGO® set while you assemble the piece.\nPerfect to display on a wall or shelf, LEGO® Art models of iconic artworks, musicians, Super Heroes and Sith Lords offer you a rewarding building experience while you explore your passion for creative arts and crafts.\nLEGO® building pieces meet exacting quality standards, which ensures they are consistent, compatible and work every time – it’s been that way since 1958.\nLEGO® pieces are tested to ensure that every LEGO Art building set meets strict safety standards, making this Marvel Studios Iron Man wall decor piece as robust as it is beautiful."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/spiderjet-vs-venom-mech-76150","description":"There’s endless action when kids play with LEGO® Marvel Spider-Man Spider-Jet vs. Venom Mech (76150). When the supersized 4-armed mech’s monstrous claws reach for Spider-Man, Spider-Man Noir launches a jet-plane attack on the super villain. Superhero minifigure action – Spider-Man vs Venom! This action-packed Venom mech set with LEGO® Marvel Spider-Man minifigures will give superhero fans endless imaginative role-play fun. Kids open the mech's cockpit to place the Venom minifigure pilot inside. Movable arms and legs enable all-round mech mobility. The Spider-Jet is armed with disc shooters and flick missiles. With so much activity, this hot building toy is ideal for both individual and group play. Cool Spider-Man action playsets LEGO Marvel Spider-Man building toys give kids an infinite universe of imaginative role-play adventures. With collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, young superheroes can recreate favorite Marvel movie scenes and invent imaginative stories of their own.\nThis enormous Venom mech gives kids a giant-sized bad guy to defeat. When they put the minifigure inside the mech, the mega mechanical monster can go anywhere and grab at anything – including Spider-Man and jet planes!\nAn oversized, 4-armed version of Venom gives the villain extraordinary powers. The new-for-January-2020 Spider-man Noir action minifigure takes him on with a jet plane armed with a disc shooter and flick missiles.\nThe mech's cockpit opens for the Venom minifigure to enter. Kids position its arms and legs for action, then battle Spider-Man! Combine with other cool LEGO® Spider-Man sets for extra play options.\nBoys and girls aged 7 and up will play out endless superhero adventures with this LEGO® Marvel Spider-Man building toy. A hot action gift for kids who love Spider-Man playsets and LEGO® minifigures.\nAt over 4” (12cm) tall, this buildable mech toy inspires imaginative play on a big scale. Kids can integrate the playset with other LEGO® superhero building toys for even more imaginative make-believe possibilities.\nThis great gift for kids doesn’t need batteries. Kids can enjoy hands-on fun whenever they want. Battery-free LEGO® mech toys encourage creative thinking, imaginative role-play and problem-solving skills.\nLooking for a Spider-Man playset for someone new to LEGO® building toys? Not a problem! This Superhero Venom mech toy comes with an easy-to-follow guide to get kids building and playing without delay.\nLEGO® Marvel Spider-Man playsets deliver imaginative group and solo superhero adventures for kids wanting to recreate movie scenes, dream up adventures of their own or simply use their Marvel building toy for display.\nLEGO® toys meet the highest industry standards, so they are consistent, compatible and connect and pull apart easily (no superpowers needed!) – and it's been that way since 1958.\nAs well as meeting the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends,scratches and stretches LEGO® bricks and pieces so you can be sure the toy is safe for your child."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/avengers-helicarrier-76153","description":"The LEGO® Marvel Avengers Helicarrier (76153) building toy takes kids aboard the awesome Avengers Helicarrier as they join Iron Man, Captain Marvel, Thor, Black Widow, War Machine and Nick Fury to battle M.O.D.O.K. – the big-brained super villain.\n\nAvengers action with superhero minifigures\nFans of Marvel Avengers movies can relive favorite scenes and dream up stories of their own when they board the amazing Helicarrier. It has lots of cool accessories, so kids can equip their team of superheroes ready for action. Then it’s time to prime the sphere cannons, spin the Helicarrier’s rotors, put 3 minifigures into the cockpit and launch into some high-speed spins and moves using the specially designed Helicarrier base.\n\nBrick construction toys for Marvel Avengers fans\nLEGO Marvel Avengers brick building toys open up an infinite universe of role-play fun. With collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, kids can enjoy imaginative superhero adventures that never end.\n\nThe LEGO® Marvel Avengers Helicarrier (76153) construction toy puts young superheroes in among the action with popular minifigures, vehicles and accessories they’ll recognize from the Marvel movies.\nThe Helicarrier has rotors, sphere cannons and a cockpit for 3 minifigures. The buildable toy comes with Iron Man, Captain Marvel, Thor, Black Widow, War Machine, Nick Fury, M.O.D.O.K. and A.I.M. Agent minifigures.\nMarvel Avengers fans can recreate thrilling scenes and dream up imaginative stories of their own when they join their favorite superheroes and board the awesome Helicarrier to battle with super villain M.O.D.O.K.\nLooking for the best tech building toy for kids? Whether they’re into Marvel Avengers action, superhero minifigures or just amazing brick-built toys, this Helicarrier playset is an awesome gift for kids aged 9 and up.\nMeasuring over 14” (37cm) long, the Marvel Avengers Helicarrier gives kids superhero action on a big scale. It also looks amazing on displayin any youngster’s bedroom.\nThis cool buildable toy doesn’t need batteries, so kids can enjoy hands-on imaginative fun and role-play action whenever and wherever they want to!\nGet kids building and playing right away with simple, clear instructions that ensure they get the most from all the fun details and cool features.\nLEGO® Marvel Avengers playsets put superhero movie action into kids' hands! With collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, the imaginative role-play adventures will never end.\nLEGO® building toys meet the highest industry standards, which means they are consistent, compatible and connect and pull apart perfectly every time, and it’s been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure your child's construction toy meets the highest safety and quality standards in the world."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/venomosaurus-ambush-76151","description":"LEGO® Marvel Spider-Man Venomosaurus Ambush (76151) puts Marvel movie action into kids’ hands. This versatile playset inspires endless role play as young superheroes enact imaginative battles between Spider-Man and Venom.\n\nMarvel Spider-Man role-play adventures\nMarvel fans can recreate favorite movie scenes and devise their own imaginative adventures with Spider-Man, Iron Spider, Spider-Ham and Venom minifigures in a battle for the crucial Venom egg. The creative play steps up a gear when kids place the Venom minifigure into the mighty Venomosaurus building toy, with its vicious jaws and black web-weapons, and put Spider-Man into his mega-buggy, with its awesome weapons and super-suspension.\n\nPopular superhero construction toys\nLEGO Marvel Spider-Man playsets are filled with collectible vehicles, mechs, buildings, minifigures, weapons and gadgets. These hot building toys transport kids to a universe of superhero adventures where they build key skills as they explore and play.\n\nThe awesome LEGO® Marvel Spider-Man Venomosaurus Ambush (76151) playset puts superhero movie action, collectible minifigure construction toys and endless imaginative role-play fun into young Marvel movie fans’ hands.\nKids relive favorite Marvel movie scenes and create adventures of their own with Spider-Man, Iron Spider, Spider-Ham and Venom minifigures, as they battle for the Venom egg – inside of which is the Venomized skeleton.\nThe creative play intensifies when kids place the Venom minifigure into the Venomosaurus, with its vicious jaws and black web-weapons, and put Spider-Man into his vehicle with its awesome weapons and super-suspension.\nIt’s not just Marvel movie fans who’ll be thrilled to receive this Spider-Man building toy as a birthday present. It makes a great gift for any child aged 8 and up who loves imaginative play with hot action construction toys.\nWith the Venomosaurus building toy measuring over 7” (18cm) high, this popular playset inspires endless epic adventures and makes an awesome display in any kid’s room.\nThis cool mechanical building toy doesn’t need batteries, so kids can enjoy creative fun, imaginative role play and hands-on action whenever and wherever they want it.\nSimple, clear instructions ensure kids get building and playing right away and experience maximum enjoyment with the cool vehicles and fun features.\nLEGO® Marvel Spider-Man playsets put Marvel movie action into kids hands! With collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, these hot building toys help kids build key skills as they play.\nLEGO® building sets meet the highest industry standards, which means they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure your child’s building set meets the highest safety and quality standards in the world."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/avengers-wrath-of-loki-76152","description":"LEGO® Marvel Avengers Wrath of Loki (76152) inspires youngsters to role-play endless imaginative superhero adventures. And, while they play, they’ll acquire developmental skills that’ll last a lifetime.\n\nBuild, play and learn\nWith LEGO Iron Man, Thor, Hulk, Captain Marvel and Loki minifigures, plus a cool building and awesome vehicles, the scene is set for superhero action and adventure! This LEGO 4+ set is a fun way for preschoolers and youngsters to learn to build. With special Starter Bricks, even first-time builders can experience the joy of construction “by myself”. A simple building guide helps kids understand the building process and grows their confidence, so they feel ready to take on more challenging LEGO projects.\n\nSuperhero minifigures and cool construction toys\nIf you're looking for the best superhero birthday gift, LEGO Marvel Avengers building toys give kids collectible minifigures, amazing features and endless imaginative superhero fun.\n\nLEGO® Marvel Avengers Wrath of Loki (76152) inspires imaginative role-play and creative thinking as kids explore endless play possibilities with superhero minifigures and cool vehicles in an exciting setting.\nWith Iron Man, Thor, Hulk, Captain Marvel and Loki minifigures, plus the Avengers Tower, Quinjet and Loki's glider, kids can recreate Marvel movie scenes and dream up superhero action stories of their own.\nLEGO® 4+ sets get youngsters building right away with a special Starter Brick. As they build, their confidence grows, and they discover a never-ending universe of amazing characters and creative play possibilities.\nPacked with fun features and awesome accessories for imaginative play and superhero action, this cool toy construction set is an ideal Christmas or birthday gift for preschoolers and youngsters aged 4 and up.\nWith the playset's Avengers Tower measuring over 6” (16cm) high, this collectible building toy inspires superhero fun on an epic scale – and when the action stops, it looks great on display in any kid’s bedroom.\nThis hands-on, buildable toy doesn’t require batteries. Kids can build and play right away, whenever and wherever they want to.\nThe included simple guide helps youngsters build, play and develop confidence as they learn the purpose of the building steps.\nLEGO® Marvel Avengers playsets put Marvel movie action into kids hands! With collectible minifigures, buildable toy vehicles, weapons and gadgets, the sets are designed to inspire young minds with imaginative superhero play.\nLEGO® sets meet the highest industry standards, which means every LEGO construction toy is consistent, compatible and connects and pull apart perfectly every time – and it’s been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure every child's LEGO playset meets the highest safety and quality standards in the world."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/iron-man-hall-of-armor-76125","description":"Conduct experiments with Tony Stark and capture the Outriders with the LEGO® Marvel Avengers 76125 Iron Man Hall of Armor, featuring a modular lab that can be combined and stacked in many different ways for endless play possibilities. The hall includes a rotating podium with 2 posable robotic arms for Tony Stark to get suited up as Iron Man, a desk, kitchen, weapon storage, tool storage and Iron Man suit storage modules, a radar dish and more. This versatile Iron Man construction toy includes a posable Igor Suit mech with minifigure cockpit, a posable mobile robot and 6 minifigures—including Iron Man MK 1, Iron Man MK 5, Iron Man MK 41 and Iron Man MK 50, plus Tony Stark face and hair elements to attach to your chosen Iron Man minifigure.\n\nIncludes 6 Marvel Universe minifigures: Iron Man MK 1, Iron Man MK 5, Iron Man MK 41, Iron Man MK 50 and 2 Outriders.\nThis buildable superhero toy features an Iron Man lab with detachable modules that can be combined and stacked in many different ways to create alternative play experiences.\nIron Man lab includes: a rotating podium with 2 posable robotic arms; desk with translucent-blue screen, minifigure chair and cup elements; kitchen module with a buildable smoothie maker and cup element; weapon storage module with a stud shooter, power-up jetpack and energy beam element for the minifigures; tool storage module with a wrench; modules to store Iron Man suits; radar dish; safety barrier elements; fire extinguisher and 2 flame elements.\nConnect modules into a circle to create a screen room or a prison for the bad guys.\nThis superhero playset also includes an Igor Suit mech, featuring an opening minifigure cockpit and posable arms and legs, and a posable robot on wheels for imaginative play.\nAccessory elements include Tony Stark face and hair elements to attach to the Iron Man suit minifigures.\nIron Man MK 1, Iron Man MK 5 and Iron Man MK 41 minifigures are new for March 2019.\nRecreate exciting action from the Marvel Avengers movies with this cool LEGO® building set for kids.\nIron Man lab measures over 5” (13cm) high, 13” (35cm) wide and 6” (17cm) deep with modules in standard formation.\nIgor Suit measures over 3” (9cm) high, 1” (5cm) long and 3” (9cm) wide."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/iron-man-helmet-76165","description":"Challenge your construction skills and evoke classic comic-book artistry with this LEGO® Marvel Avengers Iron Man Helmet.\n\nAuthentic details to build and display\nCapture the iconic contours and impressive details of Iron Man’s iconic helmet with LEGO bricks, special red and gold elements and glowing graphics stickers for the eyes. Standing on a sturdy base with a nameplate, this displayable building set is sure to attract attention and admiring comments wherever you place it. For an even more impressive display, place your Iron Man helmet alongside other authentic LEGO models.\n\nLEGO brick model-making kits\nEscape the busy world for a moment and rediscover the joy of creative construction with adult LEGO building sets. Satisfying to build and stunning to display, adult LEGO kits make great birthday gifts, Christmas presents and personal treats for anyone interested in model making or comic-book culture.\n\nTest your creative construction superpowers with the LEGO® Marvel Avengers Iron Man Helmet. If you’re an adult Marvel fan or model-building enthusiast, this buildable display model is for you!\nThe iconic design of Iron Man’s Helmet is cleverly reproduced with LEGO® bricks and graphics stickers to evoke memories of classic Marvel Avengers movie scenes. The buildable model stands on a sturdy base with nameplate.\nCapture the iconic contours and impressive detail of Iron Man’s helmet with LEGO® bricks, red and gold elements and stickers for eyes. Looks great displayed alongside other LEGO Marvel models.\nWhether you’re a Marvel fan, a LEGO® lover or both, this 480-piece construction kit will provide you with a challenging build and absorbing escapism. It makes a great birthday gift, Christmas present or personal treat.\nThe Iron Man Helmet measures over 7.5” (19cm) high, 4” (10cm) wide and 4.5” (12cm) deep. It doesn’t need much space for display, but its striking, authentic details are sure to catch the eye of every Marvel fan.\nNo batteries required. This collectible LEGO® Marvel Avengers Iron Man Helmet offers a hands-on, stress-relieving building experience as 480 LEGO bricks slowly transform into a stunning display model.\nIncludes high-quality, easy-to-follow instructions – so you can open the box and embark on your fascinating project without delay.\nPart of a series of LEGO® Marvel models designed to deliver a satisfying build-and-display experience that will appeal to any fan of model making or comic-book culture.\nNo need to use super-powers to connect and pull apart LEGO® bricks and pieces. They have reached the highest industry standards since 1958, which ensures they fit together and separate perfectly every time.\nLEGO® bricks and pieces are rigorously tested to ensure this amazing display model meets the highest safety standards on planet earth (and the Marvel Universe!)."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/avengers-truck-take-down-76143","description":"Captain America and Hawkeye’s LEGO® Avengers truck is ambushed by 2 bad guys on a motor-trike with a drone. Time to reveal the truck’s secret 6-shot crossbow! Kids will love this cool superhero action set with 4 LEGO minifigures and the Avengers truck. Superhero minifigure action – great gift for kids Put Marvel action into the hands of young superheroes with this supercool set. Stud bullets fly as 2 bad guys swerve their trike in front of the Avengers' truck then launch an attack with a drone. Kids will love opening the truck to reveal the secret weapon… a huge 6-shot crossbow! With 4 minifigures (3 of them new-for-January-2020), Avengers truck, motor-trike, armed drone and lots of stud-shooting weaponry, this buildable LEGO Marvel Avengers toy will inspire endless imaginative fun. Popular LEGO toys for solo or group play Give kids the hot toys they love! With awesome vehicles, mechs, buildings, minifigures, weapons and gadgets, LEGO Marvel Avengers sets are great for fans ofthe movies.\nBring the excitement of the Marvel Avengers movies to your little superhero! This Captain America and Hawkeye set has cool vehicles, minifigures and all the action kids love. Great for play and display.\nWith 3 new-for-January-2020 minifigures – Captain America, Hawkeye and 2 AIM Agents – a motor-trike, drone and Avengers truck (with its hidden weapon!), kids can create epic superhero battle scenes.\nWhether creating favorite movie scenes or inventing adventures of their own, Marvel Avengers fans can use this playset in an endless variety of ways. With so many cool features and cool characters, anything can happen.\nGreat gift for budding superheroes aged 7 and up or kids wanting to expand their LEGO® Marvel Avengers playset collection. Quick to assemble, it inspires imaginative fun that never ends.\nMeasuring over 6” (17cm) long and 4” (11cm) high with its stud shooter deployed, the Avengers Truck provides kids with large-scale superhero fun. Great for taking on AIM Agents or mixing up with other LEGO® Marvel sets.\nNo batteries required. Kids can enjoy hands-on play powered by their own imaginations. This means stimulating play is available anytime, anywhere. And because it’s battery-free, the fun never ends!\nKids can either jump straight in and assemble the easy-to-build set, or use the simple instructions to get started. When there's a break in the action, the vehicles and minifigures look great on display in kids' rooms.\nInspire endless imaginative role-play for young superheroes with LEGO® playsets and minifigures. Whether reliving movie scenes or making up adventures of their own, LEGO Marvel Avengers sets make great gifts for kids.\nLEGO® toys meet the highest industry standards as well as our own quality criteria. This ensures LEGO bricks are consistent, compatible and always connect and pull apart perfectly – and it's been that way since 1958.\nAt The LEGO Group, we drop, squash, twist, heat, bend, scratch and stretch LEGO® bricks and pieces to ensure they meet the highest global safety and quality standards – so you can be certain your child is safe."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/iron-man-hulkbuster-versus-a-i-m-agent-76164","description":"Young superheroes role-play big battle scenes with the awesome LEGO® Marvel Avengers Iron Man Hulkbuster versus A.I.M. Agent (76164) playset.\n\nKids use the posable Hulkbuster to fight evil attackers\nThere’s authentic Marvel action when kids place an Iron Man minifigure inside the mega Hulkbuster armor to battle 2 enemy agents. The bad guys have weapons and 1 of them has a jet pack. The Hulkbuster armor has movable limbs and, for extra firepower, kids can put the Rescue minifigure in the built-in shooter turret.\n\nCool LEGO Avengers toys and superhero minifigures\nWith collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, LEGO Marvel Avengers building toys let kids recreate the best scenes from their favorite Marvel movies and open up a thrilling universe of imaginative superhero role-play.\n\nThere’s imaginative play on a big scale when young superheroes role-play battle adventures with the LEGO® Marvel Avengers Iron Man Hulkbuster versus A.I.M. Agent (76164) playset, with its movable limbs and cool features.\nIncludes 4 minifigures – Iron Man, Rescue and 2 A.I.M. Agent soldiers – and a large-sized, posable Hulkbuster. With cool weapons and a jet pack, the scene is set for an epic battle!\nKids place Iron Man inside the Hulkbuster armor and put Rescue into the built-in shooter turret to take on the armed bad guys and save the city.\nMarvel movie fans and any young superhero aged 8 and up will enjoy endless imaginative adventures with this awesome Hulkbuster set – one of the most popular Iron Man armors.\nThe outstretched Hulkbuster measures over 6” (16cm) tall and 7” (20cm) wide. With posable limbs, this mighty fighting machine can go anywhere and take on any villains that dare to get in its way.\nThis Hulkbuster playset doesn’t need batteries. Battery-free toys stimulate creative thinking, imaginative role-play and problem-solving skills as kids explore hands-on play straight from the box.\nEasy-to-follow instructions ensure kids can open the box and begin building, playing and getting creative immediately.\nLEGO® Marvel Avengers playsets include collectible minifigures, toy vehicles, weapons and gadgets that put Marvel movie action right into the hands of young superhero fans.\nEvery LEGO® construction toy meets the highest industry standards, which means it’s consistent, compatible and connects and pulls apart perfectly every time – and it’s been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted, analyzed… to ensure they always meet the highest safety and quality standards in the world."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/black-widow-s-helicopter-chase-76162","description":"With LEGO® Marvel Avengers Black Widow’s Helicopter Chase (76162), young superheroes can join forces with Black Widow and Yelena Belova to take on Marvel super villain Taskmaster in his awesome armed helicopter. Superhero action and adventure! Taskmaster's helicopter has 4 stud shooters and a rifle on each side. The 2 spinning rotor blades give it the power and precision needed to launch an attack. An opening cockpit allows the Taskmaster minifigure to be placed inside, and the cargo area opens to release Taskmaster’s buggy. Yelena Belova has 2 shooters and Black Widow carries 2 sticks as she arrives on her motorcycle. When Taskmaster gets out of his helicopter, he holds a sword and shield. Inspire young imaginations with LEGO Marvel Avengers LEGO Marvel Avengers playsets open up a thrilling universe of role-play adventures. With collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, kids can recreate favorite movie scenes and devise imaginative stories of their own.\nThere’s superhero action and adventure in the air and on the ground with Taskmaster’s awesome armed helicopter. With Black Widow and Yelena Belova on the super villain’s tail, anything can happen!\nTaskmaster’s twin-rotor helicopter has 4 stud shooters and 2 rifles. The cockpit opens to fit the minifigure inside and a cargo area to hold Taskmaster's buggy. Black Widow is on her motorcycle.\nTaskmaster is launching an attack in his helicopter. Black Widow races to the scene on her motorbike followed by Yelena Belova. With rotor blades spinning and weapons at the ready, the action is unstoppable!\nBoys and girls aged 7 and up will enjoy endless superhero adventures with this LEGO® Marvel Avengers building playset. It’s a great Christmas or birthday gift for superhero kids.\nThe helicopter, with rotor blades in position, measures over 15” (39cm) long, providing hands-on play on a generous scale. Combine with other LEGO® sets for even more imaginative fun.\nThis playset doesn't require batteries, so kids can have fun whenever and wherever they want. Hands-on construction toys encourage the development of creative thinking, imaginative role play and problem-solving skills.\nThinking of buying this LEGO® Marvel Avengers building toy for someone new to LEGO construction kits? No problem. It comes with easy-to-follow instructions so they can open the box and start building and playing straightaway.\nLEGO® Marvel Avengers playsets bring superhero adventures to life. Kids can relive favorite movie scenes, make up stories on their own or as a group, or simply display the supercool superhero models in their room.\nLEGO® construction sets meet the highest industry standards plus our own rigorous quality criteria to ensure that the bricks are consistent, compatible and connect and pull apart easily – no superpowers required!\nWe drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces to ensure they meet the highest global safety andquality standards – and you can be certain your child is safe."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/iron-man-armoury-76167","description":"With 2 enemy intruders to battle and a super-cool hot rod to drive, LEGO® Marvel Avengers Iron Man Armory (76167) provides superhero fans with a versatile playset packed with imaginative role-play possibilities.\n\nIron Man adventures with cool weapons and a hot rod\nInspire kids to build, imagine and act out open-ended stories with Iron Man, the popular superhero from the Marvel Avengers movies. With 2 bad guys, a souped-up car, 2 awesome Iron Man suits, minifigure, mini Iron Man prototype trophy figure and a cool buildable setting, this dynamic and multifaceted playset provides all a young superhero needs for action-packed role-play adventures.\n\nHands-on superhero action with LEGO brick construction toys\nIf you’re looking for the best superhero birthday gift for a boy or girl aged 7 or up, LEGO Marvel Avengers building toys give kids collectible minifigures, amazing features and endless imaginative superhero fun.\n\nLEGO® Marvel Avengers Iron Man Armory (76167) is packed with imaginative role-play possibilities for kids aged 7 and up. The multifaceted playset puts Iron Man adventures right into the hands of young superheroes.\nIncludes a Tony Stark minifigure, 2 Iron Man suits, 2 enemy A.I.M. Agents and a hot rod for him to repair and drive. Just like the movies, there’s also a mini Iron Man prototype model and a burger for him to snack on.\nWhen bad guys break into Iron Man’s building, kids must use his hot rod’s shooting functions, the Iron Man suit’s power blasts and all their superhero skills to save him, his armor and the precious Iron Man prototype.\nPacked with fun features and awesome accessories for imaginative play and superhero action, this Marvel fans’ construction set is an ideal Christmas toy or birthday gift for kids aged 7 and up.\nWith the armory measuring over 3” (8cm) high and the hot rod 3.5” (10cm) long, this playset inspires epic superhero adventures and makes an awesome display in kids’ rooms.\nNo batteries needed. Kids imaginations are unleashed without delay as they build and play with this hands-on toy, whenever and wherever they wish.\nClear instructions help kids get creative right away. With cool characters, fun features and a familiar movie location, this simple guide ensures maximum build-and-play fun every time.\nLEGO® Marvel Avengers playsets bring Marvel movie action to life, inspiring imaginative superhero role play with collectible minifigures, toy vehicles, weapons and gadgets.\nLEGO® construction sets meet the highest industry standards, which means every LEGO toy is consistent, compatible and connects and pulls apart perfectly every time – and it’s been that way since 1958.\nAt the LEGO Group, we drop, heat, crush, twist and analyze our bricks and pieces to ensure every child’s LEGO® playset meets the highest toy safety and quality standards in the world."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/super-heroes-lab-10921","description":"Stimulate creativity and inspire imagination with this versatile superhero construction toy for toddlers. Popular Marvel Avengers characters and cool equipment and vehicles come together to create a developmental playset that’s full of fun! Kids’ superhero learning toy! Toddlers can have fun with Iron Man, Spider-Man and Captain America toys in Iron Man's laboratory. Using a crane, spinning turntable, wrench and control panel, little superheroes can fix Captain America's motorcycle, lift and move heavy loads and pull the Spider-Man figure along for a fun ride behind the motorcycle! And, while preschoolers are busy having fun with this colorful Marvel superhero toy, they’re also developing their cognitive thinking, spatial reasoning, creativity and fine motor skills. Great gifts for toddlers! LEGO DUPLO® toys combine iconic themes, recognizable settings, popular characters and toddler-friendly bricks in a range of playsets that inspire young minds through playful learning and creative fun.\nEncourage toddlers’ imagination, creativity and developmental benefits with popular superheroes from the blockbuster Marvel Avengers movies. Anything can happen when superheroes work together in Iron Man’s lab.\nKids can assemble Iron Man’s laboratory workshop – with its moving crane, spinning turntable, wrench and control panel – and team up with Spider-Man, Captain America and Iron Man to carry out repairs and have some fun!\nThere's Captain America's motorcycle to fix, heavy loads to lift and shift – kids can even pull Spider-Man along for a ride behind the motorcycle (watch out for his web!). For even more fun, combine with other playsets.\nA fun-packed starter set for budding builders and little superheroes. With safe, toddler-friendly pieces, this colorful playset makes a great Christmas, birthday or any-other-day gift for kids aged 2 and over.\nWith a maximum height of over 5” (13cm), this versatile playset is big enough for serious play and compact enough for the superhero action wherever kids go.\nNo batteries required. This toddlers’ developmental toy is powered by their imagination. Battery-free toys boost critical thinking skills and give kids the satisfaction of making fun things happen ‘by myself’!\nSimple instructions for parents and toddlers ensure the imaginative fun begins as soon as the Iron Man toy comes out of the box. No time-consuming setting up – just instant delighted smiles and captivated minds.\nLEGO® DUPLO® playsets make great gifts for toddlers because they encourage open-ended creative play that introduces real-life scenarios, familiar characters, cute animals and free-thinking fun.\nLEGO® DUPLO® construction toys for toddlers meet the highest industry standards, ensuring they are easy for little hands to pick up, place and pull apart – and it's been that way since 1969!\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® DUPLO® bricks and pieces to make sure every little builder's DUPLO playset meets the highest global safety and quality standards."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/venom-crawler-76163","description":"With LEGO® Marvel Avengers Venom Crawler (76163) young superheroes can team up with Spider-Man to take on both Carnage and archenemy Venom, who is at the controls of his monstrous Venom Crawler! Cool action vehicles and minifigures Behold, the Venom Crawler! With 8 movable legs and a rear stud shooter, this reinforced battle machine makes an awesome adversary. Even worse – the alien Symbiote at the controls has contaminated Iron Man to become Iron Venom! Spider-Man rides to the rescue in his Spider Buggy, armed with 2 stud shooters. But to make things even more challenging for our favorite webslinger, the evil Carnage jumps into the action with his battle maze weapon. Playsets for superheroes! LEGO Marvel Avengers building toys take kids to a universe of imaginative role-play excitement. With awesome vehicles, mechs, buildings, minifigures, weapons and gadgets, young superheroes can recreate favorite Marvel movie scenes and dream up adventures of their own.\nThe action and adventure are in kids’ hands when Spider-Man takes on both Carnage and archenemy Venom. The evil alien Symbiote is at the controls of the Venom Crawler – and has contaminated Iron Man to become Iron Venom!\nThe Venom Crawler has 8 movable legs and a rear stud shooter. Spider-Man's buggy has 2 stud shooters. Set includes 3 minifigures: Spider-Man, Carnage and the Iron Man/Venom hybrid, Iron Venom.\nSpider-Man is in a battle with both Carnage and archenemy Venom, who is operating the monstrous Venom Crawler! Kids will need all their superhero powers to defeat this adversary!\nYoung superheroes aged 8 and up will enjoy endless imaginative fun with this LEGO® Marvel Avengers playset. It’s a great Christmas, birthday or any-other-day gift for fans of the Marvel Avengers movies.\nThe Venom Crawler measures over 9” (24cm) long, giving kids hands-on play on a big scale. Combine this playset with other LEGO® sets for even more imaginative fun.\nNo batteries required,so kids can enjoy the playset whenever and wherever they want without losing power. These hot construction toys encourage creative thinking, imaginative role-play and problem-solving skills.\nIncludes easy-to-follow instructions that ensure the creative construction and imaginative play start as soon as kids open the box.\nBring superhero adventures to life with the exciting range of LEGO® Marvel Avengers playsets. Kids can recreate favorite movie scenes, make up stories of their own or simply put their awesome models on display.\nLEGO® construction toys meet the highest industry standards plus our own quality criteria, so they are consistent, compatible and connect and pull apart easily – no superpowers needed! It’s been that way since 1958.\nAs well as satisfying the highest global safety and quality standards, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces so you can be certain they are safe for your child."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/iron-man-mech-76140","description":"Young superheroes can relive Marvel Avengers movie action with this posable LEGO® Marvel Avengers Iron Man Mech (76140)! Once the Iron Man minifigure enters the armored mech – no villain is safe! Awesome Iron Man building toy for kids Fans of Marvel Avengers will love this action-packed Iron Man mech figure. The mech's cockpit opens up for the Iron Man minifigure to fit inside. An overhead stud shooter fends off any threat, and movable arms and legs enable all-round mobility. For extra building fun, download the free LEGO® Life interactive building app. Marvel action with LEGO superhero figures LEGO Marvel Avengers building toy playsets open up a thrilling universe of role-play adventures. With collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, kids can recreate favorite movie scenes and devise imaginative stories of their own.\nPower up kids’ LEGO® Iron Man adventures with the mighty Iron Man mech! When they put the minifigure inside the mech armor, they can go anywhere, grab anything and remove anyone who gets in their way!\nKids will love the new-for-January-2020 Iron Man mech design – a larger version of Iron Man with a breastplate displaying his all-important energy core. The cockpit opens so the Iron Man minifigure can enter the mech.\nImaginations soar when young superheroes open the mech's cockpit, insertthe Iron Man minifigure, position the mech’s arms and legs for action, and fire the stud shooter at approaching enemies.\nBoys and girls aged 6 and up will enjoy endless imaginative Iron Man adventures with this LEGO Marvel Avengers building toy. One of the hottest mech figures for kids who love Iron Man toys.\nThe outstretched Iron Man mech measures over 4” (12cm) tall x 3” (9cm) wide x 3” (9cm) deep – big enough to go anywhere, grab anything and remove any villains or alien invaders that get in his way.\nThis mech figure doesn’t need batteries, so kids get hands-on fun whenever and wherever they want it. Playing with battery-free mech toys encourages creative thinking, imaginative role-play and problem-solving skills.\nInstructions PLUS means even young children can build LEGO® toys independently. This fun interactive guide has zoom and rotate features and is available with the free LEGO Life app for smartphones and tablets.\nLEGO® Marvel Avengers playsets deliver high-powered, imaginative superhero adventures for kids wanting to relive movie scenes, create stories of their own or simply put their supercool superhero models on display.\nLEGO® building toys meet the highest industry standards, so they are consistent, compatible and connect and pull apart easily (no superpowers needed!) – and it's been that way since 1958.\nAs well as meeting the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends, scratches and stretches LEGO® bricks and pieces so you can be sure they're safe for your child."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/spider-man-mech-76146","description":"Young superheroes can recreate Marvel action with this posable LEGO® Marvel Spider-Man: Spider-Man Mech (76146). When kids place the Spider-Man minifigure inside the supersized spider-mech no bad guy is safe! Supersized Spider-Man adventures This action-packed Spider-Man mech set and LEGO minifigure will give Marvel superhero fans endless imaginative fun. The giant robot's opening cockpit allows the Spider-Man minifigure pilot to enter the mech. Movable arms and legs enable all-round mobility, and a huge villain-catching web extends from the right hand. A spider breastplate decorates the mech’s chest. For extra building fun, download the free LEGO Life interactive building app with cool zoom and rotate features. Popular LEGO building toys with Marvel magic! LEGO Marvel Spider-Man building toys open up a universe of role-play adventures. With collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, kids can recreate favorite Marvel movie scenes and devise imaginative stories of their own.\nThis amazing Spider-Man mech gives kids bigger and better superhero adventures. When they put the minifigure inside the mech, the spider-robot can go anywhere, grab anything and ensnare whoever gets in their way.\nThe mech is an oversized version of Spider-Man, with 4 spider legs extending from his back and a large villain-catching web coming from his hand. An opening cockpit allows the Spider-Man minifigure to enter the mech.\nKids can place the Spider-Man minifigure into the mech, position its arms and legs for action, then take on all the bad guys! The set integrates with other popular superhero figures and Spider-Man building toys.\nBoys and girls aged 6 and up will enjoy endless superhero adventures with this LEGO® Marvel Spider-Man building toy. A hot, action-packed gift for kids who love Spider-Man fun.\nAt over 5” (15cm) tall, this collectible Spider-Man mech inspires imaginative play on a big scale. It's great to combine with other LEGO® Marvel mechs and, when the action stops, to display in any kid’s room.\nThis action-packed playset doesn’t need batteries. Kids can enjoy hands-on fun whenever they want. Battery-free LEGO® mech toys encourage creative thinking, imaginative role-play and problem-solving skills.\nIncludes Instructions PLUS, so even young children can build their LEGO® toy independently. This fun, free interactive guide, with zoom and rotate functions, comes with the LEGO Life app for smartphones and tablets.\nLEGO® Marvel Spider-Man playsets deliver action-packed, imaginative superhero adventures for kids wanting to recreate movie scenes, dream up adventures of their own or simply use their collectible model for display.\nLEGO® toys meet the highest industry standards, so they are consistent, compatible and connect and pull apart easily (no superpowers needed!) – and it's been that way since 1958.\nAs well as meeting the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends, scratches and stretches LEGO® bricks and pieces so you can be sure your toy is safe for your child."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/thanos-mech-76141","description":"Superhero fans can enjoy action-packed fun and adventure with this posable LEGO® Marvel Avengers Thanos Mech (76141). When kids place the Thanos minifigure into the buildable mech, the super villain becomes crazier and deadlier than ever! Cool action with a Thanos LEGO® minifigure Superhero fans will love this action-packed Thanos mech figure. Kids open the mega machine's cockpit and put the Thanos minifigure pilot inside. Movable arms and legs enable all-round mobility, and the dreaded Infinity Gauntlet, complete with 6 Infinity Stones, means this mechanized Marvel Avengers super villain is equipped to destroy half the life in the universe! For extra building fun, download the free LEGO Life interactive app. Marvel Avengers fun with buildable kids' LEGO toys LEGO Marvel Avengers building toys take kids to a thrilling universe of imaginative role-play. With awesome vehicles, mechs, buildings, minifigures, weapons and gadgets, young superheroes can recreate favorite movie scenes and make up adventures of their own.\nPut Marvel Avengers action in the hands of young superheroes with Thanos and his super-sized mech! Kids place the Thanos minifigure inside his giant, posable machine – and the super villain becomes even deadlier!\nThe Thanos mech is a larger version of Thanos and displays his distinctive breastplate. It comes with the powerful Infinity Gauntlet, complete with 6 Infinity Stones, and a new-for-January-2020 Thanos minifigure pilot.\nKids place the Thanos minifigure inside the mech's opening cockpit. With posable arms and legs, the mighty mech prepares to annihilate the universe – or strike a pose for display in any young superhero’s bedroom!\nGive this popular buildable LEGO® toy to Marvel Avengers fans and they’ll role-play endless superhero adventures with the cool mech and Thanos minifigure. It's a great gift for kids aged 6 and up.\nAt over 4” (11cm) tall x 5” (13cm) wide and 2” (6cm) deep, the Thanos mech offers big-scale Marvel Avengers fun – whether sharing adventures with other superheroes or destroying the universe singlehandedly!\nYou don’t need batteries for this Marvel Avengers Thanos playset. Kids can enjoy hands-on fun anywhere, anytime – and develop creative thinking, imaginative role-play and problem-solving skills as they play.\nEven young children can assemble the Thanos buildable toy, thanks to Instructions PLUS. This fun interactive guide has zoom and rotate features and is available with the free LEGO® Life app for smartphones and tablets.\nEvery LEGO® Marvel Avengers playset delivers high-octane superhero fun for kids who want to recreate favorite movie scenes, make up adventures of their own or simply put their supercool models on display.\nBecause LEGO® toys meet the highest industry standards as well as our own quality criteria, they are consistent, compatible and connect and pull apart perfectly every time – and it's been that way since 1958.\nAt The LEGO Group, we drop, squash, twist, heat, bend, scratch and stretch LEGO®bricks and pieces to ensure they meet the highest global safety and quality standards, giving you certainty that your child is safe."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/falcon-black-widow-team-up-40418","description":"Fans of superhero battles will have endless fun role-playing this colossal clash, as 2 popular Marvel Avengers – the winged Falcon and super-soldier Black Widow – take on 2 enemy A.I.M. Agents. LEGO® Marvel Avengers Falcon & Black Widow Team Up (40418) ramps up the action even further with an extra-large, hand-operated 6-shooter, plus lots of ammunition.\nThis LEGO® Marvel Avengers set includes 4 minifigures – Black Widow, Falcon and 2 A.I.M. Agents – and a large 6-shooter, plus ammunition.\nFalcon’s wings can be moved by hand into ‘flying’ position.\nThe hand-controlled 6-shooter fires out large LEGO® projectiles."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/spider-man-and-the-museum-break-in-40343","description":"Help Spider-Man protect the museum artefacts in LEGO® Marvel Spider-Man and the Museum Break-In, with 3 minifigures, an extra Spider-Man head element, web shield and buildable drone."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/avengers-tower-battle-76166","description":"The LEGO® Marvel Avengers: Avengers Tower Battle (76166) provides kids with superhero battle action inside and outside the 5-floor Marvel Avengers Tower.\n\nFeatures, functions, action and adventure!\nSuperheroes Iron Man and Black Widow take on the evil Red Skull and his A.I.M. Agents in an epic battle spread over the spectacular, 5-floor Marvel Avengers Tower. The structure opens for easy access to 7 awesome rooms where kids can enjoy endless imaginative adventures: blow out the energy core, blast open the jail, collapse the balcony, launch a rocket attack… the iconic New York skyscraper is packed with role-play possibilities with classic Marvel characters.\n\nBring Marvel action to life with LEGO brick building toys\nIf you’re looking for a cool superhero birthday or Christmas gift for a boy or girl aged 8 or up, LEGO Marvel Avengers building toys give kids collectible minifigures, amazing features and endless imaginative superhero fun.\n\nWith 5 floors and 7 feature-packed rooms, the LEGO® Marvel Avengers: Avengers Tower Battle (76166) is bursting with role-play possibilities with classic Marvel characters.\nRooms include Black Widow’s Sky Cycle garage, the Arc Reactor room, the Armory room, a tech lab, a jail and 2 balconies. The Iron Man minifigure comes with 2 additional armors: Blazer and Tazer.\nThe structure opens to reveal 5 floors of easily accessible, authentically detailed play space. Kids’ imaginations will be inspired by fun features, such as a blast-open jail, collapsible balcony and a rocket launcher.\nThis Marvel fans’ construction set makes an ideal Christmas toy or birthday gift for kids aged 8 and up who love superhero action and adventure.\nAt 17” (44cm) high, the LEGO® Marvel Avengers Tower gives kids lots of cool features to explore and lots or familiar Marvel locations where they can enact epic imaginative stories.\nNo batteries required. This stimulating toy unleashes hands-on, imaginative fun as soon as kids open the box.\nWith clear instructions provided, kids can build and play without delay. The simple guide ensures they get the very best out of this awesome playset every time they play.\nLEGO® Marvel Avengers playsets bring Marvel movie action to life, inspiring imaginative superhero role play with collectible minifigures, toy vehicles, weapons and gadgets.\nLEGO® construction sets meet the highest industry standards, which means every LEGO toy is consistent, compatible and connects and pulls apart perfectly every time – and it’s been that way since 1958.\nAt the LEGO Group, we drop, heat, crush, twist and analyze our bricks and pieces to ensure every child’s LEGO® playset meets the highest toy safety and quality standards in the world."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/carnage-76199","description":"LEGO® Marvel Spider-Man Carnage (76199) takes your construction skills into the Marvel Universe as you recreate the nightmarish features of the alien super villain.\n\nAuthentic details to build and display\nFrom the low, red brow to the protruding jaw packed with bayonet-like teeth, this LEGO brick replica of Carnage provides Marvel movie fans and model-making enthusiasts with a building experience that is challenging yet highly rewarding. With a stylish name plaque attached to the sturdy base, this remarkable model will look even more impressive displayed alongside other LEGO comic-book creations.\n\nLEGO brick model-making kits\nEscape the busy world and rediscover the joy of creative construction with adult LEGO building sets. Satisfying to build and stunning to display, adult LEGO kits make great birthday gifts, Christmas presents and personal treats for anyone interested in model making or comic-book culture.\n\nConstruct your own LEGO® brick replica of the merciless super villain Carnage, with LEGO Marvel Spider-Man Carnage (76199).\nThis 546-brick project captures all the monstrous alien’s authentic details – from its low, red brow to its bayonet-like teeth – and stands on a sturdy base with a stylish name plaque attached.\nThe satisfaction of a job well done will last long after the hands-on construction of this collectible piece of Marvel memorabilia is completed.\nThis build-and-display iconic super villain is the perfect project for adult Marvel movie fans and model-making enthusiasts.\nThe finished model measures over 7 in. (19 cm) high, 3 in. (9 cm) wide and 5 in. (15 cm) deep and provides a fascinating conversation starter, whether displayed in your home or workplace.\nThis premium display model provides a stress-relieving diversion for model makers as Carnage gradually emerges from the LEGO® bricks.\nHigh-quality, printed instructions are included to ensure you can embark on this fascinating construction project without delay.\nThe range of LEGO® sets created with adults in mind are designed to deliver a satisfying build-and-display experience that will captivate any model-making enthusiast.\nLEGO® building kits meet rigorous industry quality standards to ensure they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global safety standards."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/thanos-keyring-854078","description":"This LEGO® Thanos Key Chain (854078) is the perfect gift for Marvel movie fans. A genuine LEGO Thanos minifigure wearing his famous golden helmet is securely attached to a strong metal chain with a durable metal ring. Young action heroes can attach the iconic super villain to their keys, backpacks, lunchboxes and more – and make every day awesome!\nFeatures a LEGO® Thanos minifigure attached to a durable metal ring and chain. The minifigure is fixed firmly to the metal chain and cannot be removed.\nMetal ring attaches easily and securely to keys, backpacks, lunchboxes and more.\nMeasures over 5 in. (15 cm) high, 1 in. (4 cm) wide and under 1 in. (1 cm) deep. Suitable for kids aged 6 and up."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/captain-marvel-keyring-854064","description":"Kids who enjoy the Marvel movies will loves this LEGO® Marvel Captain Marvel Key Chain (854064). With a real LEGO Captain Marvel minifigure held by a durable metal ring and robust metal chain, kids can attach the awesome superhero to keys, backpacks, lunchboxes and more. A great gift for any fan of Marvel movie action.\nFeatures a LEGO® Captain Marvel minifigure attached to a durable metal ring and chain. The minifigure is fixed firmly to the metal chain and cannot be removed.\nMetal ring attaches easily and securely to keys, backpacks, lunchboxes and more.\nMeasures over 5” (15cm) high, 1” (4cm) wide and under 1” (1cm) deep. Suitable for kids aged 6 and up."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/lego-marvel-super-heroes-invincible-iron-man-key-chain-853706","description":"Suit up and show off your super hero skills with this LEGO® Marvel Super Heroes Invincible Iron Man Key Chain. Attach the minifigure on a durable metal ring and chain to your keys or backpack, and add an extra layer of indestructible armor!\n\nFeatures a LEGO® Marvel Super Heroes Invincible Iron Man minifigure attached to a durable metal ring and chain.\nAttach it to your keys or backpack.\nMinifigure is not detachable from metal chain."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/spider-man-keyring-853950","description":"Team up with a legend when you attach the LEGO® Marvel 853950 Spider-Man Key Chain to your keys or backpack. Featuring an updated design for January 2019, this Spider-Man minifigure linked to a sturdy metal ring and chain makes a fun gift for all fans of the web-slinging superhero.\n\nFeatures a LEGO® Marvel Spider-Man minifigure linked to a durable metal ring and chain.\nAttach it to your keys or backpack.\nMinifigure is not detachable from metal chain."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/venom-key-chain-854006","description":"Give fans of the Marvel movies some superhero fun with this LEGO® Marvel Venom Key Chain (854006). With a genuine LEGO minifigure held by a durable metal ring and robust metal chain, this awesome super villain attaches securely to keys, backpacks, lunchboxes and more. Perfect for any Marvel Venom fan to collect and display.\nFeatures a LEGO® Venom minifigure attached to a durable metal ring and chain. The minifigure is fixed firmly to the metal chain and cannot be removed.\nMetal ring attaches easily and securely to keys, backpacks, lunchboxes and more.\nMeasures over 5” (15cm) high, 1” (4cm) wide and under 1” (1cm) deep. Suitable for kids aged 6 and up."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/taskmaster-s-ambush-77905","description":"The limited-edition LEGO® Marvel Avengers Taskmaster’s Ambush (77905) lets fans recreate superhero action from the Marvel Studios’ Black Widow movie with favorite characters and a classic vehicle.\n\nBlack Widow movie scene\nSuperhero fans can capture the Marvel movie action in a play-and-display model depicting Black Widow and Red Guardian as they take on the super villain Taskmaster in his 6-wheel monster truck. The 3 collectible minifigures carry a range of weapons, including batons, shields, sword and a bow and arrow. There’s also a safe box and other accessories to inspire endless imaginative adventures based on the Black Widow movie. The completed model will add a great conversation piece to any room.\n\nBring Marvel action to life\nLEGO Marvel Avengers buildable playsets open a universe of role-play adventures. With collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, fans can recreate favorite movie scenes and devise imaginative stories of their own.\n\nCapture Marvel Studios’ Black Widow movie action forever with the LEGO® Marvel Avengers Taskmaster’s Ambush (77905) play-and-display superhero construction toy.\nIncludes Black Widow, Taskmaster and exclusive Red Guardian minifigures, a buildable 6-wheel monster truck plus cool weapons and accessories.\nThe scene depicts an epic battle from Marvel Studios' Black Widow movie. The vehicle detaches for imaginative play, then reattaches to the baseplate to create an eye-catching display.\nFor ages 7 and up. This LEGO® Marvel Avengers building playset makes a great birthday, Christmas, holiday or ‘just because’ gift for kids.\nThe iconic characters are captured in a striking display piece that will appeal to Black Widow fans of all ages and attract interest from all who see it.\nMeasuring over 4 in. (12 cm) high and 2 in. (6 cm) long, the vehicle is ideal for hands-on action and combines with other LEGO® Marvel sets for even more creative play.\nLEGO® Marvel buildable toys provide young superheroes with endless imaginative play-and-display possibilities.\nLEGO® bricks and pieces satisfy stringent industry standards to ensure they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958.\nLEGO® sets are dropped, heated, crushed, twisted and analyzed to make sure they fulfil rigorous global safety standards."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/avengers-compound-battle-76131","description":"Stage a thrilling 76131 Avengers Compound Battle and defeat Thanos and the Outrider with this LEGO® Marvel Avengers toy building set! The Avengers headquarters features a 2-level office building with a meeting room—including a table with a secret gun compartment, an opening ‘laser-beam' safe, helipad, garage, rooftop spring-loaded shooter and dual stud shooters, plus a rotating, tilting radar. This popular toy construction set also includes a buildable toy helicopter with adjustable, spinning rotors and 6-stud rapid shooter, and an offroader with a rotating turret with dual stud shooter. Play out thrilling scenes from the Marvel Avengers movies with 4 minifigures, an Ant-Man microfigure and posable Hulk and Thanos big figures.\n\nThis buildable superhero playset includes 4 Marvel Universe minifigures: Iron Man, Captain Marvel, Nebula and a 4-armed Outrider, plus posable Hulk and Thanos big figures and an Ant-Man microfigure.\nThis construction toy features the Avengers compound with a 2-level office building, helipad, garage, plus a helicopter and offroader for creative play.\nThe office building features: 2 Avengers ‘A' logo elements on the exterior wall; rotating, tilting spring-loaded shooter on the rooftop; lower level with an entrance, buildable rotating computer and a ‘laser-beam’ safe; and an upper level with a meeting room, table with secret compartment, rotating door leading to the helipad and accessory elements including 3 chairs, 2 guns, 3 cups and a jug.\nThe compound also features: a helipad with 2 dual stud shooters and bridge to the office building; garage for the offroader with a ramp, opening barrier and a rotating, tilting radar dish; and tool racks with crowbar, wrench, welder and circular saw elements.\nHelicopter features an opening minifigure cockpit, 2 spinning, tilting rotors and a 6-stud rapid shooter.\nOffroader features a minifigure cockpit and rotating turret with dual stud shooter and standing room for a minifigure.\nWeapons include Nebula's sword and Thanos's buildable, double-sided battle axe.\nAccessory elements include Captain Marvel 10 Power Bursts for imaginative play.\nThe Iron Man minifigure and Thanos and Hulk big figures are all new for March 2019, and the Nebula minifigure and Ant-Man microfigure each feature new-for-March-2019 Avengers team suit decoration.\nRecreate exciting scenes from the Marvel Avengers movies with this action-packed superhero toy building set for kids.\nAvengers compound measures over 6” (17cm) high, 11” (29cm) wide and 7” (20cm) deep.\nHelicopter measures over 3” (9cm) high, 5” (14cm) long and 1” (5cm) wide.\nOffroader measures over 2” (7cm) high, 4” (11cm) long and 2” (6cm) wide."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/avengers-ultimate-quinjet-76126","description":"Team up with the Avengers and fly into conflict against the Chitauri in the LEGO® Marvel Avengers 76126 Avengers Ultimate Quinjet. This awesome jet features an opening minifigure cockpit, stud shooters, adjustable wings, spinning rotors, opening passenger compartment and an opening rear compartment with a fold-out 6-stud rapid shooter and stud-shooting trike. This popular toy building set for kids has 6 minifigures—including Black Widow, Hawkeye, Rocket and Thor, all with new-for-March-2019 Avengers team suit decoration—and cool weapons to recreate thrilling scenes from the Marvel Avengers movies.\n\nThis buildable superhero playset includes 6 new-for-March-2019 Marvel Universe minifigures: Black Widow, Hawkeye, Rocket, Thor and 2 Chitauri.\nThe Marvel Ultimate Quinjet model features an opening minifigure cockpit, 2 stud shooters, opening passenger compartment with 2 minifigure seats and weapon racks, opening rear compartment with fold-out 6-stud rapid shooter and trike, adjustable wings and spinning rotors.\nTrike features a minifigure seat and 2 stud shooters.\nWeapons include Black Widow’s 2 energy sticks, Hawkeye’s bow & arrow, Rocket’s gun and Chitauri’s 2 blasters for imaginative play.\nBlack Widow, Hawkeye, Rocket and Thor LEGO® minifigures feature new-for-March-2019 Avengers team suit decoration.\nRecreate exciting action from the Marvel Avengers movies with this superhero toy building set.\nUltimate Quinjet measures over 4” (12cm) high, 15” (40cm) long and 11” (28cm) wide."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/stark-jet-and-the-drone-attack-76130","description":"Team up with Happy Hogan, Nick Fury, Mysterio and Spider-Man for an aerial battle in LEGO® Marvel Spider-Man 76130 Stark Jet and the Drone Attack. This action-packed Spider-Man playset features a buildable Stark Jet airplane model toy with 2 stud shooters, adjustable wings, energy bomb storage compartment, dual minifigure cockpit with a rear passenger seat for Spider-Man and an opening hatch function. Press the button on the top of the jet to drop energy bombs or let Spider-Man swoop down on his spider web string. This creative building toy also includes 2 stud-shooting drones and 4 minifigures to role-play superhero scenes from Marvel’s Spider-Man: Far From Home movie.\n\nThis building set for kids includes 4 Marvel Universe minifigures: Happy Hogan, Nick Fury, Spider-Man and Mysterio.\nStark Jet features a dual minifigure cockpit with pilot seats for Happy Hogan and Nick Fury, control panel stickers, 2 guns, plus a passenger seat for Spider-Man, opening hatch function with attachment point for Spider-Man’s spider web string element, rear storage compartment for 3 buildable energy bombs, adjustable wings and 2 stud shooters.\nPress the button on the top of the jet to open the hatch and drop bombs or let Spider-Man swoop down from the jet on his spider web string.\nEach buildable toy drone features 2 stud shooters.\nWeapons include Happy Hogan’s gun, Nick Fury’s shooter and Mysterio’s power energy elements for creative play.\nThis Marvel building toy also includes the Spider-Man minifigure’s spider web string element.\nNick Fury and Mysterio minifigures are new for May 2019.\nRecreate thrilling superhero scenes from Marvel’s Spider-Man: Far From Home movie.\nAdd 76128 Molten Man Battle and 76129 Hydro-Man Attack superhero playsets for even more Spider-Man action and imaginative play.\nStark Jet construction toy measures over 6” (10cm) high, 9” (38cm) long and 3” (25cm) wide.\nEach drone measures over 1” (4cm) long, 1” (4cm) wide and under 1” (2cm) high."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/avengers-hulk-helicopter-rescue-76144","description":"Your little superhero will feel like they are in the Marvel Avengers: Endgame movie with this exciting 76144 Hulk Helicopter Rescue LEGO® set. There are so many ways to play with the Avengers’ helicopter, featuring 2 triple stud shooters and a cool function to drop the Hulk onto enemies, plus the Chitauri’s Marvel Leviathan creature and stud-shooting flyer for aerial battles.\n\nRole-play action! A great gift for kids, it includes 4 minifigures for role-play action, including Rescue (aka Pepper Potts) with 2 Power Blasts and Black Widow with 2 batons to fight the Chitauri. The Hulk big figure and his Infinity Gauntlet glove with collectible Infinity Stones add even more creative storytelling options.\n\nMarvel Avengers thrills! LEGO Marvel Avengers playsets open up a thrilling universe of role-play adventures. With collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, superhero fans can recreate movie scenes, dream up their own stories or simply display the supercool models.\n\nKids can role-play as Rescue, Black Widow and Hulk with a missile-shooting helicopter building toy and reimagine Marvel Avengers: Endgame battle scenes against 2 enemy Chitauri and a posable Leviathan!\nIncludes 4 minifigures, a cool Hulk action figure, a helicopter with triple stud shooters and function to drop Hulk into battle, plus the Chitauris’ Leviathan and stud-shooting flyer to stage epic aerial encounters.\nRescue aka Pepper Potts has Power Blasts for action play and Hulk comes with the Infinity Gauntlet glove with 4 collectible Infinity Stones – the other Infinity Stones are in the Avengers Compound Battle (76131) set.\nWith cool action figures and models that are fun to build and great for solo or group play, this popular 482-piece building toy makes a brilliant gift for kids aged 8+.\nThe helicopter building toy measures over 4” (11cm) high, 9” (25cm) long and 7” (19cm) wide, and all the models and characters combine brilliantly with other LEGO® Marvel sets for even more superhero role-play action.\nNo batteries required – this Marvel Avengers playset is made with LEGO® bricks and powered purely by kids’ free-thinking creativity, so their superhero stories never run out of energy!\nIt comes with easy-to-follow instructions so they can open the box and start building the models straight away.\nLEGO® construction sets meet the highest industry standards plus our own rigorous quality criteria to ensure that the bricks are consistent, compatible and connect and pull apart easily – no superpowers required!"},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/spider-mech-vs-venom-76115","description":"Join Spider-Man and Ghost Spider on a mission to release Aunt May from Venom’s clutches in a thrilling LEGO® Marvel Spider-Man 76115 Spider Mech vs. Venom battle. Match the posable Spider Mech, featuring an opening minifigure cockpit, tech spider/web shooter and gripping claw, against the huge posable Venom Mech, with minifigure-grabbing claws. This superhero toy building kit includes 4 LEGO minifigures, Ghost Spider's hover board with 2 stud shooters, plus 9 assorted web elements to customize your builds, minifigures and weapons.\n\nIncludes 4 minifigures: Spider-Man, Ghost Spider, Venom and Aunt May.\nSpider Mech features an opening minifigure cockpit, posable joints, shooter to fire tech spider or web elements, and a gripping claw with attachment points for alternative web elements.\nVenom Mech features a minifigure cockpit, posable joints, a long tongue, and gripping claws to grab minifigures.\nAlso includes Ghost Spider's hover board with 2 stud shooters and a translucent flame exhaust element, plus 9 assorted new-for-December-2018 web elements to customize your builds, minifigures and weapons.\nAccessory elements include Aunt May’s ice cream.\nThe Spider-Man, Venom and Aunt May minifigures are new for December 2018.\nBuildable Spider Mech toy measures over 5” (14 cm) high, 4” (11cm) long and 1” (4cm) wide\nVenom Mech measures over 8” (22cm) high, 7” (18cm) long and 3” (8cm) wide"},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/spider-man-s-spider-crawler-76114","description":"Team up with Spider-Man and Spider-Man 2099 to pursue diamond thieves Sandman and Vulture in the LEGO® Marvel Spider-Man 76114 Spider-Man’s Spider Crawler. The Crawler features a lifelike spider-crawling function, 2 stud shooters and a shooter that fires tech spider or web elements. This superhero playset includes 4 LEGO minifigures with weapons, Sandman's buildable opening sandbase with hidden diamond elements and Vulture's buildable wings. Also includes 9 assorted web elements to customize your builds, minifigures and weapons for imaginative play.\n\nIncludes 4 new-for-December-2018 minifigures: Spider-Man, Spider-Man 2099, Vulture and Sandman.\nSpider-Man’s Spider Crawler features a minifigure cockpit, 8 crawling legs activated by model movement, 2 stud shooters, and a shooter to fire tech spider or web elements.\nAlso includes Sandman's buildable opening sandbase with 3 stolen diamond elements inside, a transparent display dome with a diamond element inside, and Vulture's buildable wings.\nThis LEGO® building set for kids includes 9 assorted new-for-December-2018 web elements to customize your builds, minifigures and weapons.\nWeapons include Vulture’s stud shooter and Sandman’s buildable sand mallet.\nSpider-Man’s Spider Crawler buildable mech toy measures over 3” (8cm) high, 8” (22cm) long and 5” (15cm) wide."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/war-machine-buster-76124","description":"Storm into battle against the Outriders and save Ant-Man with the LEGO® Marvel Avengers 76124 War Machine Buster. This awesome posable mech features an opening minifigure cockpit, 6-stud rapid shooter, 2 detachable stud-shooting cannons, 2 flick missiles, gripping hands and an opening storage compartment for extra ammo. This hot construction toy has 4 minifigures—including War Machine and Ant-Man, both with new-for-March-2019 Avengers team suit decoration—to recreate thrilling scenes from the Marvel Avengers movies.\n\nThis buildable superhero playset includes 4 Marvel Universe minifigures: War Machine, Ant-Man and 2 Outriders.\nWar Machine Buster mech features an opening minifigure cockpit, 6-stud rapid shooter, 2 detachable stud-shooting cannons, 2 flick missiles, posable arms and legs, gripping hands and an opening storage compartment for extra ammo.\nDetach the stud-shooting cannons and place in the War Machine minifigure's hands and on his shoulder.\nThe War Machine and Ant-Man minifigures in this LEGO® building set for kids feature new-for-March-2019 Avengers team suit decoration.\nRecreate thrilling action from the Marvel Avengers movies with this creative construction toy.\nWar Machine Buster mech measures over 6” (17cm) high, 2” (6cm) long and 5” (14cm) wide."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/captain-marvel-and-the-skrull-attack-76127","description":"Team up with Captain Marvel and Nick Fury to save Goose the cat from Talos in LEGO® Marvel 76127 Captain Marvel and The Skrull Attack. This action-packed construction toy features Nick Fury’s Quinjet with an opening dual minifigure cockpit, adjustable wings, 2 flick-missile shooters that each shoot 4 missiles at once, and an opening rear compartment with space for Goose. This popular toy building set for kids includes 3 minifigures with weapons to recreate exciting scenes from the Captain Marvel movie and for endless imaginative play.\n\nThis Captain Marvel toy building set includes 3 new-for-January-2019 minifigures: Captain Marvel, Nick Fury and Talos, plus a Goose the cat LEGO® figure.\nThe LEGO® Marvel collectible Quinjet features an opening dual minifigure cockpit, adjustable wings, 2 flick-missile shooters and an opening rear compartment with space for the cat.\nFire 4 missiles at once with each of this LEGO® Marvel model's flick-missile shooters.\nSuperhero toy weapons includes Captain Marvel's power energy elements and Talos’s stud shooter.\nRecreate thrilling scenes from the Captain Marvel movie with this action-packed superhero playset.\nQuinjet measures over 4” (11cm) high, 11” (30cm) long and 8” (21cm) wide."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/molten-man-battle-76128","description":"Build an awesome fire monster and role-play a thrilling LEGO® Marvel Spider-Man 76128 Molten Man Battle. The buildable Molten Man mechanical buildable toy figure features posable joints, a gripping claw, 6-stud rapid shooter, buildable ‘melting’ objects including half a car, street lamp and a traffic light attached to its body, molten lava elements and attachment points for minifigures. This Marvel toy includes 3 minifigures—Spider-Man, Mysterio and a firefighter—with weapons and accessories to play out exciting superhero scenes from Marvel’s Spider-Man: Far From Home movie.\n\nThis Spider-Man toy building set for kids includes 3 Marvel Universe minifigures: Spider-Man, Mysterio and a firefighter.\nMolten Man buildable figure features a posable head, arms and legs, gripping claw, 6-stud rapid shooter, buildable ‘melting’ objects including half a car, street lamp and traffic light, chain, melting lava stick elements and various attachment points for minifigures.\nThis Spider-Man playset features minifigure weapons including Spider-Man’s web pack, and Mysterio’s power energy elements.\nAccessories include the firefighter’s buildable fire extinguisher for creative play.\nThe Marvel Spider-Man minifigure features new-for-May-2019 black and grey stealth suit decoration and the Mysterio minifigure is also new for May 2019.\nRecreate thrilling scenes from the Spider-Man: Far From Home movie with this creative building toy.\nAdd 76129 Hydro-Man Attack and 76130 Stark Jet and The Drone Attack construction toys for even more Spider-Man action.\nMolten Man buildable action figure toy stands over 7” (18cm) tall."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/the-menace-of-mysterio-76149","description":"LEGO® Marvel Spider-Man The Menace of Mysterio (76149) is a construction toy that introduce kids to LEGO® building, minifigure action and supercool adventures. Spider-Man helicopter and Mysterio mech playset As well as Spider-Man, Ghost Spider and Mysterio LEGO minifigures, this superhero playset includes the awesome spider-copter and Mysterio's mighty mech! The mech has wheels and movable arms to smash into the bank's vault. Kids can use the ‘claws' on Spider-Man's helicopter to grab Mysterio and zap his mech with a blast of web. A simple building guide explains the purpose of each step, and the free, downloadable LEGO Life app provides interactive zoom and rotate. Cool kids’ action playset With vehicles, mechs, buildings, minifigures, weapons and gadgets, LEGO Marvel Spider-Man building toys let little superheroes recreate favorite movie scenes and make up imaginative stories of their own.\nThere’s action, excitement and popular superhero toys in this LEGO® starter set for young builders. A great way to introduce kids to LEGO building and Marvel Spider-Man movie adventures.\nThis cool action-packed toy comes with Spider-Man, Ghost Spider and a new-for-January-2020 Mysterio minifigure. Also includes Spider-Man's helicopter, Mysterio's mech and a bank that breaks open to reveal a toy vault!\nMysterio wheels his mad mech to smash its powerful arms into the bank and grab the loot! Can Spider-Man race to the scene in his helicopter in time to stop him? Can Ghost Spider disable the mech with a blast of web?\nThis LEGO® Marvel Spider-Man building toy will make a popular gift for kids’ birthdays and at Christmas. The building challenges and group-play possibilities are perfectly suited to boys and girls aged 4 and up.\nWith the Spider-Man helicopter measuring over 5” (13cm) long and the mech over 3” (10cm) high, this superhero minifigure playset offers cool Spider-Man action with endless individual and group-play possibilities.\nYou don’t need batteries for this superhero gift – kids just pick up and play! Hands-on LEGO® building toys help kids develop their creative thinking, imaginative role-play and problem-solving skills.\nEven young kids can build this Spider-Man playset independently, thanks to Instructions PLUS. This free interactive guide has fun zoom and rotate features and comes with the LEGO Life app for smartphones and tablets.\nLEGO® MarvelSpider-Man playsets encourage imaginative role-play with action-packed, superhero adventures. Kids can recreate movie scenes, make up stories of their own, or simply group their models into a cool display.\nLEGO® bricks and pieces meet the most stringent industry standards, ensuring they're consistent, compatible and able to connect and pull apart easily – and it's been that way since 1958.\nAs well as satisfying the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends, scratches and stretches LEGO® bricks and pieces so you can be sure they're safe for your child."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/avengers-speeder-bike-attack-76142","description":"With Black Panther’s amazing bike, 3 LEGO® minifigures, awesome weaponry and deadly canisters, kids who like high-speed superhero action will love this cool LEGO® Marvel Avengers Speeder Bike Attack (76142) building toy! Non-stop action – on land and in air! When kids get their hands on this Marvel Avengers set, they'll be transported to a world of high-octane role-play. A well-armed villain swoops in on a jetpack armed with stud shooters, saw blades, grapple-hook shooter and a blaster, to steal 2 deadly canisters. Black Panther races to the scene on his supercool, stud-shooting motorcycle. Thor appears, wielding his mighty hammer. With 3 minifigures, a motorcycle and copious weaponry, this LEGO Marvel Avengers set makes a great gift for your budding superhero. Superhero LEGO sets for Marvel Avengers fans LEGO Marvel Avengers building toys take kids on a superhero thrill ride! With awesome vehicles, mechs, buildings, minifigures, weapons and gadgets, kids can recreate excitingmovie scenes and make up adventures of their own.\nGive fans of Marvel’s Black Panther the superhero thrills they love. With high-speed action on land and in air, the set features 3 cool minifigures and awesome weaponry to inspire endless individual and group play.\nWith 3 new-for-January-2020 minifigures – Black Panther, Thor and an AIM Agent, Black Panther's cool bike, an armory of weapons, plus 2 canisters of deadly material, the scene is set for superhero super-adventures.\nKids speed along with Black Panther on his bike to battle an evil AIM Agent as he jetpacks in to steal the deadly canisters. The Agent is armed with a wide range of weapons, but Thor arrives to even the odds!\nThis popular LEGO® building toy makes a great gift for kids aged 6 and up and Marvel Avengers Black Panther fans of any age. It's easy to assemble and easy to combine with other LEGO Marvel sets.\nAt over 5” (14cm) long, the Black Panther bike offers high-speed Marvel Avengers thrills on a large scale. Armed with 2 stud shooters and made to seata LEGO® minifigure, this supercool superbike is ready for action.\nNo batteries are needed for this Marvel Avengers buildable toy. With hands-on fun available anywhere, anytime, it encourages kids’ creative thinking, imaginative role-play and problem-solving skills.\nSimple instructions get kids playing without delay. And once they start, they won't want to stop. Even when the fast-moving action ends, the figures will look awesome on display in your young superhero's bedroom.\nEvery LEGO®Marvel Avengers playset is designed to inspire endless role-play fun. Whether kids want to recreate movie scenes or make up adventures of their own, LEGO Marvel Avengers sets are great gifts for kids.\nAll LEGO® toys meet the highest industry standards as well as our own quality criteria. You can be certain they are consistent, compatible and always connect and pull apart perfectly – it's been that way since 1958.\nAt The LEGO Group, we drop, squash, twist, heat, bend, scratch and stretch LEGO® bricks and pieces to ensure they meet the highest global safety and quality standards – so you can be certain your child is safe."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/captain-america-outriders-attack-76123","description":"Power into battle against the Outriders with Captain America’s cool bike in LEGO® Marvel Avengers 76123 Captain America: Outriders Attack. The buildable motorcycle toy features a minifigure cockpit, 2 Captain America shield shooters, 2 detachable non-shooting blasters, attachment points for minifigures and a fold-down bike stand. This building set for kids has 4 Marvel characters—including a Captain America minifigure with a new-for-March-2019 helmet element and Avengers team suit decoration—to recreate exciting scenes from the Marvel Avengers movies.\n\nThis Captain America playset includes 4 Marvel Universe minifigures: Captain America and 3 Outriders.\nCaptain America’s bike features a minifigure cockpit, 2 Captain America shield shooters, front wheel with detachable non-shooting blasters, attachment points for minifigures, fold-down bike stand, headlight element and an exhaust flame element.\nDetach the blasters and put them in Captain America's hands ready for battle and imaginative play.\nThis superhero playset includes Captain America’s new-for-March-2019 helmet element and Avengers team suit decoration.\nRecreate thrilling action from the Marvel Avengers movies with this awesome LEGO® construction toy.\nCaptain America’s vehicle measures over 2” (7cm) high, 8” (21cm) long and 2” (7cm) wide."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/spider-man-bike-rescue-76113","description":"Speed through New York City streets and help Spider-Man and Miles Morales thwart evil Carnage’s mission to blow up the power generator in LEGO® Marvel Spider-Man 76113 Spider-Man Bike Rescue. This action-packed construction toy features a Spider-Man bike with a tech spider shooter and web gun (non-shooting), and a buildable power generator with an explode function. It also includes 3 LEGO minifigures, plus 9 assorted web elements to customize your builds, minifigures and weapons for creative play.\n\nIncludes 3 new-for-December-2018 minifigures: Spider-Man, Miles Morales and Carnage.\nSpider-Man bike features a minifigure cockpit, adjustable handlebars, big wheels, tech spider shooter and a web gun (non-shooting) with attachment point for web elements.\nBuildable power generator features an explode function, power cell elements and attachment points for web elements.\nActivate the explode function to send the power cells flying.\nThis LEGO® Marvel Spider-Man toy building set includes 9 assorted new-for-December-2018 web elements to customize your builds, minifigures and weapons.\nAccessory elements include Carnage’s tentacles.\nBuildable Spider-Man bike toy measures over 1” (5cm) high, 5” (13cm) long and 2” (6cm) wide.\nPower generator measures over 1” (3cm) high, 5” (13cm) wide and 1” (5cm) deep."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/spider-man-vs-doc-ock-76148","description":"With this LEGO® Marvel Spider-Man: Spider-Man vs. Doc Ock set (76148), young superheroes will feel as if they’re racing into action with Spider-Man and Spider-Girl on the awesome Spider-Cycle. Once they’ve worked together to defeat the evil Doctor Octopus, who knows where their imaginations will take them next? Cool action minifigures and motorcycle toy Doctor Octopus – aka Doc Ock– has 4 deadly robotic arms. But Spider-Man and his dynamic daughter Spider-Girl have the amazing Spider-Cycle.Kids will love splitting the motorcycle into 2 cool machines: Spider-Man’s high-speed bike and the giant ‘walking spider’ – always handy in a fight! There are stud shooters to fire, webs to fling and endless possibilities for individual and group play. LEGO® Spider-Man toys – great gifts for kids LEGO Marvel Spider-Man playsets open up a universe of fun-packed role-play adventures. With collectible vehicles, mechs, buildings, minifigures, weapons and gadgets, superhero fans can relive movies, create their own stories and display the supercool models in their rooms.\nThere’s action, adventure and endless possibilities for imaginative play when young superheroes join Spider-Man, Spider-Girl and their amazing 2-in-1 motorcycle to battle the evil, 4-armed Doctor Octopus.\nWith 3 LEGO® minifigures, kids can role-play as Spider-Man, Spider-Girl and Doc Ock in an action-packed confrontation. Spider-Man's motorcycle splits into 2 to create a high-speed bike and a giant ‘walking spider'!\nDoc Ock has 4 robotic arms. But Spider-Man and Spider-Girl have the Spider-Cycle, with stud shooters and webs to fling… and that’s just the beginning! Who knows where this inspirational playset will take them next?\nWith a cool superhero action set to build that’s great for solo and group play, boys and girls aged 6 and up will enjoy endless superhero adventures with this LEGO® Marvel Spider-Man building toy.\nMeasuring over 6” (17cm) long, 5” (13cm) wide and 2” (6cm) high, Spider-Man's motorcycle easily combines with other LEGO® Marvel sets for even more superhero action. And when it’s not chasing villains, it looks great on display in any kid’s room.\nNo batteries are needed for this Spider-Man superhero playset. Kids can enjoy hands-on fun whenever and wherever they want. Battery-free LEGO® building toys encourage creative thinking and imaginative role-play.\nThinking of giving this popular Spider-Man playset to someone new to LEGO® building toys? No problem! It comes with an easy-to-follow guide to get them building and playing straight away.\nLEGO® Marvel Spider-Man playsets give superhero fans endless, action-packed, role-play enjoyment. Kids can recreate movie scenes, dream up adventures of their own or simply put their models on display.\nLEGO® toys meet the highest industry standards, so they are consistent, compatible and connect and pull apart easily (no superpowers needed!) – and it's been that way since 1958.\nAs well as meeting the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends, scratchee and stretch LEGO® bricks and pieces so you can be certain your toy is safe for your child."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/vulture-s-trucker-robbery-76147","description":"Your little superhero can swing into action with Spider-Man to catch Vulture as the winged villain minifigure swoops down, blasts the bank truck open and steals the jewels! A great way to introduce preschoolers to LEGO® construction. Cool, buildable action toy with vehicles and minifigures This Spider-Man playset includes 3 LEGO minifigures – Spider-Man, the Vulture and a Driver – an awesome motorbike and a bank truck. The truck's rear ‘explodes' off to reveal boxes of jewels, and kids can remove the engine and rebuild it on top of the hood for a sporty look. A simple guide builds kids’ confidence by explaining the purpose of each building step. For extra fun, download the free LEGO Life interactive building app with zoom and rotate features. Super-fun superhero playsets With an awesome range of vehicles, mechs, buildings, minifigures, weapons and gadgets, LEGO Marvel Spider-Man building toys let little superheroes recreate favorite movie scenes and role-play imaginative stories of their own.\nThere’s action, excitement and familiar characters in this LEGO® starter set for young builders. It’s a great way to introduce kids to LEGO playsets and superhero adventures from the Marvel Spider-Man movies.\nThis fun-filled toy includes Spider-Man, the Vulture and Driver LEGO® minifigures, plus Spider-Man's motorbike and a bank truck with a rear that ‘explodes' off and an engine that can be rebuilt on the hood.\nWith a motorbiking superhero, a winged super villain and a bank truck full of jewels, the scene is set for endless action-packed play! And, when the action stops, the figures make a great display in any kid’s room.\nThis LEGO® Marvel Spider-Man building toy offers building challenges and group play possibilities perfectly suited to boys and girls aged 4 and up. A popular buildable LEGO toy for kids' Christmas or birthday gift.\nWith the bank truck toy measuring over 5” (15cm) long and 3” (9cm) high, this Spider-Man and Vulture minifigure playset encourages imaginative play on a big scale. Combine it with other toys for more superhero fun.\nYou don’t need batteries for this superhero playset. Kids just pick up and play! Battery-free, hands-on LEGO® building toys encourage creative thinking, imaginative role-play and problem-solving skills.\nEven young children can build this Spider-Man playset independently, thanks to Instructions PLUS. This free interactive guide with zoom and rotate functions comes with the LEGO Life app for smartphones and tablets.\nLEGO® Marvel Spider-Man playsets inspire kids to create action-packed, imaginative superhero adventures. They’re great for recreating movie scenes and dreaming up new adventures, or they can simply be used for display.\nAll LEGO® bricks and pieces meet the highest industry standards, so they are consistent, compatible and connect and pull apart easily –it's been that way since 1958.\nAs well as meeting the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends, scratches and stretches LEGO® bricks and pieces so you can be certain they're safe for your child."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/the-guardians-ship-30525","description":"Soar into battle action inspired by the Marvel Super Heroes Avengers: Infinity War movie with a mini LEGO® brick version of The Guardians' Ship, featuring an adjustable cockpit and adjustable wings."},{"theme":"marvel","themeUrl":"https://www.lego.com/en-us/themes/marvel","productUrl":"https://www.lego.com/en-us/product/royal-talon-fighter-30450","description":"Launch into battle with this mini LEGO® version of the iconic Royal Talon Fighter featured in the Marvel Super Heroes Black Panther movie."}]