[{"theme":"mindstorms","themeUrl":"https://www.lego.com/en-us/themes/mindstorms","productUrl":"https://www.lego.com/en-us/product/robot-inventor-51515","description":"Enter the amazing physical and digital world of programmable, remote-control robots and intelligent creations. With LEGO® MINDSTORMS® Robot Inventor (51515), young robot fans build 5 unique, motorized robots and vehicles using the free LEGO MINDSTORMS Robot Inventor App. Then they bring them to life, one at a time, using the drag-and-drop coding environment based on Scratch and complete fun activities and challenging missions (visit LEGO.com/devicecheck for a list of compatible devices). And with almost 1,000 pieces, kids will love to come up with their own tech toy creations and share them with other robot fans on LEGO Life.\n\nLevel up the play experience\nFrom the intelligent Hub with its 5x5 LED screen, 6-axis gyro and speaker, to powerful motors and accurate sensors, the latest evolution of LEGO MINDSTORMS coding robots for kids is the perfect way to help youngsters express and develop their creativity, while gaining essential 21st century STEM skills.\n\nWith LEGO® MINDSTORMS® Robot Inventor (51515), kids gain essential STEM skills as they build, code and play with remote-control robots and intelligent creations that shoot missiles, play ball, drive around and more!\nKids build Charlie, Tricky, Blast, M.V.P. and Gelo, and take on activities and missions using the Scratch-based LEGO® MINDSTORMS® Robot Inventor App (visit LEGO.com/devicecheck for a list of compatible devices).\nWith almost 1,000 pieces, including an intelligent Hub, 4 Medium Motors, Color Sensor and Distance Sensor with break-out interface, youngsters can also build their own fun robotic toys and share them online on LEGO® Life.\nFor fans of LEGO® BOOST and kids who love LEGO building and playing with robots, Robot Inventor is a great next step. It's also a cool gift for 10-year-olds and up, be it a birthday, Christmas or any other occasion.\nBlast stands at over 14” (36cm) tall, while Gelo measures over 9” (24cm) long. The Powered Up components in this set are also compatible with the LEGO® BOOST Creative Toolbox (17101), Droid Commander (75253) and others.\nAn easy-to-install rechargeable battery is included with this cool toy, so no need to go hunting for spare batteries when the fun’s about to start.\nThe free LEGO® MINDSTORMS® Robot Inventor coding app for kids includes an interface based on Scratch, digital building instructions, 50+ activities, plus Python support for more advanced coders.\nLEGO® MINDSTORMS® inspires LEGO inventors of all ages to build, code and control interactive robot toys and other creations with bricks, motors, sensors and intelligent Hubs, and share them with the MINDSTORMS community.\nSince 1958, LEGO® building bricks have met the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are rigorously tested to meet exacting safety and quality standards, so you can be sure these electronic toys won't fall apart during a mission.\nThis set features Digital Building Instructions. Now it’s easy to follow the steps on your mobile device or download a PDF of the printed building guide. Click the Building Instructions button at the bottom of this page to find and download the instructions."},{"theme":"mindstorms","themeUrl":"https://www.lego.com/en-us/themes/mindstorms","productUrl":"https://www.lego.com/en-us/product/ev3-intelligent-brick-45500","description":"This programmable, intelligent brick serves as the heart and brain of LEGO® MINDSTORMS® Education EV3 robots. It features an illuminated six-button interface that changes color to indicate the brick's active state, a high-resolution black and white display, built-in speaker, USB port, a mini SD card reader, four input ports and four output ports. The brick also supports USB, Bluetooth and Wi-Fi communication with a computer and has a programming interface that enables programming and data logging directly onto the brick. It is compatible with mobile devices and is powered by AA batteries or the EV3 Rechargeable DC Battery. The brick features:\n\nARM 9 processor with Linux-based operating system\nFour input ports for data acquisition of up to 1000 samples per/sec\nFour output ports for execution of commands\nOn-board program storage including 16 MB of Flash memory and 64 MB of RAM\nMini SDHC card reader for 32 GB of expanded memory\nIlluminated, three-color, six-button interface that indicates the brick’s active state\nHi-resolution 178x128 pixel display enabling detailed graph viewing and sensor data observation\nHigh-quality speaker\nOn-brick programming and datalogging that can be uploaded into the EV3 software\nComputer-to-brick communication through on-board USB, or external Wi-Fi or Bluetooth dongles\nUSB 2.0 host enabling bricks to be linked in a daisy chain, allows Wi-Fi communication and connection to USB memory sticks\nPowered by six AA batteries or the 2050 mAh lithium ion EV3 Rechargeable DC Battery"},{"theme":"mindstorms","themeUrl":"https://www.lego.com/en-us/themes/mindstorms","productUrl":"https://www.lego.com/en-us/product/ev3-rechargeable-dc-battery-45501","description":"The lithium ion EV3 Rechargeable DC Battery is designed for use with the EV3 Intelligent Brick and features a capacity of 2050 mAh. It provides longer run time than AA batteries and can be charged without taking the model apart. The battery is included in the EV3 Education Core Set and has a charge time of around three to four hours. It requires the 45517 DC Charger, which is the same charger as used for the rechargeable NXT DC Battery. These are sold separately."},{"theme":"mindstorms","themeUrl":"https://www.lego.com/en-us/themes/mindstorms","productUrl":"https://www.lego.com/en-us/product/ev3-color-sensor-45506","description":"The digital EV3 Color Sensor distinguishes between eight different colors. It also serves as a light sensor by detecting light intensities. Students can build color sorting and line-following robots, experiment with light reflection of different colors, and gain experience with a technology that is widely used in industries like recycling, agriculture and packaging.\n\nMeasures reflected red light and ambient light, from darkness to very bright sunlight\nCapable of detecting eight colors. It can tell the difference between color or black and white, or between blue, green, yellow, red, white and brown\nSample rate of 1 kHz\nAuto-ID is built into the EV3 software"},{"theme":"mindstorms","themeUrl":"https://www.lego.com/en-us/themes/mindstorms","productUrl":"https://www.lego.com/en-us/product/ev3-ultrasonic-sensor-45504","description":"The digital EV3 Ultrasonic Sensor generates sound waves and reads their echoes to detect and measure distance from objects. It can also send single sound waves to work as sonar or listen for a sound wave that triggers the start of a program. Students could design a traffic-monitoring system and measure distances between vehicles, for instance. There is an opportunity to discover how the technology is used in everyday items like automatic doors, cars and manufacturing systems.\n\nMeasures distances between one and 250 cm (one to 100 in.)\nAccurate to +/- 1 cm (+/- .394 in.)\nFront illumination is constant while emitting and blinks while listening\nReturns true if other ultrasonic sound is recognized\nAuto-ID is built into the EV3 software"},{"theme":"mindstorms","themeUrl":"https://www.lego.com/en-us/themes/mindstorms","productUrl":"https://www.lego.com/en-us/product/ev3-touch-sensor-45507","description":"The analog EV3 Touch Sensor is a simple but exceptionally precise tool that detects when its front button is pressed or released and is able to count single and multiple presses. Students can build start/stop control systems, create maze-solving robots and uncover the technology’s use in devices such as digital musical instruments, computer keyboards and kitchen appliances.\n\nCross-axle hole on button\nAuto-ID is built into the EV3 software"},{"theme":"mindstorms","themeUrl":"https://www.lego.com/en-us/themes/mindstorms","productUrl":"https://www.lego.com/en-us/product/ev3-cable-pack-45514","description":"This Cable Pack contains the same seven RJ12 Connector Cables as included in the 45544 EV3 Core Set. The cables can also be used with NXT. The Pack contains:\n\n4 x 25 cm/10 in. cables\n2 x 35 cm/14 in. cables\n1 x 50 cm/20 in. cables"},{"theme":"mindstorms","themeUrl":"https://www.lego.com/en-us/themes/mindstorms","productUrl":"https://www.lego.com/en-us/product/lego-mindstorms-ev3-31313","description":"Combining the versatility of the LEGO® building system with the most advanced technology we've ever developed, LEGO MINDSTORMS® EV3 lets you unleash a world of walking, talking and thinking robots that do anything you can imagine. Complete a series of challenging missions using the intuitive icon-based EV3 Programmer App for tablet devices to build and program TRACK3R, R3PTAR, SPIK3R, EV3RSTORM and GRIPP3R, and then create your own programs. Take your robotics skills to the next level with the companion EV3 Software for PC and Mac, with its more advanced yet familiar programming interface. For instant control, download the free Robot Commander app for smart devices or use the infrared remote control included with each set. Want to share your own creations and be inspired by others? Log on to LEGO.com/MINDSTORMS to access a world of exciting content and interact with a huge online community of LEGO MINDSTORMS fans. The LEGO MINDSTORMS EV3 robot revolution continues!\n\nBuild and program walking, talking and thinking robots that do anything you can imagine\nIncludes Intelligent EV3 Brick & three servo motors, plus colour, touch and IR sensors\nSPIK3R is over 16” high, 14” long and 15” wide\nLEGO MINDSTORMS building toys are compatible with all LEGO construction sets for creative building\n601 pieces – For boys and girls over 10 years old"},{"theme":"mindstorms","themeUrl":"https://www.lego.com/en-us/themes/mindstorms","productUrl":"https://www.lego.com/en-us/product/ev3-infrared-beacon-45508","description":"This has been designed for use with the EV3 Infrared Seeker Sensor. The beacon emits an infrared signal which the sensor can track. The beacon can also be used as a remote control for the EV3 brick through signals sent to the infrared sensor.\n\nRequires two AAA batteries\nFour individual channels\nIncludes a beacon button and toggle switch to activate/deactivate\nGreen LED indicating if the beacon is active\nAuto power-down if the unit is not in action for one hour\nWorking distance of up to two meters"},{"theme":"mindstorms","themeUrl":"https://www.lego.com/en-us/themes/mindstorms","productUrl":"https://www.lego.com/en-us/product/ev3-infrared-sensor-45509","description":"The digital EV3 Infrared Seeking Sensor detects proximity to the robot and reads signals emitted by the EV3 Infrared Beacon. Students can create remotely-controlled robots, navigate obstacle courses and learn how infrared technology is used in TV remotes, surveillance systems and even in target acquisition equipment.\n\nProximity measurement of approximately 50-70 cm\nWorking distance from the beacon of up to two meters\nSupports four signal channels\nReceives IR remote commands\nAuto-ID is built into the EV3 software"},{"theme":"mindstorms","themeUrl":"https://www.lego.com/en-us/themes/mindstorms","productUrl":"https://www.lego.com/en-us/product/ev3-gyro-sensor-45505","description":"The digital EV3 Gyro Sensor measures the robot’s rotational motion and changes in its orientation. Students can measure angles, create balancing robots and explore the technology that powers a variety of real-world tools like Segway®, navigation systems and game controllers.\n\nAngle mode measures angles with an accuracy of +/- 3 degrees\nGyro mode has a maximum output of 440 degrees/second\nSample rate of 1 kHz\nAuto-ID is built into the EV3 software"},{"theme":"mindstorms","themeUrl":"https://www.lego.com/en-us/themes/mindstorms","productUrl":"https://www.lego.com/en-us/product/transformer-10v-dc-45517","description":"This standard 10V DC transformer allows you to recharge the 9693 Rechargeable Battery, the 45501 EV3 Rechargeable Battery, the 8878 Power Functions Rechargeable Battery Box, and the 45302 Smarthub Rechargeable Battery."},{"theme":"mindstorms","themeUrl":"https://www.lego.com/en-us/themes/mindstorms","productUrl":"https://www.lego.com/en-us/product/ev3-large-servo-motor-45502","description":"The EV3 Large Servo Motor is a powerful motor that uses tacho feedback for precise control to within one degree of accuracy. By using the built-in rotation sensor, the intelligent motor can be made to align with other motors on the robot so that it can drive in a straight line at the same speed. It can also be used to give an accurate reading for experiments. The motor case design also makes it easy to assemble gear trains.\n\nTacho feedback to one degree of accuracy\n160-170 RPM\nRunning torque of 20 N.cm (approximately 30 oz/in)\nStall torque of 40 N.cm (approximately 60 oz/in)\nAuto-ID is built into the EV3 software"},{"theme":"mindstorms","themeUrl":"https://www.lego.com/en-us/themes/mindstorms","productUrl":"https://www.lego.com/en-us/product/ev3-medium-servo-motor-45503","description":"The EV3 Medium Servo Motor is great for lower-load, higher speed applications and when faster response times and a smaller profile are needed in the robot’s design. The motor uses tacho feedback for precise control within one degree of accuracy and has a built-in rotation sensor.\n\nTacho feedback to one degree of accuracy\n240-250 RPM\nRunning torque of 8 N/cm (approximately 11 oz/in)\nStall torque of 12 N/cm (approximately 17 oz/in)\nAuto-ID is built into the EV3 software"}]