[{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-first-adventure-21169","description":"LEGO® Minecraft™ The First Adventure (21169) takes players into the Minecraft world, where they can explore endless action and adventure with cool features, popular characters and amazing mobs.\n\nAn impressive new way to play Minecraft\nIf you know a child with a passion for Minecraft, they'll love this recreation of one of Minecraft's most exciting environments. There's a 3-level structure full of fascinating features to explore, such as a waterfall elevator, collapsible rail tracks, sliding earth blocks and, of course, explosions. Popular Minecraft characters Steve and Alex are here to share the adventure, along with Minecraft favorites, skeletons, a dyed cat, horned sheep and a flowery moobloom.\n\nLEGO® Minecraft The First Adventure (21169) is a premium creative construction set that recreates one of the online game’s most exciting play environments.\nIncludes Steve and Alex characters, plus 2 skeletons, a dyed cat, horned sheep, moobloom and fun features, such as a waterfall elevator, collapsible rail tracks, sliding earth blocks and explosions.\nPlayers must battle hostile mobs and avoid the hidden traps as they explore the detailed environment of the 3-level Minecraft™ structure.\nFor ages 8 and up. A stand-out gift for Minecraft™ players looking to expand their passion for the online game into the real world.\nThe set measures over 9 in. (23 cm) high, 8 in. (20 cm) wide and 7 in. (18 cm) deep. Great for hands-on play and creating a cool display to share with friends on social media.\nLEGO® Minecraft™ playsets give Minecraft fans a new way to play their favorite game, with characters, scenes and features brought to life with an imaginative mix of LEGO bricks and pieces.\nLEGO® building kits meet stringent industry quality standards to make certain they are consistent, compatible and connect and pull apart perfectly every time – and it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to ensure they satisfy strict global safety standards."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-pig-house-21170","description":"Take a Minecraft™ player’s passion for their favorite online game to the next level with LEGO® Minecraft The Pig House (21170). This authentic Minecraft playset has all the fun, creativity and adventure of the online game – plus the physicality and versatility of LEGO building toys.Looking for the perfect Minecraft gift?Kids use their Minecraft skills to build the kind of wacky creation they create in the online game: a house shaped like a giant pig. The side of the structure opens to reveals alarge room and a lift-off roof uncovers more room to play. The model is endlessly reconfigurable – and the entire head-room detaches to fit elsewhere on the model. Alex, the game’s heroic daredevil, is here to share the fun, while an iconic Creeper™ is determined to ambush the players. There’s activity outside too, with 2 cute pigs to care for. And, for added Minecraft authenticity, there’s an explosion function that blasts the toy to pieces!\nIndulge a Minecraft™ player’s passion for the game with LEGO® Minecraft The Pig House (21170). All the fun, creativity and adventure of Minecraft with added hands-on, LEGO brick versatility.\nAuthentic LEGO® Minecraft™ building playset featuring popular gaming character Alex, an iconic Creeper™, 2 pigs, accessories for Alex and carrots for the pigs.\nKids use Minecraft™ skills to build a pig-shaped house, open the side and remove the roof to explore hidden rooms, hide from the Creeper™, care for pigs – and detonate a house-collapsing explosion!\nFor ages 8 and up. The perfect gift for kids wanting to take their Minecraft™ play to the next level.\nMeasuring over 5.5 in. (14 cm) high, 8 in. (20 cm) wide and 7.5 in. (19 cm) deep, the set encourages hands-on creativity and looks amazing on display in any Minecraft™ fan’s room.\nThis LEGO® Minecraft™ set is made to last, endlessly reconfigurable, and easy to combine with other LEGO Minecraft sets.\nThe extensive range of LEGO® Minecraft™playsets bring the online Minecraft game to life with characters, scenes and features recreated with an imaginative mix of long-lasting LEGO bricks.\nLEGO® components fulfil rigorous industry quality standards to ensure they are consistent, compatible and connect and pull apart perfectly every time – and it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to ensure they satisfy strict global safety standards."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-warped-forest-21168","description":"LEGO® Minecraft™ The Warped Forest (21168) lets fans enjoy exciting, explosive Minecraft adventures in the real world.\n\nHands-on action for Minecraft-mad kids\nThis thrilling playset is packed with Minecraft characters and features that kids will recognize from the popular online game. Players must help Huntress cross the dangerous landscape of The Warped Forest. There are falling rocks, hostile mobs to battle and a river of lava to cross. Kids use dynamite to set off an explosion which brings down a tree across the fiery lava flow. They cross this makeshift bridge and head into further adventures.\n\nIndulge a child’s passion for Minecraft™ with LEGO® Minecraft The Warped Forest (21168). This hands-on playset brings exciting, explosive Minecraft adventures into the real world.\nIncludes 4 figures: Huntress with a bow and arrow and protective armor, a hoglin with a movable head, and 2 piglins armed with swords. Also includes built-in explosion and rockfall features.\nPlayers help Huntress cross a landscape featuring falling rocks, hostile creatures and a river of lava. They set off explosives to fell a tree, which creates a bridge leading to more adventures.\nThis thrilling LEGO® landscape realistically recreates the dark and dangerous Minecraft™ Warped Forest environment.\nFor ages 8 and up. An ideal gift for Minecraft™ players looking to expand their passion for the online game into the real world.\nThe set measures over 5 in. (13 cm) high, 9 in. (25 cm) wide and 5 in. (14 cm) deep. Great for hands-on play, and looks awesome displayed in a kid's room.\nLEGO® Minecraft™ playsets give Minecraft fans a new way to play their favorite game, with characters, scenes and features brought to life with an imaginative mix of LEGO bricks and pieces.\nLEGO® building kits meet rigorous industry quality standards to ensure they are consistent, compatible and connect and pull apart perfectly every time – and it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet the highest global safety standards."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-coral-reef-21164","description":"Bring Minecraft™, the hugely popular online kids’ game, to life in the real world with hands-on LEGO® Minecraft The Coral Reef (21164). With endlessly reconfigurable LEGO bricks, the creative-building fun never stops.\n\nAuthentic Minecraft action in an underwater adventure\nKids join Minecraft's popular daredevil, Alex, as she dives beneath the Minecraft ocean to search for hidden treasure among the colorful coral reef. The set is packed with imaginative Minecraft features – from the passing puffer fish to the surprise appearance of the treasure chest. And, like all exciting Minecraft stories, there’s a thrilling sword battle with a drowned zombie.\n\nLEGO® Minecraft™ The Coral Reef (21164) is a hands-on treat for Minecraft players that brings the game’s underwater adventures to life with endlessly reconfigurable LEGO bricks.\nDurable LEGO® Minecraft™ set featuring popular gaming character Alex, with diving helmet, magic pants and sword, plus a drowned, 2 puffer fish (1 ‘inflated', 1 normal) and accessories.\nKids join Alex, the Minecraft™ daredevil, as she dives beneath the ocean to search for hidden treasure among the colorful coral reef and fight off a surprise attack by a drowned.\nFor ages 7 and up. Delight Minecraft™ players with a real-world Minecraft building playset. The perfect surprise for gamers wanting to take their Minecraft play to the next level.\nThe set measures over 3 in. (7 cm) high, 4 in. (10 cm) wide and 3.5 in. (10 cm) deep – small enough for hands-on fun and big enough for an impressive display.\nThe colorful coral reef scene is packed with authentic Minecraft™ details and awesome accessories, such as the hidden treasure chest which opens to reveal a fish and a pearl.\nThis LEGO® Minecraft™ set is made to last, endlessly reconfigurable, and easy to combine with other LEGO Minecraft sets.\nThe extensive range of LEGO® Minecraft™ playsets bring the online Minecraft game to life with characters, scenes and features recreated with an imaginative mix of long-lasting LEGO bricks.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart perfectly every time – and it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they satisfy rigorous global safety standards."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-pirate-ship-adventure-21152","description":"Craft a pirate ship with gold detailing, pirate banner, gangplank, cannons and a cute resident parrot. This LEGO® Minecraft™ Pirate Ship Adventure set comes with a host of new-for-January-2019 features and characters, including a minifigure with pirate skin, a dolphin and a turtle with 2 eggs. Place the zombie in the special base for a Minecraft zombie-fire effect and ward off hostile mobs with the ship's flick-missile cannons. Enjoy hands-on Minecraft pirate adventures with this LEGO Minecraft set. Easily swap the ship’s modular building sections to create a tropical pirate base and combine it with other sets to create your own unique LEGO Minecraft universe! Also includes an Alex minifigure.\n\nIncludes 2 minifigures: a pirate and Alex, plus a Minecraft™ zombie and, new-for-January-2019 Minecraft dolphin, parrot and turtle figures.\nFeatures a buildable Minecraft™ island setting and pirate ship toy with working flick-missile cannons, gold detailing, pirate banner, gangplank and a rowboat.\nGet your sea legs aboard a Minecraft™ pirate ship. Fire the cannons to ward off the hostile mobs and protect the turtle's eggs from the zombie attack.\nLook after the cute parrot and feed the dolphin.\nMove the modular ship sections to create a Minecraft™ shipwreck.\nWeapons include a sword.\nAccessory elements include a map, TNT, fire element base, 2 shovels, chest, treasure, pirate banner, water bottle, torch and a compass.\nSet your imagination free—rebuild the set for more LEGO® Minecraft™ creations!\nThis set includes over 386 pieces.\nMeasures over 5” (15cm) high, 9” (23cm) wide and 9” (23cm) deep."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-creeper-mine-21155","description":"Enjoy action-packed Minecraft™ adventures with the LEGO® Minecraft 21155 The Creeper™ Mine set. Designed for fans of the record-breaking video game, this model is packed with exciting new-for-August-2019 features and functions. Kids can battle the Creeper and husk, blast out stone with the TNT and store mined gold in a giant Creeper statue that delivers it direct to a chest at the pull of a lever. This collectible Minecraft toy also features a working rail track with minecart and a detailed Minecraft shelter with a bed, anvil, oven, chest and a vegetable patch. It can be combined with other playsets to create a unique LEGO Minecraft universe for both play and display. Includes 3 minifigures: Steve, blacksmith and a husk, plus Creeper, cow and bat figures.\n\nIncludes 3 minifigures: Steve, a new-for-August-2019 Minecraft™ blacksmith and a husk, plus Creeper™, cow and bat figures.\nFeatures a mine with rail track, minecart and 3 explosion functions; shelter with a large Creeper™ statue, 2 Creeper banners, ladders, bed, anvil and an oven; desert and mesa setting with 2 signs, cactus and irrigated vegetable patch.\nUse the Minecraft™ TNT to blast out the stone and clear the blocked rail track.\nBattle the husk with your iron sword.\nHop aboard the minecart and head into the gold-rich Creeper™ Mine.\nCollect your treasure in the huge Creeper™ statue and then pull the lever to deliver it to the chest.\nWeapons include 2 pickaxes and a sword.\nAccessories include 3 TNT blocks, 2 chests and 4 golden ore elements.\nSet your imagination free—rebuild the set for more LEGO® Minecraft™ creations!\nThis set includes over 830 pieces.\nMine measures over 8” (22cm) high, 14” (38cm) wide and 8” (22cm) deep."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-crafting-box-3-0-21161","description":"LEGO® Minecraft™ The Crafting Box 3.0 (21161) brings the fun excitement of Minecraft into the real world with a diverse set of LEGO construction bricks and pieces.\n\nCool kids’ building toy for Minecraft players\nThe Crafting Box set is bursting with Minecraft ideas and inspiration. With popular characters from the game – Steve, Alex, a Creeper™, a pig and a zombie – and a host of fun features – from a TNT launcher to a Creeper confrontation – this toy playset brings Minecraft adventures to life!\n\nInteractive instructions\nInstructions PLUS is an interactive guide for smart devices within the free LEGO Building Instructions app. Zoom and rotate viewing tools help youngsters have fun as they build the castle and farm on their own. Alternative builds are available online.\n\nMinecraft games come to life with LEGO bricks and figures\nLEGO Minecraft sets put open-ended creative play into kids' hands. This cool collection of Minecraft construction toys takes players to a new dimension of imaginative play!\n\nBring Minecraft™ players’ creative adventures into the real world with The Crafting Box 3.0 (21161). It’s bursting with LEGO® Minecraft construction bricks and familiar figures to inspire endless imaginative play!\nThis Minecraft™ construction toy includes 564 bricks and pieces, plus popular characters from the game – Steve, Alex, Creeper™, pig and zombie – and a host of fun features, from a TNT launcher to a Creeper confrontation.\nThe set includes everything kids need to play out imaginative Minecraft™ adventures in a cool castle, a busy farm and awesome environments of their own as they explore new ways to play their favorite game.\nLEGO® Minecraft™ The Crafting Box 3.0 makes a great gift or birthday present for players aged 8 and up. Whether playing solo or in a group, this construction toy gives kids endless hands-on Minecraft fun.\nWith the castle measuring over 7” (18cm) high, 10” (27cm) wide and 10” (26cm) deep, and the farm measuring over 6” (16cm) high, 10” (26cm) wide and 10” (26cm) deep, this playset provides Minecraft™ fun on an epic scale.\nThis build-and-play Minecraft™ construction toy is battery-free. The fun is fueled by kids’ imaginations – so the fun never stops.\nPrinted instructions are great but digital Instructions PLUS is AWESOME! With the LEGO® Building Instructions app, even young builders can zoom, rotate and visualize their model as they create their own Minecraft™ world.\nLEGO® Minecraft™ kits combine the online excitement of Minecraft with hands-on building. With detailed models, elements and characters, plus lots of fun features, these sets give players a new dimension of Minecraft fun.\nLEGO® building sets meet the highest industry standards, which means they are consistent, compatible and connect and pull apart perfectly every time, and it's been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure your child's building set meets the highest safety and quality standards in the world."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-illager-raid-21160","description":"Action-packed, LEGO® Minecraft™ adventure with inspiring environments, cool accessories and favorite characters from the popular computer game. Anything can happen when the mysterious Minecraft Kai figure arrives to fight off the hostile invaders!Many ways for kids to build, play and create!With 3 Minecraft locations – a flat-roof desert house, trading post and a field with crops – players rearrange the set to create endless role-play scenarios. The fun continues indoors by detaching the house roof. As well as friendly Villagers, new-for-January-2020 Illagers, Vindicator and a range of animals and accessories, there’s an awesome, biting Ravager to contend with! It’s big enough for a Minecraft figure to ride on and has jaws that open and snap shut!Bring Minecraft action to life with LEGO bricks and figures!LEGO Minecraft playsets put open-ended independent and group play in kids’ hands. And, with the new-for-January-2020 buildable Minecraft figures, they’ll never want to put it down!\nTake Minecraft™ players to a new dimension with this action-packed LEGO® Minecraft set. Kids rearrange the 3 sections to inspire endless hands-on adventures tackling the hostile mobs and their biting Ravager beast!\nKids will love the new-for-January-2020 Illagers and their big, biting Ravager, which the Illagers can ride. These bad guys bring conflict and action to the game, and any other LEGO® Minecraft™ set.\nA mysterious Kai figure races to rescue the Villagers, their desert house, their trading post and their crops. And, when the battle is over, players can rearrange the 3-section set for more exciting adventures.\nBoys and girls aged 7 and up will love to build, play, rearrange and play again with this versatile Minecraft™ set. A great Christmas or birthday gift for kids looking for new ways to play their favorite game.\nThe 3-section set measures over 18” (46cm) long, 13” (34cm) wide and 10” (26cm) high. And, when the sections are rearranged and combined with other LEGO® sets, the fun just gets bigger and better!\nThis battery-free, hands-on playset boosts kids’ dexterity, creativity and problem-solving skills. Whether playing independently or as a group, kids’ imaginations ensure the enjoyment never stops!\nKids can either jump straight in and enjoy some free-building fun, or use the easy instructions to get building right away! And if the guide goes missing, simply download a new one from LEGO.com\buildinginstructions.\nLEGO® Minecraft™ construction sets bring allthe online excitement of Minecraft into the real world. With high-quality, authentic-looking models, LEGO Minecraft sets take kids’ play experience into a new dimension!\nLEGO® construction sets meet the highest industry standards plus our own rigorous quality criteria to ensure that the bricks are consistent, compatible and connect and pull apart easily!\nWe drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces to ensure they meet the highest global safety and quality standards – and you can be absolutely certain your child is safe."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-redstone-battle-21163","description":"Bring all the fun of the online Minecraft™ Dungeons game into the real world with LEGO® Minecraft The Redstone Battle (21163). With posable giants, favorite characters and fun battles, this buildable toy gives Minecraft players an action-packed setting for endless hands-on adventures.\n\nCool Minecraft monster toy for kids\nKids create Minecraft action of their own as they take on the giant redstone monstrosity and the redstone golem. Kids use cool weapons to role-play battles and adjust the posable redstone monsters to create ever-changing scenes. There are also lots of fun accessories, such as the loot contained inside the Minecraft piggy bank.\n\nBring Minecraft action to life with LEGO brick building toys!\nLooking for the best birthday gift or merchandise toy for a Minecraft fan? LEGO Minecraft playsets put the characters, the construction, the mini toys and the battle action from the online game right into kids' hands.\n\nBring the fun of the Minecraft™ Dungeons online game into the real world with LEGO® Minecraft The Redstone Battle (21163). Players create their own hands-on Dungeons adventures with popular characters and posable giants.\nIncludes 4 Minecraft™ heroes – Hex, Hedwig, Hal and Valorie – a giant redstone monstrosity and a redstone golem, plus lots of cool Minecraft weapons.\nThere's endless action, excitement and adventure when kids take on the giant redstone monstrosity and the redstone golemand join Minecraft™ heroes to overcome the Arch-Illager’s minions.\nLooking for a new Minecraft™ toy for kids aged 8 and up? This versatile LEGO® Minecraft Dungeons playset makes a great birthday gift for kids looking for new ways to play their favorite game.\nPlayers can build, play, rearrange and play again with this creative LEGO® Minecraft™ construction set. And with the posable redstone monstrosity toy standing over 6” (16cm) tall, kids have hands-on fun on an epic scale.\nThis Minecraft™ monster action toy is battery-free, powered solely by kids’ imaginations! The hands-on play boosts kids’ dexterity, creativity and problem-solving skills, whether playing solo or as a group.\nSimple, clear instructions ensure kids get building and playing right away and experience maximum enjoyment with the cool characters, fun features and familiar location.\nLEGO® Minecraft™ construction sets bring all the online excitement of Minecraft into the real world. With high-quality, authentic-looking models, LEGO Minecraft sets take kids’ play experience into a new dimension!\nLEGO® building sets meet the highest industry standards, which means they are consistent, compatible and connect and pull apart perfectly every time, and it’s been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure your child's building set meets the highest safety and quality standards in the world."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-blaze-bridge-21154","description":"Leap into a world of Minecraft™ adventures with this LEGO® Minecraft 21154 The Blaze Bridge set, featuring a fiery Minecraft Nether setting with a bridge, burning lava, fearsome Minecraft mobs and unique items. Players of the record-breaking video game will love to activate the gravel rockfall and the flying blaze functions as they battle the hostile mobs to cross the bridge and win the treasure. Kids can also combine this collectible Minecraft playset with other sets to create a unique LEGO Minecraft universe for both play and display. Includes an Alex minifigure, plus a wither skeleton and 2 blaze figures with spinning blaze rod functionality.\n\nIncludes an Alex minifigure, plus a wither skeleton and 2 blaze figures with spinning blaze rods.\nFeatures a buildable Minecraft™ Nether setting with a bridge, lava, magma, soul sand, glowstone, gravel and nether quartz blocks, brewing stand, 2 potions and a chest with treasure.\nDon your diamond armor, grab your diamond sword and head for The Blaze Bridge!\nBattle the wither skeleton and avoid the swooping blaze to cross the bridge and win the treasure.\nActivate the gravel rockfall and flying blaze functions.\nWeapons include 2 Minecraft™ swords and a pickaxe.\nAccessories include a chest with treasure elements.\nSet your imagination free—rebuild the set for more LEGO® Minecraft™ creations!\nThis set includes over 370 pieces.\nMeasures over 4” (11cm) high, 9” (25cm) wide and 5” (13cm) deep."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-pillager-outpost-21159","description":"Bring Minecraft™ excitement off the computer and into the real world with this LEGO® Minecraft playset. Players of the game can enact action-packed, hands-on adventures with favorite Minecraft characters – Pillagers and an Iron Golem.Cool Minecraft toy for kids to build, play and adaptThe crossbow-wielding, new-for-January-2020 Pillagers have captured the friendly Iron Golem giant. It’ll take kids’ skill, ingenuity and Minecraft know-how to pull off a successful rescue mission as the heroic Knight figure. The model separates into 3 sections, which kids rearrange to customize the challenge. It’s packed with accessories and features – including a fully equipped tent, 2 dummies for archery practice and a TNT explosion function.Minecraft action figure fun in a LEGO playsetLEGO Minecraft toy building sets put open-ended independent play in kids’ hands. Best of all for adults, LEGO Minecraft makes a great Christmas or birthday gift for kids. And with the awesome, new-for-January-2020 buildable Minecraft figures – they’ll never want to put it down!\nA hands-on Minecraft™ rescue adventure with popular characters from the game – Pillagers and an Iron Golem – brought to life in a customizable, 3-section LEGO® Minecraft playset!\nKids will love the toy’s new-for-January-2020 crossbow-carrying LEGO® Minecraft™ Pillagers. There’s also a cool TNT explosion function, a fully-equipped tent, and an archery practice area complete with target dummies.\nPlayers blast open the Minecraft™ cage with TNT to rescue the Iron Golem then take on the troublesome Pillagers! And, when the battle is over, the 3-section set can be rearranged ready for more adventures.\nGive boys and girls aged 7 and up this versatile Minecraft™ playset as a Christmas, birthday or any-other-day gift! Great for LEGO® brick fans and Minecraft gamers looking for new ways to play their favorite game.\nMeasuring over 12” (33cm) long, 7” (20cm) high and 7” (18cm) wide, the set comes in 3 separate sections that allow kids to rearrange, reimagine and embark on endless exciting adventures!\nNo batteries needed. The fun is powered by kids’ imaginations – so the enjoyment never ends! Battery-free, hands-on, real-world play boosts kids’ dexterity, creativity and problem-solving skills.\nSimple instructions for kids start them building without delay! And if the instructions go missing, you can download a fresh set from LEGO.com\buildinginstructions.\nEvery LEGO® Minecraft™ construction toy brings Minecraft’s online excitement into the real world. With high-quality, authentic-looking models, LEGO Minecraft sets take kids’ play experience into a new dimension!\nLEGO® toys meet the highest industry standards as well as our own quality criteria. This ensures LEGO bricks are consistent, compatible and always connect and pull apart perfectly – and it’s been that way since 1958!\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks to ensure every piece meets the highest global safety and quality standards – and you can be sure your child is safe."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-abandoned-mine-21166","description":"LEGO® Minecraft™ The \"Abandoned\" Mine (21166) brings classic Minecraft action to life in the real world as kids help the game’s leading character mine, build and explore, while trying to survive constant attacks by a variety of hostile creatures.\n\nHands-on Minecraft mining adventures\nKids join Steve as he attempts to unearth coal, iron and diamond – while under attack from a scary zombie, creepy spider and living slime. Players must lure the hostile creatures to the cave entrance, then use ahand-operated device to bring the high-level gravel crashing down on them.\n\nBring Minecraft to life with LEGO brick-building playsets!\nLooking for the best birthday present or holiday gift for a Minecraft fan? LEGO Minecraft playsets put all the fun of the online game and more right into kids' hands.\n\nLEGO® Minecraft™ The \"Abandoned\" Mine (21166) brings classic Minecraft action to life in the real world as kids help the game’s leading character mine, build and explore while under attack from various hostile creatures.\nIncludes a familiar cast of Minecraft™ characters and creatures: Steve, a zombie, spider and living slime. The set also includes coal, iron and diamond elements and a falling gravel feature.\nPlayers must help Steve mine for essential resources while luring the zombie, spider and living slime to the cave entrance where kids can use a hand-operated device to bring high-level rocks crashing down on them.\nAn ideal birthday or holiday gift for kids aged 7 and up who want to take their Minecraft™ adventures to another dimension.\nThis versatile LEGO® Minecraft™ playset measures over 5” (14cm) high, 7” (19cm) wide and 4” (12cm) deep and is designed to inspire endless imaginative play. The set also combines easily with other LEGO Minecraft toys.\nNo batteries required. This LEGO® Minecraft™ set is fueled by kids’ imaginations – so the fun never ends. The hands-on play will improve kids’ dexterity, creativity and problem-solving skills.\nSimple, printed instructions get kids building and playing right away so they can experience maximum enjoyment with the cool characters, fun features and familiar Minecraft™ locations.\nLEGO® Minecraft™ construction sets bring all the online excitement of Minecraft into the real world. With high-quality, authentic-looking models, LEGO Minecraft sets take kids’ play experience into a new dimension!\nLEGO® building sets meet the highest industry standards, which means they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure your child's building set meets the highest safety and quality standards in the world."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-bee-farm-21165","description":"The LEGO® Minecraft™ The Bee Farm (21165) playset is buzzing with role-play possibilities. Minecraft players and non-players alike can enjoy endless, hands-on, imaginative play with fun characters and creatures from the online game.\n\nOpen-ended play inspired by Minecraft\nKids can join the friendly bees as they help the flowers and crops to grow and make honey in the beehive. But they must also fend off a swarm of angry bees, which fly together through the air, whizz round in circles and fly free to attack the sheep and the frightened villager. Exciting, engaging and educational, this versatile set includes innovative, hands-on features, a winged beekeeper, villager and 8 busy bees – so the fun can start right away.\n\nReal-life Minecraft action with LEGO brick-building toys!\nLooking for the best birthday present or holiday gift for a Minecraft fan? LEGO Minecraft playsets put all the fun of the online game and more right into kids' hands.\n\nFeaturing characters and creatures from the online game, the LEGO® Minecraft™ The Bee Farm (21165) playset is buzzing with hands-on, role-play possibilities for Minecraft players and non-players alike.\nIncludes a beekeeper with elytra wings, villager, baby sheep, 4 friendly bees and 4 angry bees. The set also includes a rotatable flying feature from which the bees can fly free to wreak havoc!\nKids can join 4 friendly bees as they help flowers and crops to grow – and help the beekeeper to fend off 4 angry bees, which hover in the air, whizz round in circles and fly free to frighten the sheep and the villager.\nMinecraft™ players and non-players alike aged 8 and up will get a buzz from this fun bee toy. Makes a great birthday or holiday gift for kids looking for new ways to play their favorite game.\nThis versatile LEGO® Minecraft™ playset measures over 7” (19cm) high, 6” (16cm) wide and 5” (13cm) deep. Players can build, play, rearrange and play again, and combine it with other LEGO Minecraft toys for even more fun.\nThis LEGO® Minecraft™ set doesn’t require batteries since it is powered solely by kids’ imaginations! The hands-on fun boosts kids’ dexterity, creativity and problem-solving skills, whether playing solo or with friends.\nSimple printed instructions make it easy for kids to build, play and enjoy maximum LEGO® Minecraft™ fun without delay.\nLEGO® Minecraft™ construction sets bring all the online excitement of Minecraft into the real world. With high-quality, authentic-looking models, LEGO Minecraft sets take kids’ play experience into a new dimension!\nLEGO® building sets meet the highest industry standards, which means they are consistent, compatible and connect and pull apart perfectly every time – it's been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure your child's building set meets the highest safety and quality standards in the world."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-end-battle-21151","description":"Grab your potion, ender pearl and enchanted bow, and prepare for the ultimate Minecraft™ encounter. Destroy the end crystal, defeat the enderman and slay the fireball-shooting ender dragon to win The End Battle! Enjoy hands-on Minecraft adventures with this LEGO® Minecraft set. Combine this model with other sets to create your own unique LEGO Minecraft universe. This set also includes a new-for-January-2019 dragon slayer minifigure and a code to redeem the skin in the Minecraft Bedrock Edition online game.\n\nIncludes a new-for-January-2019 dragon slayer minifigure, plus ender dragon and enderman figure.\nThis Minecraft™ toy features a buildable ender dragon toy with highly posable limbs and an enderman figure, plus a Minecraft End setting with obsidian pillar and an end crystal with pop-up functionality.\nCheck your dragon slayer armor, grab your potion, ender pearl and enchanted bow, and prepare for The End Battle!\nShoot fireball missiles from the ender dragon and move its limbs to create dynamic poses.\nWeapons include an enchanted bow.\nAccessories include an ender pearl and a potion\nSet your imagination free—rebuild the set for more LEGO® Minecraft™ creations!\nAlso includes a code for redeeming a LEGO® dragon slayer skin in the Minecraft Bedrock Edition online game.\nThis set includes over 222 pieces.\nMeasures over 3” (9cm) high, 9” (23cm) wide and 5” (13cm) deep."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-panda-nursery-21158","description":"Do you know a Minecraft™ player who would love to care for the cute panda figures they see in the Minecraft computer game? Well, now they can! The LEGO® Minecraft Panda Nursery toy building set brings these adventures to life, giving kids an authentic, hands-on Minecraft play experience in the real world.Kids create their own Minecraft stories with a LEGO building set!Children aged 7 and up can continue their online Minecraft adventures in a physical environment. They can look after and entertain the baby panda, prepare the nursery building and rooftop bed where the playful cub sleeps, and provide food for everyone. There’s lots of bamboo for the pandas to nibble on and Alex is here with a delicious-looking toy cake!Cute pandas make LEGO Minecraft even more magical! Best of all for adults, they make a great Christmas or birthday gift for kids. LEGO Minecraft sets put open-ended independent play in kids’ hands. And, with the posable, adorable, new-for-January-2020 pandas – they’ll never want to put it down!\nVersatile panda playset that brings favorite Minecraft™ stories to life. Kids enjoy hands-on Minecraft fun and adventure when they assemble the LEGO® nursery building set and start caring for the adorable toy pandas.\nNew-for-January-2020, the cutest mobs in Minecraft™! Mom and baby panda Minecraft characters sit, stand and move their heads. An ocelot has come to visit, there’s bamboo to eat and Alex has brought a pie to share!\nKids can build and play with their own Minecraft™ environment. There’s a hut to prepare for the pandas with a rooftop bed for tired babies. And, if there’s any Minecraft gold to be mined, Alex has his diamond pickaxe!\nThis versatile Minecraft™ playset makes a great Christmas, birthday or any-other-day gift for boys and girls aged 7 and up. Great for panda-lovers and Minecraft players wanting new ways to play their favorite game.\nAt over 7” (19cm) long, 3” (9cm) high and 3” (8cm) wide, the playset brings Minecraft™ excitement into the real world – and kids can increase the fun even more by combining it with other LEGO® sets.\nNo need for batteries, so the fun starts straight from the box! The hands-on independent play is powered by kids’ imaginations – which boosts their dexterity, creativity and problem-solving skills.\nSimple instructions for kids get them building and playing without delay! And if the instructions go missing, just download a fresh set from LEGO.com\buildinginstructions.\nEvery LEGO® Minecraft™ construction toy brings Minecraft’s online excitement into the real world. With high-quality, authentic-looking models, LEGO Minecraft sets take kids’ play experience into a new dimension!\nAll LEGO® toys meet the highest industry standards as well as our own quality criteria. You can be sure they are consistent, compatible and always connect and pull apart perfectly – and it’s been that way since 1958!\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces to ensure they meet the highest global safety and quality standards – so you can be sure your child is safe."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-trading-post-21167","description":"LEGO® Minecraft™ The Trading Post (21167) is packed with popular Minecraft features to inspire endless imaginative role-play: an exploding mine, hostile skeleton, mysterious trader and 2 llamas!\n\nVersatile playset filled with hands-on Minecraft fun\nThere are lots of things to engage and entertain kids at the Minecraft mine. The leading character, Steve, is working hard to unearth precious resources before visiting the trading booth. But kids must help him contend with a barrage of classic Minecraft excitement. There are llamas on the loose, an explosion, a hostile skeleton to battle, and the trader appears to have nothing to trade! Or does he? Kids must turn the handle to reveal the hidden items.\n\nBring Minecraft building and battling to life!\nLooking for the best kids' birthday present or holiday toy for a Minecraft fan? LEGO Minecraft playsets put all the figures and all the fun of the online game right into kids' hands.\n\nLEGO® Minecraft™ The Trading Post (21167) is a versatile, hands-on playset packed with endless classic Minecraft fun: mining, explosions, a mysterious trader, hostile skeleton and 2 llamas on the loose!\nIncludes popular Minecraft™ characters and creatures: Steve, a trader, skeleton and 2 llamas. The set also contains fun features, such as an exploding mine and a trading post.\nKids help Steve contend with non-stop Minecraft™ action. There's an explosion at the mine, a skeleton to battle,llamas to catch and a trader with nothing to trade – until the secret handle is turned to reveal the goods.\nThis fun-packed playset makes a great birthday or holiday gift for kids aged 8 and up who want to take their Minecraft™ adventures to a whole new level.\nThe Minecraft™ model measures over 5” (14cm) high, 5” (14cm) wide and 3” (9cm) deep and is designed to inspire endless role-play adventures. For even more fun, the set combines easily with other LEGO® Minecraft toys.\nNo batteriesrequired – just curious kids’ imaginations! The hands-on play is a great way to develop kids’ dexterity, creativity and problem-solving skills.\nClear printed building instructions help kids start exploring the familiar Minecraft™ locations and enjoying the fun features and cool characters right away.\nLEGO® Minecraft™ construction sets bring all the online excitement of Minecraft into the real world. With high-quality, authentic-looking models, LEGO Minecraft sets take kids' play experience into a new dimension!\nLEGO® building sets meet the highest industry standards, which means they are consistent, compatible and connect and pull apart perfectly every time – it’s been that way since 1958.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure your child's building set meets the highest safety and quality standards in the world."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-wool-farm-21153","description":"Children can enjoy hands-on Minecraft™ action with this LEGO® Minecraft 21153 The Wool Farm playset, featuring a farm setting with 2 dyed sheep and a baby sheep. Players of the record-breaking video game will love to create their own adventures with the Steve minifigure, shearing the sheep, caring for the baby sheep and building fun structures to decorate the farm. This collectible Minecraft toy comes with building instructions for 3 decorative structures and includes additional LEGO bricks for improvised building. It can also be combined with other sets to create a unique LEGO Minecraft universe for both play and display!\n\nIncludes a Steve minifigure, plus new-for-August-2019 red, yellow and baby sheep figures.\nFeatures a Minecraft™ farm setting with a birch tree, fence, stream, stepping-stones, crops, flowers, 2 dyed Minecraft sheep and a baby sheep, plus colored LEGO® bricks for building 1 of 3 fun structures to decorate the farm.\nThis Minecraft™ toy also includes additional LEGO® bricks for creative building.\nGrab your shears and get to work at The Wool Farm!\nBuild 1 of 3 structures or your own creations to add a personal touch to your farm.\nEasy-to-reconfigure modular design for quick and easy rebuilding.\nAccessory elements include sheep shears.\nSet your imagination free—rebuild this set for more LEGO® Minecraft™ creations!\nThis LEGO® Minecraft™ playset includes over 250 pieces.\nFarm measures over 4” (12cm) high, 7” (19cm) wide and 5” (14cm) deep."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-taiga-adventure-21162","description":"With Minecraft™ features and figures for players to build, modify and enjoy, this fun-packed LEGO® set encourages kids to step away from the computer and bring Minecraft action into the real world!Kids build their own adventures with 4 favorite Minecraft characters!Unleash kids’ creativity with Minecraft’s Steve, Skeleton, Wolf and the new-for-January-2020 Fox figure. There are snow-capped mountains to climb, red berries to eat and a roaring campfire to keep warm while kids blast for precious ore in the freezing Taiga region. But action and adventures soon interfere with the plans!Take Minecraft players to a whole new dimension of hands-on play!LEGO Minecraft sets put open-ended independent play in kids’ hands. And with authentic Minecraft biomes and popular action figures, they’ll never want to put the toy down!\nTake Minecraft™ players on a thrilling LEGO® Minecraft building adventure in the freezing Taiga region. With 4 cool characters, including a new-for-January-2020 Fox, kids can enjoy non-stop hands-on Minecraft fun.\nWith Steve and his golden sword, Skeleton with a bow and Fox and Wolf figures, plus berry bushes for food, a campfire for heat and TNT to blast for ore, this toy playset is bursting with independent play possibilities!\nKids create and play in their own Minecraft™ environment; rearrange, rebuild and reimagine it for new adventures, and combine it with other LEGO® sets to extend the fun.\nThis versatile playset is an ideal toy for boys and girls seeking new ways to play Minecraft™. A great Christmas, birthday or any-other-day gift for Minecraft players – and budding builders – aged 7 and up.\nThe set measures over 3” (9cm) long, 3” (9cm) wide and 1” (3cm) high. And, when the sections are rearranged or combined with other LEGO® Minecraft™ sets, the fun grows and grows!\nNo batteries needed. This LEGO® Minecraft™ set is powered by kids’ imaginations – so the fun never ends! Let kids enjoy the magic of Minecraft with the hands-on creative possibilities of a LEGO brick set.\nWith simple, clear instructions, kids start building and playing straight away! And if the toy’s instructions go missing, you can download a new set from LEGO.com\buildinginstructions.\nLEGO® Minecraft™ construction sets bring all the online excitement of Minecraft into the real world. With high-quality, authentic-looking models, LEGO Minecraft sets take kids’ play experience into a new dimension!\nLEGO® toys meet the highest industry standards, so they are consistent, compatible and connect and pull apart easily – and it’s been that way since 1958.\nAt The LEGO Group, we drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces so you can be certain they're safe for your child and satisfy the highest global safety and quality standards."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-nether-portal-21143","description":"Craft a portal, build an awesome rail system and journey into the Nether. Battle the flying blaze and the fireball shooting ghast, activate the lava fall, and mine light-emitting glowstone. Enjoy hands-on Minecraft™ adventures with this LEGO® Minecraft set—designed for young fans of the highly successful sandbox video game. Also includes a Steve LEGO Minecraft minifigure, plus small magma cube and baby zombie pigman figures.\n\nIncludes a Steve LEGO® Minecraft™ minifigure, plus blaze, small magma cube and baby zombie pigman figures, and a ghast figure that shoots fireball-decorated discs.\nFeatures a buildable Minecraft™ Nether setting with portal, flames, mushrooms and lava-flow function, plus a minecart and a curved rail track system.\nCheck out the new-for-January-2018, larger ghast with its 9 tentacles, deep-set red eyes and disc-firing function–shoots 2 discs without reloading!\nGrab your diamond sword, jump aboard the minecart and journey through the portal to reach the Nether!\nBattle the ferocious, flying blaze and the fireball shooting ghast, and mine glowstone that really glows in the dark!\nActivate the lava-flow function to send the lava crashing down.\nWeapons include a sword and a pickaxe.\nAccessory elements include a red potion, shield, chest, bed, magma block, nether quartz ore and mineable glowstone ore elements.\nSet your imagination free—rebuild the set for more LEGO® Minecraft™ creations!\nThis children's toy includes over 470 pieces and is suitable for ages 8+.\nMeasures over 6” (16cm) high, 7” (19cm) wide and 9” (24cm) deep."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-chicken-coop-21140","description":"Have fun tending to the chickens at the Chicken Coop, featuring an elevated henhouse that delivers eggs directly into a chest. Enjoy hands-on Minecraft™ adventures with this LEGO® Minecraft set—designed for young fans of the highly successful sandbox video game. Combine this set with other LEGO Minecraft models to create your own unique LEGO Minecraft universe. Includes an Alex LEGO Minecraft minifigure, plus baby chicken and tamed wolf figures, and 2 chicken figures.\n\nIncludes an Alex LEGO® Minecraft™ minifigure, plus baby chicken and tamed wolf figures, and 2 chicken figures.\nFeatures a buildable Minecraft™ chicken farm setting with an elevated henhouse that delivers egg elements directly into a chest, plus a decorative chicken banner, chicken pen with opening gate, furnace, and a water and grass area with plants.\nTempt the chickens into the pen with the seeds.\nPlace the eggs into the henhouse and retrieve them from the chest.\nRemove the henhouse roof to access the interior.\nAlso includes an axe element.\nAccessory elements include a bone, feather, seeds and 2 eggs.\nSet your imagination free—rebuild the set for more LEGO® Minecraft™ creations!\nThis fun toy includes over 195 pieces and is suitable for ages 7-14.\nMeasures over 4” (11cm) high, 5” (14cm) wide and 5” (14cm) deep."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-skull-arena-21145","description":"Dodge the slime shooter and defeat your opponent to claim the prize golden apple, and battle the killer bunny to get the healing potions and a chest containing a shield and bow. Enjoy hands-on Minecraft™ adventures with this LEGO® Minecraft 21145 The Skull Arena set—designed for fans of the highly successful video game. Combine with other sets to create your own unique LEGO Minecraft universe. Also includes 2 player minifigures, each with their own unique Minecraft skin.\n\nIncludes 2 LEGO® Minecraft™ minifigures, each with their own unique Minecraft skin, plus a killer bunny figure. ● Features a buildable LEGO® Minecraft™ Skull Arena setting with a large skull-shaped structure, lava, green and blue player podiums, platform with golden apple and a flick missile shooter that fires a slime missile element. ● Grab your gold sword or axe and dodge the slime shooter as you battle to win the golden apple. ● Defeat the killer bunny to get the healing potions and chest containing a shield and bow. ● Weapons include a bow and a golden axe and sword. ● Accessory elements include 2 red healing potions, chest and a shield. ● Set your imagination free—rebuild the set for more LEGO® Minecraft™ creations! ● This set includes over 195 pieces. ● The Skull Arena measures over 4” (11cm) high, 9” (24cm) wide and 6” (16cm) deep."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/the-zombie-cave-21141","description":"Activate the TNT function to blast your way into the bat-infested Zombie Cave. Battle a zombie and a baby zombie, and mine for coal, redstone, gold and diamond ores. Enjoy hands-on Minecraft™ adventures with this LEGO® Minecraft set—designed for young fans of the highly successful sandbox video game. Combine this set with other LEGO Minecraft models to create your own unique LEGO Minecraft universe. Also includes a Steve LEGO Minecraft minifigure.\n\nIncludes a Steve LEGO® Minecraft™ minifigure, plus zombie, baby zombie and bat figures.\nFeatures a buildable Minecraft™ cave setting with TNT blasting function, ladder, furnace, lava and coal, redstone, gold and diamond-style ore elements.\nActivate the TNT function to blast your way into the cave.\nPull the lever to send the gravel blocks tumbling.\nBattle to defeat the hostile zombie and baby zombie.\nAlso includes an iron pickaxe element.\nAccessory elements include a cookie, torch and a furnace.\nSet your imagination free—rebuild the set for more LEGO® Minecraft™ creations!\nThis popular kids toy includes over 240 pieces and is suitable for ages 7-14.\nMeasures over 4” (11cm) high, 7” (19cm) wide and 5” (14cm) deep."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/bigfig-creeper-and-ocelot-21156","description":"Kids can enjoy real-world Minecraft™ adventures on a big scale with 2 buildable toy characters from the popular video game – a BigFig Creeper™ and an Ocelot. This Minecraft toy provides hours of independent play and gives kids a cool Minecraft decoration for their room!Minecraft Creeper vs. Ocelot battleChildren aged 7 and up will love to recreate the familiar Minecraft confrontation between a Creeper and an Ocelot. The brick building toys are easy to assemble and look amazing. Movable feet anda head that turns give the Creeper authentic mobility, and the yellow, spotted Ocelot is quick to react with its posable head, legs and tail. Easy to position – great to play and display!Big fun with Minecraft BigFig giftsLEGO® Minecraft BigFig sets are supercool, super-collectible and, best of all for adults, a super Christmas or birthday gift for kids. Designed to put open-ended creative play in youngsters’ hands, they’re extra-large for extra enjoyment and take Minecraft fun to new heights!\nBring the excitement of Minecraft™ into the real world. This BigFig Creeper™ and Ocelot are recreations of the iconic video game characters. Cool, collectible and great for play and display.\nThe extra-large, easy-to-build Creeper™ and Ocelot add a whole new physical dimension to the Minecraft™ game. Movable limbs maximize possibilities for independent play and action poses.\nWhether creating favorite scenes or their own adventures, Minecraft™ players discover new ways to play with LEGO® Minecraft. With a range of BigFig figures to collect, the play and display possibilities are endless!\nIdeal for Minecraft™ players aged 7 and up or anyone wanting to expand their Minecraft merchandise collection. Requires only very basic building skills. Great Christmas, birthday or any-other-day gift.\nAt over 4” (10cm) tall, the BigFig Creeper™ offers Minecraft™ fun on a large scale – whether sharing an adventure with the Ocelot (over 1” or 5cm tall) or spreading panic among other LEGO® MinecraftBigFigs.\nNo batteries needed. Hands-on play powered by kids’ imaginations boosts critical thinking and problem-solving skills. And, because it’s battery-free, the fun never ends!\nSimple, clear instructions get kids building and playing without delay. And, once they begin, the Minecraft™ fun doesn’t stop – whether the BigFigs are used to create exciting adventures or an awesome display.\nEvery LEGO® Minecraft™ BigFig toy expands the Minecraft online world into the physical world. With high-quality, authentic-looking models, LEGO Minecraft sets take kids’ play experience into a new dimension!\nLEGO® toys meet the highest industry standards, so they are consistent, compatible and connect and pull apart easily – and it’s been that way since 1958.\nAs well as meeting the highest global safety and quality standards, The LEGO Group drops, squashes, twists, heats, bends, scratches and stretches LEGO® bricks and pieces so you can be sure your toy is safe for your child."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/bigfig-pig-with-baby-zombie-21157","description":"Minecraft™ players can bring the game’s online excitement to life with a LEGO® Minecraft BigFig Pig and Baby Zombie. This large-scale set inspires endless independent play and provides cool Minecraft decorations that kids will love to display in their rooms!Give kids the 3D Minecraft toy experience!Children aged 7 and up will love to continue their Minecraft adventures in the real world. Pig and Baby Zombie are buildable, posable toys designed to give kids hands-on Minecraft fun wherever they are. The lovable, pink Pig’s head and legs are movable, and so are the cute, green-faced Baby Zombie’s head, legs and arms. Pig is even happy to let Baby Zombie ride on its back!Make Minecraft Mega – with LEGO® BigFig sets!LEGO® Minecraft BigFig sets are supercool, super- collectible and, best of all for adults, a super Christmas or birthday gift for kids. BigFigs are extra-large for extra enjoyment, and they put hands-on, open-ended creative play in Minecraft players’ hands!\nPut Minecraft™ adventures into kids’ hands with LEGO® BigFig Pig and Baby Zombie. These authentic real-world models of the iconic video game characters are great to play with, to display and to collect.\nBig and easy to build, LEGO® brick BigFig Pig and Baby Zombie toys feature a realistic design with movable limbs to maximize play possibilities. And when the action stops, they look great as decorations in kids’ rooms.\nGive kids new ways to play Minecraft™. Whether kids are recreating favorite Minecraft scenes or making up adventures of their own, LEGO® BigFigs add a whole new physical dimension to the popular computer game.\nGreat gift for Minecraft™ players! Cool Christmas, birthday or any-other-day present for boys and girls aged 7 and up. Only requires basic building skills and combines with other LEGO® Minecraft BigFig sets.\nAt over 4” (10cm) long and 2” (6cm) high, the BigFig Pig offers Minecraft™ fun on a large scale – whether having adventures with Baby Zombie at over 2” (7cm) tall or with other BigFigs from the LEGO® Minecraft collection.\nBattery-free fun, so the enjoyment never ends! Real-world, hands-on play powered by kids’ imaginations gets them off the PC and boosts their thinking, problem-solving and social skills.\nGet kids building and playing with their toys quickly! Simple, clear instructions ensure the fun starts straight out of the box.\nEvery LEGO® Minecraft™ BigFig toy brings Minecraft’s online excitement into the real world. With high-quality, authentic-looking models, LEGO Minecraft sets take kids’ play experience into a new dimension!\nBecause LEGO® toys meet the highest industry standards as well as our own quality criteria, they are consistent, compatible and connect and pull apart perfectly every time – and it’s been that way since 1958.\nAt The LEGO Group, we drop, squash, twist, heat, bend, scratch and stretch LEGO® bricks and pieces to ensure they meet the highest global safety and quality standards – and you can be certain yourchild is safe."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/alex-key-chain-853819","description":"Put your keys in safe hands with this LEGO® Minecraft™ Alex Key Chain. Attach the Alex minifigure on a durable metal ring and chain to your keys or backpack and enjoy her company wherever you venture.\n\nFeatures a LEGO® Minecraft™ Alex minifigure attached to a durable metal ring and chain.\nAttach it to your keys or backpack.\nMinifigure is not detachable from metal chain."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/creeper-key-chain-853956","description":"Put a notorious mob on guard with this LEGO® Minecraft™ 853956 Creeper™ Key Chain. Attach the Creeper minifigure on a durable metal ring and chain to your keys or backpack to add a touch of iconic LEGO Minecraft style.\n\nFeatures a LEGO® Minecraft™ Creeper™ minifigure attached to a durable metal ring and chain.\nAttach it to your keys, bag or backpack.\nMinifigure is not detachable from metal chain."},{"theme":"minecraft","themeUrl":"https://www.lego.com/en-us/themes/minecraft","productUrl":"https://www.lego.com/en-us/product/steve-key-chain-853818","description":"Take Steve on your adventures with this fun key chain. Attach the LEGO® Minecraft™ Steve minifigure on a durable metal ring and chain to your keys or backpack and enjoy his company all day long.\n\nFeatures a LEGO® Minecraft™ Steve minifigure attached to a durable metal ring and chain.\nAttach it to your keys or backpack.\nMinifigure is not detachable from metal chain."}]