[{"theme":"minions","themeUrl":"https://www.lego.com/en-us/themes/minions","productUrl":"https://www.lego.com/en-us/product/brick-built-minions-and-their-lair-75551","description":"Kids who love Minions will go wild for this LEGO® building toy for kids (75551). First, they can build an eye-catching, brick-built version of Kevin and Stuart. Then they can turn the models around to reveal the room playset inside, complete with accessories, such as tools, hats and weapons, plus figures for role play. Kids can construct 2 toy Minion models at a time and then rebuild Kevin into Bob.\n\nExplore with the Minions\nYoung Minion fans will love seeing all the intricate details inside the rooms. Each one matches a different Minion’s unique personality and all feature turning eyes. Kids can create inventions in the lab with Kevin or watch Stuart take a nap in his bedroom. Kevin rebuilds into Bob, who’s practicing kung fu.\n\nCreative fun and a rewarding build\nThis awesome set comes with Instructions PLUS, an interactive guide that makes building these models extra fun. Available in the free LEGO Life app for smartphones and tablets, it features tools to help kids build independently.\n\nA creative building set that lets Minions fans build their favorite Minion character. Kids can build both Kevin and Stuart, and then rebuild Kevin into Bob.\nOnce the character is built, the fun goes on. Kids will love seeing the eyes turn. Then they can explore the intricate room playset inside, using the fun accessories to create their own Minion stories.\nInspired by the Minions: The Rise of Gru movie, kids can explore kung fu with Bob, build inventions with Kevin or let Stuart take a nap in his bedroom.\nMakes a great birthday present for kids aged 8 and up who love Minions toys. After playing with their creation, kids will love putting their models on display.\nEach brick-built LEGO® Minion measures over 3” (9cm) long and 4” (11cm) wide. Kevin is over 5” (15cm) tall, Stuart is 5” (14cm) tall and Bob is 4” (12cm) tall, making them ideal for play and display.\nPowered by kids’ imaginations! No batteries are needed with this Minions building toy for kids.\nWith Instructions PLUS, even younger builders can enjoy a sense of achievement from building independently.\nEach LEGO® Minions set encourages creative fun as children role-play scenes from the Minions: The Rise of Gru movie.\nLEGO® building bricks meet the highest industry standards, plus the LEGO Group’s own quality criteria. This ensures they are consistent, compatible and connect and pull apart easily every time.\nLEGO® Minions bricks and pieces are thoroughly tested to make sure every playset meets the highest global safety standards."},{"theme":"minions","themeUrl":"https://www.lego.com/en-us/themes/minions","productUrl":"https://www.lego.com/en-us/product/unstoppable-bike-chase-75549","description":"Give your young Minions fan an action-packed ride with this LEGO® Minions Unstoppable Bike Chase (75549) buildable toy motorbike set. With 3 figures – Gru, Bob and Stuart – the action starts fast and never slows down. Fans will love building the motorbike before role-playing favorite scenes from the Minions: The Rise of Gru movie.\n\nRole-play with favorite Minion characters\nKids will love putting Gru on the motorbike. Minions Bob and Stuart can sit up front, ride behind Gru or take a trip on the rocket skates.\n\nKids learn to build\nLEGO Minions building toys for kids bring the mischievous world of the Minions to any home. Instructions PLUS is an interactive guide that makes building this model extra fun. Available in the free LEGO Life app for smartphones and tablets, it has zoom and rotate viewing tools to help even younger children build the LEGO brick versions independently.\n\nThere are lots of ways to play with this fun set. Gru’s on a mission and kids can help by putting the Minions on the front of the bike, pulling them along on the rocket skates, or giving them a toy banana treat.\nAn action-packed Minions toy motorbike building set (75549), featuring Gru, Stuart and Bob toy figures. Kids can enjoy full-speed action as they role-play epic scenes from the Minions: The Rise of Gru movie.\nRole play is easy with this toy motorbike set. With 3 figures, including the exclusive Gru LEGO® minifigure, only available in this set, kids will love making up their own Minion stories.\nLooking for a birthday present or exciting treat for a Minions fan aged 6 and up? This is a great choice. Ideal for creative fun, it’s an awesome toy for kids who love building toys and Minion escapades.\nThis toy motorbike measures over 3” (10cm) high, 5” (13cm) long and 1” (5cm) wide, making it just the right size for creative play.\nWant to inspire creative fun? Great news: This Minions toy set is powered by kids’ imaginations – not batteries.\nWith Instructions PLUS, available in the free LEGO® Life app, kids aged 6 and up can learn to build independently, giving them a sense of achievement as they learn new skills.\nWith fun characters and imaginative stories to tell, each LEGO® Minions playset encourages children to role-play scenes from the Minions: The Rise of Gru movie.\nLEGO® building bricks meet the highest industry standards, plus the LEGO Group’s own quality criteria. This ensures they are consistent, compatible and connect and pull apart easily every time.\nLEGO® Minions bricks and pieces are thoroughly tested to make sure every playset meets the highest global safety standards."}]