[{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/mf-set-summer-celebration-40344","description":"Bring summer fun to LEGO® play with this LEGO Iconic 40344 Summer Celebration Minifigure Set, including a new-for-June-2019 ice cream vendor and pink parrot, plus a diver, surfer and a bather, all ready for a day at the beach. This colorful minifigure collection also includes a brick-built ice cream cart with parasol, ice pops and an ice cream cone, a surfboard, diver's helmet and flippers, jewel element, a red crab and a parrot perch. A great addition to any LEGO set and the perfect gift for youngsters who love creative role-play.\n\nIncludes 4 minifigures: a new-for-June-2019 ice cream vendor, plus a diver, surfer and bather.\nAlso includes a new-for-June-2019 pink parrot figure.\nAccessories include a surfboard, jewel element, diver’s helmet and flippers, a red crab, parrot perch, and an ice cream cart with parasol, ice pops and ice cream cone.\nA sunny addition to any LEGO® set.\nAn ideal gift for kids who love creative role-play."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/police-mf-accessory-set-40372","description":"Kids can ramp up the action with this LEGO® City Police MF Accessory Set (40372), including LEGO City Adventures TV series hero Duke DeTain, a police officer and 2 crook minifigures. Fans of the TV series can enjoy creating and reenacting scenes from the show. And with a bank ATM setting, crook's sack truck, plus walkie-talkie, crowbar and dynamite accessories, the scene is set for hours of imaginative, crook-catching fun.\nKids aged 6 and up can boost the crook-catching action with this LEGO® Police MF Accessory Set. An exciting addition to any LEGO playset and an ideal introduction set for budding police officers.\nIncludes LEGO® City TV hero Duke DeTain, police officer and 2 crook minifigures, plus a bank setting, crook's sack truck and walkie-talkie, crowbar and dynamite accessories.\nATM setting measures over 1” (5cm) high, 1” (3cm) wide and 1” (3cm) deep."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/series-21-71029","description":"Kids can bring exciting play possibilities to any LEGO® set with these fun, treat-sized, LEGO Minifigures Series 21 (71029) toys. This new-for-January-2021 series features a great lineup of exclusive LEGO people and characters to collect and display or to take play in thrilling new directions.\n\nImaginative character lineup\nChildren and adult fans can say “Hi!” to a new, limited-edition range of characters, including Centaur Warrior, Shipwreck Survivor, Pug Costume Guy, Beekeeper, Ladybug Girl, Violin Kid, Alien, Space Police Guy, Ancient Warrior, Airplane Girl, Cabaret Singer and Paddle Surfer.\n\nSurprising and fun\nEach finely crafted, highly detailed minifigure comes in a sealed ‘mystery’ bag with one or more accessory elements and a collector's leaflet, making a great little gift that will put a smile on anyone's face.\n\nMore LEGO® toy people and characters! Boost endless play with these cool LEGO Minifigures Series 21 (71029) bags. A fun treat for kids and fans of any age.\nWhat’s in the bag? 1 of 12 unique, buildable characters to discover, plus one or more accessories and a collector's leaflet. A great addition to any LEGO® collection that will inspire new play.\nLEGO® Minifigures characters will appeal to any boy or girl aged 5 and up, inspiring their imaginations and helping them build creativity andconfidence through individual play or with friends.\nThese limited-edition, high-quality minifigures and accessories make a perfect unexpected gift.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart consistently every time – it's been that way since 1958.\nLEGO® components are dropped, squashed, twisted, heated, bent, scratched and stretched to make sure they meet stringent global safety standards."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/hogwarts-students-acc-set-40419","description":"Make any child’s Harry Potter™ role-play fun even more magical with the LEGO® Harry Potter Hogwarts™ Students Accessory Set (40419). From Gryffindor™, Harry Potter carries his wand and Marauder’s map. From Slytherin™, Draco Malfoy™ clutches a wand and an apple. From Hufflepuff™, Hannah Abbott holds her wand and a lantern. From Ravenclaw™, Cho Chang has a wand and a book – and there's even a bookshelf for the book to sit on when she's finished reading.\nIncludes 4 Hogwarts™ student minifigures dressed in their House uniforms with accessories to enhance the play possibilities of any LEGO® Harry Potter™ playset.\nThe Harry Potter™ minifigure has a wand and Marauder’s map; the Draco Malfoy™ minifigure has a wand and an apple; the Hannah Abbott minifigure has a wand and lantern; and the Cho Chang minifigure has a wand and a book.\nAlso includes a buildable bookshelf.\nWith 53 pieces, this versatile set is suitable for anyone aged 6 and up."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/fairground-mf-acc-set-40373","description":"Roll up, roll up for family fun with this LEGO® Iconic Fairground Minifigure Accessory Set (40373)! This colorful playset for kids features a buildable mini shooting range with a stud shooter – knock down the gold-colored can to win 1 of the cute teddy bear figures. It also includes a girl, dad and 2 fairground employee minifigures with fun accessories to inspire creative play. This accessory set is an ideal gift for ages 6+ to add to their LEGO collections and open up even more play options.\nKids can recreate the fun of the fair with this LEGO® Iconic Fairground Minifigure Accessory Set, featuring a buildable mini shooting range with a stud shooter and 2 cute teddy bear figures as prizes for action play.\nThe playset has 4 minifigures – a girl (with new-for-January 2020 face print and unicorn clothing decoration), her dad and 2 fairground employees – with a bullhorn and 2 ice cream accessory elements for creative play.\nThis construction kit makes an ideal birthday or holidaygift for kids aged 6 and up to use with their other LEGO® sets. It comes with easy-to-follow instructions so even first-time builders can build with confidence."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/golden-zane-mf-acc-set-40374","description":"Dedicated NINJAGO® fans will love to recreate thrilling action scenes from season 3 of the TV series with this cool LEGO® Golden Zane Minifigure Accessory Set (40374). An exclusive minifigure to this set, Golden Zane can be used by kids to role-play battles against a dangerous army of Nindroids and a unique crawler vehicle in the digital world of Digiverse. Kids are guaranteed to be entertained for hours as they escape into this exciting fantasy realm.\nYoung builders with imaginative minds will be thrilled to create and play with this action-packed LEGO® Golden Zane Minifigure Accessory Set, featuring 4 minifigures and, exclusive to this set, a unique crawler vehicle.\nThe set contains a Golden Zane minifigure, a Nindroid with a cool backpack, and 2 fearsome Overlord warriors, each with a sword, so kids can stage exciting stories.\nThis is an ideal gift for kids aged 6 and up, who can combine it with their other NINJAGO® toys. There is no need for batteries and it comes with simple instructions to guide youngsters through the building process."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/spider-man-and-the-museum-break-in-40343","description":"Help Spider-Man protect the museum artefacts in LEGO® Marvel Spider-Man and the Museum Break-In, with 3 minifigures, an extra Spider-Man head element, web shield and buildable drone."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/knightmare-batman-acc-set-2018-853744","description":"Let the battle commence against the Parademons with this LEGO® DC Super Heroes 853744 Knightmare Batman™ Accessory Set. This cool toy for kids features Batman’s turret with 2 stud shooters and 3 minifigures with assorted weapons, including the new-for-September-2018 Knightmare Batman minifigure and his rifle with an attachable LEGO tile of The Joker's face.\n\nIncludes a new-for-September-2018 Knightmare Batman™ and 2 Parademon™ minifigures with detachable wings.\nBatman’s turret features 2 stud shooters.\nWeapons include Batman’s rifle (with an attachable decorated LEGO® tile of The Joker’s face) and the Parademons' 2 stud shooters.\nRecreate the famous Knightmare scene from the Batman™ v Superman™: Dawn of Justice movie.\nTurret measures over 1” (3cm) high and 1” (5cm) wide."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/tlm2-accessory-set-2019-853865","description":"Build a defense against alien invaders with THE LEGO® MOVIE 2™ 853865 Accessory Set 2019, featuring a car fort, including a stud shooter, fender and headlight-style elements. This small construction toy also includes Emmet and Apocalypseburg citizen minifigures, plus 2 new-for-February-2019 sewer babies—and makes a great addition to other THE LEGO MOVIE 2 playsets.\n\nIncludes 2 minifigures: Emmet and an Apocalypseburg citizen, plus 2 new-for-February-2019 sewer babies.\nFeatures a buildable car fort with a stud shooter, fender and headlight-style elements, plus a spear.\nCar fort measures 1” (4cm) high, 2” (6cm) wide and 1” (5cm) deep."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/mf-set-ninjago-2019-40342","description":"Get set for exciting adventures with this 40342 LEGO® NINJAGO® 2019 Minifigure Set for kids. Youngsters will love playing out battles against bad guys Pyro Destroyer and Blizzard Archer with ninja hero Kai in his Legacy outfit and a new-for-June-2019 minifigure of legendary explorer Clutch Powers. Each minifigure has a weapon and the set also includes a brick-built weapon rack with additional weapon accessories. A great gift for youngsters to use with their LEGO NINJAGO construction toys for creative role-play.\n\nIncludes 4 LEGO® NINJAGO® minifigures: Clutch Powers, Kai (in Legacy outfit), Pyro Destroyer and Blizzard Archer.\nClutch Powers minifigure is new for June 2019.\nWeapons include Clutch Powers’ whip, Kai’s katana, Pyro Destroyer’s flame torch and Blizzard Archer's ice spear, plus Pyro Destroyer's shield element.\nAlso includes a brick-built weapon rack with additional weapon accessories.\nAn ideal gift for kids to use with their LEGO® NINJAGO® building sets."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/dc-super-heroes-series-complete-box-66638","description":"Kids and fans with a passion for super heroes will love these awesome LEGO® Minifigures (66638) DC Super Heroes Series collectible sets. Children and adult fans can collect a range of character toys, old and new, from the expansive DC Universe, including Aquaman™, Batman™, Bat-Mite™, BUMBLEBEE, Cyborg™, The Flash™, Green Lantern™, Metamorpho™, Mister Miracle™, Sinestro™, Wonder Woman™, Superman™, The Joker™, Huntress™, The Cheetah™ and Stargirl™. Each of the finely crafted, highly detailed minifigures comes in a sealed mystery bag with one or more accessory elements to add to the fun, a collector's leaflet with information on the character and a posing brick to display them in different poses.\n60 Limited Edition LEGO® Minifigures characters to build and play out your very own adventures! The full case contains 60 individual bags and at least one complete collection of all 16 minifigures in the series.\nInspire thrilling super-hero role play with these cool minifigures. A great gift for kids and fans of the DC Universe. Play starts straight out of the bag! These also make great collectibles for fans of any age.\nWhat’s in the bag? Kids can discover super heroes or villains they've never met before to add to their LEGO® Minifigures collections, with different characters from the DC Universe comic books.\nThese awesome characters are great for independent play, where kids can help their favorite super heroes face off against villains and save the day, be part of new stories with other models or collect and display.\nAny fan of the DC Universe will love these unique collectible super heroes. The detailed LEGO® minifigures (66638) and their accessories will thrill any kid and make a great gift for boys and girls aged 5+.\nSmall yet mighty. The individual mystery bags each contain 1 of 16 DC Universe super hero minifigures, complete with one or more accessories and a posing brick. Totally portable and ready for play and display.\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills, plus it gives them the joy of imagining new stories all on their own.\nOpen the bag and the play begins with assembling the minifigure. Easy-to-follow instructions make building a snap, giving kids the joy of constructing their own cool super-hero toy - and loads of creative fun.\nGive youngsters iconic characters for play or display with LEGO® Minifigures collectibles. These fun, mini playsets offer open-ended play that helps build children’s creativity and imagination skills.\nLEGO® bricks meet the highest industry standards and quality criteria, so they are consistent, compatible and connect and come apart easily every time – it's been that way since 1958.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® bricks and pieces to make sure every kid's building toy meets the highest global safety and quality standards.\nPLEASE NOTE: Each ‘mystery’ bag contains one of the 16 DC Super Heroes minifigure characters available in this collection. This box includes 60 'mystery' bags, and at least one complete collection."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/series-21-6-pack-66657","description":"Know a LEGO® fan who loves playing with minifigures? Give them a neat surprise with this pack of 6 collectible figures from the LEGO Minifigures Series 21. This series features a great lineup of exclusive LEGO people to collect and display or to play with. Children and adult fans will all love this imaginative collection with characters including Centaur Warrior, Beekeeper, Alien and Paddle Surfer. Each limited-edition minifigure comes with loads of details, plus 1 or more cool accessories.\nDiscover a host of colorful personalities with this pack of 6 collectible characters from the LEGO® Minifigures Series 21. It’s a fun treat for LEGO fans of all ages.\nThis pack includes 6 unique, buildable characters from a series of 12, with accessories and a collector’s leaflet. A great addition to any LEGO® collection to inspire role play.\nLEGO® Minifigures characters will appeal to any boy or girl aged 5 and up, inspiring their imaginations and helping them develop creativity through individual play or with friends."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/dc-super-heroes-series-71026","description":"Kids and fans with a passion for super heroes will love these awesome LEGO® Minifigures (71026) DC Super Heroes Series collectible sets. Each mystery bag contains 1 of 16 different super-hero or villain characters from the DC Universe. Outstanding character lineup Children and adult fans can collect a range of character toys, old and new, from the expansive DC Universe, including Aquaman™, Batman™, Bat-Mite™, BUMBLEBEE, Cyborg™, The Flash™, Green Lantern™, Metamorpho™, Mister Miracle™, Sinestro™, Wonder Woman™, Superman™, The Joker™, Huntress™, The Cheetah™ and Stargirl™. Exciting accessories and posing brick for display Each of the finely crafted, highly detailed minifigures comes in a sealed mystery bag with one or more accessory elements to add to the fun, a collector's leaflet with information on the character and a posing brick to display them in different poses.\nInspire thrilling super-hero role play with these cool minifigures. A great gift for kids and fans of the DC Universe. Play starts straight out of the bag! These also make great collectibles for fans of any age.\nWhat’s in the bag? Kids can discover super heroes or villains they've never met before to add to their LEGO® Minifigures collections, with different characters from the DC Universe comic books.\nThese awesome characters are great for independent play, where kids can help their favorite super heroes face off against villains and save the day, be part of new stories with other models or collect and display.\nAny fan of the DC Universe will love these unique collectible super heroes. The detailed LEGO® minifigures (71026) and their accessories will thrill any kid and make a great gift for boys and girls aged 5+.\nSmall yet mighty. These mystery bags each contain 1 of 16 DC Universe super hero minifigures, complete with one or more accessories and a posing brick. Totally portable and ready for play and display.\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills, plus it gives them the joy of imagining new stories all on their own.\nOpen the bag and the play begins with assembling the minifigure. Easy-to-follow instructions make building a snap, giving kids the joy of constructing their own cool super-hero toy - and loads of creative fun.\nGive youngsters iconic characters for play or display with LEGO® Minifigures collectibles. These fun, mini playsets offer open-ended play that helps build children’s creativity and imagination skills.\nLEGO® bricks meet the highest industry standards and quality criteria, so they are consistent, compatible and connect and come apart easily every time – it's been that way since 1958.\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® bricks and pieces to make sure every kid's building toy meets the highestglobal safety and quality standards."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/series-20-71027","description":"Kids can bring exciting new play possibilities to any LEGO® set with LEGO Minifigures (71027) Series 20. This new-for-September-2020 LEGO minifigure series features a colorful lineup of unique LEGO people to collect and display or use with existing playsets to take the stories in new, fun directions.\n\nEntertaining character lineup Children and adult fans can say hi to a new range of LEGO people toys, including Pajama girl, Piñata boy, Peapod costume girl, Sea rescuer, Pirate girl, Martial arts boy, Breakdancer, Super warrior, Brick costume guy, Llama costume girl, Space fan, Athlete, Tournament knight, 80s musician, Drone boy and Viking.\n\nExciting accessories and a collector’s leaflet\nEach of the finely crafted, highly detailed minifigures comes in a sealed mystery bag with one or more accessory elements to add to the fun, plus a collector’s leaflet.\n\nInspire fun role-play with these delightful LEGO® Minifigures Series 20 (71027) bags. A great gift for kids and fans of any age who love collecting the assorted community people. Play starts with opening the bag!\nWhat’s in the bag? Kids can discover unique characters they’ve never met before to add to their LEGO® Minifigures collections or introduce into another LEGO set they own, with 16 detailed, buildable minifigures.\nThese awesome characters are great for independent play, where kids can develop new stories for each different minifigure, be part of stories with other models, or collect and display them all.\nAny fan of LEGO® Minifigures bags will love these unique collectible characters. The detailed minifigures and their accessories will thrill any kid and make a great treat gift for boys and girls aged 5+.\nSmall and playful. These mystery bags each contain 1 of 16 unique minifigures, complete with one or more accessories, like a toy rocket or rescue toys, and a collector’s leaflet. Totally portable and ready for action.\nPowered by a child’s imagination for hours of endless fun! Battery-free toys help boost kids’ independent play and problem-solving skills, plus it gives them the joy of imagining new stories all on their own.\nOpen the bag and the play begins with assembling the minifigure toy. Easy-to-follow instructions make building a snap, giving kids the joy of constructing their own awesome character and loads of creative fun.\nGive youngsters iconic characters to play or display with LEGO® Minifigures collectibles. These fun, mini playsets offer open-ended play that helps build children’s creativity and imagination skills.\nLEGO® bricks meet the highest industry quality criteria, so they are consistent, compatible and connect and come apart easily every time – it’s been that way since 1958.\nLEGO® bricks and pieces are dropped, squashed, twisted, heated, bent, scratched and stretched to make sure every kid’s building toy meets the highest global safety and quality standards."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/ninjago-acc-set-2019-853866","description":"Gear up for battle with the LEGO® NINJAGO® 853866 Accessory Set 2019, featuring the Oni villains from Series 10 of the NINJAGO Masters of Spinjitzu TV series. This action-packed little set has 3 new-for-January-2019 Oni minifigures, including one with iconic horn elements, and assorted weapons.\n\nFeatures 3 Oni demon minifigures—one with horn elements—with 4 swords and other assorted weapons."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/harry-potter-series-2-71028","description":"Magic can be found everywhere! Kids and fans will love these awesome LEGO® Minifigures (71028) Harry Potter™ Series 2 collectible bags. Each mystery bag contains 1 of 16 different toy characters from the Harry Potter series.\n\nAmazing character lineup for creative activities\nFans young and old can collect, play with or display some great character toys from the Harry Potter series, including Harry Potter, Hermione Granger™, Ron Weasley™, Ginny Weasley™, Fred Weasley, George Weasley, Luna Lovegood™, Moaning Myrtle, Griphook, Headmaster Albus Dumbledore™, Professor Sprout, Neville Longbottom™, Kingsley Shacklebolt, Bellatrix Lestrange, Lily Potter and James Potter.\n\nCool accessories and collectible toys\nEach of the finely crafted, highly detailed minifigures comes in a sealed mystery bag with 1 or more accessory elements to add to the action, including some never-before-seen accessories for certain characters, plus a collector’s leaflet with character information.\n\nImmerse fans in wizarding role play with these cool LEGO® Minifigures (71028) Harry Potter™ Series 2 sets. Play starts straight out of the bag! These make great gifts and collectibles for fans of any age.\nWhat’s in the bag? Kids can find characters from the Harry Potter™ movies to add to their LEGO® Minifigures (71028) collection or Harry Potter sets. Each minifigure comes with 1 or more accessories and an information leaflet.\nThese awesome minifigures are great for imaginative play, where kids can adventure with their favorite characters in current sets that they own, make them part of new stories with other models or collect them to display.\nAny Harry Potter™ fan will love these unique collectible toys. The detailed LEGO® Minifigures and their accessories will thrill any kid and make a great gift for boys and girls aged 5 and up.\nSmall yet mighty! These mystery bags each contain 1 of 16 awesome Harry Potter™ universe minifigure toys, complete with one or more accessories. Totally portable and ready for play or display.\nAre you Hufflepuff, Slytherin, Ravenclaw or Gryffindor? Powered by a child’s imagination for hours of fun! Battery-free toys help boost kids’ creative and group play skills and lets them imagine new stories on their own.\nOpen the bag and the play begins with assembling the minifigure. Easy-to-follow instructions make building a snap, giving kids the joy of constructing their own fun collectible toy - and loads of creative play.\nGive youngsters iconic characters for play or display with LEGO® Minifigures collectibles. These fun, mini playsets offer open-ended play that helps build children’s creativity and imagination skills.\nLEGO® bricks meet the highest industry standards and quality criteria, so they are consistent, compatible and connect and come apart easily every time – it’s been that way since 1958.\nLEGO® bricks are dropped, heated, crushed, twisted and analyzed to make sure every kid’s building toy meets the highest global safety and quality standards."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/lego-mf-display-case-16-red-5004892","description":"Exhibit your favorite collectible minifigures in this attractive, red LEGO® Minifigure display case, featuring a transparent clasp door and 16 separate compartments, each with a gray baseplate to keep your minifigures perfectly posed. This sturdy case is suitable for wall mounting or display on a flat surface, and features large LEGO studs for stacking multiple cases as your collection grows!\n\nFeatures 16 separate compartments with gray baseplates, transparent clasp door and a red base and top with large LEGO studs for stacking multiple cases\nSuitable for wall mounting or display on a flat surface\nExhibit, carry and store your favorite minifigures!\nCollect and stack multiple LEGO Minifigure Display Cases for an impressive display!\nMeasures over 7\" (18cm) high, 15\" (37cm) wide and 1\" (4cm) deep"},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/lego-minifigure-display-case-16-5005375","description":"Exhibit your favorite collectible minifigures in this attractive black LEGO® Minifigure Display Case, featuring a transparent clasp door and 16 separate compartments, each with a gray baseplate to keep your minifigures perfectly posed. This sturdy case is suitable for wall mounting or display on a flat surface, and features 8 large LEGO studs for stacking multiple cases as your collection grows!\n\nFeatures 16 separate compartments with gray baseplates, transparent clasp door, and a black base and top with 8 large LEGO® studs for stacking multiple cases.\nSuitable for wall mounting or display on a flat surface.\nExhibit, carry and store your favorite minifigures!\nCollect and stack multiple LEGO® Minifigure Display Cases for an impressive display.\nMeasures over 14” (37cm) high, 7” (18cm) wide and 1” (4cm) deep."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/lego-minifigure-display-case-16-blue-5005772","description":"Let children show their favorite minifigures with pride with this LEGO® 5005722 Minifigure Display Case in blue. Featuring 16 individual compartments with baseplates and opening doors, this plastic display case is stackable and can stand on any flat surface or be mounted on a wall for a stylish display.\n\nFeatures a LEGO® brick design for easy stacking, 16 minifigure compartments, each with a LEGO baseplate, and 2 transparent clasp doors at the front.\nMeasures over 14” (38cm) high, 7” (18cm) wide and 1” (4cm) deep."},{"theme":"minifigures","themeUrl":"https://www.lego.com/en-us/themes/minifigures","productUrl":"https://www.lego.com/en-us/product/display-case-8-black-5006152","description":"LEGO® fans can display their most prized LEGO minifigures with this compact, 2-level presentation case. It’ll keep up to 8 minifigures clean, tidy and safe from prying siblings! The entire case is designed like a large LEGO brick, with the interior divided into 8 compartments, perfectly sized to present the iconic LEGO minifigures at their very best. The case has a black top and bottom, transparent sides and studded baseplates in each compartment to hold figures steady at all times.\nAn easy and effective way for kids to store, protect and display up to 8 LEGO® minifigures.\nMinifigures are secured on 8 gray baseplates arranged on 2 levels. Transparent sides allow the contents to be viewed from all directions.\nMeasures over 7 in. (18 cm) high, 7.5 in. (19 cm) wide, 1.5 in. (4 cm) deep. Please note that minifigures are not included."}]