[{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/monkie-kid-s-team-secret-hq-80013","description":"Let children discover the cool features inside LEGO® Monkie Kid’s Team Secret HQ (80013). This LEGO ship toy opens up and can be divided for easy access to the detailed living area, workshop, posable mech and more. The toy crane on the deck can be used to grab the Bull Clones’ stud-shooting assault boat, and Pigsy and Mei’s fun buildable water jets add to the battle play options. A fabulous gift idea for kids, this LEGO set includes 7 minifigures with weapons, plus Sandy and Mo the cat figures to role-play exciting adventures.\n\nInteractive instructions\nCheck out Instructions PLUS, available within the free LEGO Life app, for this collectible toy. It allows children to zoom into, rotate and visualize the model while building the real thing.\n\nEducational and fun!\nInspired by Monkey King tales from the classic Journey to the West novel and rooted in China’s culture and values, LEGO Monkie Kid™ toy playsets help children to develop their creativity, bravery and resilience.\n\nThere are surprises galore inside this LEGO® Monkie Kid’s Team Secret HQ (80013) model for children, which opens out and can be divided into three for easy access to the workshop, living area, a posable mech and more.\nKids can role-play epic battles as their favorite characters, with Monkie Kid, Pigsy, Mei, General Ironclad, Snort, Grunt and Roar minifigures, a Sandy figure and Mo the cat figure, plus cool weapons like The Golden Staff.\nThis creative toy is packed with fun features to inspire play, including the LEGO® ship toy’s crane to hook the Bull Clones’ stud-shooting assault boat and jet pack, and Pigsy and Mei’s cool, stud-shooting water jets.\nAn awesome birthday, special-occasion or holiday gift idea for kids aged 10 and up, this 1,959-piece LEGO® set offers a challenging, rewarding build and many hours of enjoyment – whether playing solo or with friends.\nMonkie Kid’s Team Secret HQ measures over 15” (40cm) high, 16” (41cm) long and 9” (23cm) wide in boat mode, opening up to 35” (89cm) long, and makes an eye-catching display item in any child’s bedroom between playtimes.\nThis collectible toy playset is built solely with LEGO® bricks and powered by children’s imaginations – no batteries required – so their playtime Monkie Kid missions will never run out of energy!\nKids can enjoy a digitally enhanced building experience with Instructions PLUS, available in the free LEGO® Life app, which allows them to zoom into, rotate and visualize this unique toy while they build. Fabulous!\nEducational LEGO® Monkie Kid™ building toys, inspired by mythical tales from China of the Monkey King, help children to nurture their bravery and resilience while enjoying many hours of creative fun.\nYoungsters won’t need Monkie Kid powers to connect or pull apart LEGO® building bricks! They meet the highest industry standards, ensuring consistency, a perfect, easy connection every time and robust building.\nLEGO® bricks and pieces are tested in almost every way you can imagine to make sure that this creative toy building set for kids meets the highest global safety and quality standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/the-legendary-flower-fruit-mountain-80024","description":"Children can bring the legend of the Monkey King to life as they build this detailed LEGO® Monkie Kid™ model of the iconic Flower Fruit Mountain (80024). Every section of the premium-quality toy playset tells a different story, from how he was born to how he became king of the monkeys, with features such as an opening rock to reveal the Monkey King and a buildable waterfall that opens to allow entry to the hidden mountain cave. There are 8 minifigures, including 4 different versions of Monkey King to play out specific legendary tales.\n\nInteractive instructions\nFind clear instructions in the box and Instructions PLUS in the free LEGO Building Instructions app, which makes the construction process even more exciting for kids with intuitive tools to help them visualize the model.\n\nBuild and learn\nInspired by the classic Journey to the West novel and rooted in China’s culture, awesome LEGO Monkie Kid building toys make the best gifts for kids to help nurture their creativity and resilience.\n\nEpic tales of the legendary Monkey King come to life as children build each section of this awesome LEGO® Monkie Kid™ Flower Fruit Mountain toy playset (80024).\nIncludes 8 minifigures: Monkie Kid, Evil Macaque, Brother Monkey, Sister Monkey and 4 versions of Monkey King (Baby, Classic, Apprentice and Battle) to role-play stories from the classic tale.\nPacked with authentic, storytelling features, including an opening rock to reveal the Monkey King, a buildable waterfall that opens to allow entry to the mountain and a buildable red-crowned crane.\nRole-play battle scenes with Monkie Kid and the Evil Macaque minifigures on a rotating platform – and look out for the Chinese calligraphy.\nOffering a challenging build and unlimited play, this 1,947-piece LEGO® Monkie Kid™ construction toy makes the best birthday, holiday or surprise present for trend-setting kids aged 10 and up.\nMeasuring over 13.5 in. (34 cm) high, 27 in. (68 cm) wide and 10 in. (25 cm) deep, this unique toy will have everyone talking and makes a stunning display piece between playtime adventures.\nPrinted instructions are included, while digital Instructions PLUS, available in the LEGO® Building Instructions app, allows kids to save their progress and restart the build anytime.\nLEGO® Monkie Kid™ toy building sets are inspired by the classic Chinese novel Journey to the West and help children develop their courage, resilience and optimism while having fun.\nLEGO® components meet strict industry standards to ensure that they are compatible and connect consistently and strongly.\nLEGO® bricks and pieces are tested in almost every way imaginable to satisfy the highest global safety standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/monkey-king-warrior-mech-80012","description":"LEGO® Monkie Kid™ fans can become civilian-saving heroes with this huge, posable Monkey King Warrior Mech (80012), featuring gold-colored elements and an extendable staff. This set also features a stud-shooting Bull Clone mech toy and Pigsy’s noodle store to inspire creative storytelling. An ideal LEGO gift idea for kids aged 10 and up, it includes 6 minifigures, plus The Golden Staff, a buildable cloud for Monkie Kid and Flower Fruit Mountain mini build to recreate an iconic scene from Monkie Kid’s life story.\n\nInstructions PLUS!\nInstructions PLUS offers a digital, interactive guide to building this unique toy playset. Available in the free LEGO Life app, it has zoom and rotate viewing tools to help children build the LEGO brick models.\n\nBuild, play, learn\nInspired by Monkey King tales from the classic Journey to the West novel and rooted in China’s culture and values, LEGO Monkie Kid playsets help youngsters to grow their bravery and resilience through creative building and play.\n\nLEGO® Monkie Kid™ fans will love this huge, posable Monkey King Warrior Mech (80012), plus other cool builds including Pigsy’s colorful noodle store and Bull Clone mech for battle play and creative storytelling.\nThis playset has 6 minifigures including Monkey King and Monkie Kid with The Golden Staff, a buildable cloud with a display stand, and a Flower Fruit Mountain mini build to recreate an iconic Monkie Kid scene.\nThere are so many play-inspiring features, such as the LEGO® mech toy’s huge, extendable staff, the Bull Clone mech’s stud shooter, Monkie Kid’s bedroom above the store and the buildable arcade game.\nThis 1,629-piece LEGO® set makes a cool birthday, surprise or holiday gift idea for kids aged 10+. Hours of enjoyment are guaranteed, whether building and playing solo or sharing the creative fun with friends.\nThe Monkey King LEGO® mech toy measures over 15” (40cm) high, 9” (23cm) long and 16” (42cm) wide and this magnificent playset combines brilliantly with other LEGO Monkie Kid™ building toys for even more action.\nNo batteries required! This collectible toy LEGO® set is powered by kids’ imaginations, so they can use the Monkey King mech, the other cool builds and minifigures to create new Monkie Kid missions every playtime.\nChildren will enjoy the building process even more with Instructions PLUS, available in the free LEGO® Life app, which allows them to digitally zoom into, rotate and visualize the models while they build. Awesome!\nEducational LEGO® Monkie Kid™ building toys, inspired by China’s legend of the Monkey King, help kids to develop their creativity, bravery and resilience through hours of immersive building and play.\nBuilders will not need Monkie Kid powers to connect or pull apart LEGO® bricks! Ever since 1958, they have met the highest industry standards to ensure consistency and a perfect, easy connection.\nLEGO® building bricks and pieces are dropped, heated, crushed, twisted and extensively analyzed, so you can be sure that this collectible toy playset meets the highest global safety and quality standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/monkie-kid-s-team-dronecopter-80023","description":"Children can become heroes in their own epic stories and wow their friends with Monkie Kid’s Team Dronecopter. This LEGO® Monkie Kid™ helicopter toy (80023) features 2 spring-loaded shooters and 2 detachable ‘cargo containers’ with lots of homely features inside, including bunk beds and a buildable arcade machine. The playset includes 8 minifigures and 2 figures, including Monkie Kid, Mei, Sandy, Mo the cat, Spider Queen, Mr. Tang with a Journey to the West book element and Red Son with a flyer, plus a spring-loaded ‘spider poison’ shooter for battle action.\n\nGo digital\nFind clear instructions in the box and digital Instructions PLUS in the free LEGO Building Instructions app, which lets youngsters zoom in on, rotate and visualize the models as they build.\n\nBuild, play and learn\nInspired by the classic Journey to the West novel and rooted in China’s culture, LEGO Monkie Kid sets make the best gifts for kids, helping them develop creativity, bravery, resilience and optimism.\n\nChildren can join a team of heroes and battle the Spider Queen with the fabulously detailed Monkie Kid’s Team Dronecopter (80023), plus a buildable, spring-loaded ‘spider poison’ shooter.\nIncludes 8 minifigures: Monkie Kid, Mei, Mr. Tang, Huntsman, Syntax, Red Son, Spider Queen and Fei, plus Sandy and Mo the cat toy figures, with weapons and accessories for creative role play.\nThis helicopter toy has 2 spring-loaded shooters and 2 detachable ‘cargo containers’ that are full of homely features, including a buildable arcade machine, bunk beds and a guitar accessory element.\nThis premium-quality building kit also includes Red Son’s flyer and Mo’s cat-box-shaped flyer to boost the action play, plus a Journey to the West book element for Mr. Tang.\nOffering an immersive building experience and limitless creative play potential, this 1,462-piece, LEGO® set makes the best birthday or holiday gift toy for trend-setting kids aged 10 and up.\nThe Dronecopter measures over 7.5 in. (19cm) high, 15.5 in. (39 cm) long and 15.5 in. (39 cm) wide and will look impressive displayed in any child’s bedroom between playtime adventures.\nPrinted instructions are included, while Digital Instructions PLUS, available in the LEGO® Building Instructions app, lets kids save their progress and jump straight back into the build anytime.\nCollectible LEGO® Monkie Kid™ toy building sets are inspired by the Chinese legend of the Monkey King, and help children develop their creativity, resilience and optimism while having fun.\nLEGO® components meet strict industry standards to ensure they are compatible for a simple, secure connection every time.\nLEGO® bricks and pieces are tested to the max to make sure that they meet stringent global safety standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/red-son-s-inferno-truck-80011","description":"Children can dream up limitless action-packed stories with this LEGO® Monkie Kid™ toy building set (80011). Red Son’s Inferno Truck has many play-inspiring features, including a button to launch the integrated race car toy and fire the 6-stud rapid shooter, plus a winch to drag the ‘exploding’ ATM out of the brick-built Speedy Panda store. A great gift idea for kids, this LEGO tow truck comes with 7 minifigures for role play and a colorful Pigsy delivery tuk-tuk for Monkie Kid to drive to rescue store owner Lee.\n\nInteractive instructions\nCheck out digital Instructions PLUS, available within the free LEGO Life app, for this collectible toy playset. Tools to zoom in on, rotate and view the models help kids confidently build the real-life versions.\n\nMonkie fun!\nRooted in China’s culture and values, LEGO Monkie Kid sets reimagine Monkey King tales from the classic Journey to the West novel and nurture children’s bravery and resilience through creative building and play.\n\nThis red-hot LEGO® Monkie Kid™ building toy (80011) for youngsters features Red Son’s Inferno Truck with an integrated, detachable race car, a Speedy Panda store and Pigsy’s tuk-tuk to inspire action play.\nKids can role-play their own exciting stories as popular characters with 7 minifigures – Monkie Kid, Red Son, Snort, Grunt, Roar, Mei and Lee – plus weapons and the colorful brick-built models.\nThe armored Inferno Truck has a button to launch the integrated race car and fire the 6-stud rapid shooter, a winch to drag the ATM from the store, and 2 ‘power cell’-shooting cannons to use in battles with Monkie Kid.\nAn ideal special-occasion, birthday or holiday gift idea for kids aged 9+, this 1,111-piece LEGO® set offers a rewarding building challenge that can be enjoyed solo or with friends and family.\nThe LEGO® tow truck toy measures over 6” (16cm) high, 15” (39cm) long and 8” (21cm) wide and all the models in this playset combine brilliantly with other LEGO Monkie Kid™ sets for even more playtime action.\nThis battery-free, educational toy is powered by children’s imaginations, encouraging them to develop their creativity by role-playing as their favorite LEGO® Monkie Kid™ characters and making up unique stories.\nEnhance children’s building experience with Instructions PLUS, available in the free LEGO® Life app, which allows them to digitally zoom into, rotate and visualize the models while they build the real things. Cool!\nCollectible LEGO® Monkie Kid™ toy playsets, inspired by mythical tales from China of the Monkey King, help children to become braver and more resilient while enjoying hours of creative fun.\nNo need for Monkie Kid powers to connect or pull apart LEGO® building bricks! They meet the highest industry standards, ensuring consistency, robust building and a perfect, easy connection every time.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed in almost every way imaginable, ensuring that this creative toy building set meets the highest global safety and quality standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/spider-queen-s-arachnoid-base-80022","description":"Children can create unlimited exciting adventures with this awesome LEGO® Monkie Kid™ mech toy: Spider Queen’s Arachnoid Base (80022). The posable mech has lever-operated attack pincers and opens to reveal a minifigure prison and the Spider Queen’s lab for building robotic spiders. A hot gift toy for trend-setting kids, this unique playset features 6 minifigures, including Monkey King and Monkie Kid with The Golden Staff, which converts into a flyer for battle action.\n\nDigitally enhanced building\nFind clear, step-by-step instructions in the box and add to youngsters’ fun with Instructions PLUS in the free LEGO Building Instructions app, which lets them zoom in on and rotate the model on screen while building the real thing.\n\nBuild and learn\nInspired by Monkey King tales from the classic Journey to the West novel and rooted in China’s culture and values, LEGO Monkie Kid sets help youngsters develop bravery, resilience and optimism through creative building and play.\n\nLet children create their own awesome battle stories with this LEGO® Monkie Kid™ toy playset (80022), featuring the Spider Queen’s Spider Arachnoid Base mech/mobile HQ.\nIncludes 6 toy minifigures – Spider Queen, Syntax, Monkie Kid, Pigsy, Monkey King and a civilian – plus weapons and accessories including The Golden Staff, which converts into a flyer for Monkie Kid.\nThe posable Spider Queen mech/HQ features lever-operated attack pincers, and the spider’s ‘body’ opens to reveal a detailedlab and minifigure prison.\nThis premium-quality, 1,170-piece LEGO® set offers a rewarding build and unlimited play potential. It makes a super birthday or holiday gift for trend-setting, creative kids aged 9 and up.\nMeasuring over 10 in. (25 cm) high, 13.5 in. (34 cm) long and 17.5 in. (44 cm) wide, the spider mech is a unique toy that kids will be proud to display and show off to their friends between playtimes.\nIncludes step-by-step instructions and make building extra fun for kids withInstructions PLUS, in the LEGO® Building Instructions app, including tools to zoom and rotate the model on screen.\nCollectible LEGO® Monkie Kid™ building toys reimagine the Chinese legend of the Monkey King through innovative storytelling, inspiring children to develop their creativity, resilience and optimism.\nLEGO® components meet rigorous industry standards to ensure they are consistent and compatible for a simple, strong connection every time.\nLEGO® components are tested in almost every way imaginable to make sure that they meet stringent global safety standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/demon-bull-king-80010","description":"Young Monkie Kid fans will love creating epic scenes with this LEGO® Demon Bull King building toy (80010). A brilliant LEGO gift idea for kids aged 9 and up, it features a huge, posable Demon Bull King model, with many cool features to build and inspire play such as a LEGO light brick that lights up the torso, stud-shooting cannons, a ‘flame thrower’ and a big axe. The Monkie Kid, Pigsy and Princess Iron Fan minifigures each have weapons, including The Golden Staff, to boost the battle action.\n\nInstructions PLUS!\nThis collectible toy playset comes with illustrated building instructions. Kids can also use Instructions PLUS, available on the free LEGO Life app, which lets them zoom into, rotate and visualize the model while building the real thing. Cool!\n\nBuild, play, learn\nInspired by Monkey King tales from the classic Journey to the West novel and rooted in China’s culture and values, LEGO Monkie Kid sets nurture children’s bravery and resilience while they enjoy hours of creative fun.\n\nEncourage your youngster to build and become a brave hero like Monkie Kid, battling against the odds with this LEGO® Monkie Kid™ playset (80010), which features a huge, highly detailed, posable, Demon Bull King model.\nThis LEGO® set includes 3 minifigures – Monkie Kid with The Golden Staff, Pigsy with a Rake Cannon and Princess Iron Fan with her Magic Fan – for children to role-play as heroes and villains in their own LEGO stories.\nThe Demon Bull King model has play-inspiring features including a LEGO® light brick to make the torso glow, space for the Princess on his shoulder, 2 stud-shooting cannons, a ‘flame thrower’ and a big, detachable axe.\nA super birthday, surprise or holiday gift idea for kids aged 9+, this 1,051-piece LEGO® model kit offers a challenging build and combines brilliantly with other LEGO Monkie Kid™ sets for even more action play.\nThe LEGO® villain Demon Bull King toy stands over 11” (29cm) tall and will look stunning displayed in any child’s bedroom between action-packed playtime adventures.\nThis unique and collectible toy building set is made with LEGO® bricks and purely powered by children’s creativity… Well, almost! Just 2 LR41 button cell batteries (included) are required for the LEGO light brick.\nDigital Instructions PLUS, available in the free LEGO® Life app, allows kids to rotate, zoom and visualize this model from all angles as they build the real thing, heightening their feelings of independence. Awesome!\nInspired by legendary tales from China of the Monkey King, LEGO® Monkie Kid™ creative toys nurture youngsters’ bravery, creative and resilience through hours of fun building and play.\nChildren don’t need Monkie Kid powers to build with LEGO® bricks! Ever since 1958, they have met the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and rigorously analyzed, ensuring that this educational building toy meets the highest global safety and quality standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/monkie-kid-s-lion-guardian-80021","description":"Youngsters will love showing off this action-packed LEGO® Monkie Kid™ Lion Guardian playset (80021) to their friends. It features a fully posable Lion Guardian mech toy with 2 hidden spring-loaded shooters, the Spider Queen’s battle rig with movable legs and 2 spring-loaded shooters, plus a posable robotic spider. A great gift for trend-setting kids, this set also includes a buildable arcade with a toy-grabbing claw game that dispenses toy elements, plus 5 minifigures with cool weapons for role-play battles.\n\nGo digital\nFind printed instructions in the box and enhance children’s building experience with intuitive Instructions PLUS in the free LEGO Building Instructions app, which lets them visualize the models on screen as they build.\n\nEducational and fun\nLEGO Monkie Kid building sets are inspired by Monkey King tales from the classic Journey to the West novel and rooted in Chinese culture and values. They are designed to nurture kids’ bravery, resilience and optimism through creative play.\n\nChildren become the heroes in their own thrilling adventures with this LEGO® Monkie Kid™ Lion Guardian (80021) mech toy, Spider Queen battle rig, posable robotic spider and buildable arcade.\nThis premium-quality, battle toy playset includes 5 minifigures – Monkie Kid with The Golden Staff, Mei with the Jade Dragon Blade, Huntsman with a rifle, Spider Queen and Lu.\nThe fully posable Lion Guardian features snapping jaws and has a hidden, spring-loaded shooter in each of the drums, while the Spider Queen’s battle rig has movable legs and 2 spring-loaded shooters.\nKids will love playing with the buildable arcade’s dance machine and the toy-grabbing game with a movable claw that dispenses toy elements just like a real-life arcade game.\nThis 774-piece, LEGO® building toy makes a cool birthday present, holiday gift or surprise treat for creative kids aged 8 and up who like to be part of the hottest trends.\nThe Lion Guardian measures over 8.5 in. (21 cm) high, 11 in. (28 cm) longand 7.5 in. (19 cm) wide. It’s a cool model for youngsters to display and show off to friends between playtime adventures.\nStep-by-step instructions in the box and intuitive Instructions PLUS, available in the free LEGO® Building Instructions app, enhance children’s building experience.\nLEGO® Monkie Kid™ toy building sets are inspired by China’s legend of the Monkey King and help children to develop their imaginations, bravery and resilience while having lots of fun.\nEver since 1958, LEGO® components have met rigorous industry standards to ensure they are compatible and connect consistently.\nLEGO® components are dropped, heated, crushed, twisted and rigorously analyzed to satisfy stringent global safety standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/pigsy-s-food-truck-80009","description":"Inspire action-packed playtime adventures with this LEGO® Monkie Kid™ toy playset (80009) featuring Pigsy’s Food Truck and 2 buildable toy motorcycles for the food-stealing Bull Clones. The LEGO food truck toy has opening sides for easy access to the kitchen and command center. Fans will love fun features like the fake refrigerator with weapons inside and the pig-shaped rapid shooter on the roof. A super LEGO gift idea for kids, it includes 5 collectible toy minifigures to role-play exciting stories.\n\nDigital instructions\nAvailable in the free LEGO Life app, Instructions PLUS offers a digital, interactive guide to building this unique construction toy. Tools to zoom, rotate and visualize help kids to confidently build the LEGO brick models.\n\nMonkie fun!\nRooted in China’s culture and values, LEGO Monkie Kid sets reimagine Monkey King tales from the classic Journey to the West novel, nurturing children’s bravery and resilience while they have lots of creative fun.\n\nLEGO® Monkie Kid™ fans will love Pigsy’s Food Truck, a brilliantly detailed, wacky vehicle with many hidden weapons, such as Pigsy’s rake, to battle against 2 food-stealing Bull Clones riding brick-built toy motorcycles.\nChildren can role-play food fights with 5 collectible toy minifigures – Monkie Kid and Pigsy in civilian clothes, Snort and Grunt with an axe and stud shooter, and Uncle Qiao – and fun food elements.\nThe play food truck features a six-stud rapid shooter, a spiked front fender and opening sides for easy access to the kitchen on one side with a weapon rack disguised as a refrigerator, and a command center on the other.\nA delightful birthday, special surprise or holiday gift for kids aged 8+, this 832-piece LEGO® set offers a fun and rewarding building challenge and is ideal for solo or social creative play.\nThe play food truck measures over 6” (17cm) high, 9” (24cm) long and 5” (13cm) wide and will make a big impression displayed in any child’s bedroom when not in use for Monkie Kid capers!\nNo batteries required! This educational, creative toy playset is powered by kids’ imaginations, so they can use Pigsy’s Food Truck, the Bull Clones’ motorbikes and the minifigures to create unlimited adventures.\nKids will enjoy the building process even more with Instructions PLUS, available in the free LEGO® Life app, which allows them to digitally zoom in on, rotate and visualize this unique toy model while they build.\nLEGO® Monkie Kid™ toy building sets, inspired by Monkey King tales from the Journey to the West novel, help children to become more creative, brave and resilient while having hours of fun.\nNo need for Monkie Kid powers to connect or pull apart LEGO® building bricks! Ever since 1958, they have met the highest industry standards to ensure a perfect, easy connection and robust building.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to make sure that this building set for kids meets the highest global safety and quality standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/monkie-kid-s-cloud-jet-80008","description":"Kids will love role-playing as hero Monkie Kid, piloting his Cloud Jet, battling for The Golden Staff and saving a civilian with this cool LEGO® playset (80008). The aircraft toy features disc shooters and a minifigure cockpit that detaches to become a speed bike, while enemy Red Son has a buildable Twin Fire Jet Pack and Power Glove for conflict play. A super LEGO gift idea for kids aged 8 and up, it includes 4 minifigures so children can pretend to be their favorite characters.\n\nInteractive instructions!\nThis creative toy comes with printed building instructions. Kids can also use Instructions PLUS, available within the free LEGO Life app, which lets them zoom in on, rotate and visualize the twinjet aircraft while building the real thing.\n\nFun and educational\nInspired by Monkey King tales from the classic Journey to the West novel and rooted in China’s culture and values, LEGO Monkie Kid™ sets help children to grow their bravery and resilience while having creative fun.\n\nYour young hero can battle for The Golden Staff and save civilian Ai from Red Son and the Bull Clones with LEGO® Monkie Kid’s Cloud Jet (80008), a cool, buildable aircraft toy that also launches a built-in speed bike.\nChildren will love role-playing original adventures they dream up themselves with 4 minifigures – Monkie Kid with The Golden Staff, Red Son with a Power Glove and brick-built Twin Fire Jet Pack, Growl and Ai.\nThe Cloud Jet plane features adjustable wings with 2 disc shooters, big twinjet engines and a minifigure cockpit for Monkie Kid that detaches to create a LEGO® speed motorbike to take the battle action to the ground.\nThis 529-piece toy airplane playset offers a fun and rewarding building challenge for boys and girls aged 8+, and makes a super birthday present, special LEGO® surprise or holiday gift for kids.\nGreat for solo or social play, this kids’ toy jet plane measures over 5” (13cm) high, 11” (28cm) long and 11” (30cm) wide and looks cool displayed in a child’s bedroom when it’s not being flown on Monkie Kid missions!\nThis LEGO® Monkie Kid™ collectible toy playset is made purely with LEGO building bricks and powered by children’s creativity – no batteries required – so their playtime adventures will never run out of energy!\nInstructions PLUS, available in the free LEGO® Life app, allows young builders to visualize this unique toy model from all angles as they build it, adding to their feelings of independence and awesomeness!\nLEGO® Monkie Kid™ toy building sets, inspired by legendary tales from China of the Monkey King, help children to develop their creativity, bravery and resilience while having fun.\nMonkie Kid powers are not required to connect or pull apart LEGO® bricks! Ever since 1958, LEGO bricks have met the highest industry standards to ensure consistency and a perfect, easy connection.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure that this collectible kids’ toy jet plane, with built-in LEGO speed motorbike, meets the highest global safety and quality standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/iron-bull-tank-80007","description":"Children can role-play epic adventures as heroes Monkie Kid and Sandy – or villainous Bull Clones – with the LEGO® Monkie Kid™ Iron Bull Tank (80007). This LEGO armored toy vehicle features a rotating turret with a 6-stud rapid shooter, oil-barrel-launching function and other cool details to inspire battle action. An exciting LEGO gift idea for kids aged 7 and up, the toy playset includes 3 minifigures and a Sandy figure with weapons to inspire youngsters to create new stories every playtime.\n\nGo digital!\nCheck out digital Instructions PLUS, available within the free LEGO Life app, for this unique collectible toy. Tools to zoom in on, rotate and view the model help kids confidently build the real-life, LEGO brick tank.\n\nBuild, play, learn\nRooted in China’s culture and values, LEGO Monkie Kid sets delightfully reimagine Monkey King tales from the epic Journey to the West novel, helping youngsters to grow their creativity, bravery and resilience through building and play.\n\nKids can enter a world of adventures and become heroes defending against the Bull Clones’ attacks in an awesome buildable Iron Bull Tank with this action-packed LEGO® toy playset (80007).\nGreat for solo play or sharing the fun with friends, this LEGO® tank comes with 3 minifigures – Monkie Kid, Grunt and Roar – plus a Sandy figure, all with weapons to boost the battle action.\nThe toy army tank has lots of play-inspiring features, including a rotating turret with a 6-stud rapid shooter, plus a minifigure cockpit that can be lifted to release oil barrels and a cattle guard to plow through obstacles.\nThis 430-piece LEGO® set makes a fun birthday, special-occasion or holiday gift for kids aged 7+ to introduce them to creative building toys or expand their LEGO collection.\nThis LEGO® armored toy vehicle measures over 6” (16cm) high, 7” (19cm) long and 5” (15cm) wide – it looks great displayed in a child’s bedroom between battles and fits easily into a bag ready for play on the go.\nThis battery-free toy army tank is powered by children’s imaginations, encouraging them to be inventive while dreaming up new storylines and role-playing thrilling missions as their favorite characters.\nMake this creative toy building set extra fun for kids with digital Instructions PLUS, via the LEGO® Life app. Even young builders can easily zoom, rotate and visualize this model as they construct the real-life version.\nInspired by mythical tales from China of the Monkey King, LEGO® Monkie Kid™ educational toys nurture children’s bravery and resilience while they enjoy hours of creative fun.\nMonkie Kid powers aren’t needed to connect or pull apart LEGO® building bricks! Ever since 1958, LEGO bricks have met the highest industry standards to ensure consistency and a perfect, easy connection.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed so you can be sure that this collectible building set for kids meets the highest global safety and quality standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/white-dragon-horse-jet-80020","description":"Give your little hero a fun, rewarding building experience and hours of creative play with this exciting LEGO® Monkie Kid™ jet plane playset (80020). A top-quality gift toy for children, it features Mei’s White Dragon Horse Jet, with 2 spring-loaded shooters and 2 stud shooters, a buildable, working vending machine, posable robotic spider, spider trap and stud-shooting hoverboard. Children can role-play as Mei and Mo the cat battling to save a civilian from the Spider Queen’s Huntsman, with 3 minifigures and a LEGO figure.\n\nDigital instructions\nFind step-by-step instructions in the box, while youngsters will also love using intuitive Instructions PLUS in the free LEGO Building Instructions app to visualize the models as they build the real things.\n\nCool, buildable toys\nLEGO Monkie Kid building sets are rooted in Chinese culture. They reimagine the Monkey King legend through innovative storytelling, helping to develop kids’ creativity, resilience and optimism through building and play.\n\nChildren will love role-playing as the heroic Mei flying her White Dragon Horse Jet (80020) to save the city from the Spider Queen’s Huntsman and a ‘poisonous’ robotic spider.\nThis LEGO® jet plane playset includes 3 minifigures – Mei, Huntsman and Si – with weapons including Mei’s Jade Dragon Blade, plus a Mo the cat figure with a buildable, stud-shooting hoverboard.\nThe jet airplane features 2 spring-loaded shooters and 2 stud shooters. There’s also a buildable, working vending machine – ‘scan’ the cell phone element and drink-can elements are dispensed.\nFun to build and offering hours of creative play, this high-quality, 565-piece, LEGO® toy plane set makes a cool birthday gift, holiday present or surprise treat for kids aged 7 and up.\nThe White Dragon Horse Jet measures over 3 in. (8 cm) high, 13.5 in. (34 cm) long and 7.5 in. (19 cm) wide. Along with the other builds and minifigures, it’s easily portable for play wherever kids go.\nIncludes clear instructions andintuitive Instructions PLUS, available in the free LEGO® Building Instructions app, to make building even more fun, letting kids visualize the models while they build.\nInspirational LEGO® Monkie Kid™ building toys reimagine the Chinese legend of the Monkey King for the modern day, helping children develop their imaginations, bravery and resilience.\nLEGO® components meet strict industry standards, which guarantees secure connections and robust builds – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to ensure they meet the highest safety standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/red-son-s-inferno-jet-80019","description":"Spark children’s creativity with this action-packed LEGO® Monkie Kid™ toy playset (80019), featuring Red Son’s Inferno Jet, a Flower Fruit Mountain mini build and The Golden Staff. The jet features a minifigure cockpit and 2 spring-loaded shooters. A super gift idea for kids, this set also includes Monkie Kid, Red Son and Bob minifigures with weapons and accessory elements such as Red Son’s Power Glove and a LEGO toy jetpack to inspire fun, imaginative play.\n\nInteractive instructions\nFind printed instructions in the box and check out Instructions PLUS in the free LEGO Building Instructions app, featuring tools to zoom in on, rotate and view the model on screen, making the building process even more rewarding for youngsters.\n\nBuild, play and learn\nLEGO Monkie Kid sets are rooted in Chinese culture and values. They reimagine Monkey King tales from the classic Journey to the West novel in new ways, helping children develop bravery, resilience and optimism while enjoying hours of creative fun.\n\nChildren can role-play as the heroic Monkie Kid guarding Flower Fruit Mountain against Red Son’s Inferno Jet attacks with this action-packed LEGO® Monkie Kid™ toy playset (80019).\nThis fun toy includes 3 minifigures – Monkie Kid, Red Son with the Power Glove and firing flame-energy elements, and Bull Clone Bob with a buildable jet pack and flame thrower – to inspire play.\nThe Inferno Jet features a minifigure cockpit and 2 spring-loaded shooters, and the Flower Fruit Mountain mini build holds The Golden Staff to inspire imaginative, exciting playtime battles.\nThis high-quality, 299-piece, LEGO® jet airplane set offers a rewarding build-and-play experience for kids aged 7 and up, making it a super birthday present, holiday gift or special treat.\nThe Inferno Jet measures over 4 in. (10 cm) high, 8.5 in. (21 cm) long and 5.5 in. (14 cm) wide, a portable size so kids can easily hold it, swoosh it and fire the shooters.\nIncludes printed building instructions and Instructions PLUS in the free LEGO® Building Instructions app, enabling young builders to view a virtual version of this unique toy model as they build.\nFun LEGO® Monkie Kid™ building toys reimagine the Chinese legend of the Monkey King through innovative storytelling and help to nurture youngsters’ creativity, resilience and optimism.\nLEGO® components meet stringent standards to ensure a secure connection every time – it’s been that way since 1958.\nLEGO® bricks and pieces are tested to the max to make sure they meet rigorous global safety standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/white-dragon-horse-bike-80006","description":"Let children role-play heroic missions to defeat the Bull Clones with this exciting LEGO® Monkie Kid™ White Dragon Horse Bike (80006) playset. There are loads of cool details to inspire hours of fun, including the LEGO toy motorcycle’s foldout flight-mode wings and stud shooters, the Bull Clones’ hideout’s prison, ‘fire’ gate and stud shooters, plus Monkie Kid’s Cloud Board. The 4 minifigures also have weapons to boost the battle role-play action.\n\nInstructions PLUS!\nInstructions PLUS offers a digital, interactive guide to building this collectible LEGO gift toy for kids. Available in the free LEGO Life app, it has zoom and rotate viewing tools to help even younger children build the models. Cool!\n\nMonkie delight!\nRooted in China’s culture and values, LEGO Monkie Kid sets delightfully reimagine Monkey King tales from the classic Journey to the West novel, helping children to grow their creativity, bravery and resilience as they make up their own exciting adventures.\n\nYour young hero can play out unlimited adventures with this LEGO® Monkie Kid™ toy playset (80006), featuring Mei’s high-tech White Dragon Horse Bike, the Bull Clones’ hideout, plus Monkie Kid’s buildable Cloud Board.\nThis collectible toy includes Monkie Kid, Mei, Bob and Snort minifigures with weapons and there are lots of cool functions to inspire battle role play, including the bike’s stud shooters and foldout flight-mode wings.\nTo add to the action options, the Bull Clones’ hideout has a sentry post with 2 stud shooters, a ‘fire’ gate and a prison. Whether playing solo or sharing the fun with friends, kids will love this unique creative toy!\nThis 259-piece, LEGO® toy motorcycle playset makes a cool birthday, surprise or holiday gift for kids aged 6+, offering a fun, challenging building experience and hours of exciting playtime.\nThe LEGO® kids’ toy motorbike measures over 2” (7cm) high, 7” (18cm) long and 2” (6cm) wide – a nice size to carry in your bag or child’s backpack with the other builds and minifigures for play on the go.\nPower up kids’ imaginations with this battery-free toy building set, encouraging them to be inventive while pretending to be heroes and creating their own epic stories.\nHelp even younger children build independently with Instructions PLUS, available in the free LEGO® Life app, which allows them to view a virtual version of the models while they build them. Awesome!\nLEGO® Monkie Kid™ educational toys, inspired by mythical tales from China of the Monkey King, help kids to develop their creativity, bravery and resilience as they build and play.\nLittle builders will not need Monkie Kid powers to connect or pull apart LEGO® bricks! Ever since 1958, LEGO bricks have met the highest industry standards to ensure consistency and robust building.\nLEGO® building bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure that all LEGO sets meet the highest global safety and quality standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/monkie-kid-s-cloud-bike-80018","description":"Children will love role-playing as the heroic Monkie Kid trying to save a civilian from Spindrax with this LEGO® Monkie Kid™ motorcycle toy playset (80018). It features a Cloud Bike with transforming wheels for flight mode and 2 hidden disc shooters, Spindrax’s bike with 2 stud shooters, plus a posable robotic spider toy. Easily portable and perfect for action-packed, everyday play sessions, the set includes 3 minifigures, with weapons including The Golden Staff, to inspire storytelling.\n\nFun to build\nStep-by-step instructions for building this cool LEGO gift toy for kids are included in the box. And check out interactive Instructions PLUS in the free LEGO Building Instructions app, with zoom and rotate viewing tools to help youngsters build with confidence.\n\nExciting and educational\nRooted in China’s culture and values, LEGO Monkie Kid toys reimagine Monkey King tales from the classic Journey to the West novel for modern times, nurturing children’s creativity through building and play.\n\nYoung heroes can play out high-speed missions to save the city from the Spider Biker and a robotic spider with this action-packed LEGO® Monkie Kid™ Cloud Bike playset (80018).\nThis buildable set includes 3 LEGO® minifigures – Monkie Kid with The Golden Staff, Spindrax with a sword and Rui – to inspire fun, creative, storytelling and play every day.\nMonkie Kid’s Cloud Bike features 2 hidden disc shooters and transforming wheels to flip into flight mode, and Spindrax’s bike has 2 stud shooters. The set also includes a posable robotic spider toy.\nThis cool, 203-piece, LEGO® motorcycle toy playset offers a fun building experience and many entertaining play sessions, making it the best birthday, surprise or holiday gift for kids aged 6 and up.\nThe Cloud Bike measures over 2.5 in. (7 cm) high, 5.5 in. (14 cm) long and 1.5 in. (4 cm) wide – a nice size to slip in a child’s backpack with the other builds and minifigures for play on the go.\nClear, step-by-step instructions are included in the box and Instructions PLUS, available in the free LEGO® Building Instructions app, allows kids to view virtual versions of the models as they build.\nLEGO® Monkie Kid™ building toys, inspired by the Chinese legend of the Monkey King, help kids to develop their imaginations, bravery and resilience while having lots of fun.\nEver since 1958, LEGO® components have met stringent standards to ensure that they are compatible and connect and pull apart consistently.\nLEGO® components aredropped, heated, crushed, twisted and rigorously analyzed to make sure they meet stringent global safety standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/monkey-king-40381","description":"LEGO® Monkie Kid™ fans will love building their own brilliant LEGO BrickHeadz™ version of the Monkey King (40381). This awesome little model of a legendary character from the classic Chinese novel Journey to the West is fun to build solo or with friends and family. It comes with step-by-step, illustrated instructions so even LEGO newcomers can build with confidence. A fun gift idea for creative kids aged 10 and up, this collectible toy includes a baseplate to create an eye-catching display.\nLEGO® Monkie Kid™ fans will love building their own LEGO BrickHeadz™ version of the Monkey King (40381), recreating details of this legendary character from the classic Journey to the West novel to create a cool display.\nThis 175-piece LEGO® toy building set makes an awesome birthday present, holiday gift or anytime surprise for kids aged 10 and up. It comes with illustrated instructions so even LEGO beginners can build independently.\nThis LEGO® brick-built Monkey King toy figure includes a baseplate for display and measures 5” (12.8cm) tall – it won’t take up too much space but it’s sure to grab the attention of any passerby wherever it is displayed."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/the-flaming-foundry-80016","description":"Children can plan their own LEGO® Monkie Kid™ rescue missions with The Flaming Foundry (80016) toy playset. This model of the Demon Bull King’s lair can be moved on the wheels of the detachable dump truck. It has a workshop, armory, prison, control room, and such play-inspiring features as a glowing furnace with a LEGO light brick, robotic arms and a rapid shooter. There are also 7 minifigures, including Monkie Kid, Mei, Princess Iron Fan and Red Son, with weapons for role-play battles.\n\nEnhanced building\nAn exciting gift idea for kids, this unique LEGO toy playset comes with clear instructions. Add to youngsters’ fun with Instructions PLUS in the free LEGO Building Instructions app, which lets them zoom in on and rotate the model while building it.\n\nBuild and learn\nInspired by Monkey King tales from the classic Journey to the West novel and rooted in China's culture and values, LEGO Monkie Kid toy building sets help to nurture youngsters' bravery and resilience through creativeplay.\n\nYoungsters can role-play as heroes or villains with this LEGO® Monkie Kid™ toy playset (80016), featuring a detailed model of The Flaming Foundry, mobile hideout of the Demon Bull King and his Bull Clones.\nIncludes a brick-built Demon Bull King figure and 7 minifigures – Monkie Kid, Mei, Princess Iron Fan, Red Son, Roar, Growl and Uncle Zhang – with cool weapons to inspire many playtime action-adventures.\nThe foundry model can move on the wheels of a detachable toy dump truck and features a workshop, glowing furnace, armory, prison, crane, robotic arms, adjustable turrets and 6-stud rapid shooter for creative play.\nThis collectible, 1,427-piece LEGO® building toy makes a brilliant birthday, surprise or holiday gift for kids aged 9+. Hours of immersive, creative fun are guaranteed, whether building and playing solo or with friends.\nMeasuring 9.5” (24.1cm) high, 12.6” (32cm) wide and 12.8” (32.5cm) deep when closed, the foldout Flaming Foundry makes a striking display piece and combines brilliantly with other LEGO® Monkie Kid™ sets.\nThe furnace in this unique toy playset has a LEGO® light brick (2 LR41 button cell batteries included) and a holder for The Golden Staff. Kids can make the staff glow simply by pressing down on it.\nEnhance children's building experience with intuitive Instructions PLUS, available in the free LEGO® Building Instructions app, which allows them to zoom into, rotate and visualize this unique toy while they build.\nCollectible LEGO® Monkie Kid™ toy building sets are inspired by China’s legend of the Monkey King and help children to develop their creativity, bravery and resilience while enjoying hours of fun.\nNo need for Monkie Kid powers to connect or pull apart LEGO® building bricks! They meet the highest industry standards, ensuring a perfect, easy connection every time and consistently robust builds.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed in almost every way imaginable, so you can be sure that this kids’ building set meets the highest safety and quality standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/monkie-kid-s-cloud-roadster-80015","description":"Children can create their own LEGO® Monkie Kid™ rescue missions, saving civilians from the evil Horn Demons with Monkie Kid’s Cloud Roadster (80015). The roadster features race-car-style design details, a spinning cloud engine and 2 spring-loaded shooters, while the Horn Demons' calabash-inspired toy motorcycle has a minifigure compartment and detachable flyer to inspire unlimited stories. This unique toy playset includes 5 minifigures with weapons, such as Monkie Kid's Golden Staff, for role-play battles.\n\nGo digital!\nA great gift idea for kids, this collectible LEGO toy comes with clear instructions. Kids will also love using intuitive Instructions PLUS in the free LEGO Building Instructions app to zoom in on, rotate and visualize the models as they build.\n\nFun and educational\nRooted in China's culture, LEGO Monkie Kid sets reimagine Monkey King tales from the classic Journey to the West novel and help to nurture children's courage and resilience through creative building and play.\n\nChildren will feel like heroes with this LEGO® Monkie Kid™ toy car playset (80015), role-playing as Monkie Kid and racing to rescue civilians from the Horn Demons in the supercool Cloud Roadster.\nThis collectible toy includes 5 minifigures: Monkie Kid with his Golden Staff, Gold Horn Demon and Silver Horn Demon, each with Calabash weapons, plus Wang and Chen with accessory elements for creative play adventures.\nThe roadster has real race-car details, a spinning cloud engine and 2 spring-loaded shooters, while the Horn Demons’ LEGO® vehicle features a compartment to capture a minifigure and a detachable flyer for battle action.\nA super special-occasion, birthday or holiday gift idea for kids aged 8+, this 659-piece LEGO® set offers a fun, creative building challenge that can be enjoyed solo or with friends and family.\nThe roadster racer toy measures over 4” (10cm) high, 12” (30cm) long and 6” (16cm) wide and combines brilliantly with the brick-built models in other LEGO® Monkie Kid™ sets to create even more exciting stories.\nThis battery-free toy playset is powered by children’s creativity, encouraging them to develop their imaginations by role-playing as their favorite LEGO® Monkie Kid™ characters and making up unique adventure stories.\nMake building even more fun for kids with intuitive Instructions PLUS, available in the free LEGO® Building Instructions app, which allows them to digitally zoom into, rotate and visualize the models while they build.\nEducational LEGO® Monkie Kid™ building toys, inspired by China’s legend of the Monkey King, help kids to develop their creativity, bravery and resilience through hours of immersive building and play.\nBuilders will not need Monkie Kid powers to connect or pull apart LEGO® bricks! Ever since 1958, LEGO bricks have met the highest industry standards to ensure a consistently easy connection and robust model builds.\nLEGO® building bricks and pieces are dropped, heated, crushed, twisted and extensively analyzed, so you can be sure that this kids’ toy building set meets the highest global safety and quality standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/sandy-s-speedboat-80014","description":"Young heroes can play out exciting rescue missions with this LEGO® Monkie Kid™ playset (80014), featuring Sandy’s Speedboat and the Spider Queen’s mech and Silken Web Cave. An awesome gift for kids, the models have lots of cool details such as the boat's rapid shooter and cat compartment, and the cave's web trap. There are 3 minifigures, plus Sandy, Mo the cat and spider figures, plus cool weapons such as Sandy's Crescent Staff and the Spider Queen's staff for role-play battles.\n\nDigital instructions\nThis collectible LEGO gift toy comes with illustrated instructions, and the free LEGO Building Instructions app with intuitive Instructions PLUS, featuring zoom and rotate viewing tools, makes the creative process even more fun.\n\nBuild, play, learn\nRooted in China's culture and values, LEGO Monkie Kid sets delightfully reimagine Monkey King tales from the classic Journey to the West novel, helping children to grow their creativity, bravery and resilience as they play out their own epic stories.\n\nYoungsters can role-play as Monkie Kid and Sandy and lead daring rescue missions with this LEGO® Monkie Kid™ toy playset (80014), featuring Sandy’s awesome speedboat and the Spider Queen’s Silken Web Cave and mech.\nThis collectible toy includes Monkie Kid, Spider Queen and Pigsy minifigures, Sandy, Mo the cat and 3 spider figures, plus weapons such as Sandy's big Crescent Staff and Monkie Kid's Golden Staff for battle action.\nThere are so many play-inspiring features, from the boat's 6-stud rapid shooter, spinning propeller and cat/ammo compartment to the cave’s web to trap Pigsy. The back of the mech also opens up to transport the 3 spiders.\nThis 394-piece playset makes a cool birthday, surprise or holiday gift for kids aged 8+, offering a rewarding building experience and hours of fun playing solo or with friends. [Note: boat does not float in water.]\nThe LEGO® kids' toy speedboat measures over 5.3” (13.5cm) high, 9” (22.8cm) long and 5.7” (14.5cm) wide and makes a colorful, eye-catching display piece in any child’s bedroom between playtime adventures.\nSpark kids’ imaginations with this battery-free toy building set, encouraging them to be inventive and awakening the hero inside themselves as they create and play out their own thrilling stories.\nEnhance children's creative experience with intuitive Instructions PLUS, in the free LEGO® Building Instructions app, which allows them to view, rotate and zoom in on digital versions of the models while they build.\nCollectible LEGO® Monkie Kid™ toy playsets, inspired by mythical tales from China of the Monkey King, help to nurture children’s creativity, bravery and resilience in a unique way while they build and play.\nYoung builders will not need Monkie Kid powers to connect or pull apart LEGO® bricks! Ever since 1958, LEGO bricks have met the highest industry standards to ensure consistency and robust building.\nLEGO® building bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure that all LEGO sets meet the highest global safety and quality standards."},{"theme":"monkie-kid","themeUrl":"https://www.lego.com/en-us/themes/monkie-kid","productUrl":"https://www.lego.com/en-us/product/monkie-kid-s-rc-race-40472","description":"Add competitive toy car racing action to children’s LEGO® Monkie Kid roleplay adventures with this compact accessory set (40472). Great for solo or group play, it features mini builds of Monkie Kid’s Cloud Roadster and Bull Clone Bob’s vehicle, plus a trophy presentation stage and a trophy element for Mei to present to the winning driver. The car toys, minifigures, stage and accessories fit easily into a child’s backpack, ready for fun races wherever they go.\nLet the races begin with this LEGO® Monkie Kid™ RC Race accessory set (40472) for kids, featuring mini builds of Monkie Kid’s Cloud Roadster and Bull Clone Bob’s vehicle.\nGreat for solo action or group fun, this racing car toy playset includes Monkie Kid, Mei and Bob minifigures with a trophy and 2 remote controller elements, plus a buildable trophy presentation stage.\nThis easy-to-build, 57-piece LEGO® starter kit makes a super birthday present or holiday gift toy for kids aged 6 and up as a first LEGO Monkie Kid™ set or to add to their collection."}]