[{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/catamaran-sea-battle-71748","description":"Exciting high-sea adventures await ninja fans with this unique and super-cool LEGO® NINJAGO® Catamaran Sea Battle (71748) playset. One of the 2 included catamarans splits in to 3 separate boat toys, one of which features a mini prison, so kids have all they need to enjoy hours of imaginative play.\n\nPremium NINJAGO playset\nThis ninja toy comes with 6 minifigures: Island Jay, Island Kai and Island Zane and their enemies Chief Mammatus, Thunder Keeper and Rumble Keeper, all of whom are armed with an array of spears, swords and shields to enhance the battle action for kids.\n\nBest gifts for creative play\nNINJAGO toys open up a world of exciting adventures. Little builders will love putting together these cool toys before teaming up with their ninja heroes to learn crucial life skills as they battle a cast of evil villains with an amazing collection of dragons, mechs and temples.\n\nLEGO® NINJAGO® Catamaran Sea Battle (71748) is an action-packed ninja playset featuring 2 catamarans, one of which splits into 3 boats, so kids can stage thrilling clashes at sea.\nIncludes 6 minifigures from the NINJAGO® TV series: Island Jay, Island Zane and Island Kai, who take on Chief Mammatus, Rumble Keeper and Thunder Keeper – all with cool weapons!\nThe Keepers' battle catamaran has 2 spring-loaded shooters and can split into 3 separate boats, one with a mini prison for the ninjas, and one featuring 2 stud shooters and a casket of diamonds.\nThe ninjas’ own catamaran toy features 2 spring-loaded shooters and can fold up into speed mode and fold back out for attack mode.\nThis 780-piece battle set provides a fun-filled build for kids aged 9 and up and makes a great birthday or holiday gift that will wow their friends.\nThe Keepers' catamaran measures over 8.5 in. (22 cm) tall, 13 in. (33 cm) long and 9.5 in. (24 cm) wide – a great size to display in a child's bedroom between playtime battles.\nLook out for more NINJAGO® sets inspired by the TV series, including Lloyd’s Jungle Chopper Bike (71745), Jungle Dragon (71746) and The Keepers’ Village (71747).\nLEGO® NINJAGO® offers an amazing collection of cool playsets any ninja fan will be proud to own and lets them learn positive life skills through exciting adventures with their heroes.\nFor more than 6 decades, LEGO® bricks have been made from some of the highest-quality materials, ensuring they connect and pull apart consistently every time – ninja skills not needed!\nLEGO® building bricks meet stringent safety standards, which means kids are in safe hands."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/zane-s-titan-mech-battle-71738","description":"Get young ninja fans role-playing exciting scenes from season 5 of the LEGO® NINJAGO® TV series, with this Zane’s Titan Mech Battle (71738) Legacy set. Featuring posable legs and arms, a sword and spinning chainsaw in its hands, plus 2 spring-loaded shooters and a cockpit for ninja minifigures, kids will love this modern update of the original mech.\n\nHours of fun for passionate NINJAGO fans\nThis ninja toy features 4 minifigures: ninjas Zane and Jay Legacy plus 2 Ghost Warriors Ghoultar and Soul Archer, all armed with cool weapons including a bow and arrow and scythe to inspire endless NINJAGO battling fun. New for January 2021, Jay Legacy is a special golden collectible minifigure to celebrate 10 years of NINJAGO toys.\n\nTop gifts for imaginative kids\nNINJAGO building toys open up a world of exciting adventures for kids. Little ninjas can team up with their heroes to battle a cast of evil villains as they role-play with an amazing collection of cool toys including dragons, mechs and temples.\n\nLEGO® NINJAGO® Legacy Zane’s Titan Mech Battle (71738) is a modern update on a classic playset featuring a highly posable, chainsaw-wielding mech toy for kids to stage thrilling battles.\nAction-packed battle set includes 4 minifigures from season 5 of the NINJAGO® TV series: ninjas Jay Legacy and Zane, plus Ghost Warriors Ghoultar and Soul Archer, all armed with cool weapons.\nThis awesome mech toy has posable arms and legs, a sword and chainsaw in its hands, and 2 spring-loaded shootersfor kids to create fast-moving stories.\nIncludes a golden Jay Legacy collectible minifigure with a small stand to celebrate the 10th anniversary of NINJAGO® toys.\nLook out for more special collectible golden minifigures in other NINJAGO® sets: Tournament of Elements (71735), Boulder Blaster (71736) and X-1 Ninja Charger (71737).\nThis 840-piece ninja playset provides a fun and rewarding build for ages 9 and up and makes a great birthday or holiday gift for kids who love LEGO® building and ninja action!\nMeasuring over 10 in. (26 cm) tall, 3.5 in. (9 cm) long and 5.5 in. (15 cm) wide Zane’s Titan Mech looks great on display in a child’s bedroom between playtime battles.\nLEGO® NINJAGO® offers an amazing collection of cool playsets that put a smile on any kid's face and lets them learn positive life skills through exciting adventures with their ninja heroes.\nFor more than six decades, LEGO® bricks have been made from the highest-quality materials to ensure they pull apartconsistently, every time. Ninja skills not needed!\nLEGO® building bricks meet stringent safety standards, so kids are in safe hands."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/the-keepers-village-71747","description":"Action-loving ninja fans will be thrilled to recreate scenes from the LEGO® NINJAGO® TV series with The Keepers’ Village (71747) playset. This amazingly detailed ninja toy features a prison inside a dragon’s mouth, hidden shooters and a trap that leaves characters dangling from a tree.\n\nGifts that really wow kids!\nThe set features 5 minifigures – Island Cole, Jay and Kai, Chief Mammatus and Thunder Keeper – each of whom carries cool weapons so kids can stage fun battles among themselves as they try to win possession of the prized storm amulet. The stone pillar at the top of the set also separates into 3 different monster characters.\n\nCool toys for kids\nLEGO NINJAGO battle toys let kids step away from their screens and dive into a world of fantasy action. Here they can learn vital life skills and team up with their heroes to battle evil villains with an amazing collection of ninja toys, including dragons, mechs and temples.\n\nLEGO® NINJAGO® The Keepers’ Village (71747) building set features a highly detailed and interactive jungle lair so kids can re-enact amazing battle scenes.\nIncludes 5 minifigures: Island Cole, Island Jay, Island Kai, Chief Mammatus and Thunder Keeper, all wielding cool weapons from the LEGO® NINJAGO® TV series.\nThe ninja playset features a prison cell inside a dragon's head, a dangerous trap disguised as a leaf, hidden shooters and a stone pillar that can separate into 3 characters.\nThis 632-piece island playset provides a fun build for ages 8 and up and will make a very welcome birthday or holiday present for ninja-loving kids.\nThe Keepers’ Village measures over 8.5 in. (22 cm) high, 7 in. (19 cm) long and 11 in. (29 cm) wide – a set that is bound to impress friends when on display in kids' bedrooms.\nLook out for more NINJAGO® sets inspired by the TV series, including Lloyd's Jungle Chopper Bike (71745), Jungle Dragon (71746) and Catamaran Sea Battle (71748).\nLEGO® NINJAGO® features an amazing collection of cool toys so kids can enjoy hours of imaginative fun as they learn crucial life skills on adventures with their ninja heroes.\nFor more than 6 decades LEGO® bricks have been made from high-quality materials to ensure they consistently connect and pull apart – ninja skills not needed!\nLEGO® building bricks meet some of the highest safety standards in the world. Kids are in safe hands with LEGO playsets."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/x-1-ninja-charger-71737","description":"Kids will love playing out ninja-versus-Nindroid Warrior battles from season 3 of the LEGO® NINJAGO® TV series with this modern update of the X-1 Ninja Charger (71737). The 2-in-1 vehicle features 2 spring-loaded shooters and has a cool toy motorcycle hidden inside to be fired out at the press of a button to attack the Nindroids.\n\nFor kids who are into fantasy action stories\nThis unique Legacy playset also includes 5 minifigures: ninja heroes Kai, Jay and Cole Legacy plus a Nindroid Warrior and Mindroid to help kids create their own enthralling fantasy stories. New for January 2021, Cole Legacy is a never-seen-before golden collectible minifigure with a stand to celebrate 10 years of NINJAGO playsets.\n\nThe perfect LEGO gifts for ninja fans\nLEGO NINJAGO playsets open up a world of exciting adventure for kids. NINJAGO fans can team up with their heroes to battle enemies as they play with an amazing collection of ninja toys including motorbikes, mechs and so much more.\n\nLEGO® NINJAGO® X-1 Ninja Charger (71737) is a 2-in-1 modern update ninja vehicle with a shooting toy car and ninja motorcycle to give kids a world of exciting play possibilities.\nImpressive playset includes 5 minifigures: ninjas Kai, Jay and Cole Legacy to take on a Nindroid Warrior and Mindroid from season 3 of the TV series, who are all ready to battle with cool weapons.\nKids will be thrilled to push a button that fires out a fast motorcycle ridden by a ninja minifigure from inside the X-1 Ninja Charger car.\nIncludes a golden Cole Legacy collectible minifigure with small stand to celebrate the 10th anniversary of NINJAGO® toys.\nLook out for more special collectible golden minifigures in other NINJAGO® sets including Tournament of Elements (71735), Boulder Blaster (71736) and Zane's Titan Mech Battle (71738).\nThis ninja toy playset gives kids aged 8 and up a fun-filled building task and makes a great birthday or holiday gift.\nThe shooting car toy measures over 2.5in. (7 cm) high, 9 in. (23 cm) long and 4.5 in. (11 cm) wide – the perfect size to play with at home or for fun on the go.\nLEGO® NINJAGO® has an amazing collection of action-packed playsets to fuel your kid’s passions and let them learn positive life skills as they pretend to be a ninja.\nFor more than six decades LEGO® bricks have been made from the highest-quality materials to ensure they consistently pull apart. Ninja skills not needed!\nLEGO® building bricks meet the highest safety standards in the world, so your kids are in safe hands with LEGO playsets."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/boulder-blaster-71736","description":"Ninja fans will be thrilled with this modern update of the Boulder Blaster (71736) shooting airplane to stage exhilarating battles from season 4 of the LEGO® NINJAGO® TV series. The airplane toy has 8 spring-loaded shooters on its rotating front to aim rapid fire at the evil Eyezor or at the prison building to release the captured Lloyd.\n\nFor kids who are into fantasy action stories\nThis ninja toy features 4 minifigures: ninjas Cole, Lloyd and Kai Legacy and their enemy Eyezor to give kids everything they need to create fast-moving adventures. New for January 2021, Kai Legacy is a never-seen-before golden collectible figure with a stand to celebrate 10 years of NINJAGO playsets.\n\nThe best gifts for ninja fans\nLEGO NINJAGO playsets offer kids the key to a world of exciting adventure. NINJAGO fans can team up with their heroes to learn life skills and battle dangerous enemies as they role-play with an amazing collection of ninja toys including dragons, jets and temples.\n\nLEGO® NINJAGO® Boulder Blaster (71736) is an upgraded and modern Legacy playset featuring a super cool shooting airplane and ninja prison to give kids an action-packed play experience.\nIncludes 4 minifigures: ninjas Cole, Lloyd and Kai Legacy to take on the evil Eyezor and recreate scenes from season 4 of the LEGO® NINJAGO® TV series.\nKids will be excited to rapidly fire 8 missiles from the ninja airplane's rotating front at enemies or at the prison to release a captured ninja.\nIncludes a special golden Kai Legacy collectible minifigure with small stand to celebrate the 10th anniversary of NINJAGO® toys.\nLook out for more special collectible golden minifigures in other NINJAGO® sets: Tournament of Elements (71735), X-1 Ninja Charger (71737) and Zane's Titan Mech Battle (71738).\nThis awesome toy gives kids aged 8 and up a rewarding building task and makes a great birthday or holiday gift for NINJAGO® fans.\nThe ninja battle toy measures over 4 in. (12 cm) high, 11 in. (28 cm) long and 9 in. (25 cm) wide – the perfect size to play with at home or slip in a bag for fun on the go.\nLEGO® NINJAGO® has an amazing collection of buildable toys and minifigures that will be at the top of kids’ wish lists to let them pretend to be their ninja heroes.\nFor more than six decades LEGO® bricks have been made from the highest-quality materials to ensure they consistently pull apart. Ninja skills not needed!\nLEGO® building bricks meet the highest safety standards inthe world, so your kids are in safe hands with LEGO playsets."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/overlord-dragon-71742","description":"Little ninjas can enjoy recreating action-filled scenes from season 2 of the LEGO® NINJAGO® TV series with the Overlord Dragon (71742) playset. Featuring posable legs, head and wings adorned with blades, the dragon can take several different stances to inspire role-play fun.\n\nEndless thrills for young builders\nThe posable dragon toy is accompanied by 2 minifigures: ninja Golden Lloyd armed with a katana on his back and the Overlord wielding his own sharp blade, so kids have all they need to play out exhilarating battles in the sky and on the ground in this classic fight between good and evil.\n\nUnique toys for creative kids\nLEGO NINJAGO toys offer a world of all-consuming fun as kids travel to an exciting fantasy world where they can join forces with their heroes to battle a cast of evil villains playing with an amazing collection of cool toys including dragons, jets and vehicles.\n\nLEGO® NINJAGO® Legacy Overlord Dragon (71742) playset featuring a cool and highly posable dragon for kids to enjoy hours of flying fun.\nImpressive dragon playset with 2 minifigures from season 2 of the LEGO® NINJAGO® TV series: Overlord armed with a blade and ninja Golden Lloyd with a katana strapped to his back.\nThis fun dragon toy has posable head, legs and bladed wings for NINJAGO® fans to create fast-moving stories in the sky or on the ground.\nThis battle playset provides a rewarding building experience for kids aged 7 and up and is the perfect LEGO® gift to help them fulfil their passion for ninjas and being creative.\nThe Overlord Dragon measures over 5.5 in. (12 cm) high, 18 in. (46 cm) long and 17.5 in. (45 cm) wide to look impressive displayed in a child's bedroom between playtime battles.\nLEGO® NINJAGO® includes an amazing collection of cool playsets that put a smile on any kid's face and lets them learn positive life skills through exciting adventures with their ninja heroes.\nFor more than six decades, LEGO® bricks have been made from the highest-quality materials to ensure they pull apart consistently, every time. Ninja skills not needed!\nLEGO® building bricks meet stringent safety standards, so kids are in safe hands."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/tournament-of-elements-71735","description":"Get kids staging spectacular battles from season 4 of the LEGO® NINJAGO® TV series with this Tournament of Elements (71735) playset. The highly detailed temple has a battle platform, a rotating weapon platform, a spinner weapon and a collection of jade blades.\n\nThe perfect ninja set to inspire imaginative role play\nFeaturing 7 minifigures: ninjas Kai, Jay and Lloyd Legacy, masters of elements Bolobo, Jacob and Gravis, and the villainous Eyezor, this playset give kids endless options to stagebattles and training drills. New for January 2021, Lloyd Legacy is a special golden collectible figure with a stand to celebrate 10 years of NINJAGO building sets.\n\nTop gift ideas for creative kids\nLEGO NINJAGO battle toys allow kids to escape to a world of fantasy action where they can learn vital life skills and team up with their heroes to battle evil villains as they play with an amazing collection of ninja toys including dragons, mechs and temples.\n\nLEGO® NINJAGO® Tournament of Elements (71735) Legacy building set features a highly detailed and interactive temple for kids to practice ninja skills and stage amazing battles.\nNinja toy playset is packed with 7 minifigures: ninjas Jay, Kai and Lloyd Legacy, master of elements Bolobo, Gravis and Jacob and the evil Eyezor from season 4 of the TV series.\nThe ninja temple features a battle platform to stage exciting duels, a rotating weapon platform and spinning weapon to practice ninja skills, and a collection of jade blades to award as prizes.\nIncludes a golden Lloyd Legacy collectible minifigure with small stand to celebrate the 10th anniversary of NINJAGO® toys.\nLook out for more special collectible golden minifigures in other NINJAGO® sets: Boulder Blaster (71736) and X-1 Ninja Charger (71737) and Zane's Titan Mech Battle (71738).\nThis 283-piece battle playset with collectible figures provides a fun build for ages 6 and up and makes the perfect treat for a boy or a girl with a passion for the NINJAGO® universe.\nThe ninja temple measures over 6.5 in. (17 cm) high, 6 in. (16 cm) wide and 9.5 in. (24 cm) deep – a portable set to play with anywhere or on the go or at home.\nLEGO® NINJAGO® has an amazing collection of cool toys for kids to enjoy hours of imaginative fun as they learn crucial life skills and embark on adventures with their ninja heroes.\nFor more than six decades LEGO® bricks have been made from the highest-quality materials to ensure they consistently pull apart. Ninja skills not needed!\nLEGO® building bricks meet the highest safety standards in the world, so your kids are in safe hands with LEGO playsets."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/jay-s-electro-mech-71740","description":"Kids can develop their building skills and play out fun scenes from season 4 of the LEGO® NINJAGO® TV series with Jay’s Electro Mech (71740). Featuring a posable mech, ninja car, spider toy, and a golden-sword display, kids can enjoy hours of ninja adventures.\n\nLearn to build with LEGO® NINJAGO®\nThis cool ninja toy is specially designed to give young builders aged 4 and up a brilliant play experience. Inside the box, each bag of bricks has a complete model and character to build so kids can quickly get the action underway. There is also a Starter Brick to provide a partly constructed base to start building.\n\nFun for all the family\nLEGO® 4+ sets are the perfect way for adults to enjoy building with kids. It’s quick and easy to get started – as well as a step-by-step paper guide in the box, this set comes with Instructions PLUS on the LEGO Building Instructions app. This interactive guide includes zoom, ghost and rotate tools for children to get the most from the building process.\n\nLEGO® NINJAGO® Jay’s Electro Mech (71740) helps kids learn how to build before they enjoy fun battles with a posable mech toy and ninja car.\nAction-packed battle toy set includes 2 minifigures from season 4 of the NINJAGO® TV series: ninja Jay and the villain Eyezor plus a Starter Brick to get the building and playing started quickly.\nThis awesome mech toy has posable arms and legs, a spinning blade, and a large sword in its hands, and a cockpit to carry Jay, all to inspire kids' fun-filled stories.\nEyezor’s car toy has a cool spinning platform mounted on it with a shooter that can fire studs for kids to play out fun battle scenes.\nWith just 106 pieces, this ninja playset provides a simple and fun build for kids aged 4 and up and makes the perfect gift for a child who deserves a special treat.\nMeasuring over 6.5 in. (17 cm) tall, 4 in. (10 cm) long and 6.5 in. (16 cm) wide Jay's Electro Mech looks great on display in a child's bedroom between playtime battles.\nYoungsters can make their building experience even better with digital instructions PLUS. With the zoom, rotate and ghost modes, the building becomes part of the fun.\n4+ playsets offer a great way for youngsters to learn how to build with simple and easy-to-understand instructions, while also allowing the rest of the family to share in the fun.\nFor more than six decades, LEGO® bricks have been made from the highest-quality materials to ensure they pull apart consistently, every time. Ninja skills not needed!\nLEGO® building bricks meet stringent safety standards, so kids are in safe hands."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/lloyd-s-jungle-chopper-bike-71745","description":"Kids will be thrilled to recreate action scenes from the LEGO® NINJAGO® TV series with this fantastic Lloyd’s Jungle Chopper Bike (71745). The 2-in-1 vehicle features 2 stud-shooters, an opening cockpit, working suspension and a flyer that can be detached and used as a surfboard. Unique toys for fantasy adventures The ninja playset has 3 minifigures: Island Lloyd, Island Nya and a Rumble Keeper to help kids play out their own make-believe jungle and sea adventures. These characters can stage battles among themselves to see who wins the precious storm amulet that also comes with this set. Top toys for ninja fans NINJAGO playsets encourage kids to step away from their screens and develop crucial life skills by enjoying hands-on playtime, on their own or with friends. A world of exciting adventures opens up to them through an amazing collection of ninja toys, including dragons, mechs and vehicles.\nLEGO® NINJAGO® Lloyd’s Jungle Chopper Bike (71745) is an awesome 2-in-1 ninja vehicle with a ninja bike and surfing toy to give kids a world of play possibilities.\nNinja toy comes with 3 minifigures: Island Lloyd and Island Nya, each armed with a weapon, to take on the Rumble Keeper, who has a cool spear and shield.\nChopper bike toy features working suspension, an opening cockpit to place Island Lloyd, plus a detachable flyer that turns into a surfboard toy so Island Nya can ride into battle.\nThis ninja toy playset gives kids aged 7 and up a fun-filled building task and makes a great gift for a child who deserves a special treat.\nThe bike toy measures over 6 in. (16 cm) high, 8.5 in. (21 cm) long and 2 in. (6 cm) wide – the perfect portable size to play with at home or on the go.\nLook out for more NINJAGO® sets inspired by the TV series, including Jungle Dragon (71746), The Keepers' Village (71747) and Catamaran Sea Battle (71748).\nLEGO® NINJAGO® features an amazing collection of incredible playsets to help kids step away from their screens and learn positive life skills as they enjoy imaginative role play.\nFor more than 6 decades LEGO® bricks have been made from high-quality materials to ensure they consistently connect and pull apart – ninja skills not needed!\nLEGO® building bricks meet stringent safety standards, giving you the peace of mind that your kids are in safe hands."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/epic-battle-set-cole-vs-ghost-warrior-71733","description":"Get LEGO® NINJAGO® fans playing out imaginative and fun battles with this brilliant Epic Battle Set- Cole vs. Ghost Warrior (71733) playset. It features a brick-built marketplace with a hanging lantern and a spinning battle platform, so kids can escape to a fantasy world to enjoy hours of role-play action.\n\nPlaysets to inspire creative activities\nThis ninja battle toy features 2 minifigures: a new-for-January-2021 Cole and a Legacy Ghost Warrior from the LEGO® NINJAGO® TV series. The playsetprovides kids with all they need to stage fun clashes to see who wins the 4 black weapons.\n\nThe best cool toys for kids\nLEGO NINJAGO playsets encourage kids to step away from their screens to enjoy daring adventures in a fantasy world. Here they can learn valuable life skills and team up with their heroes playing with an exciting collection of ninja toys including mechs, planes and dragons.\n\nLEGO® NINJAGO® Epic Battle Set – Cole vs. Ghost Warrior (71733) gives kids all they need to stage kicking and slamming battles between their ninja hero Cole and the evil Ghost Warrior.\nNinja toy playset features 2 minifigures: a new-for-January-2021 Cole and a Legacy Ghost Warrior from the LEGO® NINJAGO® TV series and 4 exclusive black weapons.\nThe ninja battle toy also includes a brick-built marketplace for the characters to stage their fights and a spinning battle platform for Cole toknock over his opponent.\nWith only 51 pieces this makes a great first LEGO® set for young builders aged 6 and up and is a wonderful surprise treat they will want to play with over and over again.\nThe marketplace measures over 2.5 in. (7 cm) high, 2 in. (5 cm) wide and 3 in. (8 cm) deep – a great size for bedroom battles or to take to a friend's house.\nRecreate even bigger LEGO® NINJAGO® epic battles with other sets: Kai vs. Skulkin (71730), Zane vs. Nindroid (71731) and Jay vs. Serpentine (71732).\nLEGO® NINJAGO® sets tempt kids away from their screens into a world of imaginative play where they can learn positive life skills on adventures alongside their ninja heroes.\nFor more than six decades LEGO® bricks have been made from the highest-quality materials to ensure they consistently pull apart. Ninja skills not needed!\nLEGO® building bricks meet the highest safety standards in the world."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/epic-battle-set-jay-vs-serpentine-71732","description":"Get creative kids staging their own spinning-and-kicking battles with this impressive Epic Battle Set- Jay vs. Serpentine (71732) building toy. The durable ninja playset features a brick-built snake statue and spinning battle platform for kids to enjoy hours of role-play fun.\n\nThe best cool toy for kids\nThis ninja battle toy features 2 minifigures: a new-for-January-2021 Jay and a Legacy Serpentine warrior from the LEGO® NINJAGO® TV series. The playset offers hours of fun as kids stage amazing battles between the pair to claim the 4 prized blue weapons.\n\nTop toys for creative kids\nLEGO NINJAGO playsets take kids away from their screens to enjoy imaginative adventures in a fantasy world. There they can learn valuable life skills and team up with their heroes to play out action scenes with an amazing collection of ninja toys including mechs, planes and dragons.\n\nLEGO® NINJAGO® Epic Battle Set – Jay vs. Serpentine (71732) provides kids with all they need to play out exhilarating duels between their ninja hero Jay and the villainous Serpentine.\nNinja toy playset features 2 minifigures: a new-for-January-2021 Jay and a Legacy Serpentine from the LEGO® NINJAGO® TV series, and 4 exclusive blue weapons.\nThe ninja battle toy also includes a brick-built snake statue and a spinning battle platform for Jay to use in the heat of his battles to knock over his opponent.\nThis LEGO® starter kit comes with only 69 pieces so is the perfect size for young builders aged 6 and up and makes a wonderful gift or surprise treat for them.\nThe snake statue measures over 1 in. (3 cm) high, 2.5 in. (6 cm) wide and 2.5 in. (7 cm) deep – a great size to play with at home or to take to a friend's house for more fun.\nRecreate even bigger LEGO® NINJAGO® epic battles with other sets: Kai vs. Skulkin (71730), Zane vs. Nindroid (71731) and Cole vs. Ghost Warrior (71733).\nLEGO® NINJAGO® sets take kids away from their screens into a world of imaginative play where they can learn positive life skills on adventures alongside their ninja heroes.\nFor more than six decades LEGO® bricks have been made from the highest-quality materials to ensure they consistently pull apart. Ninja skills not needed!\nLEGO® building bricks meet the highest safety standards in the world."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/epic-battle-set-kai-vs-skulkin-71730","description":"Get kids playing out ultimate good-versus-evil battles between hero Kai and his nemesis Skulkin with this Epic Battle Set – Kai vs. Skulkin (71730) playset. Featuring a cool spinning platform battle toy and a small brick-built temple, this ninja toy makes a great treat and will inspire kids to enjoy hours of captivating role play.\n\nEverything kids need for imaginative play\nThis buildable toy features 2 minifigures: a new-for-January-2021 Kai and a Legacy Skulkin from Seasons 1 and 2 of the LEGO® NINJAGO® TV series, while the included 4 red weapons add an extra dimension to the battle play.\n\nThe best buildable toys for creative kids\nNINJAGO playsets encourage kids to step away from their screens to enjoy daring adventures in a fantasy world. They will love learning valuable life skills and teaming up with their ninja heroes as they play with an exciting collection of ninja toys including mechs, planes and dragons.\n\nLEGO® NINJAGO® Epic Battle Set – Kai vs. Skulkin (71730) lets kids stage exciting all-action battles between their hero Kai and the evil Skulkin.\nNinja playset features 2 minifigures: a new-for-January-2021 Kai and a Legacy Skulkin from Seasons 1 and 2 of the LEGO® NINJAGO® TV series and 4 red weapons.\nAlso includes a detailed brick-built temple and a cool battle platform for Kai to spin into the action and use as a powerful weapon to knock over Skulkin.\nWith 61 pieces, this playset is a fun building experience for kids aged 6 and up and the perfect ‘just because’ treat they will want to play with over and over again.\nTemple measures over 1 in. (3 cm) high, 4.5 in. (12 cm) wide and 2.5 in. (6 cm) deep – the perfect size to play with at home or to take to a friend's house for more fun.\nRecreate even bigger LEGO® NINJAGO® epic battles with other sets: Zane vs. Nindroid (71731), Jay vs. Serpentine (71732) and Cole vs. Ghost Warrior (71733).\nLEGO® NINJAGO® sets take kids away from their screens into a world of imaginative play where they can learn positive life skills on adventures with their ninja heroes.\nFor more than six decades, LEGO® bricks have been made from the highest-quality materials to ensure they pull apart consistently, every time. Ninja skills not needed!\nLEGO® building bricks meet the highest safety standards in the world."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/epic-battle-set-zane-vs-nindroid-71731","description":"This impressive Epic Battle Set – Zane vs. Nindroid (71731) lets kids create their own thrilling fights between ninja Zane and a Nindroid robot warrior. The high-action playset also features a brick-built Nindroid factory and spinning battle toy for NINJAGO® fans to include in their exciting duels.\n\nThe ultimate cool toy for kids\nThe ninja battle toy features 2 minifigures: a new-for-January-2021 Zane and a Legacy Nindroid warrior from the LEGO NINJAGO TV series. Your little ninja will love spending hours plotting thrilling fights, while the 4 white weapons add another dimension to the action.\n\nThe best toy playsets for ninja adventures\nLEGO NINJAGO playsets take kids away from their screens to enjoy imaginative adventures in a fantasy world of action. They will love learning valuable life skills and teaming up with their heroes as they play out scenes with a cool collection of ninja toys, including mechs and dragons.\n\nLEGO® NINJAGO® Epic Battle Set – Zane vs. Nindroid (71731) lets kids create their own ninja action scenes between their hero Zane and a dangerous Nindroid.\nNinja toy playset features 2 minifigures: a new-for-January-2021 Zane and a Legacy Nindroid from the NINJAGO® TV series, and 4 exclusive white weapons.\nThe ninja battle toy also includes a small brick-built Nindroid factory and a spinning battle platform for Zane to use to knock over his opponent in their awesome clashes.\nThis 56-piece battle playset is a fun building experience for kids aged 6 and up and the perfect birthday gift or surprise treat to make them happy.\nThe Nindroid factory measures over 1 in. (3 cm) high, 2.5 in. (6 cm) wide and 3 in. (8 cm) deep – a great size for fun at home or to take to a friend's house for more fun.\nRecreate even bigger LEGO® NINJAGO® epic battles with other sets: Kai vs. Skulkin (71730), Jay vs. Serpentine (71732) and Cole vs. Ghost Warrior (71733).\nLEGO® NINJAGO® sets takekids away from their screens into a world of imaginative play where they can learn positive life skills on adventures with their ninja heroes.\nFor more than six decades LEGO® bricks have been made from the highest-quality materials to ensure they consistently pull apart. Ninja skills not needed!\nLEGO® building bricks meet the highest safety standards in the world."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/skull-sorcerer-s-dungeons-71722","description":"Action-packed LEGO® NINJAGO® Skull Sorcerer’s Dungeons (71722) playset with 8 minifigures, including ninjas Hero Cole, Hero Zane and Hero Lloyd. The toy dungeons let creative kids enjoy countless hours re-enacting breathtaking battles from the TV series.\n\nThe ultimate LEGO board game\nThis building set for kids also acts as a thrilling NINJAGO board game. Ninja fans use the dice spinner to plot their way through the dungeons, avoiding traps, lava, moving bridges and the Skull Sorcerer's warriors as they seek to grasp the Shadow Blade of Deliverance and free a ninja from prison. It can also be combined with other LEGO sets to create a giant board game.\n\nLEGO toys offer a world of creative fun.\nLEGO NINJAGO building toys for kids provide an escape to a fantasy world of non-stop action where they can fight with their ninja heroes against the forces of evil. NINJAGO fans will love indulging in role play with ninja weapons, buildable figures, cars, dragons and much more.\n\nLEGO® board game and dungeons playset featuring Hero Cole, Hero Zane and Hero Lloyd to play out scenes from the NINJAGO® TV series. The ideal ninja toy for kids who love making their own stories and playing board games.\nThis LEGO® NINJAGO® Skull Sorcerer's Dungeons (71722) playset boasts 8 figures for kids to play out thrilling NINJAGO® dungeon adventures. The dice spinner doubles the fun and lets them compete in a LEGO® board game.\nThis awesome playset can be used as both toy dungeons for staging battles from the NINJAGO® TV series and a LEGO® board game for kids to plot their way past the traps and hazards before confronting the Skull Sorcerer.\nThis 1,171-piece LEGO® NINJAGO® board game with a vast array of figures offers a rewarding building task for boys and girls aged 9+ and makes a very cool birthday or LEGO gift for any occasion for creative kids.\nNew for June 2020, this ninja toy is just the right size to play with at home or to proudly display in a bedroom. The toy dungeons measure over 12” (31cm) high, 10” (27cm) long and 16” (43cm) wide.\nNo batteries are required for your little ninjas to enjoy dungeon adventures – it is ready for creative fun as they share the action with friends as soon as it is built. The play never has to stop!\nThis NINJAGO® board game is accompanied by helpful and detailed instructions, so youngsters can put it together with real confidence to get the fun started quickly.\nLEGO® NINJAGO® building sets for kids will inspire their imaginations and provide a passage into an amazing world of adventure where they can team up with their favorite ninja heroes for endless exciting battles.\nThe LEGO® bricks used to build this fun toy meet the highest industry standards, ensuring they are always consistent, compatible and pull apart with ease every time. Not even the Skull Sorcerer can defeat them!\nThe LEGO® bricks used to build this action toy with ninja weapons have been tirelessly tested and meet the highest global safety and quality standards. You are in safe hands with LEGO toys."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/empire-temple-of-madness-71712","description":"A stunning LEGO® NINJAGO® Ninja Temple with 6 minifigures including NINJAGO Digi Jay and Digi Cole, and the evil ruler of Prime Empire Unagami. With this temple toy and ninja minifigures, adventurous kids can have endless fun recreating the exciting end-game battle from the TV series. The best temple toy playset The LEGO® NINJAGO® temple offers a hive of activity and excitement to imaginative kids as they plot their way to the top. They must avoid the traps and use the Key-Tanas to get pastthe fearsome Sushimi in his sushi kitchen before opening the gate to reveal Unagami’s throne. Challenging and fun building sets LEGO® NINJAGO® building sets make the best toys for kids by offering an escape to a fantasy world of non-stop action where they can fight with their ninja heroes against the forces of evil. NINJAGO® fans will always be captivated as they role-play with action toys including ninja temples, buildable toys, cars, dragons and more.\nIncredible LEGO® NINJAGO® temple toy playset with exciting traps and features, and 6 minifigures from Prime Empire. This makes the perfect gift for kids who love role-playing stories with the team of ninja heroes.\nThis building set features a NINJAGO® Temple and 6 minifigures including NINJAGO Digi Jay, Lloyd and Cole, and the villains Unagami, Red Visor and Sushimi. Kids will love to indulge their creativity and stage battles.\nThis brilliantly detailed temple model offers hours of exciting fun for children as they attempt to avoid all the traps and the fearsome Sushimi, so they can use the three Key-Tanas to reveal Unagami’s throne at the top.\nThis 810-piece temple model is a rewarding construction toy for boys and girls aged 9+ and makes a great birthday gift, Christmas present, or LEGO gift for any occasion.\nNew for January 2020, this adventure toy is just the right size to play with at home or proudly display on a mantlepiece in a bedroom. The Empire Temple measures over 15” (38cm) high, 8” (22 cm) long and 11” (28cm) wide.\nNo batteries are required for this ninja playset – it is ready for independent play or to share the fun with friends as soon as it is built. The action with these adventure toys never has to stop for a single second.\nThis ninja playset provides the ideal model building task for children, who are accompanied by easy-to-follow instructions as they put together the bricks to create this cool action toy.\nLEGO® NINJAGO® model building kits for kids fuel their creativity and allow them to step into an exciting world of adventure where they can team up with their favorite ninja heroes for endless fun and exciting battles.\nThe LEGO® bricks used to build this construction toy have met the highest industry standards for more than 60 years, ensuring they are always consistent, compatible and pull apart with ease every time. Even Unagami can't defeat them!\nThe LEGO® bricks used to build this action toy have been relentlesslytested and meet the highest global safety and quality standards. You know you are in safe hands when you choose a LEGO toy as a gift for your kids."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/skull-sorcerer-s-dragon-71721","description":"NINJAGO® fans can build and play with the Skull Sorcerer’s Dragon (71721). This dragon building kit features 6 buildable figures for captivating creative play. Kids will be able to enjoy role-play action as the ninjas battle the Skull Sorcerer, his dragon and his skeleton warriors, to free themselves from the spooky Dungeons of Shintaro.\n\nAmazing playset for board game adventures\nThis dragon building set also doubles as a LEGO® NINJAGO board game boasting a ninja dice spinner and an assault course with a trap for the ninjas to navigate. Kids spin the dice and plot their way through the game to grasp the prized Ivory Blade of Deliverance. It can also be combined with other LEGO sets to create a giant board game.\n\nStunning Building Sets for Kids\nLEGO NINJAGO sets let imaginative youngsters escape to a mystical world where they can act out stories as their ninja heroes, taking on the forces of evil. Kids can indulge in hours of fun role play with a range of dragons, cars, jets and more.\n\nLEGO® NINJAGO® Skull Sorcerer’s Dragon (71721) dragon set with 6 minifigures to recreate battle scenes from the NINJAGO TV series. The ideal gift for fans who want to play out stories and take part in LEGO board games.\nDetailed ninja playset with a NINJAGO® dragon toy and 6 minifigures: Hero Jay, Hero Kai, Hero Nya, the Skull Sorcerer and 2 Awakened Warriors. Children can role-play adventures or take part in the exciting board game.\nThe LEGO® dragon has moving legs, wings and tail and can fire missiles from 2 shooters and drop bones and spiders. The ninja figures can also participate in a board game to escape the Dungeons of Shintaro.\nThis 1,016-piece dragon building set provides a great opportunity for boys and girls aged 9+ to throw themselves into a fun building task. NINJAGO® fans will love to receive it as a birthday present or anytime gift.\nNew for June 2020, this dragon building set is the ideal size to enjoy at home or to take on the go so the action never stops.The battle dragon fun toy is over 12” (31cm) high, 14” (38cm) long and 20” (53cm) wide.\nNo batteries are required for the LEGO® NINJAGO® board game and warrior toy figures – they are ready for action as soon as they are built, so the ninja adventures never have to stop.\nThe bricks and elements in this playset come with simple-to-follow instructions, making it quick and easy for your young builder to get their NINJAGO® dragon toy ready for creative play.\nLEGO® NINJAGO® ninja warrior kits provide a gateway to a thrilling world of dragon adventures, where kids can live out their dreams by teaming up with the ninjas for non-stop thrills.\nThe LEGO® bricks used in this dragon building set have met the highest industry standards for more than 60 years, ensuring they are always consistent, compatible and pull apart with ease every time.\nThe LEGO® bricks used to build this ninja warrior kit have been relentlessly tested and meet the highest global safety and quality standards. LEGO fun toys are a guarantee of quality."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/fire-stone-mech-71720","description":"This LEGO® NINJAGO® Fire Stone Mech (71720) with 5 minifigures is perfect for fans of ninja toys and building sets for kids. Youngsters will love putting together the fire ninja mech and figures to play out action-packed scenes from the NINJAGO TV series.\n\nAmazing LEGO fun toys\nThis stunning and detailed LEGO mech set offers kids a world of possibilities so they can enjoy hours of engrossing action. They can place two ninjas in the cockpit of the highly posable mech as it storms into battle against enemies Murt and Moe, smashing its way out from the bowels of Shintaro Mountain.\n\nThe perfect building toys for kids\nLEGO NINJAGO mech sets offer youngsters a gateway into a world of fantasy fun where they can indulge in creative play as they role-play stories with buildable figures. Your little ninja will be enthralled as they play with a range of action toys, including cars, jets, dragons and more.\n\nSuper-cool LEGO® NINJAGO® Fire Stone Mech (71720) and 5 minifigures for kids to recreate action from the NINJAGO TV series. This makes the perfect role-play toy for kids who want to pretend to be their ninja heroes.\nThis ninja playset includes a NINJAGO® Fire Stone mech and 5 minifigures: Hero Kai, Hero Nya, Hero Cole, Moe and Murt. Youngsters can have fun playing out their own NINJAGO brick adventures from the Dungeons of Shintaro.\nThis awesome toy provides kids with endless play possibilities. The Fire Stone ninja mech boasts highly posable legs and arms, fits up to 2 minifigures in its cockpit, and can fire studs from its shooters.\nThis 968-piece LEGO® NINJAGO® mech set provides a fun building experience for boys and girls aged 9+. New for June 2020, this action toy is the perfect way for little ninjas to explore their creativity.\nThis NINJAGO® building set for kids is perfect for play at home or for fun on the go. Ninjas can enjoy adventures anywhere! The fire ninja mech measure overs 10” (27cm) high, 7” (19cm) long and 11” (29cm) wide.\nNo batteries are required for this fun toy set – it is ready for breathtaking NINJAGO® action as soon as it is built. Kids need only the power of their imaginations.\nA fun and rewarding building experience is on offer to young LEGO® fans when they assemble this LEGO NINJAGO® mech, accompanied all the way by easy-to-follow instructions.\nLEGO® NINJAGO® building toys for kids fire up young, curious minds and allow themto escape into a unique world of fantasy action where they can join forces with their ninja heroes for awesome NINJAGO brick adventures.\nThe LEGO® building bricks in this NINJAGO® mech meet the highest industry standards, ensuring they are always consistent, compatible and pull apart easily every time.\nThe LEGO® building bricks used for this LEGO mech set meet the highest global safety and quality standards. You are always in safe hands when you choose LEGO playsets as a gift for your children."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/jay-s-cyber-dragon-71711","description":"This LEGO® NINJAGO® Jay’s Cyber Dragon (71711) buildable toy with 5 minifigures will be adored by fans of ninja mechs, who can use it to create their own action-packed fantasy stories from Prime Empire. This stunning LEGO dragon is highly posable and fires missiles from its spring-loaded shooters. The best dragon toys With 5 buildable figures of NINJAGO® Digi Jay, Digi Nya, Unagami, Richie and Hausner, ninja fans can dive in the video game world of Prime Empire and play out battles for the yellow Key-Tana. The two ninjas can ride in the cockpit of the awesome Dragon Mech, which will grip youngsters’ imaginations as they play solo or with friends. The perfect construction toys LEGO® NINJAGO® building toys for kids allow them to enter a world of adventure where they can team up with their ninja heroes to take on the forces of evil. NINJAGO fans will be enthralled as they role-play with these stunning ninja action toys, which include ninja cars, dragon models, temples, buildable figures and more.\nStunningly designed LEGO® NINJAGO® Dragon toy for kids and 5 minifigures to stage thrilling action from Prime Empire. The perfect gift for dedicated fans of NINJAGO or kids with adventurous and creative minds.\nThis building set includes a Cyber Dragon and 5 minifigures: NINJAGO® Digi Jay, Digi Nya, Unagami, Hausner and Richie. The Dragon Mech and buildable figures can be used to stage thrilling scenes from the TV series.\nThis brilliantly detailed tech dragon has a posable head and limbsand can fire missiles from its spring-loaded shooters. The buildable figures all have health boards, and an exciting array of new armor and weapons from Prime Empire.\nThis 518-piece LEGO® dragon and ninja action figures toy set is a fun and challenging build for boys and girls aged 8+ and makes a great birthday gift, Christmas present or LEGO gift for any occasion. NINJAGO® fans will be thrilled.\nNew for January 2020, this Tech Dragon is the ideal size to play with at home or take out forfun on the go. The posable dragon measures over 4” (12cm) high, 15” (39cm) long and 12” (33 cm) wide.\nNo batteries are required for this tech dragon – it is ready to go into battle in both Prime Empire and NINJAGO® city as soon as it is built, so you never need a timeout.\nThis is the perfect LEGO® gift for a young builder. The bricks and buildable figures come with easy-to-follow instructions to quickly have your dragon toy ready for action.\nLEGO® NINJAGO® building toys for kids allow them to freely express themselves and dive into an exciting world of adventure where they can team up with their favorite ninja heroes for endless adventures against evil forces.\nLEGO® bricks have met the highest industry standards for more than 60 years, ensuring they are always consistent, compatible and pull apart with ease every time.\nThe LEGO® bricks used to build this dragon model construction toy have been relentlessly tested and meet the highest global safety and quality standards.You know you are in safe hands when you choose a LEGO toy for your kids."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/zane-s-mino-creature-71719","description":"Kids will love building this LEGO® NINJAGO® Zane’s Mino Creature (71719) set, featuring 4 buildable figures, for creative fun on their own or with friends. They can dive into this thrilling world of fantasy with Hero Cole and Hero Zane and help them escape the terrifying Dungeons of Shintaro.\n\nThe perfect ninja toy for board game adventures\nThis NINJAGO Zane set doubles as a LEGO board game, featuring a ninja dice spinner and a fort with a special trap. Kids can spin the dice and take part, with the aim of avoiding the trap, getting past their enemies and grasping the prized Ivory Blade of Deliverance. It can also be combined with other LEGO sets to create a giant board game.\n\nStunning building toys for kids\nLEGO NINJAGO sets allow imaginative youngsters to escape to a mystical world where they can role-play adventures as their ninja heroes, taking on the forces of evil. Kids will have hours of enjoyment playing with these fun toys, which include mechs, dragons, ships, jets and lots more.\n\nAwesome LEGO® NINJAGO® Zane’s Mino Creature (71719) playset. This building toy for kids is perfect for those who love playing NINJAGO board games and recreating captivating stories with ninja buildable figures.\nNinja playset includes Hero Zane, Hero Cole and their Mino Creature, who take on the Geckles, Ginkle and Gleck, at their fort for thrilling battles. There is also a dice spinner for kids to play the NINJAGO board game.\nNew for June 2020, this NINJAGO® Zane set includes 4 minifigures and a Mino Creature to recreate scenes inside the Dungeons of Shintaro. Kids can also use the characters to compete in an exciting LEGO® NINJAGO board game.\nThe 616-piece LEGO® board game offers a rewarding building experience for boys and girls aged 8+ and is a great birthday or LEGO gift for any occasion. This action toy inspires solo or sociable imaginative play.\nThis awesome toy is a great size to play with at home or to take on the go. The LEGO® NINJAGO® Mino Creature ram figure measures over 7” (18cm) high, 10” (26cm) long and 18” (7cm) wide.\nNo batteries are required for this LEGO® NINJAGO® board game – it’s ready to play with right out of the box. These ninja medieval toys are powered solely by kids’ creativity, so the fun never has to stop.\nThis is the perfect fun toy to give to a young LEGO® builder. The bricks and figures come with easy-to-follow instructions so they can quickly get the action started.\nLEGO® NINJAGO® fun toys let kids escape to a thrillingworld of fantasy action where their favorite ninjas take on a cast of evil villains. It’s the ideal way to inspire creative play!\nLEGO® bricks have met the highest industry standards since 1958, ensuring they are always consistent, compatible and pull apart with ease every time.\nThese LEGO® bricks and pieces have been rigorously tested to meet the highest global safety and quality standards. Robust enough even to withstand being trampled on by a Mino Creature!"},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/kai-fighter-71704","description":"Ninja fans who love creating iconic LEGO® NINJAGO® Legacy playsets and have a passion for playing with fun toys and buildable figures will be enthralled by the Kai Fighter (71704). This stunning building set for kids features a toy jet and 2 ninja and 2 Nindroid Warrior action figures.\n\nThe perfect ninja toy for creative fun.\nCelebrate the famous history of NINJAGO by building this cool LEGO NINJAGO Legacy set, a modern and upgraded action toy from season 3 of the TV series. Kids will enjoy the fun challenge of putting it together from building bricks before staging epic ninja battles between Kai and Lloyd and the Overlord’s Nindroid Warriors.\n\nThe best ninja playsets\nLEGO NINJAGO ninja toys offer youngsters a gateway into a world of fantasy fun where they can indulge in creative play as they role-play stories with NINJAGO action figures. Your little ninja will be captivated as they play with a range of action toys, including ninja jets, mechs, vehicles and dragons.\n\nLEGO® NINJAGO® Legacy set featuring Kai Fighter toy jet, and 2 ninja and 2 Nindroid warrior action figures from season 3 of the TV series. Kids who love ninja toys can enjoy hours of creative play or share the fun with friends.\nCool playset includes a ninja jet and 2 ninja and 2 Nindroid Warrior action figures, with their Nindroid shooter. Kids have all they need to recreate action from the NINJAGO® Masters of Spinjitzu TV series.\nA modern update of the Kai Fighter from NINJAGO® Mastersof Spinjitzu, with folding wings, an adjustable cockpit and two spring-loaded shooters. Between plotting epic battles, kids can display it in their bedrooms.\nThis 513-piece NINJAGO® Legacy set provides a fun building task for boys and girls aged 8+, and is an exciting birthday or holiday gift. This ninja warrior kit encourages hours of creative play for NINJAGO fans.\nThis LEGO® NINJAGO® Legacy set is an ideal size to enjoy at home or when kids are on the go. The toy jet measures over 5” (13cm) high, 13” (34cm) long and 16” (43cm) wide.\nNo batteries are required for this exciting playset – little ninjas just need to fire up their imaginations before embarking on NINJAGO® brick adventures.\nKids do not need to worry about what to do with the 513 pieces – the ninja warrior set comes with easy-to-follow instructions to guide them through the building process.\nLEGO® NINJAGO® fun toys and buildable figures provide kids with a gateway to a thrilling world of fantasy action and allow them to create stories with their favorite ninjas.\nLEGO® building bricks have met the highest industry standards for more than 60 years, ensuring they are always consistent, compatible and pull apart with ease every time, whether on Earth or in NINJAGO® city!\nThese LEGO® bricks and pieces have been relentlessly tested and meet the highest global safety and quality standards. You will always have peace of mind with LEGO building kits."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/ninja-tuner-car-71710","description":"This LEGO® NINJAGO® Ninja Tuner Car (71710) with 4 minifigures building set will be loved by fans of ninja cars, who also have the thrill of transforming it into a flying toy. Kids can role-play being their hero NINJAGO Digi Kai and learn about the ninjas' ethos of believing in yourself and helping others. The best toy cars for kids With 4 buildable figures of NINJAGO Digi Kai, Scott and two evil Red Visors, youngsters can immerse themselves in the video game world of Prime Empire and recreate battles for a Key-Tana. This combined ninja car and flying toy will really fire up their imagination and inspire independent play, or endless fun with friends. The perfect LEGO gift LEGO NINJAGO building sets allow kids to enter a mystical world of adventure where they can team up with their ninja heroes to take on the forces of evil. NINJAGO fans will be captivated as they role-play with these stunning action toys, which include speeders, NINJAGO® cars, dragons, temples and buildable figures.\nAwesome LEGO® NINJAGO® Ninja Tuner Car, which transforms into a flying car toy. This makes the ideal birthday gift for kids who love building NINJAGO cars and role-playing their own stories with their mini-ninja heroes.\nThis building set includes a Ninja Tuner Car and 4 minifigures: NINJAGO® Digi Kai, Scott and two Red Visors. Youngsters will love escaping the real world and playing out scenes with this Speeder as they battle for a Key-Tana.\nThis awesome toy car for kids creates a worldof possibilities for builders as the Ninja Tuner Car can also sprout wings and become a plane. The 4 buildable figures all come with new health boards to show their remaining lives.\nThis 419-piece ninja playset is a rewarding build for boys and girls aged 8+ and makes a great birthday gift for kids. New for January 2020, the toy playset guarantees endless racing fun and hours of entertainment for your mini-ninjas.\nThis LEGO® Speed Racer is perfect to play with at home or to slip into yourbag for fun on the go. The Ninja Tuner Car measures over 2” (6 cm) high, 12” (33 cm) long and 4” (11 cm) wide.\nNo batteries are required for this toy racing set – it is ready to go for thrilling fantasy fun in NINJAGO® as soon as it is built, so you never need to pull over for petrol.\nThis is the perfect LEGO® gift for a young builder. The bricks and buildable figures come with easy-to-follow instructions to quickly have your LEGO Speed Racer ready for action.\nLEGO® NINJAGO® building toys for kids fuel their creativity and allow them to escape into an exciting world of adventure where they can team up with their favorite ninja heroes for endless adventures battling against evil forces.\nLEGO® bricks have met the highest industry standards for more than 60 years, ensuring they are always consistent, compatible and pull apart with ease every time.\nThe LEGO® bricks used to build this speed car have been relentlessly tested and meet the highest global safety and quality standards. You know you are in safe hands when you choose a LEGO® toy as a gift for your kids."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/gamer-s-market-71708","description":"This is a brilliant LEGO® NINJAGO® ninja market featuring 9 LEGO minifigures including NINJAGO Digi Jay and Avatar Nya, and a host of other mini-ninjas and villains. With these ninja collectibles and plenty of cool accessories, NINJAGO fans can freely express themselves and recreate scenes from the Gamer's Market in Prime Empire. An exciting new way to build your toy playset with ninja collectibles Instructions PLUS offers an interactive guide to constructing this toy playset featuring minininjas. Available on the free LEGO Life app, it has zoom and rotate viewing tools to help children piece together their LEGO bricks. The perfect buildable toys LEGO NINJAGO building sets make the perfect gift for kids by letting them enter a mystical world of adventure to team up with their ninja heroes against the forces of evil. NINJAGO® fans will be endlessly entertained as they role-play with action toys including gaming figures, buildable toys, cars, dragons and more.\nStunning LEGO® market with 9 exclusive LEGO minifigures from Prime Empire. This makes the perfect gift for kids who love the NINJAGO® realm and playing out their own stories with collectible ninja toys.\nThis building set features 9 minifigures including NINJAGO® Digi Jay, Avatar Nya and Avatar Cole, and exclusive figures of Avatar Pink Zane and Harumi. At the Gamer's Market, there is a weapons shop and hat stall for the NINJAGO figures, and to create stories around.\nThis awesome LEGO® market has stalls offering 6 different ninja hats and a range of new weapons to fire up youngsters’ imaginations as they dress and arm 9 gaming figures to recreate action at the Gamer’s Market.\nThis 218-piece toy market is a quick-to-build construction toy for boys and girls aged 7+ and makes a great birthday gift for kids. New for January 2020, these ninja toys provide non-stop fun and entertainment for creative children.\nThis toy market is just the right size to play with at home or can be taken with you when on the move. The Key-Tana stall measures over 5” (14 cm) high and 3” (9 cm) wide.\nNo batteries are required for this construction toy – it is ready for independent play or action with friends as soon as it is built. The fun with these ninja collectibles never stops.\nInstructions PLUS offers an interactive guide that makes building this LEGO® market an even more enjoyable experience. Available on the free LEGO Life app, it has zoom and rotate viewing tools to help children have fun while they build.\nLEGO® NINJAGO® building kit for kids fuel their creativity and allow them to step into an exciting world of adventure where they can team up with their favorite ninja heroes for endless adventure and battles.\nLEGO® bricks have met the highest industry standards for more than 60 years, ensuring they are always consistent, compatible and pull apart with ease every time.\nThe LEGO® bricks used to build this action toy have been relentlessly tested and meet the highest global safety and quality standards. You know you are in safe hands when you choose a LEGO toy as a gift for your kids."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/jay-and-lloyd-s-velocity-racers-71709","description":"LEGO® NINJAGO® fans will love building and racing these Jay and Lloyd’s Velocity Racers (71709) featuring an awesome buildable toy bike and plane for independent play or fun with friends! They can immerse themselves in this captivating world with the Digi Jay minifigure in a toy plane speeder and Digi Lloyd on his ninja bike as they race the evil Hausner. Extra fun! Instructions PLUS offers an interactive guide to help building this toy plane speeder and toy bike and makes it even more fun.Available in the free LEGO Life app; it has zoom and rotate viewing tools to help youngsters build independently. The perfect guide for this building project. The perfect birthday gift for kids LEGO NINJAGO playsets allow children to enter a mystical world where they can let their imaginations run wild as a team of brave ninja heroes take on the forces of evil. Kids will have hours of fun role-playing with these hot toys, which include mech toys, motorbikes, jet planes, dragons, temples andmore.\nStunning LEGO® NINJAGO® toy playset featuring Jay and Lloyd’s Velocity Racers. This building kit for kids is perfect for those who love adventure toys and role-playing exciting battles with ninja action figures.\nThis toy playset includes Digi Jay and his toy Speeder plane, Digi Lloyd and his toy ninja bike, Hausner and his hoverboard, and a Key-Tana. Kids will love to recreate the Speedway Five-Billion race from Prime Empire.\nNew for January 2020, this hot toy playset includes 3 minifigures who battle inside the Prime Empire video game. All the minifigures have cool prime controller weapons and health boards displaying their remaining lives.\nThese 322-piece construction toys provide a fun building experience for boys and girls aged 7+ and make a great birthday gift. The toy playset will inspire imaginative play or kids can indulge in role-play with friends.\nLEGO® NINJAGO® adventure toys are the ideal size to play with at home or take with you on the go. The toy bike measures over 2” (6 cm) high, 10” (28 cm) long and 1” (5 cm) wide.\nNo batteries are required for this ninja playset – it’s ready to play with right out of the box. These ninja vehicles are simply powered by kids’ imagination, so the racing and battles never have to stop.\nThis is the perfect ninja playset to give to a young LEGO® builder. The bricks and buildable figures come with easy-to-follow instructions, or kids can use the amazing digital and interactive Instructions Plus guide on the free LEGO Life app.\nLEGO® NINJAGO® collectible construction toys let kids enter a thrilling world of fantasy action and role-play with their favorite ninjas against the forces of evil. The perfect way to fully engage young minds.\nLEGO® bricks have met the highest industry standards since 1958, ensuring they are always consistent, compatible and pull apart with ease every time.\nThese LEGO® bricks and pieces have been rigorously tested and meet the highest global safety and quality standards, both here on Earth and in the NINJAGO® realm!"},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/journey-to-the-skull-dungeons-71717","description":"Kids can recreate thrilling scenes from the NINJAGO® TV series with this Journey to the Skull Dungeons (71717) playset. With 4 minifigures, including Hero Nya, Hero Jay, Hero Lloyd and Murt, creative youngsters can plot their own dungeon adventures.\n\nAmazing LEGO® NINJAGO board game\nThis super-cool building set for kids also doubles as a LEGO NINJAGO board game. Youngsters can use the dice spinner to plot their way through the dungeon as they attempt to avoid the ninja traps, spiders and prison guard Murt before they can grasp the Shadow Blade of Deliverance and free one of the ninjas from prison. It can also be combined with other LEGO sets to create a giant board game\n\nThe perfect building sets for kids\nLEGO NINJAGO ninja toys give youngsters a gateway into a fantasy world where they can indulge in creative play and role-play stories with ninja minifigures. Your little ninja will be captivated as they play with a range of fun toys, including vehicles, mechs and dragons.\n\nLEGO® NINJAGO® Journey to the Skull Dungeons (71717) board game playset with ninjas Hero Nya, Hero Jay and Hero Lloyd from the NINJAGO TV series. A fun toy for kids who love to play on their own or with friends.\nThis fun toy boasts 4 buildable figures: Hero Nya, Hero Jay, Hero Lloyd and Murt, plus a dungeon toy with a prison cell. The dice spinner lets kids double the fun and compete in a thrilling LEGO® board game.\nThis super cool playset can be both a toy dungeon for recreating scenesfrom the NINJAGO® TV series and a board game for kids to navigate their way past the ninja traps and spiders to free an imprisoned ninja.\nThis 401-piece LEGO® NINJAGO® set with buildable figures offers a fun building experience for boys and girls aged 7+ and makes a highly sought-after birthday or LEGO gift for any occasion, for dedicated ninja fans.\nThis kids prison playset guarantees countless hours of creative play. The dungeon toy measures over 5” (13cm) high, 8” (22cm) long and 8” (20cm) wide – just the right size for kids to take wherever they go.\nThis toy dungeon requires no batteries – it’s ready to go. All kids need to do is fire up their imaginations and dive in!\nEasy-to-follow building instructions are included to help bring this kids' prison playset to life and quickly enjoy captivating dungeon adventures.\nLEGO® NINJAGO® sets fuel their creativity and provide escape into an all-consuming world of thrills and adventure where they can pretend to be daring ninjas.\nLEGO® building bricks have met the highest industry standards since 1958. They are consistent, compatible and pull apart with ease every time.\nThese LEGO® bricks and pieces have been rigorously tested and meet the highest global safety and quality standards, even down in the Dungeons of Shintaro!"},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/storm-fighter-battle-71703","description":"Kids can recreate thrilling scenes from early seasons of the Masters of Spinjitzu TV series with this updated LEGO® NINJAGO® Legacy set. Storm Fighter Battle (71703) features 3 minifigures, a toy jet, a toy car and a NINJAGO temple with a jail. This ninja battle set will provide imaginative kids with hours of creative fun.\n\nWelcome to 4+!\nLEGO NINJAGO 4+ toys help preschool kids learn to build their favorite characters, vehicles and buildings. With Starter Brick bases to make the process simpler, these sets are specially designed so first-time builders can experience the pride of constructing all on their own.\n\nThe perfect building sets for kids\nLEGO NINJAGO ninja toys give youngsters a gateway into a fantasy world where they can indulge in creative fun and role-play stories with NINJAGO action figures. Your little ninja will be captivated as they play with a range of ninja toys, including ninja jets, mechs and dragons.\n\nLEGO® NINJAGO® Legacy set featuring Kai and Jay from classic early seasons of the TV series for exciting adventures against Lasha. This NINJAGO battle pack is perfect for helping preschool kids develop and improve their building skills.\nThis fun toy has Starter Brick bases to help little ninjas learn to build and create their own NINJAGO® adventures with minifigures of Kai, Jay, Lasha, a toy car, toy jet and a temple with a jail attached.\nThis Storm Fighter Battle NINJAGO® Legacy set features a cool ninja jet with folding wings and a toy car with shooter for ninja fans to stage exciting battle scenes from the NINJAGO Masters of Spinjitzu TV series.\nThis 165-piece NINJAGO® battle set with buildable figures offers a fun building experience for preschoolers aged 4+, and makes a highly desirable birthday present or holiday gift for passionate ninja fans.\nNew for June 2020, this ninja toy is an eagerly anticipated update from classic seasons of the NINJAGO® TV series. The temple measures 4” (10cm) high, 5” (13cm) long and 8” (20cm) wide – the perfect size to play with anywhere.\nThis Building toy for kids requires no batteries – it’s ready to go. The NINJAGO® battle pack is controlled only by kids’ imaginations, so the ninjas never need to call a ceasefire.\nThe perfect fun toy to help preschoolers learn to build. Easy-to-follow building instructions are included to help bring this NINJAGO® battle set to life and start NINJAGO brick adventures.\nLEGO® 4+ building sets for kids introduce them to a wide universe of their movie favorites, TV characters and everyday heroes, helping them to understand the purpose of building steps and boosting their confidence.\nLEGO® building bricks have met the highest industry standards since 1958. They are consistent, compatible and pull apart with ease every time.\nThese LEGO® bricks and pieces have been rigorously tested and meet the highest global safety and quality standards, both here on Earth and in NINJAGO®city!"},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/kai-s-fire-dragon-71701","description":"LEGO® NINJAGO® fans can recreate famous scenes from season 1 of the TV series with this upgraded legacy red dragon toy and 2 minifigures. Kai’s Fire Dragon (71701) must stop Lord Garmadon snatching the Sword of Fire from the mini fire temple. Kids are sure to be entertained for hours as they escape into this fantasy world. The new way to build toys for kids LEGO fans now have a new and interactive way to build this dragon toy figure: the digital Instructions PLUS via the free LEGO Life app on smartphones and tablets. Zoom, rotate and view this ninja dragon as it comes to life on a screen and in front of you. Welcome to 4+! LEGO NINJAGO® 4+ toys offer preschool kids a gateway to an action-packed world where they can let their imaginations run wild as they learn to build their favourite characters, vehicles and buildings. With Starter Brick bases to make the process simpler, these sets are specially designed so first-time builders can experience the pride of constructing all on their own.\nLEGO® NINJAGO® Legacy playset featuring Kai and his Fire Dragon from season 1 of the TV series for epic battles against Lord Garmadon. This cool toy for kids will help them learn to build with confidence.\nThis ninja toy has a Starter Brick base to help youngsters learn to build and create role-play stories with NINJAGO® Kai, his Fire Dragon, Lord Garmadon, a mini fire temple with the Sword of Fire, and 2 fire elements.\nThis Red Dragon toy is highly posable, and can move its legs, wings, tail, head and mouth as it battles alongside Kai against Lord Garmadon. Kids can devise stories as they seek to protect the Sword of Fire.\nThis 81-piece dragon toy provides a fun building experience for preschoolers and youngsters aged 4+ and makes a great birthday gift for kids, Xmas present, or LEGO® gift for any occasion.\nNew for January 2020, this is an update on the LEGO® NINJAGO® dragon toy from season 1 of the TV series. The ninja dragon measures over 2” (6cm) high, 2” (6cm) long and9” (23cm) wide – the perfect size to play with anywhere.\nNo batteries are needed for this LEGO® NINJAGO® dragon – it’s can be played with right out of the box. The dragon toy figure is powered by kids’ imaginations, so the quest to protect the Sword of Fire never has to stop.\nThe perfect LEGO® toy to help preschoolers learn to build. A guide is included to explain the building steps and the ninja dragon can also be built using the interactive Instructions Plus guide on the free LEGO Life app!\nLEGO® 4+ buildable toys introduce younger children to a wide universe of their movie favorites, TV characters and everyday heroes, helping them to understand the purpose of building steps and boosting their confidence.\nLEGO® building bricks have met the highest industry standards since 1958. They are consistent, compatible and pull apart with ease every time. Used to create this ninja build, they would defeat even Lord Garmadon!\nThese LEGO® bricks and pieces have been rigorously tested and meet the highest global safety and quality standards, both here on Earth and in NINJAGO® city!"},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/kai-s-mech-jet-71707","description":"Kai’s Mech Jet (71707) is the ideal birthday gift for kids who love LEGO® NINJAGO® Mechs and Toy Planes. This is a 2-in-1 toy playset, which increases building and play possibilities. Kids can choose for it to be a toy jet plane or a mech toy for exciting adventures in Prime Empire with NINJAGO Kai. The fun new way to build LEGO gifts Instructions PLUS offers an interactive guide to build this toy jet and mech toy and makes it even more fun. Available in the free LEGO Life app; it has zoom and rotate viewing tools to help youngsters build independently. The perfect guide to create this toy playset. The best building kits for kids LEGO NINJAGO buildable toys let kids enter a mystical world where they can indulge in imaginative play as a team of mini ninjas take on the forces of evil. Kids will be completely enthralled as they role-play with toy jets, NINJAGO Mechs, speeders, dragons and temples.\nBrilliant LEGO® NINJAGO® building kit for kids featuring Kai’s Mech Jet. This toy playset will be adored by kids who love buildable toys and creating exciting stories with NINJAGO figures and mech toys.\nThis building set includes a NINJAGO® Mech that rebuilds into a toy plane, 2 minifigures: NINJAGO® Kai and Richie, and a Key-Tana. Together they will fuel kids' creativity as they re-enact scenes from Prime Empire.\nNew for January 2020, this toy jet plane creates a world of possibilitiesas it can also be rebuilt into a powerful mech toy with posable arms and legs and shoot studs.\nThis 217-piece action toy is a rewarding build for boys and girls aged 7+ and makes a great holiday gift. The awesome building set will inspire kids to embrace imaginative play as they bring to life their favorite ninjas.\nLEGO® NINJAGO® Mech action toys are the perfect size to play with at home or take with you for fun on the go. The mech measures over 6” (16 cm) high and 9” (25 cm) wide.\nNo batteries are required for this construction toy – it’s simply fueled by kids’ vivid imaginations, so you never need to leave the NINJAGO® realm.\nThe perfect ninja playset to give to a young LEGO® builder. The bricks and buildable figures come with paper instructions, as well as the amazing digital and interactive Instructions Plus guide on the free LEGO Life app.\nLEGO® NINJAGO® collectible buildable toys let kids enter a thrilling world of fantasy action and create stories with their favorite ninjas as they take on the forces of evil.\nLEGO® bricks have met the highest industry standards for more than 60 years, ensuring they are always consistent, compatible and easily pull apart every time. LEGO always delivers quality here on Earth or in the action-packed NINJAGO® realm.\nThese LEGO® bricks and pieces have been relentlessly tested and meet the highest global safety and quality standards. With LEGO playsets, you always have your peace of mind."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/wu-s-battle-dragon-71718","description":"This LEGO® NINJAGO® Wu’s Battle Dragon (71718) building set for kids with 2 minifigures will be adored by fans of ninja toys, who can use it to stage their own fantasy stories from the NINJAGO TV series. The awesome posable dragon can move its wings, tail, feet and head.\n\nThe best dragon building kit\nWith 2 buildable figures of Hero Wu and Gleck, ninja fans can immerse themselves in the mysterious Dungeons of Shintaro and play out battles between themselves for the Ivory Blade of Deliverance. Wu can ride his flying dragon, which will enchant youngsters’ creative minds.\n\nThe ultimate ninja playsets\nLEGO NINJAGO building toys for kids let them learn about the honorable values of ninjas as they venture into a world of mystery where they can role-play their heroes battling powerful dark forces. NINJAGO fans will be gripped for hours by these fun toys, which include dragons, cars and mechs in the different playsets.\n\nAwesome LEGO® NINJAGO® Wu’s Battle Dragon (71718) toy and 2 minifigures to recreate action from the NINJAGO TV series. The ideal gift for NINJAGO fans or kids who enjoy plotting their own dragon adventures with fun toys.\nThis dragon playset includes a Battle Dragon and 2 minifigures: Hero Wu and Gleck, and the Ivory Blade of Deliverance. Kids can stage fun stories of their own to see which of these characters triumphs!\nThis wonderfully detailed Battle Dragon has a posable head, legs, wings and tail and is designed for the Hero Wu minifigure to ride. Gleck is armed with a crossbow to fire studs.\nThis 321-piece LEGO® dragon building kit provides an exciting and rewarding build for boys and girls aged 7+ and makes a great birthday present or LEGO gift for any occasion.\nNew for June 2020, this NINJAGO® dragon set is a great size to play with at home or to take out for adventures on the go. The flying dragon measures over 4” (12cm) high, 9” (24cm) long and 13” (33cm) wide.\nNo batteries are required for this dragon building set – it is ready to head into the sky, powered solely by your child’s imagination, for hours of creative play.\nThis is the perfect LEGO® gift for a young builder. The bricks and buildable figures come with easy-to-follow instructions so kids will quickly have the dragon ready for adventures.\nLEGO® NINJAGO® building toys for kids let them learn the honorable values of the ninjas and enjoy active play as they lose themselves in an excitingworld of adventure.\nThe LEGO® bricks used to build this playset have met the highest industry standards, ensuring they are always consistent, compatible and pull apart with ease every time.\nThe LEGO® building bricks in this dragon building kit have been relentlessly tested and meet the highest global safety and quality standards. You know you are in safe hands with LEGO fun toys."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/cole-s-speeder-car-71706","description":"This LEGO® NINJAGO® Cole’s Speeder Car (71706) with 2 minifigures is ideal for fans of toy car sets and NINJAGO action figures. Kids will love this easy-to-build NINJAGO car. They can recreate stories inside the video game Prime Empire with their ninja hero Digi Cole behind the wheel of this mini toy car as he battles Hausner for a prized Key-Tana. A new fun way to build! Instructions PLUS offers a digital, interactive guide to building this toy car for kids. Available in the free LEGO Lifeapp, it has zoom and rotate viewing tools to help even younger children build this cool LEGO brick model. The perfect LEGO gifts LEGO NINJAGO 4+ toys offer preschool kids a gateway to an action-packed world where they can let their imaginations run wild as they learn to build their favourite characters, vehicles and buildings. With Starter Brick bases to make the process simpler, they are specially designed so first-time builders can experience the pride of constructing all on their own.\nFun LEGO® NINJAGO® toy car set featuring Cole’s Speeder Car. This easy to build LEGO set is ideal to help preschool kids learn to build and grow confidence with simple building steps.\nThis toy car set has a Starter Brick chassis to make building the Speeder car easier and includes Digi Cole and Hausner on his hoverboard. Preschool kids will love using imaginative play to recreate scenes from Prime Empire.\nNew for January 2020, this hot toy includes the buildable figures of NINJAGO® DigiCole and Hausner who engage in epic adventures inside the Prime Empire video game.\nThis 52-piece toy car for kids set is a quick build for boys and girls aged 4+ and makes a great holiday gift. The toy playset will inspire imaginative play by ninja fans of the exciting NINJAGO® realm.\nLEGO® NINJAGO® cars are perfect to play with at home or slip into your bag for fun on the go. The Speeder Car measures over 1” (4 cm) high, 3” (10 cm) long and 2” (6 cm) wide.\nNo batteries are required for this toy car set – it’s simply fueled by kids’ imagination, so the racing and battles in NINJAGO® never have to take a breath.\nPreschool kids can learn to build with digital Instructions PLUS, which feature intuitive modes like zoom, rotate and ghost mode. They will love using this to see their action toys come to life.\nLEGO® 4+ buildable toys introduce younger children to a wide universe of their movie favorites, TV characters and everyday heroes, and helps them to understand the purpose of building steps and boost their confidence.\nLEGO® bricks have met the highest industry standards for more than 60 years, ensuring they are always consistent, compatible and pull apart with ease every time, whether on Earth on in the NINJAGO® realm.\nThese LEGO® bricks and pieces have been relentlessly tested and meet the highest global safety and quality standards. You always have peace of mind with LEGO building kits."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/jungle-raider-71700","description":"Kids who love bringing to life classic LEGO® NINJAGO® Legacy adventure toys and have a passion for playing with toy buggys will be thrilled with this Jungle Raider (71700). After assembling it from building bricks they can plot exciting action scenes from the Tournament of Elements as the ninja action figure of Lloyd enjoys epic adventures in the jungle. A new and exciting way to build cool toys for kids Instructions PLUS offers a digital and interactive guide to building this jungle toy. Available in the free LEGO Life app, it has zoom-and-rotate viewing tools to help young children build this cool LEGO building brick model. The best building kits for kids LEGO NINJAGO adventure toys give kids a passport to an action-packed world where they can express themselves with independent play as they create stories around the ninja warriors. Youngsters are guaranteed endless fun as they play with a range of ninja toys, including jungle toys, jet planes, dragons, NINJAGO vehicles and more.\nLEGO® NINJAGO® Legacy play set featuring Jungle Raider toy buggy and Lloyd ninja action figure from season 4 of the TV series. Kids who love ninja models can enjoy hours of independent play or share the fun with friends.\nThis building kit for kids includes a toy buggy with large rubber tires for racing and a ninja warrior Lloyd minifigure wielding a golden sword. Kids have all they need to stage scenes from the Tournament of Elements.\nA modern update of the Jungle Raider from NINJAGO® Masters of Spinjitzu, this ninja toy has a cool suspension feature where kids can press down and watch it spring up. Kids can stage races or display in their bedrooms.\nThis 127-piece top toy makes a rewarding building task for boys and girls aged 7+ and is a great birthday gift for kids. The ninja build will inspire imaginative play from children who revere the team of young ninjas.\nThis LEGO® NINJAGO® ninja build and mini ninjas are just the right size to play with at home or take with youwherever you go. The toy buggy measures over 2” (7cm) high, 5” (14cm) long and 3” (8cm) wide.\nNo wasting time hunting around for batteries with this ninja toy! None are required – all that is needed to enjoy this set are children’s active imaginations.\nPaper instructions are good, but LEGO® playsets provide something even better for the building process: Digital Instructions PLUS on the free LEGO Life app feature modes like zoom, rotate and ghost to help kids create top toys.\nLEGO® NINJAGO® collectible action toys and mini action figures provide kids with a passport to a thrilling world of fantasy action and allow them to create stories with their favorite ninjas.\nLEGO® building bricks have met the highest industry standards for more than 60 years, ensuring they are always consistent, compatible and pull apart with ease every time, whether on Earth or in NINJAGO® city!\nThese LEGO® bricks and pieces have been relentlessly tested and meet the highest global safety and quality standards. You know you have peace of mind with LEGO building kits."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/spinjitzu-burst-cole-70685","description":"This awesome NINJAGO® Spinjitzu Burst - Cole (70685) accessory set allows youngsters to enjoy countless hours of creative play as they learn to become Spinjitzu masters. Kids can role-play exciting scenes with the LEGO® NINJAGO Spinjitzu building kit on their own or with friends.\n\nFun and interactive LEGO Spinjitzu set\nThrilling NINJAGO brick adventures are guaranteed for your little ninja when they build this fun toy playset. They can place the Cole minifigure inside a Spinjitzu spinner of NINJAGO blades and launch him into the air. The perfect gift for imaginative kids who will have a blast!\n\nThe best role-play toys for kids\nNINJAGO sets give children the chance to enter a world of fantasy action where they can indulge in creative play as the team of ninjas develop their skills and take on the forces of evil. Kids will be enthralled with these ninja toys, including cars, dragons, buildable figures and more.\n\nNINJAGO® Accessory set featuring Spinjitzu spinner fun toy and Cole figure to create exciting NINJAGO Spinjitzu action scenes. The ideal building set for kids to inspire the imaginations of passionate ninja fans.\nNINJAGO® accessory pack includes Spinjitzu spinner, launch pad and LEGO® ninja Cole minifigure. Dedicated NINJAGO fans can enjoy creative fun and play out exciting stories with this fun toy.\nNew for June 2020, this collectible LEGO® Spinjitzu set lets children place a Cole Burst figure inside the Spinjitzu spinner before launching him into a spin for endless hours of NINJAGO® fun.\nThis 48-piece ninja toy for kids is a rewarding build for boys and girls aged 7+, and encourages imaginative fun for ninja fans. It makes a great birthday gift or LEGO® present for any occasion.\nThe NINJAGO® accessory pack is for fun at home or slip into your bag when you are on the go. The Spinjitzu spinner of NINJAGO blades and launch pad measures over 2.5” (7 cm) high, 3.5” (10 cm)long and 3” (7cm) wide.\nNo batteries are required for your little Spinjitzu master to propel Cole Burst into a spin – it’s ready to go for NINJAGO® brick adventures as soon as they have built it.\nThe perfect LEGO® NINGAGO® Spinjitzu building kit for youngsters. The bricks come with easy-to-follow instructions to have the ninja toy ready quickly for Cole's NINJAGO Spinjitzu adventures.\nLEGO® NINJAGO® playsets and buildable figures let kids enter a thrilling world of fantasy action to plot stories with their ninja heroes as they perfect their Spinjitzu skills.\nLEGO® bricks have met the highest industry standards for more than six decades, ensuring they are always consistent, compatible and pull apart with ease every time, whether on Earth or in NINJAGO® city.\nThese LEGO® bricks have been constantly tested and meet the highest global safety and quality standards. You always have peace of mind with LEGO figures and building kits."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/spinjitzu-burst-kai-70686","description":"Stunning LEGO® Spinjitzu Burst-Kai (70686) set allows kids to indulge in hours of creative play as they help Kai Burst become a Spinjitzu master. A world of possibilities is on offer to ninja fans as they stage action-packed scenes with this LEGO NINJAGO Spinjitzu building kit.\n\nInteractive Spinjitzu Masters fun toy\nLittle ninjas can enjoy NINJAGO® brick adventures with this cool LEGO® Spinjitzu set. They can secure the Kai Burst figure in the Spinjitzu spinner, hit a button and send him into action. NINJAGO fans and imaginative youngsters will be enchanted by this fun toy.\n\nThe best role-play toys for kids\nLEGO® ninja playsets give children the chance to enter a thrilling world where they can enjoy imaginative fun with their favourite ninjas taking on the forces of evil. Kids will love the range of ninja toys, including cars, jets, dragons, buildable figures and more.\n\nNINJAGO® Accessory set featuring Spinjitzu spinner and Kai figure to role-play ninja action scenes. Playful kids with active imaginations will adore this innovative LEGO® NINJAGO Spinjitzu building kit.\nNINJAGO® accessory pack includes Spinjitzu spinner of NINJAGO blades, launch pad and LEGO® ninja Kai minifigure. This awesome toy guarantees hours of purposeful play as NINJAGO Kai trains to become a Spinjitzu master.\nNew for June 2020, this collectible LEGO® Spinjitzu set lets children place a Kai Burst figure inside the Spinjitzu spinner before sending him into action for non-stop NINJAGO® fun..\nThis 48-piece ninja toy for kids is a rewarding build for boys and girls aged 7+, and encourages imaginative fun for ninja fans. It makes a great birthday gift or LEGO® present for any occasion.\nThe ideal NINJAGO® accessory pack to play with at home or wherever kids' ninja adventures take them. The Spinjitzu spinner of NINJAGO blades and launch pad measures over 2.5” (7 cm) high, 3.5” (10 cm) long and 3” (7cm) wide.\nNo batteries are required for this awesome toy, only your little ninja’s imagination, and so Kai Burst never has to take a break from spinning into action!\nThe perfect LEGO® NINGAGO® Spinjitzu building kit for youngsters. The bricks come with easy-to-follow instructions to have this ninja toy quickly ready for Kai's NINJAGO Spinjitzu adventures.\nLEGO® NINJAGO® playsets and buildable figures let kids enter an enthralling world of fantasy action to plot stories with their ninja heroes as they develop their Spinjitzu skills.\nLEGO® bricks have met the highest industry standards for more over 60 years, ensuring they are always consistent, compatible and pull apart with ease every time, whether on Earth or in NINJAGO® city.\nThese LEGO® bricks have been constantly tested and meet the highest global safety and quality standards. You always have peace of mind with LEGO figures and building sets for kids."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/spinjitzu-burst-lloyd-70687","description":"This Spinjitzu Burst-Lloyd set (70687) with 1 figure is perfect for little ninjas who love role-play toys and building kits. This innovative ninja toy offers a world of exciting play possibilities to recreate exciting scenes and train NINJAGO® Lloyd to be a Spinjitzu master.\n\nFun and interactive NINJAGO® Accessory pack\nEndless NINJAGO® brick adventures are on offer with this LEGO® NINJAGO set. Imaginative kids can place the Lloyd Burst figure in the spinning blade toy, hit a button on the launch-pad and send him into action. NINJAGO fans will love to play with this on their own or with friends.\n\nThe ultimate LEGO® NINJAGO® Spinjitzu building kit\nLEGO® ninja playsets provide creative kids with a gateway to a fantasy world of fun where they can pretend to be their favourite ninjas and take on the forces of evil. Kids will be enthralled with this range of toys, including ninja weapons, jets, dragons, buildable figures and more.\n\nNINJAGO® Building set for kids featuring Spinjitzu spinner and Lloyd figure to play out action scenes. Imaginative kids will love the thrills on offer with this interactive LEGO® NINJAGO Spinjitzu building kit.\nThis ninja playset includes a Spinjitzu spinner, launch pad and LEGO® ninja Lloyd figure. Children will enjoy helping NINJAGO® Lloyd become a Spinjitzu master and transform into a ninja weapon.\nNew for June 2020, this collectible LEGO® Spinjitzu set is perfect for creative play and non-stop fun as NINJAGO fans can place the Lloyd figure inside the Spinjitzu spinner, hit the launch button and send him into action.\nThis 48-piece fun toy offers a rewarding building task for boys and girls aged 7+, and makes a great birthday present or gift for any occasion. The figure and ninja toy inspire rewarding creative play in kids.\nThe ideal LEGO® NINJAGO® set to play with at home, or on the go wherever kids' ninja adventures take them. The spinning blade toy measures over 2.5” (7 cm) high, 3.5” (10 cm) long and 3” (7cm) wide.\nNo batteries are required for this fun toy and buildable figure, only your little ninja’s imagination, so Lloyd will never be too tired for NINJAGO® Spinjitzu adventures.\nThe perfect LEGO® NINGAGO® Spinjitzu building kit for youngsters. The bricks come with easy-to-follow instructions to have this ninja toy ready quickly for Lloyd's NINJAGO Spinjitzu adventures.\nLEGO® building sets for kids provide a passport to a thrilling realm of fantasy action where ninja fans can create their own stories and work on their Spinjitzu skills.\nLEGO® bricks have met the highest industry standards for more than six decades, ensuring they are always consistent, compatible and pull apart with ease every time, whether on Earth or in NINJAGO® city.\nThese LEGO® bricks have been constantly tested and meet the highest global safety and quality standards. You always have peace of mind with LEGO figures and building kits."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/golden-zane-mf-acc-set-40374","description":"Dedicated NINJAGO® fans will love to recreate thrilling action scenes from season 3 of the TV series with this cool LEGO® Golden Zane Minifigure Accessory Set (40374). An exclusive minifigure to this set, Golden Zane can be used by kids to role-play battles against a dangerous army of Nindroids and a unique crawler vehicle in the digital world of Digiverse. Kids are guaranteed to be entertained for hours as they escape into this exciting fantasy realm.\nYoung builders with imaginative minds will be thrilled to create and play with this action-packed LEGO® Golden Zane Minifigure Accessory Set, featuring 4 minifigures and, exclusive to this set, a unique crawler vehicle.\nThe set contains a Golden Zane minifigure, a Nindroid with a cool backpack, and 2 fearsome Overlord warriors, each with a sword, so kids can stage exciting stories.\nThis is an ideal gift for kids aged 6 and up, who can combine it with their other NINJAGO® toys. There is no need for batteries and it comes with simple instructions to guide youngsters through the building process."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/lloyd-s-dao-with-sheath-854126","description":"NINJAGO® fans will love pretending to be one of their favorite ninja heroes with the awesome Lloyd’s Dao with Sheath (854126). New for March 2021, this fun toy helps Lloyd conquer all the villains he confronts in the fantasy world of NINJAGO. This small dagger has an impressively decorated sheath and can be strapped to a kid's back to boost role-play action.\nLloyd’s Dao with Sheath features a green dagger with an ornate handle for imaginative kids to play out action-packed stories with their ninja heroes.\nA fantastic birthday or Christmas gift that lets kids aged 6 and up dive into the all-action world of NINJAGO® to enjoy ninja adventures.\nMeasures over 19” (50cm) high and 4” (11cm) wide – the perfect size for kids to take with them into fun battles."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/jade-blade-854074","description":"Ninja fans will be thrilled to play with this fantastic NINJAGO® Jade Blade (854074) from the action-packed TV series. New for March 2021, the sword has a unique blade with a golden handle. When kids brandish it in daring battles, they are bound to conquer the ninjas' enemies! The sword can also be combined with NINJAGO costumes to create even more play options.\nSuper-cool NINJAGO® Jade Blade sword can be wielded by kids as they role-play awesome ninja scenes from the TV series for hours of fun.\nA brilliant birthday or Christmas gift for kids aged 6 and up to help them explore their creativity on their own or share the fun with friends.\nMeasures over 19” (50cm) high and 6” (17cm) wide – the perfect size for playtime action."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/sword-of-fire-854125","description":"Imaginative kids will love to play out thrilling ninja adventures with this famous LEGO® NINJAGO® Sword of Fire (854125). New for March 2021, the golden sword features an ornate handle with an eye-catching dragon’s head breathing fire along the blade. Young ninjas can brandish the sword as they act out their own action scenes or combine with NINJAGO costumes to further enhance the role-play experience.\nAmazing golden sword decorated with a fire-breathing dragon can be used by kids as they stage thrilling action from the NINJAGO® TV series.\nA popular birthday or Christmas gift for kids aged 6 and up that will keep them entertained for hours on end in the fantasy world of NINJAGO®.\nMeasures over 19” (50cm) high and 3” (9cm) wide – the ideal size for ninja adventures."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/jay-key-chain-853996","description":"NINJAGO® fans will be thrilled to own this awesome LEGO® NINJAGO® Jay Key Chain (853996). The key chain features a Jay minifigure ready for adventure in a stylish blue Legacy outfit with a bandana covering his face, and is attached to a durable metal chain and ring. This key chain can be fastened to your kid's backpack as a cool decoration or used to keep their keys safe.\nFeatures a LEGO® NINJAGO® Jay minifigure permanently attached to a durable chain and ring.\nA fun birthday or Christmas LEGO® gift for kids aged 6 and up, who can attach it to their backpack, bag or keys.\nMeasures over 5” (15cm) long; just the right size to fit in a pocket."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/lloyd-key-chain-853997","description":"Give the NINJAGO® fan in your life this super-cool LEGO® NINJAGO® Lloyd Key Chain (853996). The key chain features a Lloyd minifigure ready for battle wearing a stylish green Legacy outfit with a bandana covering his face, and is attached to a durable metal chain and ring. This key chain will proudly show off their passion for their ninja hero when secured to a backpack or a set of keys.\nFeatures a LEGO® NINJAGO® Lloyd minifigure permanently attached to a durable chain and ring.\nThe perfect treat for kids aged 6 and up, who can attach it to their backpack, bag or keys.\nMeasures over 5” (15cm) long; the perfect size to fit in a pocket."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/ninjago-city-gardens-71741","description":"Rediscover cherished memories and favorite ninja heroes with this NINJAGO® City Gardens (71741) set for play and display. Celebrate the 10th anniversary of the world of NINJAGO by enjoying a rewarding and fun-filled building task.\n\nA ninja toy for creative fun\nThere is something to enthrall NINJAGO fans on each of the brilliantly detailed 5 tiers, including an ice cream shop, Chen’s noodle house, the control room and a museum celebrating the ninjas’ rich history. The building set is also packed with 19 minifigures, including all of the ninjas and some their allies, to enhance the build-and-play experience.\n\nThe ultimate construction set for all NINJAGO fans.\nThis hugely impressive model is guaranteed to excite NINJAGO fans of all ages: a nostalgia-filled tower to proudly display for older builders, and a world of play opportunities for youngsters. The mammoth set has 5,685 pieces, so parents can also enjoy a rewarding and fun bonding experience building it with their children.\n\nSpectacular NINJAGO® City Gardens (71741) 5-tiered ninja house model to build and play with, or display to celebrate the 10th anniversary of the NINJAGO world.\nHouse playset has an incredible 19 minifigures to enhance role play including Young Lloyd, Kai, Zane, Urban Cole, Urban Jay, Urban Nya, Wu Legacy, Misako, Ronin, Hai, Cece, Mei and Tito.\nModel is packed with rooms, including an ice cream shop, Chen’s noodle house, a ninja control room and a museum, all with accessories and details inspired by the ninjas’ rich history.\nEach of the model’s 5 tiers lifts off for easy play action, and there is a ladder that can be pulled up and down at the back.\nThis 5,685-piece ninja playset is a great birthday gift for a passionate NINJAGO® or LEGO® fan and can be a fun bonding experience when a parent and child build it together.\nThe ninja house measures over 29 in. (73 cm) high, 17.5 in. (44 cm) long and 13 in. (33 cm) wide, which is sure to impress when placed on display.\nIncludes a collectible golden Wu Legacy minifigure to also celebrate the 10th anniversary of LEGO® NINJAGO® toys.\nLEGO® NINJAGO® has an amazing collection of cool toys for play or display, including mechs, dragons, cars and boats.\nFor more than six decades LEGO® bricks have been made from the highest-quality materials to ensure they consistently pull apart. Ninja skills not needed!\nLEGO® building bricks meet the highest safety standards in the world, so your kids are in safe hands with LEGO playsets."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/jungle-dragon-71746","description":"Get kids role-playing exciting scenes from the LEGO® NINJAGO® TV series with this super-cool Jungle Dragon (71746) ninja playset. Featuring highly posable wings, legs and tail, a jaw that opens and closes, plus a saddle for a ninja to ride in, it inspires the best imaginative play.\n\nCool ninja toys for kids\nThe dragon toy comes with 4 minifigures: Island Lloyd, Island Zane, PoulErik and Thunder Keeper, all armed with weapons so kids can play out gripping clashes to grab the storm amulet. There is also a surfboard with a shooting function to add even more fun to battles.\n\nGifts to wow friends\nLEGO NINJAGO toys make great gifts for kids who want to escape to an exciting and immersive fantasy world where they can team up with their heroes to battle a succession of evil villains. Ninja fans can play with an amazing collection of fun toys including dragons, jets and vehicles.\n\nLEGO® NINJAGO® Jungle Dragon (71746) playset, featuring a fantastic posable dragon toy so kids can recreate scenes from the TV series or make up their own exciting stories.\nIncludes 4 minifigures from the LEGO® NINJAGO® TV series: Island Lloyd, Island Zane, PoulErik and Thunder Keeper, all of whom carry cool weapons to increase the battle fun.\nDragon toy has highly posable wings, legs and tail, a jaw that opens and closes and a removable saddle so a ninja can ride the dragon during battle adventures.\nThe set also comes with a cool surfboard with a sail and a shooting function to wow play partners and add even more options to kids’ ninja battles.\nThis cool buildable toy set is a highly desirable birthday or holiday gift for kids aged 8 and up who love ninjas and creative fun.\nThe Jungle Dragon measures over 5.5 in. (15 cm) high, 11.5 in. (30 cm) long and 6.5 in. (17 cm) wide, so kids can proudly display it in their bedroom between playtime battles.\nLook out for moreNINJAGO® sets inspired by the TV series, including Lloyd’s Jungle Chopper Bike (71745), The Keepers’ Village (71747) and Catamaran Sea Battle (71748).\nLEGO® NINJAGO® has an amazing collection of cool toys for both play and display that lets kids learn positive life skills through exciting adventures alongside their ninja heroes.\nFor more than 6 decades, LEGO® bricks have been made from high-quality materials to ensure they connect and pull apart consistently every time – ninja skills not needed!\nLEGO® building bricks meet stringent safety standards, which means kids are in safe hands."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/destiny-s-bounty-71705","description":"Creative kids who love building classic LEGO® NINJAGO® Boat sets and are excited by playing with fun toys will love Destiny’s Bounty (71705). This detailed and interactive building set for kids features a NINJAGO LEGO ship and 7 ninja action figures including Wu, Kai, Zane and Cole.\n\nSpectacular LEGO NINJAGO Boat set\nLittle ninjas can enjoy plotting their own NINJAGO® epic adventures with this action-packed and interactive ninja playset, an updated version of the NINJAGO boat from season 1 of the TV series. Kids will love firing up their imaginations with this NINJAGO Destiny’s Bounty set.\n\nFun toys for creative play\nLEGO NINJAGO building sets for kids allow them to enter a world of gripping adventure where they can team up with their ninja heroes to take down an array of evil villains. NINJAGO fans will be captivated with a range of playsets, boats, cars, dragons, temples and buildable figures.\n\nDetailed and updated NINJAGO® Destiny’s Bounty set with 7 minifigures for ninja fans to recreate scenes from the exciting world of NINJAGO. This is a brilliant building set for kids who enjoy plotting their own stories.\nNINJAGO® Legacy set including awesome Destiny's Bounty LEGO® ship and 7 minifigures: Wu, Kai, Young Lloyd Garmadon, Samurai X, Zane, Jay and Cole. NINJAGO fans have an abundance of characters to indulge in role-play fun.\nThis Destiny's Bounty ninja toy allows kids to celebrate the rich history of NINJAGO® from season 1 of the TV series. Passionate ninja fans will love dropping the ship’s anchor, rotating the engines and moving its sails.\nThis 1,781-piece playset makes for a fun building experience for boys and girls aged 9+, and is a great birthday present. New for 2020, the playset allows creative youngsters to lose themselves in a unique fantasy world.\nThe NINJAGO® Destiny's Bounty Set can be played with at home or taken on the go for even more NINJAGO epic adventures. The LEGO® ship measures over 12” (32cm) high, 17” (44cm) long and 15” (38 cm) wide.\nGood news! No batteries are required for kids to enjoy the best possible creative fun with the Destiny’s Bounty – it is ready to go as it is built, so never needs to be left at the dock.\nThis playset comes with easy-to-follow instructions, so kids can build their NINJAGO® boat as quickly as possible before they set sail into battle.\nLEGO® NINJAGO® building sets for kids inspire kids' imaginations and allow them to escape into a world of non-stop fun and creative play as they team up with their ninja heroes.\nLEGO® bricks have met the highest industry standards for more than 60 years, ensuring they are always consistent, compatible and pull apart easily every time, whether you are at home or on the high seas.\nThe LEGO® bricks used to build this ninja playset meet the highest global safety and quality standards. You know you are in safe hands when you choose LEGO fun toys for your little ones."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/mf-set-ninjago-2019-40342","description":"Get set for exciting adventures with this 40342 LEGO® NINJAGO® 2019 Minifigure Set for kids. Youngsters will love playing out battles against bad guys Pyro Destroyer and Blizzard Archer with ninja hero Kai in his Legacy outfit and a new-for-June-2019 minifigure of legendary explorer Clutch Powers. Each minifigure has a weapon and the set also includes a brick-built weapon rack with additional weapon accessories. A great gift for youngsters to use with their LEGO NINJAGO construction toys for creative role-play.\n\nIncludes 4 LEGO® NINJAGO® minifigures: Clutch Powers, Kai (in Legacy outfit), Pyro Destroyer and Blizzard Archer.\nClutch Powers minifigure is new for June 2019.\nWeapons include Clutch Powers’ whip, Kai’s katana, Pyro Destroyer’s flame torch and Blizzard Archer's ice spear, plus Pyro Destroyer's shield element.\nAlso includes a brick-built weapon rack with additional weapon accessories.\nAn ideal gift for kids to use with their LEGO® NINJAGO® building sets."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/land-bounty-70677","description":"Kids will love building the versatile LEGO® NINJAGO® 70677 Land Bounty toy truck for play battles between the ninja action figures and snake queen Aspheera’s Pyro Vipers. This mobile ninja HQ features a steering function, 2 shuriken slicers, rotating shooting cannon, retractable spring-loaded shooter and an easily accessible, detailed interior to inspire creative play. For even more action, lift off the detachable flyer with dual minifigure cockpit, stud shooters and foldout boosters, or place a minifigure on the quad bike. Ninja kids will love reimagining scenes from the NINJAGO TV show and role-playing their own stories with 9 LEGO NINJAGO minifigures and lots of cool weapons and accessory elements, including a new-for-June-2019 ninja spinner.\n\nPlayset includes 9 new-for-June-2019 LEGO® NINJAGO® minifigures: Wu, Kai, Jay, Nya and Cole FS (Forbidden Spinjitzu) ninja action figures, plus Aspheera, Char, Pyro Destroyer and Pyro Slayer.\nLand Bounty ninja truck toy features wheels with gold-colored rims and a steering function, 2 gold-colored shuriken slicers, detachable flyer, rotating shooting cannon, retractable spring-loaded shooter, 2 decorated textile sails (1 on the detachable flyer), detailed interior room with a dual minifigure cockpit, dojo with 2 weapon racks, buildable arcade game, teapot element, and an opening rear compartment with small quad bike.\nDetachable flyer features an opening dual minifigure cockpit, 2 stud shooters and foldout boosters.\nQuad bike has a minifigure seat.\nTurn the switch at the back to turn the wheels and steer Land Bounty.\nDrive Land Bounty and the shuriken slicers spin automatically.\nWeapons include Kai's silver- and gold-colored katanas, Jay's silver-colored katana and gold-colored nunchucks, Nya’s silver-colored katana and gold-colored spear, Wu’s bo staff, Char’s snake scepter, Pyro Destroyer’s scimitar and Pyro Slayer’s sword.\nAccessory elements include Kai, Jay and Nya’s katana holders, Cole FS’s ‘powered-up’ hood element and new-for-June-2019 tornado spinner toy, Wu's new-for-June-2019 cape, Aspheera's Scroll of Forbidden Spinjitzu, Aspheera and Pyro Destroyer's snake armor and shield, and Pyro Slayer's shield.\nThis ninja toy truck set is a cool toy for kids to recreate exciting action from the NINJAGO® TV show.\nLand Bounty ninja vehicle measures over 8” (22cm) high, 19” (50cm) long and 7” (18cm) wide.\nDetachable flyer measures over 5” (13cm) high, 12” (31cm) long and 11” (30cm) wide."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/castle-of-the-forsaken-emperor-70678","description":"Play out ninja battles against the Ice Emperor, General Vex and the Blizzard Samurai warriors with this ice castle toy playset for boys and girls. The LEGO® NINJAGO® 70678 Castle of the Forsaken Emperor building features the Ice Emperor’s throne with a throne-reveal function, 2 towers—1 with a stud-shooting crossbow—and a separate ice tower with a spring-loaded shooter and an opening ice prison. Kids will love recreating scenes from the NINJAGO TV show and role-playing their own stories with 7 minifigures, a posable Ice Dragon toy and lots of cool weapons and accessory elements, including the Ice Emperor’s Scroll of Forbidden Spinjitzu weapon and Lloyd FS’s new-for-June-2019 tornado spinner toy.\n\nThis castle toy playset includes 7 new-for-June-2019 LEGO® NINJAGO® minifigures: Lloyd FS (Forbidden Spinjitzu), Cole, Akita, Ice Emperor, General Vex, Blizzard Sword Master and Blizzard Archer.\nCastle of the Forsaken Emperor building features the Ice Emperor's throne, ice arch and a throne-reveal function with an attachment point for Lloyd FS's tornado spinner, 2 towers, a stud-shooting crossbow, weapon storage and assorted weapons and accessory elements including ice skates, ice hockey stick, shovel, katana and a dagger.\nIce tower features a spring-loaded shooter and ice prison with bone element and room for a minifigure inside and a lever-operated opening door.\nThis cool toy for kids includes an Ice Dragon with a posable head, legs and tail.\nWeapons include Cole's silver-colored katana and gold-colored hammer, Akita's dagger, the Ice Emperor's Scroll of Forbidden Spinjitzu weapon, General Vex's ice spear, Blizzard Sword Master's 2 ice katanas and Blizzard Archer's crossbow.\nAccessory elements include Lloyd FS’s new-for-June-2019 tornado spinner toy and ‘powered-up’ hood element, Cole’s katana holder, Akita’s wolf head and cape, and ice armor for the Ice Emperor and General Vex.\nA great holiday gift for kids to recreate exciting action from the NINJAGO® TV show.\nAdd 70671 Lloyd's Journey and 70676 Lloyd's Titan Mech LEGO® toy building sets to play out more adventures with Lloyd in the Never-Realm.\nCastle of the Forsaken Emperor measures over 8” (22cm) high, 12” (32cm) wide and 8” (22cm) deep.\nIce Tower measures over 7” (19cm) high, 2” (6cm) wide and 2” (7cm) deep.\nIce Dragon measures over 5” (14cm) high, 14” (37cm) long and 20” (51cm) wide."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/the-ultra-dragon-70679","description":"Track down evil Lord Garmadon, Pythor and the Serpentine snakes with the LEGO® NINJAGO® Legacy 70679 The Ultra Dragon! This awesome NINJAGO dragon has a dual minifigure cockpit, 4 dragon heads with stud shooters and snapping jaws, unfolding wings, whipping tail and a handle for easy flying and swooshability. This action-packed dragon battle toy comes with 6 minifigures with weapons to role-play and reimagine classic action from the NINJAGO Masters of Spinjitzu TV show.\n\nThis ninja toy features 6 LEGO® NINJAGO® minifigures, including ninja characters Lloyd and Wu, plus Lord Garmadon, Spitta, Lasha and Pythor.\nThe Ultra Dragon features a dual minifigure cockpit with a throne for Lloyd, handle for easy flying and swooshability, unfolding wings, 4 dragon heads each with an Elemental stud shooter and snapping jaws, a whipping tail and posable joints.\nLift the 4-headed dragon by the handle to increase its wingspan and fly!\nWeapons include LEGO® NINJAGO® ninja Lloyd’s 2 gold-colored katanas, Wu’s bo staff, Lord Garmadon’s 4 silver-colored katanas, Spitta’s spear, Lasha’s butterfly sword and Pythor’s short Serpentine dagger.\nThe LEGO® NINJAGO® Legacy range features new versions of popular LEGO NINJAGO sets from past seasons to recreate or reimagine iconic conflicts from the NINJAGO Masters of Spinjitzu TV show.\nMeasures over 7” (20cm) high, 21” (55cm) long and 17” (44cm) wide."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/lloyd-s-titan-mech-70676","description":"Role-play an epic battle between Blizzard Samurai and ninja action figures with LEGO® NINJAGO® 70676 Lloyd's Titan Mech. This highly posable robot ninja mech toy for kids features a minifigure cockpit, gripping hand to hold a giant katana, spinning shuriken slicer/shield and a detachable flyer with minifigure driver's seat, adjustable wings and 2 spring-loaded shooters. Children will love recreating scenes from the NINJAGO TV show and dreaming up their own ninja fighting games with 6 minifigures and lots of cool weapons and accessory elements, including the Scroll of Forbidden Spinjitzu weapon and the new-for-June-2019 tornado spinner toy of Zane FS. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement.\n\nIncludes 6 new-for-June-2019 LEGO® NINJAGO® minifigures: Lloyd and Zane FS (Forbidden Spinjitzu) ninja action figures, plus General Vex, Blizzard Sword Master, Blizzard Archer and Blizzard Warrior.\nLloyd’s Titan Mech features a minifigure cockpit, posable arms and legs, gripping hands, spinning shuriken slicer/shield, giant katana and a detachable flyer with minifigure driver's seat, adjustable wings and 2 spring-loaded shooters.\nWeapons include Lloyd's silver- and gold-colored katanas, General Vex’s Scroll of Forbidden Spinjitzu, Blizzard Sword Master’s 2 ice katanas, Blizzard Archer’s crossbow and Blizzard Warrior’s ice katana.\nAccessory elements include Lloyd’s katana holder, Zane FS’s ‘powered-up’ hood element and new-for-June-2019 tornado spinner, and General Vex and Blizzard Warrior's ice armor.\nHot toy building kit for kids to recreate exciting action from the NINJAGO® TV show.\nAdd 70671 Lloyd's Journey and 70678 Castle of the Forsaken Emperor LEGO® toy ninja sets to play out more adventures with Lloyd in the Never-Realm.\nUse the LEGO® Life app to access intuitive Instructions PLUS building instructions for this LEGO NINJAGO® set. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nTitan Mech toy measures over 14” (37cm) high, 5” (15cm) long and 13” (35cm) wide."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/monastery-of-spinjitzu-70670","description":"Prepare for ninja battles at the LEGO® NINJAGO® Legacy 70670 Monastery of Spinjitzu and stop Wyplash stealing a Golden Weapon. The buildable monastery model opens out for easy play and features an opening gate, tea room with knife trap function, rotating ninja training station, chicken trap function and NINJAGO history mural wall stickers. Practice Spinjitzu in the courtyard with 2 handheld ninja minfigure battle platforms, a sword-spinning training station and ‘fruit-cuttting' training station. This action-packed ninja playset includes all 4 collectible Golden Weapons—The Sword of Fire, The Nunchucks of Lightning, The Scythe of Quakes and The Shurikens of Ice—plus 8 minifigures to role-play and reimagine classic action from the NINJAGO Masters of Spinjitzu TV show.\n\nThis toy ninja set includes 8 LEGO® NINJAGO® minifigures: Wu, Jay, Nya, Zane, Cole, Lloyd, Kai and Wyplash.\nThe Monastery of Spinjitzu opens out for easy play and features: an opening gate; tower; tea room with 2 seats and a hidden lever-operated knife trap; rotating training station and a buildable bonsai tree; chicken trap function; and LEGO® NINJAGO® history mural wall stickers.\nThis ninja toy includes a training station with 2 rotating swords, ‘fruit-cutting' training station with a knife, banana and apple elements to knock over, plus 2 handheld ninja battle platforms for LEGO® NINJAGO® ninja minifigures to stand on.\nThis LEGO® NINJAGO® toy includes all 4 of the ninja warriors’ collectible Golden Weapons: Kai’s Sword of Fire, Jay's Nunchucks of Lightning, Cole's Scythe of Quakes and Zane's Shurikens of Ice.\nWeapons include Wu's bo staff, Nya's spear and Wyplash's dagger.\nAlso find collectible Golden Weapons in the 70667 Kai's Blade Cycle & Zane's Snowmobile, 70668 Jay's Storm Fighter and 70669 Cole’s Earth Driller LEGO® NINJAGO® sets.\nThe LEGO® NINJAGO® Legacy range features new versions of popular action toys from past seasons to recreate or reimagine iconic conflicts from the NINJAGO Masters of Spinjitzu TV show.\nMeasures over 11” (29cm) high, 12” (32cm) wide and 8” (21cm) deep when closed."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/katana-4x4-70675","description":"A cool 4x4 toy truck and ninja action figures for kids to role-play an epic battle for the Scroll of Forbidden Spinjitzu. The LEGO® NINJAGO® 70675 Katana 4x4 ninja vehicle features an opening minifigure cockpit, hidden rotating shuriken slicer with ramming function, 2 spring-loaded shooters and an opening weapon storage compartment. Children will love reimagining scenes from the NINJAGO TV show and creating their own stories with 5 minifigures and assorted weapons and accessory elements, including the Scroll of Forbidden Spinjitzu with a buildable stand and the new-for-June-2019 tornado spinner of Nya FS. Give any LEGO builder an amazing building experience with this LEGO NINJAGO set using Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement.\n\nIncludes 5 new-for-June-2019 LEGO® NINJAGO® minifigures: Kai, Nya FS (Forbidden Spinjitzu), Char, Pyro Whipper and Pyro Slayer.\nKatana 4x4 toy truck features an opening minifigure cockpit, rotating shuriken slicer with ramming function, 2 spring-loaded shooters, opening weapon storage compartment with assorted gold-colored weapons inside, wheels with gold-colored rims, turbo boosters with flame exhaust elements, a ninja flag element and decorative weapons.\nPush the lever underneath the 4x4 to ram minifigures with the shuriken slicer.\nAlso includes the Scroll of Forbidden Spinjitzu weapon with a brick-built stand.\nThis LEGO® NINJAGO® set includes Kai’s silver- and gold-colored katanas, Char’s snake scepter, Pyro Whipper’s whip and Pyro Slayer's sword.\nAccessory elements include Kai's katana holder, Nya FS's ‘powered-up' hood element and new-for-June-2019 tornado spinner, Char's snake tail, Pyro Whipper's snake armor and Pyro Slayer's shield.\nCool toy for kids to recreate exciting action from the NINJAGO® TV show.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nKatana 4x4 ninja vehicle measures over 3” (8cm) high, 8” (21cm) long and 5” (13cm) wide."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/thunder-raider-71699","description":"The Thunder Raider (71699) with 5 minifigures is the perfect cool toy for kids who love Ninja Mechs and vehicles. This is a 2-in-1 adventure toy that presents a world of exciting play possibilities. Children can build the bulked-up vehicle and then choose to detach the mech from the back and share the fun with friends by playing with one ninja toy each. The perfect LEGO® gift for kids Kids can celebrate the rich history of LEGO NINJAGO® by building this cool Legacy ninja mech playset, whichis an upgraded version of the action toy from season 3 of the TV series. Kids can recreate famous battles between the ninjas and Overlord and the Nindroid Warrior. The best building toys for kids LEGO NINJAGO ninja playsets let kids enter an action-packed fantasy world where they can indulge in imaginative play as the mini ninjas take on the forces of evil. Kids will be completely enthralled as they role-play with ninja builds, NINJAGO mechs, cars, dragons and temples.\nThe LEGO® NINJAGO® Legacy Thunder Raider 2-in-1 action toy can be built into a bulked-up vehicle before detaching a powerful Ninja Mech from the back. Kids love the world of possibilities on offer with this LEGO toy.\nThis ninja playset includes a NINJAGO® vehicle with detachable ninja mech and 5 minifigures: Jay, Cole, Lloyd, Overlord and Nindroid Warrior. Children will be thrilled to create stories with these ninja action figures.\nDetach the LEGO® NINJAGO® mech to reveal 2 missiles. The mech has a spring-shooter in each arm ready to fire and the ninja action figures have an array of weapons: Lloyd has a silver katana and Overlord has a chainsaw.\nThis 576-piece ninja toy is a fun building task for boys and girls aged 8+ and makes a great Xmas gift or LEGO® gift for any occasion. The toy playset inspires kids to embrace imaginative play with their favorite ninjas.\nLEGO® NINJAGO® action toys are the perfect size to play with at home or take with you for fun on the go. Thisninja build is 5” (15cm) high, 5” (14cm) long and 6” (16cm) wide.\nNo batteries are required for this adventure construction set – it’s fueled by kids’ love of NINJAGO ® and their desire to play out fun scenes. There is no time for the Overlord to hide from the ninja warriors!\nLooking for the ideal LEGO® gift for a young builder? Then this is it! The building bricks come with simple-to-follow instructions making it quick and easy to have your ninja playset ready for action.\nLEGO® NINJAGO® adventure construction sets provide kids with a gateway to an exciting world of fantasy action where they can create stories with their favorite ninjas as they take on the forces of darkness.\nLEGO® bricks have met the highest industry standards for more than 60 years, ensuring they are always consistent, and easily pull apart every time. LEGO bricks always deliver quality – on Earth or in NINJAGO® city!\nThese LEGO® building bricks and pieces have been relentlessly tested and meet the highest global safety and quality standards. LEGO building kits guarantee peace of mind for kids and adults."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/fire-fang-70674","description":"Children can role-play as ninja action figure Kai FS and battle Serpentine sorceress Aspheera and Fire Fang for the Scroll of Forbidden Spinjitzu with this LEGO® NINJAGO® set. The cobra-like 70674 Fire Fang snake toy features a minifigure throne, a swiping, rattling tail with 2 stud shooters, and chain elements to attach to minifigures. Children will love recreating scenes from the NINJAGO TV show and dreaming up their own stories with 4 minifigures, assorted weapons and accessory elements, including Kai’s tornado spinner and Aspheera’s Scroll of Forbidden Spinjitzu. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions for this LEGO set let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement.\n\nThis cool toy for kids includes 4 new-for-June-2019 LEGO® NINJAGO® minifigures: Kai FS (Forbidden Spinjitzu), Aspheera, Pyro Slayer and Pyro Destroyer.\nFire Fang features a minifigure throne with decorative swords, opening mouth with a fire element, swiping, rattling tail with 2 stud shooters, 2 Serpentine flag elements, and chain elements to attach to the 2 Pyro minifigures.\nAlso includes a brick-built stand with a scepter.\nWeapons include Kai FS's silver-colored katana, Aspheera's Scroll of Forbidden Spinjitzu, Pyro Slayer’s sword and Pyro Destroyer’s scimitar.\nAccessory elements include Kai FS’s ‘powered-up’ hood and new-for-June-2019 tornado spinner, Aspheera’s snake armor and fire tail, Pyro Slayer’s shield, and Pyro Destroyer's snake armor and shield.\nA great holiday gift for kids to recreate exciting action from the NINJAGO® TV show.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions for this NINJAGO toy ninja set. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nFire Fang snake toy measures over 8” (21cm) high, 11” (29cm) long and 7” (18cm) wide."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/golden-mech-71702","description":"This LEGO® NINJAGO® Legacy mech playset with 4 ninja action figures will be adored by fans of the TV series, who are passionate about recreating action scenes from season 2. Kids can enjoy the fun on their own or share group play with friends as they role-play battles with 4 minifigures: Golden Ninja Lloyd, Wu and the NINJAGO stone warriors General Kozu and Stone Army Scout. Cool toys for kids Youngsters can now build this ninja mech in a new and exciting way by using Instructions PLUS via the free LEGO Life app. Creative kids can zoom, rotate and watch this awesome ninja toy come to life both on smartphones and tablets and in front of them. Awesome ninja toys for kids! LEGO NINJAGO building toys for kids allow them to enter a world of non-stop thrills and adventure where they can join forces with their ninja heroes to take on the forces of darkness. NINJAGO fans will be captivated as they play with awesome action toys, including LEGO NINJAGO mechs, cars, dragons, temples, buildable figures and more.\nDetailed NINJAGO® Mech wielding a large toy katana accompanied by 4 minifigures lets kids recreate action-packed stories from NINJAGO City! This makes the best toy for kids who enjoy playing out exciting scenes.\nThis playset includes a towering Golden Mech ninja toy and 4 minifigures: Golden Ninja Lloyd, Wu, General Kozu and Stone Army Scout. Youngsters will love escaping into a fantasy world to stage thrilling battles.\nThis cool toy for kids lets them indulge in stories from the secondseason of NINJAGO® Masters of Spinjitzu. Dedicated fans will love to go into combat with Lloyd and his sword or with Wu wielding his trusty staff.\nThis 489-piece playset is a rewarding and fun ninja build for boys and girls aged 8+ and makes a great Xmas gift for kids. New for January 2020, the golden ninja toy guarantees endless hours of all-consuming entertainment for your mini ninjas.\nThis Mech NINJAGO® toy is perfect for play at home or to slip into a bag for fun on the go. The ninjasare adept at going on new adventures! The ninja mech measures over 9” (25cm) high, 9” (23cm) long and 12” (30 cm) wide.\nNo batteries are required for this top toy set – it is ready to go for thrilling fun in NINJAGO® city as soon as it is built, so you never need to retreat from the battle front.\nYoung builders can assemble this top toy by using Instructions PLUS via the free LEGO® Life app. Creative kids can zoom, rotate and view on smartphones and tablets as this golden ninja mech toy comes to life.\nLEGO® NINJAGO® building toys for kids fuel their creativity and allow them to escape into a captivating world of imaginative play to team up with their favorite ninja heroes for never-ending adventures.\nLEGO® bricks have met the highest industry standards for more than 60 years, ensuring they are always consistent, compatible and pull apart easily every time. Perfect for NINJAGO City battles!\nThe LEGO® bricks used to build this golden NINJAGO® mech toy meet the highest global safety and quality standards. You know you are in safe hands when you choose LEGO playsets as a gift for your children."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/jay-s-storm-fighter-70668","description":"Join ninja warrior Nya’s battle against the Serpentine snakes and reclaim Jay’s Nunchucks of Lightning with LEGO® NINJAGO® Legacy 70668 Jay’s Storm Fighter jet model. The buildable ninja jet features an opening minifigure cockpit, spring-loaded shooters, foldout wings and blades. This action-packed ninja toy includes a collectible Golden Weapon—The Nunchucks of Lightning—with a buildable Serpentine stand, plus 4 minifigures with weapons to role-play and reimagine classic action from the NINJAGO Masters of Spinjitzu TV show.\n\nIncludes 4 LEGO® NINJAGO® minifigures: Jay, Nya, Pythor and Lasha.\nJay’s Storm Fighter features an opening minifigure cockpit with storage space, 2 spring-loaded shooters, foldout wings and foldout gold-colored blades.\nThis LEGO® NINJAGO® toy also includes Jay's Golden Weapon—The Nunchucks of Lightning—with a buildable Serpentine stand.\nWeapons include LEGO® NINJAGO® ninja Nya's spear, Pythor's Serpentine staff and Lasha's short Serpentine dagger.\nFind more collectible Golden Weapons in the 70667 Kai’s Blade Cycle & Zane’s Snowmobile, 70669 Cole’s Earth Driller and 70670 Monastery of Spinjitzu LEGO® NINJAGO® sets.\nThe LEGO® NINJAGO® Legacy range features new versions of popular ninja toys for kids from past seasons to recreate or reimagine iconic conflicts from the NINJAGO Masters of Spinjitzu TV show.\nJay's Storm Fighter jet action toy measures over 3” (8cm) high, 11” (28cm) long and 11” (30cm) wide."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/empire-dragon-71713","description":"Fans of LEGO® NINJAGO® will be thrilled to build this dragon toy and recreate exciting action scenes from the NINJAGO TV series. The dragon mech is a fearsome creature with its posable head and limbs, digi blade wings, and 2 stud shooters. The best toys for kids This NINJAGO® set boasts 3 minifigures: Digi Kai, Digi Lloyd and the evil ruler of Prime Empire, Unagami, who becomes the dragon to express his anger. The battles kids can stage with these buildable figures will consume their creative minds and inspire their imaginations. The perfect construction toys LEGO® NINJAGO® toy playsets allow children to dive into an action-packed world of adventure where they can team up with their ninja heroes to take on the forces of evil. NINJAGO fans will be captivated as they play out scenes with these stunning building sets, which include ninja mechs, dragon figures, temples and ninja toys.\nAwesome LEGO® dragon and 3 minifigures to recreate thrilling action from the NINJAGO® TV series. The ideal gift for NINJAGO fans who want to be a little ninja and dive into a fantasy world for endless adventures.\nThis toy playset boasts a LEGO® NINJAGO® dragon and 3 minifigures: NINJAGO Digi Jay, Digi Lloyd and the ruler of Prime Empire, Unagami. Children can play out stories as they compete over the Key-Tana.\nThe LEGO® dragon is highly posable with moving limbs, head and jaw, and can fire studs from 2 shooters. Unagami can ride in cockpit, and it can be used for battles against Jay’s Cyber Dragon toy playset.\nThis 286-piece LEGO® dragon construction toy provides an exciting building task for boys and girls aged 8+ and will delight NINJAGO® fans and creative kids as a birthday gift, Christmas present or LEGO gift for any occasion.\nNew for January 2020, this NINJAGO® set is a great size to enjoy at home or take on the go for non-stop ninja action. The dragon figure measures over 5” (14 cm) high, 15” (39 cm) long and 5” (14 cm) wide.\nNo batteries are required for this ninja mech – it is ready to start playing out exciting stories as soon as it is built. Your little ninjas will never need to take a break from their adventures.\nLooking for the ideal LEGO® gift for a young builder? Then this is it! The bricks come with simple-to-follow instructions making it quick and easy to have your LEGO NINJAGO® dragon ready for action.\nLEGO® NINJAGO® building sets offer a gateway to a world of adventure where kids can live out their most exciting dreams by teaming up with their ninja heroes for non-stop fun as they take on a host of villains.\nThe LEGO® bricks used to build this LEGO dragon have met the highest industry standards for more than 60 years, ensuring they are always consistent, compatible and pull apart with ease every time. Even resistant to dragon attacks!\nLEGO® bricks have been relentlessly tested and meet the highest global safety and quality standards. You know you are in safe hands when you choose a LEGO toy for your kids."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/kai-s-blade-cycle-zane-s-snowmobile-70667","description":"Power into battle with the LEGO® NINJAGO® Legacy 70667 Kai’s Blade Cycle & Zane’s Snowmobile and recover the stolen Sword of Fire from the Serpentine snakes. Ninja of Fire Kai’s bike features foldout blades and big wheels while Zane’s Elemental Snowmobile has 2 stud shooters and Zane's Golden Weapon—The Shurikens of Ice. These NINJAGO ninja vehicles come with a buildable dynamite ambush scene, another collectible Golden Weapon—The Sword of Fire—with a brick-built stand, and a Spinjitzu battle platform. This ninja toy also includes 4 minifigures to role-play and reimagine classic ninja battles from Season 1 of the NINJAGO Masters of Spinjitzu TV show.\n\nIncludes 4 LEGO® NINJAGO® minifigures: Kai, Zane, Lasha and Spitta.\nKai’s Blade Cycle features a minifigure seat, foldout gold-colored blades and big wheels with rubber tires.\nZane’s Elemental Snowmobile features a minifigure seat, 2 stud shooters and Zane's Golden Weapon—The Shurikens of Ice.\nAmbush scene features a buildable lamppost with lantern element and a sign, a buildable box of dynamite and a chain.\nThis LEGO® NINJAGO® toy includes Kai's Golden Weapon—The Sword of Fire—with a buildable stand and a Spinjitzu battle platform.\nPlace a minifigure on the battle platform and turn the stick to make the platform rotate and recreate the LEGO® NINJAGO® ninja’s ‘tornado’ fighting style.\nWeapons include Lasha’s short Serpentine dagger and Spitta's long Serpentine dagger.\nFind more collectible Golden Weapons in the 70668 Jay's Storm Fighter, 70669 Cole's Earth Driller and 70670 Monastery of Spinjitzu LEGO® NINJAGO® sets.\nThe LEGO® NINJAGO® Legacy range features new versions of popular ninja playsets from past seasons to recreate or reimagine iconic conflicts from the NINJAGO Masters of Spinjitzu TV show.\nKai’s Blade Cycle measures over 1” (5cm) high, 6” (17cm) long and 2” (7cm) wide.\nZane’s Elemental Snowmobile measures over 1” (5cm) high, 7” (18cm) long and 2” (6cm) wide."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/shuricopter-70673","description":"Kids can role-play as ninja action figures battling for the Scroll of Forbidden Spinjitzu in NINJAGO® world with this toy helicopter. The LEGO® NINJAGO 70673 ShuriCopter features a minifigure cockpit, landing wheels with 2 spinning shuriken slicers, rotor-spinning function and a 6-stud rapid shooter on each wing. Children will love recreating scenes from the NINJAGO TV show and role-playing their own stories with this ninja helicopter, 3 minifigures and assorted weapons and accessory elements including the ninja tornado spinner toy of Jay FS. Give any LEGO builder an amazing building experience with this LEGO NINJAGO set using Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement.\n\nThis LEGO® NINJAGO® set includes 3 new-for-June-2019 minifigures: Zane, Jay FS (Forbidden Spinjitzu) and General Vex.\nShuriCopter features a minifigure cockpit, landing wheels with 2 spinning shuriken slicers, rotor-spinning function and a 6-stud rapid shooter on each wing.\nLand the ShuriCopter to make the shuriken slicers spin.\nTurn the button underneath the ShuriCopter to make the rotors spin.\nWeapons include Zane's silver-colored katana and 2 gold-colored shurikens, and General Vex's Scroll of Forbidden Spinjitzu.\nAccessory elements include Zane’s katana holder, Jay FS’s ‘powered-up’ hood element and new-for-June-2019 ninja tornado spinner toy, and General Vex’s ice armor.\nCool toy building kit for kids to recreate exciting action from the NINJAGO® TV show.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions for this NINJAGO® toy building set. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nShuriCopter toy helicopter measures over 2” (10cm) high, 12” (31cm) long and 9” (24cm) wide."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/cole-s-dirt-bike-70672","description":"Role-play an action-packed battle against Pyro Destroyer with this LEGO® NINJAGO® 70672 Cole’s Dirt Bike ninja toy for boys and girls. The ninja bike features a minifigure driver’s seat, caterpillar treads at the front and a big rear wheel with gold-colored rims, plus 2 stud shooters. Children will love recreating scenes from the NINJAGO TV show and creating their own stories with 3 LEGO NINJAGO minifigures—Cole, Kai and Pyro Destroyer with assorted weapons. Give any LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement.\n\nIncludes 3 new-for-June-2019 LEGO® NINJAGO® minifigures: Cole, Kai and Pyro Destroyer.\nCole’s armored Dirt Bike toy features a minifigure driver’s seat, 2 stud shooters, caterpillar treads at the front, a big rear wheel with gold-colored rims, and a ninja flag element.\nWeapons include Cole's gold-colored hammer and silver-colored katana, Kai's silver-colored katana and gold-colored katana, and Pyro Destroyer's scimitar.\nAccessory elements in this LEGO® NINJAGO® toy building set include Cole and Kai’s katana holders, and Pyro Destroyer’s shield and snake armor.\nCool toy for kids to recreate exciting action from the NINJAGO® TV show.\nUse the LEGO® Life app to access the intuitive Instructions PLUS building instructions. Help even younger builders through the building process, with easy-to-use zoom, rotate and ghost-mode functions to visualize their creations as they go.\nNinja dirt bike model measures over 2” (6cm) high, 7” (19cm) long and 2” (6cm) wide."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/spinjitzu-slam-kai-vs-samurai-70684","description":"High-speed spinning action is in store for kids as they play out Elemental clashes with LEGO® NINJAGO® 70684 Spinjitzu Slam - Kai vs. Samurai. This fun toy building set features Kai FS and Blizzard Samurai’s tornado spinners which each hold a minifigure and fit onto their own easy-to-build spinner launchers, plus a buildable pedestal with the Scroll of Forbidden Spinjitzu on top to use as a target in role-play battles. The playset includes Kai FS's eternal flame and fireball elements and Blizzard Samurai’s ice crystal and ice shield elements which can also be sent spinning with the launchers. Great for solo or social play, kids will love recreating the ninja tornado effect as seen on the NINJAGO TV show and creating their own Spinjitzu Slam competitions. This action-packed spinning top toy includes a collectible Kai FS minifigure, with a ‘powered-up' hood element, and a Blizzard Samurai minifigure for creative role-play.\n\nIncludes 2 new-for-June-2019 minifigures: Kai FS (with a ‘powered-up’ hood element) and Blizzard Samurai.\nThis LEGO® NINJAGO® spinner toy features 2 brick-built launchers and new-for-June-2019 Kai FS and Blizzard Samurai Tornado Spinners, plus a buildable pedestal with the Scroll of Forbidden Spinjitzu.\nPlace the minifigures in the tornado spinners, attach them to the launchers and slam down on the launcher to send each minifigure spinning.\nAlso includes Kai FS's eternal flame and fireball elements and Blizzard Samurai’s ice crystal and ice shield elements—attach any one to a launcher and slam to make it spin towards a target.\nA great gift for kids who can make up their own Spinjitzu Slam challenges and compete against their friends.\nAdd 70681 Spinjitzu Slam - Lloyd, 70682 Spinjitzu Slam - Jay and 70683 Spinjitzu Slam - Zane LEGO® NINJAGO® spinner toys for thrilling Spinjitzu Slam showdowns.\nRecreate the ninja tornado effect as seen on the NINJAGO® TV show with this action-packed LEGO® set.\nThis LEGO® playset makes a great birthday or holiday gift for NINJAGO® fans.\nEach tornado spinner launcher with spinning top toy attached measures over 1” (5cm) high, 1” (3cm) wide and 3” (8cm) deep.\nPedestal measures over 3” (9cm) high."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/the-golden-dragon-70666","description":"Recreate the epic Final Battle between Golden Ninja Lloyd and Overlord with the LEGO® NINJAGO® Legacy 70666 Golden Dragon action figure, featuring a minifigure saddle, opening mouth with hidden stud shooter, and posable legs, wings and tail. The cool ninja battle toy for kids includes 3 LEGO NINJAGO minifigures with weapons to intensify the role-play action as you recreate classic scenes from the NINJAGO Masters of Spinjitzu TV show.\n\nThis LEGO® NINJAGO® Legacy action toy includes 3 minifigures: Golden Ninja Lloyd, Overlord and Stone Army Scout.\nThe Golden Dragon ninja toy features a minifigure saddle, opening mouth with hidden stud shooter and posable wings, legs and tail.\nOpen the ninja dragon's mouth and fire the hidden shooter.\nWeapons include Golden Ninja Lloyd's gold-colored katana, Overlord's blade spear and Stone Army Scout's crossbow.\nAccessory elements include Overlord's 2 torsos, 4 arms and ghost-like ‘legs’.\nThe LEGO® NINJAGO® Legacy range features new versions of popular ninja playsets from past seasons to recreate or reimagine iconic conflicts from the NINJAGO Masters of Spinjitzu TV show.\nMeasures over 2” (6cm) high, 9” (24cm) long and 10” (26cm) wide."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/lloyd-s-journey-70671","description":"Stage an epic ice battle matching Lloyd and his wolf against Blizzard Warrior with this action-packed ninja toy for boys and girls. This 70671 Lloyd’s Journey LEGO® NINJAGO® set features Blizzard Warrior's fortress with a shooting crossbow and buildable ice holder for Lloyd's golden sword. Fans of the NINJAGO TV show will love role-playing scenes and creating their own adventures with the 2 LEGO NINJAGO minifigures, a wolf figure and cool ninja weapons in this toy building set.\n\nThis LEGO® NINJAGO® set includes 2 new-for-June-2019 minifigures: Lloyd and Blizzard Warrior, plus a new-for-June-2019 Lloyd’s wolf figure.\nCool toy for kids who can create Blizzard Warrior’s fortress with LEGO® building bricks, featuring space for a minifigure, a shooting toy crossbow and ice elements.\nThis battle toy building set also includes a buildable ice holder with Lloyd's golden sword.\nWeapons include ninja minifigure Lloyd's flaming torch and silver-colored toy katana, and Blizzard Warrior’s ice katana.\nPlayset also includes Lloyd’s katana holder and Blizzard Warrior’s ice armor accessory elements.\nCool toy for kids to recreate exciting action from the NINJAGO® TV show.\nAdd 70676 Lloyd’s Titan Mech and 70678 Castle of the Forsaken Emperor LEGO® sets to play out more adventures with Lloyd in the Never-Realm.\nFortress measures over 1” (5cm) high, 2” (7cm) wide and 2” (7cm) deep."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/the-samurai-mech-70665","description":"Team up with Nya—disguised as Samurai X—and drive the LEGO® NINJAGO® Legacy 70665 Samurai Mech into battle against Kruncha and Nuckal. The highly posable toy Samurai Mech features an opening minifigure cockpit, 2 stud shooters, posable arms and legs, a big katana and a double katana. This LEGO NINJAGO set also includes 3 minifigures with cool weapons to bolster your samurai battle games as you recreate classic scenes from the NINJAGO Masters of Spinjitzu TV show.\n\nIncludes 3 LEGO® NINJAGO® minifigures: Nya (as Samurai X), Kruncha and Nuckal.\nSamurai Mech features an opening minifigure cockpit, 2 stud shooters, posable arms and legs, big toy katana and a double katana.\nThis LEGO® NINJAGO® toy also includes Kruncha's sword and Nuckal's bone axe.\nThe LEGO® NINJAGO® Legacy ninja toy range features new versions of popular models from past seasons to recreate or reimagine iconic conflicts from the NINJAGO Masters of Spinjitzu TV show.\nMeasures over 5” (14cm) high, 1” (4cm) long and 4” (11cm) wide."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/jay-avatar-arcade-pod-71715","description":"The gateway to the exciting new video game world of Prime Empire is through this awesome arcade machine. NINJAGO® fans will adore creating stories with this arcade toy and 2 video game figures: Digi Jay and, exclusive to this toy playset, Avatar Jay with his guitar. The best ninja toys! This NINJAGO set offers kids the chance to choose their own ninja avatar, the character they wish to be in Prime Empire, providing a fun opportunity to be creative with stickers and accessories. The back of the arcade toy opens for kids to store their ninja action figures, and weapons. This is a cool ninja build NINJAGO fans will cherish! The perfect ninja toys for kids LEGO® ninja playsets give children the chance to enter a thrilling world where they can indulge in independent play or fun with friends as the team of ninjas take on the forces of evil. Kids will be enthralled with these ninja toys, including cars, jets, dragons, buildable figures and more.\nNINJAGO® set featuring mini arcade machine and Digi Jay and exclusive Avatar Jay minifigures to recreate thrilling adventures from Prime Empire. Playful kids with vivid imaginations and the most dedicated NINJAGO fans will all love this.\nNinja toy for kids includes arcade machine and 2 video game figures, Digi NINJAGO® Jay and the exclusive Avatar Jay, who can be armed with a range of weapons. This cool ninja toy guarantees hours of purposeful play.\nNew for January 2020, this NINJAGO® arcade toy lets kids choose their avatar in Prime Empire and customize it with stickers and accessories. The video game figures and their weapons can be stored inside the arcade machine.\nThis 47-piece ninja toy for kids is a fun build for boys and girls aged 7+ and will captivate them for several hours at a time. This makes a great gift for kids, Christmas present or LEGO® gift for any occasion.\nThe ideal ninja toy for kids to play with at home, in the car, on a train, or wherever they go. This ninja build offers a world of exciting stories and possibilities. The arcade machine measures over 2” (5 cm) high, 3” (8 cm) long and 2” (6 cm) wide.\nNo batteries are needed for this hot toy building set – all kids need are their imaginations, so there are never any annoying pauses in the action in Prime Empire!\nDo you need a building task for your little ninja? You have found it! The bricks come with simple-to-follow instructions making it easy to have your NINJAGO® arcade toy ready for role-play action in extra quick time!\nLEGO® NINJAGO® collectible buildable toys and figures let kids enter a thrilling world of fantasy to create stories with their favorite ninjas as they take on the forces of evil in both NINJAGO city and Prime Empire.\nLEGO® bricks have met the highest industry standards for more than six decades, ensuring they are always consistent, compatible and pull apart with ease every time, whether on Earth on in NINJAGO® City.\nThese LEGO® bricks and ninja action figures have been relentlessly tested and meet the highest global safety and quality standards. You always have peace of mind with LEGO building kits."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/kai-avatar-arcade-pod-71714","description":"This super cool arcade machine with 2 minifigures is the portal to the video game world of Prime Empire. Youngsters will love staging exciting stories around it with 2 video game figures: NINJAGO® Digi Kai, and exclusive to this toy playset, Avatar Kai. A world of possibilities and hours of captivating fun are guaranteed with this NINJAGO set. The best ninja action figures In Prime Empire kids choose the character they want to be and their own ninja avatar for their adventures in a mysterious new world, providing a fun opportunity to be creative. The back of the arcade toy can be opened to store the ninja action figures, and weapons and accessories. The perfect LEGO® toys LEGO NINJAGO sets give children the chance to enter a thrilling world where they can indulge in independent play or fun with friends as the team of ninjas take on the forces of evil. Kids will be enthralled with these ninja toys, including cars, jets, dragons, buildable figures and more.\nNINJAGO® set featuring mini arcade machine and Digi Kai and exclusive Avatar Kai minifigures to stage thrilling scenes from Prime Empire. The perfect toy playset for dedicated NINJAGO fans and kids with adventurous minds.\nNinja playset includes arcade machine and 2 video game figures, Digi NINJAGO® Kai and Avatar Kai, who can be armed with a range of weapons. Kids can harness their creativity and play out gripping stories from Prime Empire.\nNew for January 2020, this ninja toy allows kids to customize their minifigures and choose an avatar to enter Prime Empire. Youngsters will love storing them and the many accessories in the back of the mini arcade machine.\nThis 49-piece ninja toy for kids is quick-to-build for boys and girls aged 7+ and will inspire imaginative play by ninja fans. This makes a great birthday gift, Christmas present or LEGO® gift for any occasion.\nThe ideal arcade and action figure toy to play with at home or easily slip into your bag for kids to enjoywherever they go. The arcade machine measures over 3” (8 cm) high, 2” (5 cm) long and 6” (2 cm) wide.\nDo you want some good news? No batteries are required for this NINJAGO® set – it’s simply fueled by kids’ imaginations, so the adventures in Prime Empire never stop.\nThis is the ideal LEGO® gift for a young builder. The bricks come with simple-to-follow instructions making it quick and easy to have your arcade toy ready for hours of action-packed fun!\nLEGO® NINJAGO® collectible buildable toys and figures let kids enter a thrilling world of fantasy to create stories with their favorite ninjas as they take on the forces of evil in both NINJAGO City and Prime Empire.\nLEGO® bricks have met the highest industry standards for more than six decades, ensuring they are always consistent, compatible and pull apart with ease every time, whether on Earth or in NINJAGO® City.\nThese LEGO® bricks and pieces have been relentlessly tested and meet the highest global safety and quality standards. You always have peace of mind with LEGO building kits."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/lloyd-avatar-arcade-pod-71716","description":"This awesome arcade machine lets ninjas transport themselves from NINJAGO® City to Prime Empire. NINJAGO fans will be inspired by this arcade toy and 2 video game figures, Digi Lloyd and exclusive to this set, Avatar Lloyd with his bat to role-play and recreate thrilling stories. The best toys for kids When kids venture into Prime Empire they can choose the character they want to be with their own ninja avatar. This provides them with a brilliant opportunity to express themselves and be creative with stickers and accessories. The back of the arcade toy can be opened to store the ninja action figures, and their weapons and accessories. The perfect LEGO® toys LEGO NINJAGO sets give children the chance to enter a thrilling world where they can indulge in independent play or fun with friends as their ninja heroes take on the forces of evil. Kids will be enthralled with these ninja toys, including cars, jets, dragons, buildable figures and more.\nNINJAGO® set featuring mini arcade machine and Digi Lloyd and exclusive Avatar Lloyd minifigures for kids to devise their own stories from Prime Empire. The perfect toy playset for dedicated NINJAGO fans.\nNinja playset includes arcade machine and 2 video game figures, Digi NINJAGO® Lloyd, and Avatar Lloyd, who can be dressed in a range of accessories. Ninja fans will be thrilled to escape to an action-packed fantasy world.\nNew for January 2020, this ninja toy allows kids to customize their minifigures and choose an avatar to enter Prime Empire. Youngsters will love storing their video game figures in the back of the mini arcade machine.\nThis 48-piece ninja toy for kids is quick-to-build for boys and girls aged 7+ and will inspire independent play by ninja fans. This makes a great birthday gift, Christmas present or Lego gift for any occasion.\nArcade and action figure toys that offer a world of playing opportunities at home or when kids are on their travels. The arcade machine measures over 3” (8 cm) high, 2” (5 cm) long and 2” (7 cm) wide.\nNo batteries are required for this NINJAGO® set – it’s simply fueled by kids’ imaginations, so the adventures in Prime Empire never stop. Just build and play!\nThis is the ideal LEGO® gift for a young builder. The bricks come with simple-to-follow instructions making it quick and easy to have your arcade toy ready for hours of fun!\nLEGO® NINJAGO® collectible buildable toys and figures let kids enter a thrilling world of fantasy to create stories with their favorite ninjas as they take on the forces of evil in NINJAGO city and Prime Empire.\nLEGO® bricks have met the highest industry standards for more than six decades, ensuring they are always consistent, compatible and pull apart with ease every time, whether on Earth on in NINJAGO® City. They could even defeat the team of ninja heroes!\nThese LEGO® bricks and pieces have been relentlessly tested and given a real work out to meet the highest global safety and quality standards. You always have peace of mind with LEGO building kits."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/spinjitzu-slam-jay-70682","description":"Children will love perfecting their Spinjitzu ninja skills with LEGO® NINJAGO® 70682 Spinjitzu Slam - Jay. This action-packed playset features a Jay Tornado Spinner which holds a minifigure and fits onto the easy-to-build spinner launcher, plus a shooter base with 3 spring-loaded missiles. It's ideal for solo or social play where one young ninja operates the launcher while another aims missiles at the tornado spinner. A cool toy for kids who will love recreating the ninja tornado effect, as seen on the NINJAGO TV show, developing their own challenges and battling against friends. This ninja spinner toy includes a collectible, new-for-June-2019 Jay FS minifigure with a ‘powered-up’ hood element for imaginative role-play.\n\nIncludes a new-for-June-2019 Jay FS minifigure with a ‘powered-up’ hood element.\nThis LEGO® NINJAGO® ninja spinner toy features a new-for-June-2019 Jay Tornado Spinner with brick-built launcher, plus a buildable shooter base with 3 spring-loaded missiles.\nPlace the minifigure in his tornado spinner, attach to the launcher and slam down on the launcher to send the minifigure spiraling towards the target.\nChildren can dream up their own Spinjitzu Slam challenges and compete against their friends with this toy building set.\nAdd 70681 Spinjitzu Slam - Lloyd, 70683 Spinjitzu Slam - Zane and 70684 Spinjitzu Slam - Kai vs. Samurai LEGO® NINJAGO® building kits for kids for thrilling Spinjitzu Slam showdowns.\nKids can recreate the ninja tornado effect as seen on the NINJAGO® TV show with this action-packed LEGO® building set.\nThis LEGO® set makes a great birthday or holiday gift for NINJAGO® fans.\nTornado spinner launcher with spinning top toy attached measures over 1” (5cm) high, 1” (3cm) wide and 3” (8cm) deep."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/spinjitzu-slam-lloyd-70681","description":"Thrilling ninja action is guaranteed for kids as they learn Spinjitzu skills, battle and compete with LEGO® NINJAGO® 70681 Spinjitzu Slam - Lloyd. This fun playset features a Lloyd Tornado Spinner toy which holds a minifigure and fits onto the easy-to-build launcher, plus 3 ‘ice' targets with a sword and 2 spiders. Kids can recreate the ninja tornado effect as seen on the NINJAGO TV show, dream up their own challenges and battle against friends—the possibilities are limitless. This LEGO NINJAGO spinner toy includes a collectible, new-for-June-2019 Lloyd FS minifigure with a ‘powered-up’ hood element for creative role-play.\n\nThis cool toy for kids includes a new-for-June-2019 Lloyd FS minifigure with a ‘powered-up’ hood element.\nThis LEGO® NINJAGO® ninja spinner toy features a new-for-June-2019 Lloyd Tornado Spinner and brick-built launcher, plus 3 ‘ice’ targets with a gold-colored sword and 2 spider figures.\nPlace the minifigure in his tornado spinner, attach to the launcher and slam down on the launcher to send the minifigure spiraling towards the target.\nKids can create their own Spinjitzu Slam challenges and compete against their friends with this action-packed toy building set.\nAdd 70682 Spinjitzu Slam - Jay, 70683 Spinjitzu Slam - Zane and 70684 Spinjitzu Slam - Kai vs. Samurai LEGO® NINJAGO® playsets for thrilling Spinjitzu Slam showdowns.\nRecreate the ninja tornado effect as seen on the NINJAGO® TV show with this action-packed LEGO® building kit for kids.\nThis LEGO® set makes a great birthday or holiday gift for NINJAGO® fans.\nSpinner launcher with tornado spinning top toy attached measures over 1” (5cm) high, 1” (3cm) wide and 3” (8cm) deep."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/spinjitzu-slam-zane-70683","description":"Children can spin up a storm and take on ninja challenges with the LEGO® NINJAGO® 70683 Spinjitzu Slam - Zane spinning top toy. This fun-packed playset features a Zane Tornado Spinner which holds a minifigure and fits onto the easy-to-build spinner launcher, plus a buildable training dummy to use as a target and 2 shurikens that can also be sent spinning by the launcher. Great for solo or social play, kids will love recreating the ninja tornado effect as seen on the NINJAGO TV show and making up their own Spinjitzu Slam competitions with friends. This LEGO NINJAGO spinner toy includes a collectible, new-for-June-2019 Zane FS minifigure with a ‘powered-up’ hood element for creative role-play.\n\nIncludes a new-for-June-2019 Zane FS minifigure with a ‘powered-up’ hood element.\nThis LEGO® NINJAGO® spinner toy features a brick-built launcher and new-for-June-2019 Zane Tornado Spinner, plus 2 launchable shurikens and a buildable training dummy.\nPlace the minifigure in his tornado spinner, attach it to the launcher and slam down on the launcher to send the minifigure spiraling towards the target.\nAttach a shuriken to the launcher and slam to make it spin towards the target.\nKids can create their own Spinjitzu Slam challenges and compete against their friends with this toy building set.\nAdd 70681 Spinjitzu Slam - Lloyd, 70682 Spinjitzu Slam - Jay and 70684 Spinjitzu Slam - Kai vs. Samurai LEGO® NINJAGO® spinning top toys for thrilling Spinjitzu Slam showdowns.\nChildren can recreate the ninja tornado effect as seen on the NINJAGO® TV show with this action-packed LEGO® playset.\nThis LEGO® set makes a great birthday or holiday gift for NINJAGO® fans.\nTornado spinner launcher with tornado spinner toy attached measures over 1” (5cm) high, 1” (3cm) wide and 3” (8cm) deep."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/ninjago-acc-set-2019-853866","description":"Gear up for battle with the LEGO® NINJAGO® 853866 Accessory Set 2019, featuring the Oni villains from Series 10 of the NINJAGO Masters of Spinjitzu TV series. This action-packed little set has 3 new-for-January-2019 Oni minifigures, including one with iconic horn elements, and assorted weapons.\n\nFeatures 3 Oni demon minifigures—one with horn elements—with 4 swords and other assorted weapons."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/jay-s-kendo-training-pod-853758","description":"Open Jay’s Kendo Training Pod and find loads of cool stuff to practice your ninja skills. Play on the go with this portable pod in the color of the Blue Ninja, including a LEGO® NINJAGO® Jay minifigure in Kendo outfit, Kendo mask element with blue rim and assorted ninja weapons.\n\nFeatures a portable plastic pod in blue with a Jay minifigure inside, plus a rack with assorted Kendo training weapons and accessory elements including: Kendo mask with blue rim, 2 swords, nunchucks, shoulder armor, plus LEGO® elements to store the weapons and accessories in cool ninja style.\nMeasures over 2” (6cm) high, 2” (6cm) wide and 1” (3cm) deep."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/kai-katanas-with-sheath-853749","description":"Get equipped to protect NINJAGO® world with 2 soft-foam Kai Katanas and back-mounted sheath with adjustable straps and safety buckles, inspired by the design of Kai’s weapons in THE LEGO® NINJAGO MOVIE™.\n\nFeatures 2 soft-foam katanas and a back-mounted sheath with adjustable straps and safety buckles, inspired by the design of Kai’s katanas and sheath in THE LEGO® NINJAGO® MOVIE™.\nRecreate action-packed battles from THE LEGO® NINJAGO® MOVIE™.\nKatanas each measure over 18” (47cm) long."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/ninjago-movie-nunchucks-853700","description":"Recreate exciting THE LEGO® NINJAGO® MOVIE™ scenes with a soft-foam and fabric version of the nunchucks seen in the blockbuster animated film. Combine with the 853701 THE LEGO NINJAGO MOVIE Sword & Sheath for even more role-play action fun.\n\nFeatures a soft-foam and fabric version of the nunchucks seen in THE LEGO® NINJAGO® MOVIE™.\nRole-play exciting scenes from THE LEGO® NINJAGO® MOVIE™.\nCombine with the 853701 THE LEGO® NINJAGO® MOVIE™ Sword & Sheath for even more ninja action.\nMeasures over 20” (52cm) long."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/lloyd-mask-853751","description":"Face up to enemies of the ninja with this LEGO® minifigure-head-style Lloyd Mask in compression-molded soft foam with a visibility mesh and safety snap closure. Role-play cool scenes from THE LEGO NINJAGO® MOVIE™ and dream up your own ninja missions.\n\nFeatures a Lloyd minifigure-head-style mask in compression-molded soft foam with a visibility mesh and safety snap closure.\nOne size fits all. Child size.\nRecreate thrilling scenes from THE LEGO® NINJAGO® MOVIE™.\nComplete your ‘Lloyd transformation' with the 853750 Lloyd Dress-Up.\nMeasures over 7” (20cm) high, 7” (19cm) wide and 2” (7cm) deep."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/nya-spear-853748","description":"Display your ninja skills with this soft-foam Nya Spear, inspired by the design of Nya’s weapon in THE LEGO® NINJAGO® MOVIE™.\n\nFeatures a soft-foam spear inspired by the design of Nya’s spear in THE LEGO® NINJAGO® MOVIE™.\nRecreate action-packed battles from THE LEGO® NINJAGO® MOVIE™.\nComplete your ‘Nya transformation’ with the 853747 Nya Mask.\nMeasures over 22” (58cm) long."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/shuriken-claw-853753","description":"Strap the soft-foam Shuriken Claw to your wrist and role-play thrilling scenes from THE LEGO® NINJAGO® MOVIE™. Target enemies with the detachable soft-foam shurikens and prove that you can throw like a true ninja.\n\nFeatures a soft-foam claw with a strap and hook-and-loop closure, plus 2 detachable soft-foam shurikens.\nStrap the claw to your wrist, throw the shurikens and recreate action-packed battles from THE LEGO® NINJAGO® MOVIE™.\nMeasures over 9” (25cm) long."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/ninjago-tumbler-with-straw-853901","description":"Summon the Elemental energy of the ninja when you drink from the LEGO® NINJAGO® 853901 Tumbler with Straw! This colorful 500ml drink container features a cool image of the NINJAGO heroes and a screw-top lid with a slide-open straw protection cover inspired by the LEGO brick separator element.\n\nFeatures LEGO® NINJAGO® graphics on a durable plastic, 500ml-capacity tumbler with a screw-top lid, transparent straw and slide-open straw protection cover.\nSlide the straw cover to the side to drink from the tumbler.\nMeasures over 6” (16cm) high."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/jay-keyring-853893","description":"Enjoy electrifying adventures every day with the LEGO® NINJAGO® 853893 Jay Key Chain, featuring a minifigure of the Ninja of Lightning linked to a sturdy metal ring and chain. Attach it to your keys or backpack and show off your ninja style.\n\nFeatures a LEGO® NINJAGO® Jay minifigure linked to a durable metal ring and chain.\nAttach it to your keys or backpack.\nMinifigure is not detachable from metal chain."},{"theme":"ninjago","themeUrl":"https://www.lego.com/en-us/themes/ninjago","productUrl":"https://www.lego.com/en-us/product/nya-keyring-853894","description":"Have a ninja hero with you wherever you go when you attach the LEGO® NINJAGO® 853894 Nya Key Chain to your keys or backpack. Featuring a Nya minifigure linked to a durable metal ring and chain, it’s the ideal gift for NINJAGO fans.\n\nFeatures a LEGO® NINJAGO® Nya minifigure linked to a durable metal ring and chain.\nAttach it to your keys or backpack.\nMinifigure is not detachable from metal chain."}]