[{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/disney-train-and-station-71044","description":"Gather the family for a rewarding build and play experience with the LEGO® ǀ Disney 71044 Train and Station. Kids will love to join Disney characters Mickey Mouse, Minnie Mouse, Chip, Dale and Goofy for magical adventures with this awesome LEGO train set, featuring a motorized steam-style locomotive with tender, passenger car and a luxurious parlor car, plus an oval track and an iconic Disney Parks®-style station building. This set comes with an array of cool details, including app-controlled functionality. Use a smart phone or tablet to drive the locomotive forward, reverse and emit realistic sound effects. Joining up the train cars is simple with the magnetic LEGO couplings, and the panels on the parlor car open for access to its detailed interior complete with table, armchairs, teapot and cup. And the fun doesn’t end there! Inside the toy train station building there’s an array of intricate brick-built furnishings and details, including draped windows, wall clock, ceiling chandelier and a tower room with a little LEGO surprise!\n\nIncludes 5 uniquely decorated LEGO® ǀ Disney minifigures with accessories: Mickey Mouse, Minnie Mouse, Chip, Dale and Goofy minifigures.\nThe LEGO® ǀ Disney Train and Station includes 16 curved pieces and 4 straight pieces of track, locomotive, tender, passenger car, parlor car and an iconic station building.\nLocomotive features a large red fender, red wheels with working coupling rods, a big smoke stack and a driver’s cab.\nTender contains a LEGO® Powered Up 88009 Hub and a LEGO Powered Up 88011 Train Motor.\nTrain and sound effects can be controlled via a smart device. Connect via Bluetooth from the LEGO® Powered Up app.\nRequires batteries (not included). Please refer to the product packaging for type and quantity.\nPassenger car has seating for the LEGO® ǀ Disney minifigures.\nRemove the panel on the parlor car to access a rich interior with table, armchairs, teapot and cup.\nStation exterior features a detailed facade with balcony, clock and 2 flagged towers.\nStation interior features a ticket counter, café corner and an array of brick-built furnishings and details, including draped windows, wall clock, ceiling chandelier and a tower room with a little LEGO® ǀ Disney surprise.\nEasily connect the cars with the included LEGO® magnetic couplings.\nThis LEGO® building toy includes more than 2,900 pieces.\nThe LEGO® ǀ Disney train toy (in total) measures over 4” (12cm) high, 30” (78cm) long and 3” (8cm) wide.\nLEGO® ǀ Disney train station building measures over 15” (39cm) high, 14” (36cm) wide and 6” (16cm) deep.\nOval rail track diameter measures over 37” (96cm) long and 27” (70cm) wide."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/haunted-house-10273","description":"If you love ghosts, ghouls and things that go bump in the night, we’ve got a treat for you – the LEGO® Haunted House (10273). Take time out of everyday life and explore something extraordinary as you discover the thrills and surprises packed into this stunning building project.\n\nSpookily good details bring the story to life\nTake your time building this impressive haunted house model, before exploring all the intricate details hidden within. The house opens up, making it easy to explore inside where you’ll discover a working free-fall ride plus automatic doors at the top of the tower. See the haunted front doors close for a spooky effect. Add the LEGO Powered Up components (available separately) to control the elevator via the Powered Up app.\n\nA building project that’s full of thrills\nThis Haunted House is part of a collection of LEGO building kits for adults who appreciate clever design. This model also makes a scarily good gift, birthday present or Christmas gift.\n\nWe have introduced new packaging for adult builders to make it easier to find products related to their interests and passions. Be it sports, film, art, vehicles, landmark buildings or fairground icons, LEGO sets bring these to life in brick form. With the new packaging clearly showcasing which interest each product relates to, we took the decision to discontinue Creator Expert branding. While the brand won’t be featured on future packaging and in communication, our product range will continue to include the same advanced-build, collectible sets, guaranteeing hours of building enjoyment.\n\nThis creepy LEGO® Haunted House (10273) model provides hours of enjoyment for anyone looking to unwind with a new project. Build the spooky horror house then explore its impressive features and delightful details.\nWhy should kids get all the fun when it comes to scary toys? This building kit is designed for adults but it includes lots of playful features, such as a free-fall ride, haunted doors and a cursed painting.\nIf you appreciate beautiful details, you’ll love displaying your haunted house model. Upgrade the Haunted House with the LEGO® Powered Up components (available separately) to control the elevator via the app.\nIdeal for ghost hunters, thrill seekers and adult LEGO® fans alike, this Haunted House set makes a great birthday gift for your ghost-loving mum, dad, husband, wife, partner or friend and also makes a fun Halloween gift.\nThis dark and spooky haunted manor measures over 26.5” (68cm) high, 9” (25cm) wide and 9” (25cm) deep, making it a challenging construction kit for adults and a great brick-built model to display.\nA battery is included with the light brick in this set, so you can enjoy the illumination right away. To motorize your model, add 1 x 88009 and 2 x 88008 Powered Up components (sold separately).\nThis set comes with coffee-table-style building instructions to guide and inspire you.\nPart of a series of inspiring LEGO® construction kits for adults, designed for LEGO building fans and hobbyists who love beautiful design and elegant LEGO models.\nLEGO® building bricks meet the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time – it’s been that way since 1958.\nLEGO® bricks and pieces are rigorously tested to ensure that every building set meets the highest safety and quality standards, so you can be sure that this model is designed to last."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/passenger-train-60197","description":"Climb aboard the LEGO® City 60197 Passenger Train! This fun set features a motorized engine with 10-speed Bluetooth remote control and opening nose cone, driver’s cabin with opening window, 2 cars with removable roofs, seats and tables, a full circular track with 16 curved and 4 straight rails, plus a buildable platform with 2 seats and train service map, train signal and 4 LEGO minifigures.\n\nIncludes 4 LEGO® minifigures: 2 passengers, a train conductor and a train attendant.\nFeatures a motorized engine with 10-speed Bluetooth remote control and opening nose cone, pantograph on the roof and driver’s cabin with opening window and control panel, plus a café car with removable roof and tables, and a passenger car with removable roof, seats and tables.\nAlso includes a platform with 2 seats and train services map, a full circular track with 16 curved rails and 4 straight rails, plus a buildable train signal pole.\nAccessory elements include 3 mugs, 3 muffins, a hot dog, croissant, messenger bag and a suitcase with LEGO® box inside.\nLift off the roof to access the passenger train cabins filled with cool details.\nOperate the train with the 10-speed Bluetooth remote control.\nDrive to the platform and pick up or unload passengers.\nSet the rails in different ways to fit your city's style.\nThis product requires batteries (not included). Please refer to the product packaging for types and quantities.\nThe included Bluetooth remote is not compatible with older infrared remote-controlled LEGO® train sets.\nPassenger Train with cars measures over 4” (11cm) high, 27” (69cm) long and 1” (5cm) wide.\nEngine section measures over 4” (11cm) high, 10” (26cm) long and 1” (5cm) wide.\nPlatform measures over 2” (7cm) high, 4” (11cm) wide and 2” (6cm) deep."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/liebherr-r-9800-excavator-42100","description":"Get ready for a colossal LEGO® build and play experience with the 4,108-piece LEGO Technic™ Liebherr R 9800 Excavator. Developed in partnership with Liebherr, this replica model is operated via the intuitive LEGO TECHNIC CONTROL+ app and powered by 2 advanced Smart Hubs with 7 motors. The sophisticated app technology enables super-precise movement and amazing functionality, while delivering endless authentic digital play combinations via 4 different control screens with cool graphics. The Multi-function control screen enables users to drive the machine in all directions, rotate the superstructure, extend and raise the boom, open and tilt the bucket, play realistic sound effects and get real-time feedback, such as boom position, power usage and drive distance. With the One-touch screen, users can use drag patterns to control the boom, arm and bucket, while the Custom-built movements screen enables them to choose pre-set commands or record the model’s actions to create complex sequences of movements. And, with the Challenges & achievements screen, users can complete challenges to unlock reward badges.\n\nThis excavator model features the LEGO® TECHNIC™ CONTROL+ app for a more immersive and realistic play experience and hours of fun.\nThe app-controlled LEGO® Technic™ Liebherr R 9800 Excavator is operated via a smart device with 4 alternative control screens. Go to LEGO.com/devicecheck for a list of compatible smart devices.\nMulti-function control: Drive forward, reverse, steer, rotate the superstructure, extend, raise and lower the boom, open and tilt the bucket and get model feedback, such as boom and superstructure position, power usage and drive distance.\nOne-touch control: Select an on-screen drag pattern and see the excavator respond to your command.\nCustom-built movements: Use pre-set commands or record the model’s actions to create complex sequences of movements.\nChallenges & achievements: Complete challenges to unlock reward badges.\nReplica of the Liebherr R 9800 Excavator with an array of true-to-life features and functions, finished with an authentic color scheme and cool sticker detailing.\nIncludes 3 XL Motors, 4 L Motors and 2 Bluetooth-controlled Smart Hubs.\nSmart Hubs feature Bluetooth Low Energy (BLE) connectivity, activation button, 6 axis sensor (3 gyro and 3 accelerometer sensors) and 4 connectivity ports.\nThe app allows users to connect to multiple hubs, ensuring precise and true-to-life movements.\nDownload the app from the App Store or Google Play. Ask your parents’ permission before going online.\nThis excavator toy requires batteries (not included). Please refer to the product packaging for type and quantity.\nThis LEGO® Technic™ construction toy introduces LEGO builders to advanced elements of engineering.\nNot compatible with the Power Functions systems.\nLiebherr R 9800 Excavator measures over 15” (39cm) high, 25” (65cm) long and 10” (27cm) wide."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/4x4-x-treme-off-roader-42099","description":"Are you ready to take your LEGO® play experience to another level? The LEGO Technic™ 4x4 X-treme Off-Roader is powered by an advanced Smart Hub with 3 motors and controlled via the intuitive LEGO TECHNIC CONTROL+ app. The sophisticated app technology enables super-precise movement and functionality, while delivering endless authentic digital play combinations with authentic sound effects. Users can choose from different control screens to drive forward, reverse, steer, accelerate, brake and traverse obstacles. You can also get real-time feedback, such as a speed and tilt log or test out your skills in the app’s challenges and achievement section. This sturdy 4x4 app-controlled truck comes with high-rise independent suspension, large wheels with chunky tires and a fresh color scheme with intricate sticker detailing. Its complex gear mechanisms and technologies introduce LEGO builders to advanced elements of engineering, while improving reaction times, cognitive thinking and creative problem-solving skills.\n\nThis cool toy truck model is controlled via the LEGO® TECHNIC™ CONTROL+ app and powered by an advanced Smart Hub with 2 XL motors and 1 L motor for a more immersive play experience, authentic movements and hours of fun.\nThe app-controlled LEGO® 4x4 X-treme Off-Roader is operated via a smart device with 3 alternative screens. Go to LEGO.com/devicecheck for a list of compatible smart devices.\nMulti-function control: Drive forward, reverse, steer, accelerate, brake, traverse obstacles, play sound effects and get real-time feedback, such as a speed and tilt log.\nOne-touch control: Drag a direction on the screen and see the 4x4 carry out the maneuver.\nChallenges & achievements: Complete challenges to unlock achievement badges.\nSturdy app-controlled LEGO® truck with high-rise independent suspension, large wheels and chunky tires.\nSmart Hub features Bluetooth Low Energy (BLE) connectivity, activation button, 6 axis sensor (3 gyro and 3 accelerometer sensors) and 4 connectivity ports.\nDownload the LEGO® TECHNIC™ CONTROL+ app from the App Store or Google Play. Ask your parents’ permission before going online.\nThis remote-controlled truck requires batteries (not included). Please refer to the product packaging for type and quantity.\nThis buildable LEGO® Technic™ model introduces LEGO builders to advanced elements of engineering, while improving reaction times, cognitive thinking and creative problem-solving skills.\nNot compatible with LEGO® Power Functions systems.\n4x4 X-treme Off-Roader measures over 7” (19cm) high, 12” (33cm) long and 8” (22cm) wide."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/boost-creative-toolbox-17101","description":"Bring your LEGO® creations to life with the new LEGO BOOST Creative Toolbox—a fun and easy way for your 7+ builder to learn the basics of coding, engineering and robotics. Simply choose one of the 5 models available with the BOOST set, download the free, easy-to-use app and you’re ready to go! Choose between Vernie the Robot—a moving, talking robot; the M.T.R.4 (Multi-Tooled Rover 4)—a robust, versatile rover with 4 different tool attachments including a spring-loaded shooter; the Guitar4000—a musical instrument with pitch bend and sound effects; Frankie the Cat—an interactive robot pet that plays, purrs and expresses its mood; or the AutoBuilder—an automated production line that really builds miniature LEGO models! Then bring your creation to life with the app’s intuitive, icon-based coding interface and complete an array of exciting activities designed for each model. With LEGO BOOST, children learn about loops and variables, improve STEM and creative-problem solving skills and develop their imagination as they toggle between guided and open-ended play. The more activities you complete, the more coding blocks you unlock! The LEGO BOOST app is available for selected iOS, Android and Kindle smart devices. Please go to LEGO.com/devicecheck for a list of all compatible devices. The app offers regular updates with new challenges and coding options designed to encourage social play.\n\nIncludes a LEGO® Motorized Hub, additional Motor and a Color & Distance Sensor, plus more than 840 LEGO pieces for building and rebuilding any of 5 multifunctional models.\nCode Vernie the Robot to dance, shoot the target, beatbox, use his hockey stick or even play a game.\nBuild the M.T.R.4 (Multi-Tooled Rover 4) and choose from a selection of tools and customization attachments to complete missions or battle against other rovers.\nLearn how to play a song and rock out with the Guitar4000.\nLook after your own pet with Frankie the Cat. Be sure to feed it the right food, or it might get upset!\nConstruct, code and operate the AutoBuilder to produce real miniature LEGO® models.\nBuild and code robots and models, and complete over 60 exciting activities included in the LEGO® BOOST App. Building instructions for all 5 models are only available with the free LEGO BOOST app, available for selected iOS, Android and Kindle smart devices. The app offers regular updates that include new challenges and coding options, and encourages social play.\nReal coding transformed into an intuitive and easy to use drag-and-drop coding interface, suitable for all aged 7+. Learn about loops and variables, and develop your STEM skills, creative-problem solving and imagination by toggling between guided and open-ended play.\nStep-by-step challenges suitable for starting levels that help you progress and increase your coding skills.\nCombine with the LEGO® City 60194 Arctic Scout Truck to control and drive the vehicle! Use the LEGO BOOST app to operate the forklift, examine samples with the color sensor, help the whale back into the water and much more, for an interactive experience like never before!\nCombine with LEGO® NINJAGO® 70652 Stormbringer and set the Lightning Dragon free! Use the LEGO BOOST app to control the fearsome beast, fire the shooters, create a color-sensing ejector seat and much more!\nThis product requires batteries (not included).\nGo to LEGO.com/devicecheck for a list of compatible devices.\nThis set features Digital Building Instructions. Now it’s easy to follow the steps on your mobile device or download a PDF of the printed building guide. Click the Building Instructions button at the bottom of this page to find and download the instructions."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/app-controlled-top-gear-rally-car-42109","description":"Know a race car fan who would love to drive like the Stig from TV’s BBC Top Gear? Let them put their skills to the test with this awesome LEGO® Technic™ (42109) App-Controlled Top Gear Rally Car. First, they can have fun building the rally car toy, discovering all the elements that make this Rally Car model work. Then the adrenaline builds as they try out cool moves – all using the LEGO Technic CONTROL+ App. Powered by a smart hub, the app allows super-precise movement, giving endless play combinations with authentic sound effects. Choose from different control screens to drive forward, reverse, steer, accelerate, brake and tackle obstacles. They will also get real-time feedback, including a speed and tilt log and can test out their skills in the app’s racing challenges section. There’s inspirational content and videos to discover in the app too! LEGO Technic sets bring an advanced building challenge for kids and adults who love to learn new engineering skills.\n\nLet race car fans take on a driving challenge with this LEGO® Technic™ app-controlled Top Gear Rally Car (42109). It’s operated via a smart device with 3 screens. Go to LEGO.com/devicecheck for compatible devices.\nThis toy rally car model is controlled via the LEGO® Technic™ CONTROL+ app and powered by an advanced Smart Hub with 1 XL motor and 1 L motor for a more immersive play experience, authentic movements and hours of fun.\nBuild the car. Download the app. Get ready for action. With multi-function control, drivers can go forward, reverse, steer, accelerate, brake, or play sound effects and get real-time feedback!\nLooking for Top Gear gifts or LEGO® gifts? Racing fans aged 9+ will love this toy building set.\nAt over 10” (26cm) long, 3” (10cm) high and 5” (14cm) wide, this motorised toy car is the perfect size for driving or for display. Please note: this set is not compatible with LEGO® Power Functions systems.\nBuilding can start without batteries but to enjoy the full power of digital play with the app controls, you’ll need to pop 6 x AA 1.5V batteries into the Smart Hub.\nGetting started with this app-controlled toy is super-fast as full, easy-to-follow instructions are included in the box.\nLEGO® Technic™ plastic model kits are thoroughly tested to make sure every one of these unique toys meets the highest global safety and quality standards."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/technic-hub-88012","description":"Bring LEGO® Technic™ creations to life with the LEGO Powered Up Technic Hub (88012). This advanced control unit features an integrated tilt sensor, as well as 4 input/output ports to program and control LEGO Powered Up sensors, motors and lights.\nFeatures an integrated tilt sensor and 4 input/output ports to program and control LEGO® Powered Up motors, lights and sensors.\nConnects via Bluetooth® to the LEGO® Technic™ CONTROL+ app and is compatible with the Powered Up app.\nDesigned for use with the LEGO® Technic™ building system.\nRequires 6x AA batteries (not included).\nA great addition to STEM learning and robotics projects."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/move-hub-88006","description":"Use the LEGO® Powered Up 88006 Move Hub to bring movement and life to your LEGO creations with its 2 integrated position motors and tilt sensor. Connect other Powered Up sensors and motors to the Move Hub for even more control of your LEGO inventions.\n\nFeatures a hub with 2 input/output ports, 2 integrated position motors, an integrated tilt sensor, connecting wire and a connection point for LEGO® Powered Up components.\nConnect via Bluetooth® from the LEGO® Powered Up app.\nThis robot toy accessory requires batteries (not included). Please refer to the product packaging for type and quantity."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/technic-large-motor-88013","description":"Breathe life into LEGO® Technic™ creations with the LEGO Powered Up Technic Large Motor (88013). Whether it's powering a steering mechanism or system of gears, this motor gets the job done.\nFeatures an integrated rotation sensor and absolute positioning for accurate speed and position control.\nIncludes a connecting wire and connector for LEGO® Powered Up Hubs (required, sold separately).\nPerfect for higher-load tasks.\nDesigned for use with the LEGO® Technic™ building system.\nUsed with the LEGO® Technic™ CONTROL+ app.\nA great addition to STEM learning and robotics projects.\nLEGO® Powered Up Technic™ Hub required (sold separately)."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/technic-xl-motor-88014","description":"Power up LEGO® Technic™ creations with the LEGO Powered Up Technic XL Motor (88014). Whether turning wheels or lifting heavy loads, this super-strong motor is perfect for the most demanding tasks.\nFeatures an integrated rotation sensor and absolute positioning for accurate speed and position control.\nMaximum power for the most demanding needs.\nIncludes a connecting wire and connector for LEGO® Powered Up Hubs (required, sold separately).\nDesigned for use with the LEGO® Technic™ building system.\nUsed with the LEGO® Technic™ CONTROL+ app.\nA great addition to STEM learning and robotics projects.\nLEGO® Powered Up Technic™ Hub required (sold separately)."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/remote-control-88010","description":"Use this wireless, handheld LEGO® Powered Up 88010 Remote Control device to control LEGO builds and robot toys that incorporate the 88006 Move Hub or 88009 Hub.\n\nFeatures a handheld LEGO® remote control for toys that connect to LEGO Powered Up hubs via Bluetooth®.\nRequires batteries (not included). Please refer to the product packaging for type and quantity."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/medium-linear-motor-88008","description":"Connect the LEGO® Powered Up 88008 Medium Linear Motor to the 88006 Move Hub or 88009 Hub to make your LEGO builds move with extreme precision.\n\nThis LEGO® robot toy accessory features a medium-sized position motor for precise control, connecting wire and a connection point for LEGO Powered Up components.\nUse to motorize LEGO® creations."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/simple-medium-linear-motor-45303","description":"Connect the LEGO® Powered Up 45303 Simple Medium Linear Motor to the Powered Up Hub or Move Hub to make your LEGO building toys move.\n\nFeatures a medium-sized motor, connecting wire and a connection point for LEGO® Powered Up components.\nUse to motorize LEGO® creations."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/color-distance-sensor-88007","description":"Connect the LEGO® Powered Up 88007 Color & Distance Sensor to the 88006 Move Hub or 88009 Hub. This LEGO sensor can detect colors and motion to make your LEGO builds and robot toys interactive.\n\nFeatures a sensor, connecting wire and a connection point for LEGO® Powered Up components.\nDetect 6 colors and objects within 5 to 10 cm range with this robot toy accessory for kids."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/train-motor-88011","description":"Enhance your LEGO® building sets with the LEGO Powered Up 88011 Train Motor. Build this motor into LEGO train construction toys to make them move. Remember to power the motor with the 88006 Move Hub or 88009 Hub.\n\nFeatures a train motor, connecting wire and a connection point for LEGO® Powered Up components.\nUse to motorize LEGO® trains and bring models to life."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/cargo-train-60198","description":"Load up the powerful LEGO® City 60198 Cargo Train and deliver the goods on time! This cool LEGO City set features a motorized engine with 10-speed Bluetooth remote control, accessible driver’s cabin, a crane wagon with rotating and extendable boom arm, container wagon with 2 containers, and a log wagon, plus an armored truck with opening doors, and a forklift with opening roll cage and lifting forks. This cool LEGO train set also includes a full circular track with 16 curved rails, 16 straight rails and a railroad switch with lever, plus a control center with ladder and 2 buildable pallets with money bills, gold bar elements, a snow scooter and 6 LEGO minifigures.\n\nIncludes 6 LEGO® minifigures: 4 train workers, a security officer and a crook.\nFeatures a motorized engine with 10-speed Bluetooth remote control, pantograph on the opening roof, and driver’s cabin with control panel.\nAlso features a log wagon, crane wagon with rotating and extendable boom arm, and a container wagon with 2 containers with hooks on the roof for loading and space for pallets.\nIncludes a control center with ladder and signal lights, a full circular toy train track with 16 curved rails, 16 straight rails and a railroad switch with lever, a money transport truck with opening doors, and a working forklift with opening roll cage.\nAccessory elements include a wrench, 12 gold bar elements and 4 money bills, plus 2 buildable pallets, 3 logs and snow scooter.\nOpen the roof to access the engine car filled with cool details.\nOperate the cargo train with the 10-speed Bluetooth remote control.\nLift and load logs onto the log wagon with the crane's rotating arm and hook.\nPush the lever on the railroad switch to drive the train to a different track for loading or unloading.\nLoad pallets into the containers with the forklift before lifting them onto the container wagon with the crane.\nSet up the tracks in different configurations to load or offload cargo around your city.\nThis product requires batteries (not included). Please refer to the product packaging for type and quantities.\nThe included Bluetooth remote is not compatible with older infrared remote-controlled LEGO® train sets.\nCargo Train in total measures over 4” (11cm) high, 32” (82cm) long and 2” (6cm) wide.\nEngine measures over 4” (11cm) high, 10” (27cm) long and 2” (6cm) wide.\nLog wagon measures over 1” (5cm) high, 5” (15cm) long and 2” (6cm) wide.\nCrane wagon measures over 4” (10cm) high, 8” (22cm) long and 1” (5cm) wide.\nContainer wagon measures over 3” (9cm) high, 7” (18cm) long and 1” (5cm) wide.\nArmored truck measure over 2” (6cm) high, 6” (15cm) long and 2” (6cm) wide.\nControl center measures over 8” (21cm) high, 3” (8cm) wide and 4” (12cm) deep.\nForklift measures over 2” (7cm) high, 2” (5cm) wide and 4” (12cm) deep."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/grand-piano-21323","description":"Do you have a passion for music? Do you like to relax by focusing on a fun, hands-on project in your free time? If so, this incredible LEGO® Ideas Grand Piano model kit (21323) is just the creative activity for you.\n\nBeautiful and playable\nFeel the pride of building a sophisticated, brick-built version of a concert grand piano that you can actually play music with! Recreate the hammer action of each piano key, the moving pedal and authentic details such as the propped-open top lid and fallboard. Turn on the motor and then you are all set to play wonderful music – select user play on the free LEGO Powered Up app to play the notes yourself or activate auto play and just listen.\n\nLEGO sets for your lifestyle\nTake some time out and enjoy creating a LEGO musical masterpiece to display in your home or workplace. Part of a collection of LEGO building sets for adults, it makes a truly special birthday present or Christmas gift for yourself, the musician, piano player or hobbyist in your life.\n\nDrum roll please as we proudly introduce the first-ever, playable LEGO® Grand Piano! Experience the hands-on pleasure of creating a highly sophisticated LEGO concert piano model and then play beautiful music with it.\nThe LEGO® Ideas Grand Piano (21323) has a removable 25-key keyboard, authentic hammer action, moving dampers and pedal, and motor. Combined with the LEGO Powered Up app, you can play a tune yourself or automatically.\nRevel in the authentic design details of this beautiful model, from the top lid that can be propped up just like a real grand piano’s, to the opening fallboard and piano leg wheels, plus a height adjustable bench.\nIf you are looking for a creative DIY project, this 3,662-piece model building kit is ideal for you. So, take some time out and click your stress away with a rewarding challenge that will leave you feeling revitalized.\nThe piano measures over 8.5” (22.5cm) high, 12” (30.5cm) wide and 13.5” (35.5cm) deep when closed. A stylish item for your home or workplace, it also makes a cool gift for musicians, music-lovers, pianists and hobbyists.\nTo power up the grand piano’s self-playing function, you’ll need 6 AAA batteries (not included) and the free LEGO® Powered Up app – choose user play to play the notes yourself or auto play to listen to 1 of 4 songs.\nClear instructions help you to build with confidence and really enjoy the process, even if you are a LEGO® newcomer. Also included is a coffee-table-style booklet about this grand piano set’s fan designer and more.\nThis LEGO® Ideas building set for adults is part of a collection of inspiring model kits designed for the discerning hobbyist who relishes an immersive, hands-on DIY project.\nSince 1958, LEGO® building bricks have met the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are rigorously tested to meet exacting safety and quality standards, so you can be sure that this collectible grand piano model is as robust as it is beautiful."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/hub-88009","description":"Use the LEGO® Powered Up 88009 Hub to power and control Powered Up sensors and motors.\n\nThis robot toy accessory features a hub with 2 input/output ports, connecting wire and connection point for LEGO® Powered Up components.\nConnect via Bluetooth® from the LEGO® Powered Up app.\nRequires batteries (not included). Please refer to the product packaging for type and quantity."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/light-88005","description":"Connect the LEGO® 88005 Powered Up Light to LEGO models with the Powered Up Hub—such as the LEGO City 60197 Passenger Train—and light up your builds!\n\nFeatures 2 LED lights, connecting wire and connection point for LEGO® Powered Up components."},{"theme":"powered-up","themeUrl":"https://www.lego.com/en-us/themes/powered-up","productUrl":"https://www.lego.com/en-us/product/droid-commander-75253","description":"Introduce your Star Wars™ fan to a rich LEGO® brick galaxy of lovable droids, exciting missions and coding fun for kids with the LEGO Star Wars BOOST Droid Commander set. This interactive robot toy puts your child in command of 3 app-controlled Star Wars LEGO droids: R2-D2, a Gonk Droid and a Mouse Droid, each with their own personalities and skills. Using the free LEGO BOOST Star Wars app, your young commander builds the droids, inserts the Bluetooth-controlled Move Hub into the one that will solve each mission, and brings it to life using the intuitive drag-and-drop coding environment (visit LEGO.com/devicecheck for a list of compatible devices). Your youngster then constructs tools, weapons, targets, obstacles and lots more as they progress through over 40 exciting missions – they’ll love it! This set makes a great birthday or Christmas gift or just a gift for any occasion. It also helps youngsters develop their critical thinking and creative problem-solving skills, introduces them to basic engineering and robotics, and, just as importantly, lets them play in a rich and expansive galaxy filled with unforgettable icons like Luke Skywalker, X-wings, the Death Star and many more.\n\nKids will learn to code and develop creative problem-solving skills as they play with this interactive STEM toy, featuring 3 buildable LEGO® Star Wars™ droids and over 40 interactive missions.\nThis fun LEGO® Star Wars™ tech toy for kids includes a color & distance sensor, interactive motor, Move Hub and 1,177 pieces – enough to build all 3 lovable R2-D2, Gonk Droid and Mouse Droid LEGO figures. Please note that only one robot can be brought to life at a time using the included Bluetooth-controlled Move Hub.\nBuildable props include rocket boosters, a catapult, a cake shooter, a target, color decoder, obstacles and many more.\nKids aged 8+ will love building the robot toys using the free LEGO® BOOST Star Wars™ app, attaching the tools and weapons, and bringing them to life to solve fun, challenging missions with the easy-to-use coding environment. Visit LEGO.com/devicecheck for a list of compatible devices.\nThis great Christmas, birthday or gift idea for any occasion features unforgettable characters, locations, sounds and music from episodes I-VI of the Star Wars™ movie saga, which kids and adults will love to interact with.\nLEGO® brick R2-D2 measures over 7” (20cm) high, 3” (10cm) long and 5” (14cm) wide. LEGO Gonk Droid measures over 7” (18cm) high, 6” (16cm) long and 3” (9cm) wide. LEGO Mouse Droid measures over 5” (14cm) high, 6” (17cm) long and 3” (9cm) wide.\nFree LEGO® BOOST Star Wars™ Droid Commander app is available for selected iOS, Android and Fire smart devices. Ask your parents’ permission before going online.\nIncludes LEGO® Light Brick.\nThis set features digital building instructions. Now it’s easy to follow the steps on your mobile device or download a PDF of the printed building guide. Click the Building Instructions button at the bottom of this page to find and download the instructions."}]