[{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/creative-party-kit-41926","description":"Hit the right party note for craft-loving kids with this fun LEGO® DOTS Creative Party Kit (41926) set! Made for quick assembly, this kit gives boys and girls the chance to create and decorate their own colorful, buildable cupcake toy with removable icing that reveals a secret compartment inside for holding candy or small surprises.\n\nIt's a LEGO DOTS party!\nThis imaginative kit features 8 customizable cupcakes and plenty of tiles, candles and stickers for kids to decorate their perfect cupcake. There’s also party inspiration to help parents make it the best day ever for their youngster.\n\nFun for kids who love arts and crafts\nKids can decorate the cupcakes however they like and share their designs with friends. The colorful cupcakes combine a child's passion for arts and crafts with fun party entertainment to make a delightful birthday-related gift.\n\nSurprise any youngster with this sweet LEGO® DOTS Creative Party Kit (41926) set, featuring 8 customizable cupcakes, a sticker sheet, buildable birthday candles and plenty of colorful tiles.\nKids can decorate the cupcakes using the included design ideas or use their creativity and skills to make up their own colorful patterns. They can also take their cupcake home as a memento.\nThe included tiles are great for decorating. Kids can also swap the tiles with any of the other craft kits or bags, such as Extra DOTS – Series 3 (41921) for more design fun!\nAny kid with a passion for arts and crafts will love this creative idea. The kit is a great party group activity and the cupcakes are a fun favor that boys and girls aged 6+ will love.\nImaginative fun in a portable size. Each cupcake toy measures over 1 in. (3 cm) high and 2 in. (6 cm) wide, has a removable icing top and secret compartment inside.\nGive kids appealing crafts to create and use with LEGO® DOTS sets. These tasty-looking cupcakes offer creative party entertainment that helps build children’s confidence while they have fun.\nLEGO® DOTS sets offer open-ended creativity and encourage kids’ self-expression through creating and customizing cool craft items, bringing the joy of LEGO play to a new group of kids.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/secret-holder-41924","description":"Inspire a young crafts or animal lover with this cool LEGO® DOTS Secret Holder (41924) kit! Made for quick assembly, this set lets boys and girls create and customize their own unique box to hold all their small secrets safely. Cleanup and sorting are a breeze, thanks to the included storage tray with lid.\n\nEndlessly creative secret holder\nThis awesome and useful box kit features a cool cat, with paws for holding a note or small photo. The cat's body becomes a pencil holder and has 2 hidden compartments, plus there’s a key-shaped tile remover and plenty of fun tiles to stretch kids’ self-expression skills. The cat’s face, ears and legs can also be redesigned to reflect any position or mood.\n\nAspirational arts-and-crafts fun\nLEGO DOTS sets encourage free creativity. Kids can hone skills like imaginative thinking and simple problem-solving while they decorate the toy box and then share their designs with friends. This clever kitty secret holder makes a perfect reward for boys and girls.\n\nReward any youngster with this perfect LEGO® DOTS Secret Holder (41924) kit, featuring a box with 2 secret compartments, plus a storage tray and tiles. Play starts with opening the tray!\nPersonality on display! Kids can stretch their design skills as they decorate the Secret Holder, following the pattern ideas on the packaging and instructions, or coming up with their own fun designs.\nThe included tiles are great for making cool crafts. Kids can also use tiles from the other kits and bags, such as Extra DOTS – Series 3 (41921) or the other room decor sets!\nAny fan of DIY or arts and crafts will love this imaginative toy. The useful holder makes a great everyday gift or fun creative reward that boys and girls aged 6 and up will find appealing.\nDesigner hiding spot! The Secret Holder measures over 4.5 in. (12 cm) high, 2.5 in. (7 cm) wide and 2.5 in. (7 cm) deep, making this easy craft kit the perfect size for tucking away secrets.\nOpen the tray and creativity begins with assembling the secret holder. Clear, easy-to-follow instructions help make assembly a snap. Cleanup and storage are also a breeze thanks to the enclosed tray.\nGive kids appealing crafts to create and use with LEGO® DOTS sets. This cool, cat-shaped secret holder offers open-ended design inspiration that helps build children's creativity and confidence.\nLEGO® DOTS kits offer free creativity and encourage self-expression through creating and customizing jewelry or room decor items, bringing the joy of LEGO play to a new group of kids.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/secret-boxes-41925","description":"Unlock creativity for crafts-loving kids with this cool LEGO® DOTS Secret Boxes (41925) kit! Made for quick assembly, this set gives boys and girls the chance to create and decorate their own lockable secret boxes with space for their special treasures, and redesign them over and over. The enclosed storage tray with lid makes cleanup and sorting a breeze.\n\nFresh canvas\nThis useful kit features an easy-to-assemble, lockable, book-shaped box to hold secrets and treasures safely, a mini box build to hold the key that doubles as a tile remover, plus plenty of tiles to stretch kids’ self-expression skills while making the boxes uniquely theirs.\n\nCreative arts-and-crafts fun\nKids can decorate the boxes any way they like, then share their designs with friends. This imaginative play kit makes a perfectly delightful everyday gift for boys and girls.\n\nRecognize a child’s hard work with this creative LEGO® DOTS Secret Boxes (41925) set! This kit is ideal for kids with a passion for arts and crafts who want to express themselves through design.\nImagination on display! This cool kit features an opening book-shaped box with working lock and storage space inside, a small box with picture frame, 2 keys, plus a storage tray and plenty of tiles!\nThe included tiles are great for making unique designs. Kids can also use tiles from other LEGO® DOTS kits and bags, such as Extra DOTS – Series 3 (41921) to expand their ideas!\nAny fan of DIY or arts and crafts will love this imaginative play toy. The clever boxes make a great everyday gift or fun creative reward that boys and girls aged 6 and up will find appealing.\nCreative hiding spot. The locking, book-shaped box measures over 1.5 in. (3 cm) high, 3 in. (8 cm) wide and 3.5 in. (9 cm) long, making this easy kit the perfect size for tucking away secrets.\nOpen the tray and creativity begins with assembling the secret boxes. Clear, easy-to-follow instructions help make construction a snap. Cleanup and storage are also a breeze with the enclosed tray.\nGive kids appealing crafts to create and use with LEGO® DOTS sets. This small, lockable, book-shaped box offers open-ended design inspiration that helps build children's creativity and confidence.\nLEGO® DOTS sets offer free creativity and encourage self-expression through creating and customizing jewelry or useful roomdecor items, bringing the joy of LEGO play to a new group of kids.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/bag-tag-dog-41927","description":"Treat a crafts lover with this adorable LEGO® DOTS Bag Tag Dog (41927) kit! Made for quick assembly, this kit gives boys and girls the chance to create and decorate their own cute dog tag accessory to customize a bag or backpack.\n\nAwesome surprise for kids who love crafts\nThis imaginative bag tag toy kit features a small cube with room for lots of fun puppy or dog-related designs, a silicone ring to attach it with, a small, key-shaped tile remover and lots of tiles. Help kids push their design and creative skills further with the Extra DOTS – Series 4 (41931) bag for loads more facial expression tiles to top off the creative fun.\n\nA perfect creative gift!\nKids can make and personalize their own bag tag over and over, change up the dog’s expressions to match their own and share their designs with friends. The cool bag tag toy combines a child's passion for arts and crafts with fun self-expression and make a delightful anytime treat or top extra gift.\n\nSurprise any youngster with this cute animal LEGO® DOTS Bag Tag Dog (41927) kit, letting them craft a sturdy cube that comes with a silicone ring, key-shaped tile remover and plenty of colorful tiles.\nKids can decorate the bag tag using the design ideas from the packaging or use their creativity and skills to make up their own imaginative patterns to customize the toy.\nThe included tiles are great for decorating. Kids can also swap the tiles with any of the other craft kits or bags, such as Extra DOTS – Series 3 or 4 (41921 or 41931) for more design fun!\nAny kid with a passion for arts and crafts will love this great dog bag tag. The kit makes a fast and fun creative break and the tag will fit on any bag that boys and girls aged 6+ might carry.\nImaginative fun in a portable size. Each awesome bag tag measures over 1.5 in. (4 cm) high and 1 in. (3 cm) wide and deep and makes a durable and useful little toy treat for any child.\nGive kids appealing crafts to create and use with LEGO® DOTS sets. This adorable bag tag presents kids with cool customization options that help build confidence while they have fun.\nLEGO® DOTS sets offer open-ended creativity and encourage kids’ self-expression through creating and designing useful craft items, bringing the joy of LEGO play to a new group of kids.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/bag-tag-leopard-41929","description":"Spark a crafts fan´s imagination with this fierce LEGO® DOTS Bag Tag Leopard (41929) kit! Made for quick assembly, this kit gives boys and girls the chance to make and customize their own funky and stylish bag tag leopard toy to accessorize a bag or backpack.\n\nA perfect little surprise!\nThis customizable bag tag toy kit features a small cube, a silicone ring to attach it with and a small, key-shaped tile remover. The kit includes plenty of tiles in blue, purple and lilac colors, plus animal-print tiles for extra style. Help kids push their design and creative skills further by adding in the Extra DOTS – Series 4 (41931) bag for more facial expression tiles.\n\nFun for kids who love arts and crafts\nKids can personalize the bag tag however they like, including changing the leopard's expressions to match their own, and then share their designs with friends. The bag tag combines a child's passion for arts and crafts with fun self-expression and makes a great anytime treat or extra gift.\n\nSurprise any youngster with this bold LEGO® DOTS Bag Tag Leopard (41929) accessory kit, featuring a sturdy cube with a hanger, key shaped tile remover and plenty of colorful tiles.\nKids can decorate the bag tag using the design ideas from the toy packaging or use their creativity and skills to make up their own imaginative patterns.\nThe included tiles are great for decorating. Kids can also swap the tiles with any of the other craft kits or bags, such as Extra DOTS – Series 3 or 4 (41921 or 41931) for more design fun!\nAny kid with a passion for arts and crafts will love this bag tag gift. The kit offers a fun little creative break and the tag will fit on any bag that boys and girls aged 6+ might carry.\nPortable self-expression. Each bag tag measures over 1.5 in. (4 cm) high and 1 in. (3 cm) wide and deep, includes a bunch of colorful tiles and makes a durable and useful little treat for any child.\nGive kids appealing crafts to create and use with LEGO® DOTS sets. Thisadorable bag tag offers kids cool customization options that help build confidence while they have fun.\nLEGO® DOTS sets encourage children’s open-ended creativity and self-expression through creating and designing useful craft items, bringing the joy of LEGO play to a new group of kids.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it's been that way since 1958.\nLEGO® components are dropped,heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/bag-tag-narwhal-41928","description":"Surprise a sea creature fan with this super-cute LEGO® DOTS Bag Tag Narwhal (41928) kit! Made for quick assembly, this accessory kit gives boys and girls the chance to create and decorate their own magical narwhal bag tag to hang on a bag or backpack.\n\nA perfect accessory for self-expression!\nThis bag tag kit features a small cube with room for lots of fun designs, a silicone ring to attach it with and a small, key-shaped tile remover. Kids can use the blue, teal and aqua tiles to design a realistic narwhal. If they want to push creativity, they can grab a Series 4 bag of Extra DOTS tiles, dive into a creative ocean and make even more fun faces and designs.\n\nFun for arts-and-crafts-loving kids\nKids can personalize the bag tag, change the narwhal's expressions endlessly and then share their designs with friends. The fun little bag tag is the best for combining a child's passion for arts and crafts with self-expression and makes a delightful toy treat or top extra gift to inspire creative play.\n\nSurprise any youngster with this underwater-inspired LEGO® DOTS Bag Tag Narwhal (41928) kit, featuring a sturdy cube with a hanger, key-shaped tile remover and plenty of colorful tiles.\nKids can decorate the bag tag toy using the design ideas from the packaging or use their creativity and skills to make up their own imaginative patterns.\nThe included tiles are great for decorating. Kids can also swap the tiles with any of the other toy craft kits or bags, such as Extra DOTS – Series 3 or 4 (41921 or 41931) for more design fun!\nAny kid with a passion for arts and crafts will love this great bag tag accessory. The kit is a fast and fun creative break and the tag will fit on any bag that boys and girls aged 6+ might carry.\nCreative play in a portable size. Each bag tag measures over 1.5 in. (4 cm) high and 1 in. (3 cm) wide and deep and makes a durable and useful little treat or top extra gift for any child.\nGive kids appealing toy crafts to create and use with LEGO® DOTS sets. This adorable narwhal presents kids with unique customization options that help build confidence while they have fun.\nLEGO® DOTS sets offer open-ended creativity and encourage kids’ self-expression through creating and designing useful craft items, bringing the joy of LEGO play to a new group of kids.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/bag-tag-panda-41930","description":"Give any child an unexpected treat with this mellow LEGO® DOTS Bag Tag Panda (41930) kit! Made for quick assembly, this kit gives boys and girls a chance to create and customize their own bold panda bag tag to dress up a bag or backpack.\n\nFun for kids who love arts and crafts\nThis bag tag toy kit features a cube with room for lots of fun designs, a silicone ring to attach it to a bag or backpack, plus a small, key-shaped tiled remover and plenty of tiles. Kids can use the black, white and bamboo-decorated tiles to design a more realistic panda or grab a bag of Extra DOTS Series 4 tiles and create even more fun faces and designs to make the tag uniquely theirs.\n\nA perfect little surprise\nBoys and girls can personalize the bag tag accessory however they like, change the panda's expressions to match theirs, and then share their designs with friends. This cool bag tag kit combines a child's passion for arts and crafts with fun self-expression and makes a delightful anytime treat or extra gift.\n\nSurprise any youngster with this bamboo-loving LEGO® DOTS Bag Tag Panda (41930) kit, featuring a sturdy cube with hanger, key-shaped tile remover and plenty of colorful tiles.\nKids can customize the bag tag using the design ideas from the packaging or use their creativity and design skills to make up their own imaginative patterns for the toy.\nThe included tiles are great for decorating. Kids can also swap the tiles with any of the other craft kits or bags, such as Extra DOTS – Series 3or 4 (41921 or 41931) for more design fun!\nAny kid with a passion for arts and crafts will love this cool bag tag. The kit is a fast and fun creative gift and the tag will fit on any bag that boys and girls aged 6+ might carry.\nImaginative fun in a portable size. Each bag tag measures over 1.5 in. (4 cm) high and 1 in. (3 cm) wide and deep and makes a unique, durable and useful little toy treat for any child.\nGive kids appealing toy crafts to create and use with LEGO® DOTS sets. This panda bag tag accessory kit gives kids free design options that help build confidence while they have fun.\nLEGO® DOTS sets offer open-ended creativity and encourage kids’ self-expression through creating and designing useful craft items, bringing the joy of LEGO play to a new group of kids.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/adventure-bracelets-41918","description":"Imaginative possibilities abound for young arts and crafts fans with this limited-edition LEGO® DOTS (41918) Adventure Bracelets toy! Made to be a cute and easy craft project, this DIY bracelet kit lets kids design their own jewelry together with their best friend. They can redesign them any way they like at any time.\n\nCool bracelets for everyone\nThis friendship bracelet kit features 2 adjustable, single-row bands in orange and teal that fit around bigger or smaller wrists. The set has 32 colored and special decorated tiles with a hip, urban travel theme. Boys and girls can use the included ideas for decorating the bracelets or come up with their own looks.\n\nAccessories for kids who love creative fun\nThe joy of this art project is the chance for kids to decorate the bracelets however they like and then share them with friends. To mix and match with their friends' designs while making the bracelets uniquely their own. This set make a great Christmas present, holiday gift or anytime treat.\n\nTreat a young designer to the fun of making cute friendship bracelets with this limited-edition LEGO® DOTS Adventure Bracelets (41918) kit, featuring 2 adjustable bands and 32 tiles. Play starts with opening the bag!\nLoads of cool design ideas! Kids can grow their sense of self-expression as they decorate and share the adjustable bracelets, following the included patterns or coming up with their own, unique look.\nThese colorful tiles can be combined with other sets for shared creative fun with friends. Kids can also use tiles from the LEGO® DOTS Extra DOTS - Series 2 pack (41916) to jazz up their bracelet-making kit.\nAny fan of DIY or arts and crafts will love this creative kit. The bracelets and colorful decorated tiles will make a great Christmas present, holiday or anytime gift for boys and girls aged 6 and up.\nSmall and totally portable toy. With the bracelets each measuring over 7” (20cm) long from top to bottom, this fun bracelet-making kit lets young designers practice their creations and then share or wear them.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ creative building skills and give them the joy of creating something new all on their own.\nOpen the bag and the fun begins with decorating the bracelets. Easy-to-follow inspiration makes design a snap for kids, letting them take pride in making a unique accessory on their own while having lots of creative fun.\nGive kids cool crafts to create with LEGO® DOTS sets. This clever bracelet-making kit offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® building bricks and tiles meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and tiles are dropped, heated, crushed, twisted and analyzed to make sure every kid's building kit meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/ice-cream-besties-bracelets-41910","description":"Creativity awaits! Boys and girls who like DIY craft sets will love this limited-edition, custom LEGO® DOTS (41910) Ice Cream Besties Bracelets friendship toy! A cute arts and crafts project, this DIY bracelet set lets kids design the jewelry with their friends, then redesign the bracelets any way they like.\n\nGlittery ice-cream cuteness on a bracelet\nThis bracelet-making pack kit features 2 adjustable, single-row bands in pastel yellow and pink that fit wrists big or small. The set has 32 assorted tiles, including adorable pink glitter and cool ice cream-printed tiles. Boys and girls can use the included ideas for decorating the bracelets or come up with their own looks.\n\nCreative, shareable fun is in the bag\nThis creative craft set offers the chance for kids to make the bracelets fit their style and share them with friends. They can mix and match with their friends' designs or make them uniquely theirs – anything goes with these bracelets! This set make a great gift for Christmas, birthdays or any time.\n\nGive a child the fun of making custom friendship bracelets with this limited-edition LEGO® DOTS Ice Cream Besties Bracelets (41910) toy, featuring 2 adjustable single-row bands and 32 colorful tiles.\nA creative DIY craft set! Kids can push their self-expression skills as they decorate and share the bracelets, following the included pattern ideas or coming up with their own, unique look.\nColorful tiles in this set or others are great to use as part of shared fun with friends. Kids can also use tiles from the LEGO® DOTS Extra DOTS - Series 1 pack (41908) to spice up their cute friendship bracelets.\nAny fan of DIY or arts and crafts will love this creative kit. The adjustable bracelets and colorful decorated tiles are a great Christmas, birthday or anytime gift for boys and girls aged 6 and up.\nSmall and totally kawaii! With the bracelets each measuring over 7” (20cm) long, this adorable bracelet-making kit is great for young designers to take their creations on the go and then share or wear their favorite one.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ creative building and imaginative play skills, plus it gives them the joy of creating something new all on their own.\nOpen the bag and the fun begins with decorating the bracelets. Easy-to-follow inspiration helps make design a snap, so kids can take pride in making something unique on their own, while having loads of creative fun.\nGive kids creativecrafts to create with LEGO® DOTS sets. This clever bracelet-making kit offers open-ended design inspiration to help build children’s creativity and confidence.\nLEGO® building bricks and tiles meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and tiles are dropped, heated, crushed, twisted and analyzed to make sure every kid's building kit meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/mermaid-vibes-bracelets-41909","description":"Young mermaid fans will love designing, wearing or sharing this limited-edition LEGO® DOTS (41909) Mermaid Vibes Bracelets kit with their bestie! Made to be an easy, intuitive craft project, this DIY bracelet set encourages kids to design accessories together with their friends. They can then redesign them any way they like.\n\nCute custom-made DIY bracelets\nThis bracelet-making kit features 2 adjustable, single-row bands in dark purple and mint blue that fit around bigger or smaller wrists. The set also has 32 assorted tiles, including translucent glitter and special decorated tiles, plus design ideas on the package to get crafts-loving kids started.\n\nAccessories for creative little mermaids\nThe joy of this craft set is the chance for kids to decorate the DIY bracelets however they like and then share them with friends. They can mix and match with their friends' designs to make them uniquely theirs, because anything goes with these bracelets! This set make a great gift for Christmas, birthdays or any time.\n\nImmerse your child in the fun of making friendship bracelets with this limited-edition LEGO® DOTS Mermaid Vibes Bracelets (41909) toy, featuring 2 adjustable bands and 32 colorful tiles. Play starts with decorating!\nLoads of creative DIY bracelet ideas! Kids can stretch their design and self-expression skills as they decorate and share the bracelets, following the included pattern ideas or coming up with their own, special look.\nTiles in this set or others are great for creativity as part of shared fun with friends. Kids can add tiles from the LEGO® DOTS Extra DOTS - Series 1 pack (41908) and really dive into creating their own unique bracelets.\nAny fan of DIY or arts and crafts will love this creative kit. The flexible bracelets and colorful decorated tiles make a thrilling Christmas, birthday or anytime gift for boys and girls aged 6 and up.\nSmall, easy and totally portable. With the bracelets each measuring over 7” (20cm) long, this popular bracelet-making kit is perfect for young designers to try new ideas and then share or wear their best version.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ creative building skills and give them the joy of creating something new all on their own.\nOpen the pack and the fun begins with decorating the bracelets. Easy-to-follow inspiration makes design a snap, so boys and girls can take pride in making unique jewelry on their own while having loads of creative fun.\nGive kids cool crafts to create with LEGO® DOTS sets. This clever bracelet-making kit offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® building bricks and tiles meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and tiles are dropped, heated, crushed, twisted and analyzed to make sure every kid's building kit meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/monster-bracelets-41923","description":"Monstrously cool design possibilities await kids with this LEGO® DOTS Monster Bracelets (41923) kit! This creative set features 2 adjustable, flexible bands in mint and blue that fit around wrists of all sizes and includes 32 colorful, monster-decorated tiles. They're easy and intuitive to create and kids can make the bracelets uniquely theirs to suit their outfit or mood. This set makes a great treat or just-because gift.\n\nFreedom of self-expression\nLEGO DOTS sets let kids explore self-expression and free creativity as they make and decorate the different kits however they like. Anything goes with these bracelets and all the other DOTS kits – the magic lies in a child’s imagination. The range of different bracelets make great, unexpected, anytime treats or the best birthday gifts for kids who love creative DIY crafts.\n\nSurprise a monster-loving child with this spookily fun LEGO® DOTS Monster Bracelets (41923) craft kit and start them off on an open-ended journey of design.\nFrightfully cool jewelry on display! Kids can push their design skills as they decorate the bracelets, which feature 2 adjustable bands and 32 colorful tiles. Play starts right out of the bag!\nThis kit is great on its own for quick, imaginative creativity. Kids can also use tiles from the LEGO® DOTS Extra DOTS bags to expand their designs with cool new ideas.\nAny DIY or arts-and-crafts fan will love this customizable kit. The durable bracelets and colorful decorated tiles will make a fun holiday gift or a little extra treat for kids aged 6 and up.\nSmall, fun and totally portable. With the bracelets each measuring over 7 in. (20 cm) long, there's lots of space for kids to be creative.\nOpen the bag and decorating the bracelet starts right away. Easy-to-follow inspiration on the packaging makes creating a snap – whatwill young designers come up with first?\nThese cool LEGO® DOTS kits represent free creativity. The ready-to-decorate bracelets offer bite-sized opportunities to help build children’s imagination and confidence through fun.\nLEGO® DOTS sets offer open-ended play and encourage self-expression through creating and customizing jewelry or room decor items, bringing the joy of LEGO play to a new group of kids.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/starlight-bracelets-41934","description":"Fans of magic, mystery and stars will love designing this LEGO® DOTS Starlight Bracelets (41934) kit! This creative toy set features 2 adjustable, slender bands in teal and purple that fit around bigger or smaller wrists and 32 colorful tiles, including special, round, opalescent star tiles and star-map-decorated tiles. The bracelets are intended to be an easy, intuitive creation, so kids can decorate them to suit their outfit or mood and make them uniquely theirs.\n\nAny way you play is right!\nThe joy of this custom jewelry-making kit is the chance for kids to explore self-expression and decorate it however they like. Anything goes with these fun bracelets, as well as all the other LEGO DOTS toy sets – the magic lies in a child’s imagination. The different bracelets in the range make great unexpected treats any time or the best birthday gifts.\n\nSurprise a creatively inclined child with an out-of-this-world LEGO® DOTS Starlight Bracelets (41934) toy set and start them off on a fun journey of endless DIY design possibilities.\nUnique jewelry on display! Kids can stretch their self-expression skills as they decorate the bracelets, which feature 2 slim, adjustable bands and 32 tiles. Play starts right out of the bag!\nThis kit is great on its own as a quick, creative playset. Kids can also use tiles from the LEGO® DOTS Extra DOTS – Series 3 (41921) bag to build on their designs with cool new ideas.\nAny arts-and-crafts fan will love this creative set. The sturdy bracelets, colorful tiles and special decorated tiles will make a fun gift or a little extra treat for kids aged 6 and up.\nSmall and totally portable. With the bracelets each measuring over 7 in. (20 cm) long, this kit is perfect for budding designers to practice their creations and then wear their favorite version.\nOpen the toy bag and the fun begins with decorating the slim bracelets. Easy-to-follow inspiration makes designing a snap, or kids can create their own patterns again and again.\nGive kids a top creative gift with LEGO® DOTS kits. These clever, hand-made bracelets encourage open-ended design possibilities to help build children's creativity and confidence through fun.\nLEGO® DOTS sets offer unlimited creativity and encourage kids' self-expression through creating and customizing jewelry or room decor items, bringing the joy of LEGOplay to a new group of kids.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/cool-cactus-bracelet-41922","description":"Nature-loving kids will love creating and wearing this sharp LEGO® DOTS Cool Cactus Bracelet (41922) making kit! This creative toy set features an adjustable, flexible band in light green that fits around bigger or smaller wrists and 32 colorful tiles, including special cactus-decorated tiles. It's intended to be an easy and intuitive process, so kids can design their own bracelet and make it uniquely theirs to suit their outfit or mood.\n\nNo wrong way to play\nThe joy of this custom jewelry making kit is the chance for kids to explore self-expression and decorate it however they like. Anything goes with this fun bracelet, as well as all the other LEGO DOTS toy sets – the magic lies in a child’s imagination. The range of different bracelets make great unexpected treats at any time.\n\nSurprise a creative child with this playful LEGO® DOTS Cool Cactus Bracelet (41922) toy set and start them off on a fun journey of endless DIY design possibilities.\nUnique jewelry on display! Kids can stretch their self-expression skills as they decorate the bracelet, which features an adjustable band and 32 colorful tiles. Play starts right out of the bag!\nThis kit is great on its own as a quick, imaginative creation. Kids can also use tiles from the LEGO® DOTS Extra DOTS bags to expand their designs with cool new ideas.\nAny arts-and-crafts fan will love this creative set. The durable bracelet, colorful tiles and special decorated tiles will make a fun gift or a little-extra-something treat for kids aged 6 and up.\nSmall and totally portable. With the bracelet measuring over 7 in. (20 cm) long, this kit is perfect for budding designers to practice their creations and then wear their favorite version.\nOpen the toy bag and the fun begins with decorating the bracelet. Easy-to-follow inspiration on the packaging makes designing a snap, or kids can create their own patterns again and again.\nGive kids creative gifts to make with LEGO® DOTS kits. This clever homemade bracelet offers open-ended design possibilities to help build children's creativity and confidence through fun.\nLEGO® DOTS sets offer freedom in creativity and encourage kids' self-expression through creating and customizing jewelry or room decor items, bringing the joy of LEGO play to a new group of kids.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/music-bracelet-41933","description":"Music-loving kids will adore creating and wearing this LEGO® DOTS Music Bracelet making kit (41933)! This creative toy set features a good-quality, adjustable, flexible band in black that fits around bigger or smaller wrists and holds up to endless wear and decoration. The kit also includes 32 colorful tiles, including music note-decorated tiles with a metallic effect, translucent tiles and glitter tiles. It's intended to be an easy, intuitive creation, so kids can design their own bracelet andmake it uniquely theirs, to suit their outfit or mood.\n\nNo wrong way to play\nThe joy of this custom jewelry making kit is the chance for kids to explore self-expression and decorate the bracelet however they like. Anything goes with this fun bracelet, as well as all the other LEGO DOTS toy sets – the magic lies in a child's imagination. The different bracelets in this range make great unexpected treats any time, or a nice little extra gift ‘just because'.\n\nSurprise a creatively inclined child with this playful LEGO® DOTS Music Bracelet (41933) toy set and start them off on a fun journey of endless DIY design possibilities.\nUnique jewelry on display! Kids can stretch their self-expression skills as they decorate the bracelet, featuring an adjustable band and 32 colorful tiles. Play starts right out of the bag!\nThis kit is great on its own as a quick, imaginative creation. Kids can also use tiles from the LEGO® DOTS Extra DOTS – Series 3 and 4 (41921 and 41931) bag to expand designs with cool new ideas.\nAny arts-and-crafts fan will love this creative set. The durable bracelet, colorful tiles and special decorated tiles will make a fun gift or a little-extra-something treat for kids aged 6 and up.\nSmall and totally portable. With the bracelet measuring over 7 in. (20 cm) long, this kit is perfect for budding designers to practice their creations and then wear their favorite version.\nOpen the toy bag and the fun begins withdecorating the bracelet. Easy-to-follow inspiration on the packaging makes designing a snap, or kids can create their own patterns again and again.\nGive kids creative gifts to make with LEGO® DOTS kits. This clever, hand-made bracelet promotes limitless design options to help build children's creativity and confidence with fun.\nLEGO® DOTS sets offer open-ended creativity and encourage kids' self-expression through creating and customizing jewelry or room decor items, bringing the joy of LEGO play to a new group of kids.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it’s been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/extra-dots-series-3-41921","description":"Kids and fans of arts and crafts will love this Super Secrets-themed Extra DOTS – Series 3 (41921) bag! Made to work with all the different LEGO® DOTS sets, these extra tiles offer kids the chance to expand their designs in new ways and change them to suit their outfit, mood or room decor.\n\nExtra creativity in a bag\nThis bag features 107 colorful tiles, including star and diamond 3D-effect tiles, plus 10 special super-secret tiles from a range of 16 possible designs. This lets kids decorate their own bracelet or room decor items however they like to build their creative skills.\n\nMake arts and crafts even more fun\nThe joy of this little bag is the chance it offers kids to be even more imaginative in decorating their LEGO DOTS sets, to mix and match with their friends and show off their own unique designs. The bags make a fun reward or everyday gift for a creative youngster, or a surprise extra purchase with any other DOTS sets.\n\nBoost any youngster’s love of DIY jewelry and creativity with this cool LEGO® DOTS Extra DOTS – Series 3 (41921) bag and inspire open self-expression. What’s in the bag is part of the surprise!\nStretch a child’s creative and design skills with 81 collectible tiles in 4 colors, 16 star and diamond 3D-effect tiles and 10 mystery decorated tiles.\nThe tiles are great for decorating everything from bracelets to room decor items. Kids can use the tiles with the other DOTS sets, or any other LEGO® set, to customize them the way they like.\nAny DIY arts-and-crafts fan will love tearing into this Extra DOTS – Series 3 (41921) bag. The new colors and decorated tiles will be a fun anytime or extra gift for boys and girls aged 6 and up.\nGive kids appealing crafts to create and use with LEGO® DOTS sets. This bag of colored and decorated tiles will help build children's creative confidence while they have fun.\nLEGO® DOTS sets offer open-ended creativity and encourage kids' self-expression through creating and customizing jewelry or room decor items, bringing the joy of LEGO play to a new group of kids.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/extra-dots-series-4-41931","description":"Kids and arts-and-crafts fans will love this animal-themed, collectible LEGO® DOTS Extra DOTS – Series 4 (41931) bag! Made to work with all the different LEGO DOTS toy sets, these easy extra tiles and bricks offer kids the chance to expand their designs and personalize them to suit their outfit, mood or room decor.\n\nAwesome creativity in a bag\nThis great bag features 105 colorful pieces, including cute animal eye and mouth tiles, ear and paw bricks, colored tiles and 10 mystery tiles from a range of 16 possible decorations – what’s in the bag is a surprise! Kids can build on their creative skills as they customize their bag tags, bracelet kits or room decor items.\n\nMake arts and crafts even more fun\nThe joy of this bag is the chance for kids to be even more imaginative in decorating their LEGO DOTS toys, to mix and match with their friends and show off their own unique designs. The bags make a fun reward or everyday gift for a creative youngster, or a top extra purchase with anyother DOTS sets.\n\nBoost any kid’s joy in making unique DIY jewelry or room decor toys with this LEGO® DOTS Extra DOTS – Series 4 (41931) bag and inspire open self-expression. What’s in the bag is part of the surprise!\nStretch a child’s creative and design skills with this bag, featuring 105 collectible pieces including cute animal-themed tiles, cool colored tiles and 10 mystery decorated tiles.\nThe pieces are great for decorating everything from bracelets to room decor items. Kids can also use these tiles with other DOTS sets, or any other LEGO® set to customize them how they like!\nAny DIY arts-and-crafts fan will love tearing into this Extra DOTS – Series 4 (41931) bag. The new colors and decorated tiles will be a fun anytime or bonus gift for boys and girls aged 6 and up.\nGive kids appealing crafts to create and use with LEGO® DOTS toy sets. This bag of colored and decorated tiles and bricks will help build children's creative confidence while they have fun.\nLEGO® DOTS extra bags offer open-ended creativity and boost kids’ self-expression through designing and customizing jewelry or room decor items, bringing the joy of LEGO play to a new group of kids.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect and pull apart reliably every time – it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/bracelet-mega-pack-41913","description":"Kids who like sharing creative art projects with their friends will love this custom LEGO® DOTS (41913) Bracelet Mega Pack friendship toy! Made to be an easy, intuitive craft project, this DIY bracelet set lets kids design their own jewelry with their friends and redesign them any way they like.\n\nCustomizable friendship bracelets\nThis bracelet-making mega pack kit features 5 adjustable, flexible bands in different colors that fit bigger and smaller wrists. The set has 295 assorted tiles, including special decorated tiles and the possibility of finding a super-rare, 5-hearts decorated tile. The set comes in a tray with dividers to sort and store the tiles.\n\nDesignable, shareable fun for kids who love being creative\nThe joy of this art set lies in the opportunity for kids to share it with friends and then decorate the bracelets however they like. They can mix and match with their friends' designs and make them uniquely theirs. This set make a great gift for Christmas, birthdays orany time.\nImmerse your child in the fun of making custom friendship bracelets with this LEGO® DOTS Bracelet Mega Pack (41913) toy, featuring 5 adjustable bands and 295 colorful tiles. Play starts right out of the box!\nLoads of creative DIY bracelet ideas! Kids can stretch their design and self-expression skills as they decorate and share the bracelets, following the included pattern ideas or coming up with their own, unique look.\nColorful tiles in this set and others are great for creative sharedfun with friends. Kids can also use tiles from the LEGO® DOTS Extra DOTS - Series 1 pack (41908) to spice up their cute friendship bracelets.\nAny fan of DIY or arts and crafts will love this creative kit. The flexible bracelets and colorful decorated tiles will make a great Christmas, birthday or anytime gift for boys and girls aged 6 and up.\nBracelets each measure over 7” (20cm) long, so this exciting kit lets budding designers make their creations and then sort and safely store the tiles in the portable tray with divider inserts.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ creative building skills and gives them the joy of creating something new all on their own.\nOpen the pack and the fun begins with decorating the bracelets. Easy-to-follow inspiration helps make design a snap, so kids can take pride in making unique jewelry on their own, while enjoying loads of creative fun.\nGive kids cool crafts to create with LEGO® DOTS sets. This clever bracelet-making kit offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® building bricks and tiles meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and tiles are dropped, heated, crushed, twisted and analyzed to make sure every kid's building kit meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/creative-picture-frames-41914","description":"Treat kids to a cool toy with this DIY LEGO® DOTS Creative Picture Frames set (41914)! Designed to be easily assembled and customizable, this DIY photo frame set offers kids the chance to create their own room decor and change it to fit their room colors or mood. Cleanup and organization are a breeze thanks to the enclosed storage and sorting tray.\n\nDIY picture frame ideas\nThis set features 3 picture frames, plus colorful tiles for decorating the frames. Kids can stretch their imaginations and self-expressive play skills while they make the photo frames uniquely theirs. The frames can be used individually or connected in different ways with the included ‘z’ bricks.\n\nCreative arts and crafts fun\nThe joy of this cool toy is the chance for kids to be imaginative and decorate the frames how they like. They can display their designs, as well as favorite photos, in their room and change them whenever they wish. This kit makes a great gift for Christmas, birthdays or any time.\n\nAdd to your child’s love of creative DIY with this fun LEGO® DOTS (41914) Creative Picture Frames kit, featuring 3 frames and assorted tiles. Play starts with assembling the photo frame set, straight out of the tray!\nKids can flex their creative skills as they decorate the picture frames using patterns on the packaging and included inspiration page or coming up with their own ideas. The frames can be used separately or connected.\nThe colorful tiles are part of the fun crafts kit. Kids can also add the tiles from other DOTS sets or the Extra DOTS - Series 2 pack (41916) to decorate the frames to match their room decor!\nAny fan of arts and crafts will love this creative kit. The customizable frames and colorful decorated tiles make a thrilling Christmas present, birthday or anytime gift for boys and girls aged 6 and up.\nSmall and made to be used. With the largest frame measuring over 4” (11cm) high and 2” (7cm) wide, this clever photo frame-making kit is perfect for new crafters to practice their designs and then display their favorite version.\nPowered by a child’s imagination for unfettered crafts ideas! Battery-free toys help boost kids’ independent play skills and give them the joy of creating something new all on their own.\nOpen the package and the creative fun begins. Kids can build the frames using the easy instructions, then find inspiration for decorating them. Cleanup and sorting are a breeze with the enclosed storage tray.\nGive kids cool craftsto create with LEGO® DOTS toys. This clever kit offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® building bricks and tiles meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and tiles are dropped, heated, crushed, twisted and analyzed to make sure every kid's building kit meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/desk-organizer-41907","description":"Appeal to arts and crafts lovers with this cool LEGO® DOTS (41907) Desk Organizer set! Made to be quickly and easily assembled, this DIY toy offers kids the chance to create and decorate their own desk organizer with working drawer, then redesign the pattern over and over. Cleanup and sorting are a breeze thanks to the enclosed storage tray.\n\nUseful, creative organizer set\nThis pretty set features a multicolored desk organizer with 2 sections to hold pencils, paperclips or other office supplies, an opening drawer with a white handle to hold precious items and a photo holder, plus colorful tiles to stretch kids’ imaginations and self-expressive play skills while making the desk organizer uniquely theirs.\n\nCreative play for kids who love arts and crafts\nThe joy of this toy is the chance for kids to be imaginative and decorate the desk organizer however they like, to match their mood or their room or share\n\ntheir designs with friends. It makes a great gift for Christmas, birthdays or any time.\nEncourage your child’s creativity with this pretty LEGO® DOTS (41907) desk organizer, featuring a multicolored box with 2 compartments, a photo holder and an opening drawer. Play starts with assembly, out of the tray!\nCreativity and storage on display! Kids can push their design skills as they decorate the desk organizer, following the pattern ideas on the packaging and building instructions or coming up with their own fresh look.\nThe colorful tiles are great for creating easy and edgy crafts. Kids can also swap the tiles to and from any of the other DOTS packs, such as Extra DOTS - Series 2 (41916) or the other room decor sets!\nAny fan of DIY or arts and crafts will love this awesome toy. The useful and cute organizer and colorful tiles make a thrilling Christmas, birthday or open-ended creative activity gift for boys and girls aged 6 and up.\nDecorative storage. With the desk organizer measuring over 2” (7cm) high, 5” (14cm) wide and 3” (9cm) deep, this easy DIY craft toy is perfect for young designers to practice their creations again and again.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ independent play and problem-solving skills and give them the joy of creating something new all on their own.\nOpen the box and the creativity begins with assembling the desk organizer. Clear, easy-to-follow instructions help make construction a snap. Cleanup and storage are also a breeze thanks to the enclosed storage tray.\nGive kids cool crafts to create with LEGO® DOTS sets. This clever organizer set offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® building bricks and tiles meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and tiles are dropped, heated, crushed, twisted and analyzed to make sure every kid's building kit meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/jewelry-box-41915","description":"Kids will love decorating and using this LEGO® DOTS (41915) Jewelry Box kit! Made to be an easy, intuitive creation, this DIY bedroom accessory set offers kids the chance to create their own cute jewelry holder and then change it to suit their mood or room decor. Cleanup and organization are also a breeze thanks to the enclosed storage and sorting tray.\n\nPersonalized DIY jewelry box\nThe jewelry box toy features movable separators to hold jewelry or any of the LEGO DOTS wearables. It also hasa lock to keep secrets safe and tiles for decoration so kids can use their best creative and self-expression skills to make the toy uniquely theirs.\n\nPut the ‘fun’ in functional arts and crafts\nThe joy of this set lies in letting kids be imaginative – they can decorate the jewelry box however they like, then put it to use in their room. They can show off their best designs again and again, because anything goes with LEGO DOTS sets. These toy sets make great gifts for Christmas, birthdays or any time.\n\nHelp your child explore their love of creative DIY with this cool LEGO® DOTS Jewelry Box (41915) set. All surfaces can be decorated, letting kids have fun designing and redesigning the jewelry holder over and over.\nKids can push their self-expression skills in new directions as they decorate the jewelry box, following the pattern ideas included in the LEGO® DOTS (41915) packaging or coming up with their own, fresh looks.\nPlay starts with assembling the cute jewelry box. Kids can mix thetiles from the other DOTS sets, including the Extra DOTS - Series 1 pack (41908), to make the box fit their room decor any way they like!\nAny fan of DIY or arts and crafts will love this great art set for kids. The jewelry box and colorful tiles makes a thrilling top Christmas, birthday or anytime gift for kids aged 6 and up.\nThe jewelry box is over 1” (3cm) high, 4” (12cm) wide and 5” (14cm) deep, including tile decoration – the perfect size for a child's room. This DIY creative set is perfect for young designers to hold their jewelry.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ independent play and problem-solving skills and give them the joy of creating something new all on their own.\nA DIY kit for creative play. Easy-to-follow instructions make assembling the jewelry holder box a treat, and an idea sheet offers decorating inspiration. Cleanup and sorting are a breeze with the enclosed storage tray.\nGive kids cool crafts to create with LEGO® DOTS sets. This clever jewelry box set offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® building bricks and tiles meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and tiles are dropped, heated, crushed, twisted and analyzed to make sure every kid's building kit meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/pineapple-pencil-holder-41906","description":"Entice your arts and crafts lovers with this sweet LEGO® DOTS (41906) Pineapple Pencil Holder set! Made to be quick and easily buildable, this DIY set of boxes offers kids the chance to construct their own pencil holder and stationery box and then change them up to suit their mood or room decor. Cleanup and sorting are also a breeze with the enclosed storage tray. Colorful and useful box set This neat set features a tall yellow pencil holder with lid and spinning green leaves on top and a smaller pink and green watermelon wedge stationery box with lid, plus colorful tiles to stretch their imagination and self-expressive play skills while making the desk decor boxes fun and unique. Creative play for kids who love arts and crafts The joy of this set is the chance for kids to be imaginative and decorate the pencil holder and stationery box however they like, to match their mood or their room or share their designs with friends. They make great gifts for Christmas, birthdays or any time.\nEncourage your child’s creativity with these adorable LEGO® DOTS (41906) desk decor boxes, featuring a tall Pineapple Pencil Holder and a small watermelon wedge. Play starts with assembly, straight out of the box!\nCreativity and storage on display! Kids can stretch their design and self-expression skills as they decorate the fun boxes, following the pattern suggestions in the packaging or coming up with their own, fresh look.\nThe colorful tiles are great to create with for new, imaginative fun. Kids can also swap the tiles to and from any of the other DOTS items, such as the Extra DOTS - series 1 pack (41908) or the other room decor sets!\nAny fan of DIY or arts and crafts will love this awesome set. The clever and useful boxes and colorful decorated tiles will thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 6+.\nDecorative and useful. With the pineapple pencil holder box measuring over 5” (15cm) high and 2” (6cm) wide, this excitingDIY creative set is perfect for young designers to practice their creations over and over again.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ independent play and problem-solving skills, plus it gives them the joy of creating something new all on their own.\nOpen the box and the creating begins with assembling the pencil holder and stationery box. Easy-to-follow instructions help make assembly a snap. Cleanup and storage are also a breeze with the enclosed storage tray.\nGive kids cool crafts to create with LEGO® DOTS sets. This clever box set offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® bricks and tiles meet the highest industry standards and our own quality criteria, so they are consistent, compatible and connect and come apart easily every time – it's been that way since 1958.\nWe drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and tiles tomake sure every kid’s building toy meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/funky-animals-bracelet-41901","description":"Self-expression is a snap with this cool LEGO® DOTS (41901) Funky Animals Bracelet kit! Made to be quick, easy, intuitive projects, these DIY sets offer kids the chance to create their own jewelry and change it to suit their outfit or mood or whatever. Collectible jewelry kit This cool bracelet kit features an adjustable band in pink that fits around bigger or smaller wrists and 32 colorful tiles, including special tiles decorated with bunnies, cats and paw prints, to design their own creative bracelet toy, stretch their imagination and self-expressive play skills and make it fun and unique. Creative play for kids who love arts and crafts The joy of this set is the chance for kids to be imaginative and decorate the bracelet however they like. To match their mood, or as a great piece for self-expression to show off their fun designs, because anything goes with these bracelets. They make great gifts for Christmas, birthdays or any time.\nSupport your arts and crafts fan’s love of creative DIY with this cute LEGO® DOTS™ Funky Animals Bracelet (41901) set, with an adjustable band and 32 colorful tiles. Play starts with decorating, straight out of the bag!\nCustomizable jewelry on display! Kids can stretch their design and self-expression skills as they decorate the fun bracelet, following the pattern suggestions on the packaging or coming up with their own, fresh look.\nThe colorful tiles are great to create with in this set or others as part of imaginative fun. Kids can also use tiles from the LEGO® DOTS™ 41908 Extra DOTS - series 1 pack to dress up their bracelets with cool decorations.\nAny fan of DIY or arts and crafts will love this awesome set. The flexible bracelet and colorful decorated tiles will thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 6 and up.\nSmall and totally portable. With the bracelet measuring over 7” (20cm) long, this exciting DIY creative set is perfect for young designers to practice their creations and then wear their favorite version.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ independent play skills, plus it gives them the joy of creating something new all on their own.\nOpen the bag and the fun begins with decorating the bracelet. Easy-to-follow inspiration helps make design a snap, leading to pride of creating unique jewelry on their own, and loads of creative fun.\nGive kids cool crafts to create with LEGO® DOTS™ sets. This clever jewelry making playset offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® DOTS™ tiles and bracelets meet the highest industry standards and our own quality criteria. They are designed to be consistent, compatible, connect securely and come apart easily every time.\nWe drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® DOTS™ tiles and bracelets to make sure every kid's building toy meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/go-team-bracelet-41911","description":"Kids who like arts and crafts and creating their own jewelry will love this cool LEGO® DOTS (41911) Go Team! Bracelet kit. Made to be an easy, intuitive toy creation, this DIY set gives kids a guide for how to make their own jewelry and change it to suit their outfit, mood or favorite sport.\n\nCreative bracelet-making kit\nThis cool bracelet kit features an adjustable blue band that fits around bigger and smaller wrists and 32 colorful tiles. The set includes special tiles decorated with sports-themed icons for kids to design their own bracelet toy, stretch their imaginations and self-expressive play skills and create something fun and unique.\n\nDesign fun for kids who love being creative\nThis art set offers the chance for kids to be imaginative as they decorate the bracelet however they like – to match their mood, or as a great piece for self-expression to show off their fun designs. Anything goes with these bracelets! They make great gifts for Christmas, birthdays or any time.\n\nEncourage your child’s love of creative DIY with this spirited LEGO® DOTS Go Team! Bracelet (41911) set, featuring an adjustable band and 32 colorful tiles. Play starts with decorating, right out of the bag!\nPersonalized jewelry on display! Kids can stretch their design and self-expression skills as they decorate the fun bracelet, following the pattern ideas on the packaging or coming up with their own, unique look.\nThe colorful tiles in this set can be used on their own or with others as part of imaginative fun. Kids can also use tiles from LEGO® DOTS Extra DOTS - Series 2 (41916) to spice up their bracelets with cool new styles.\nAny fan of DIY or arts and crafts will love this creative set. The flexible bracelet and colorful decorated tiles will make a thrilling Christmas, birthday or anytime gift for boys and girls aged 6 and up.\nWith the bracelet measuring over 7” (20cm) long, this exciting DIY creative kit is small and totally portable. Budding designers can practice making different creations and then wear their favorite version.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ creative building skills, giving them the joy of creating something new all on their own.\nOpen the bag and the fun begins with decorating the bracelet. Easy-to-follow inspiration on the package helps make design a snap, so kids can take pride in making unique jewelry on their own, while enjoying creative fun.\nGive kids cool crafts to create with LEGO® DOTS sets. This clever bracelet-making kit offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® building bricks and tiles meet the highest industry standards, ensuring they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and tiles are dropped, heated, crushed, twisted and analyzed to make sure every kid's building kit meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/love-birds-bracelet-41912","description":"Kids who like wearable arts and crafts will adore this cool LEGO® DOTS (41912) Love Birds Bracelet kit! Made to be a quick and easy, intuitive creation, this DIY set offers kids the chance to create their own jewelry and change it to suit their outfit or mood or whatever. Fun jewelry kit to create again and again This cool bracelet kit features an adjustable band in teal that fits around bigger or smaller wrists and 32 colorful tiles, including special tiles decorated with birds, feathers and hearts. Kids can design their own creative bracelet toy, stretch their imagination and use self-expressive play skills to make it fun and unique. Creative play for kids who love arts and crafts The joy of this set is the chance for kids to be imaginative and decorate the bracelet however they like, to match their mood, mix and match with their friends and show off their fun designs, because anything goes with these bracelets. They make great gifts for Christmas, birthdays or any time.\nEncourage your child’s love of creative DIY with this adorable Love Birds Bracelet (41912) set, featuring an adjustable band and 32 colorful tiles. Play starts with decorating, straight out of the bag!\nCreativity jewelry on display! Kids can stretch their design and self-expression skills as they decorate the fun bracelet, following the pattern suggestions on the packaging or coming up with their own, fresh looks.\nThe colorful tiles are great to create with in this set or others as partof new, imaginative fun. Kids can also use tiles from the LEGO® DOTS (41908) Extra DOTS - series 1 pack to spice up their bracelets with cool icons.\nAny fan of DIY or arts and crafts will love this awesome set. The flexible bracelet and colorful decorated tiles will thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 6 and up.\nSmall and totally portable. With the bracelet measuring over 7” (20cm) long, this exciting DIY creative set is perfect for youngdesigners to practice their creations and then wear their favorite version.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ independent play skills, plus it gives them the joy of creating something new all on their own.\nOpen the bag and the fun begins with decorating the bracelet. Easy-to-follow instructions help make design a snap, leading to pride of creating unique jewelry on their own, and loads of creative fun.\nGive kids cool crafts to create with LEGO® DOTS sets. This clever jewelry making set offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® DOTS tiles and bracelets meet the highest industry standards and our own quality criteria. They are designed to be consistent, compatible, connect securely and come apart easily every time.\nWe drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® tiles and bracelets to make sure every kid's building toy meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/magic-forest-bracelet-41917","description":"Kids who like being creative and making their own jewelry will love this cool LEGO® DOTS (41917) Magic Forest Bracelet kit! Made to be an easy, intuitive build, this DIY craft set gives kids a guide for designing their own bracelet to suit their outfit or mood.\n\nCustom-made bracelet kit\nThis popular toy features an adjustable, flexible band in purple that fits around bigger or smaller wrists and 32 colorful tiles, including special opalescent diamonds, gold and glow-in-the-dark tiles. Kids can design their own creative DIY bracelet toy, stretch their imaginative play skills and make it fun and unique.\n\nDesign fun for kids who love arts and crafts\nThe joy of this custom-made bracelet kit is the chance for kids to explore self-expression and decorate the bracelet however they like. Anything goes with these bracelets, as well as all the other LEGO DOTS sets – the magic lies in a child's imagination. The sets make great gifts for Christmas, birthdays or any time.\n\nEncourage your child’s love of creative DIY with this mysterious LEGO® DOTS Magic Forest Bracelet (41917) set, featuring an adjustable band and 32 colorful tiles. Play starts with decorating, right out of the bag!\nUnique jewelry on display! Kids can stretch their self-expression skills as they decorate the cool LEGO® DOTS Magic Forest Bracelet (41917), following the pattern ideas on the packaging or coming up with their own.\nThis set is great on its own or combined with others as part of imaginative play. Kids can also use tiles from the LEGO® DOTS Extra DOTS - Series 1 pack (41908) to expand their DIY bracelet designs with cool new ideas.\nAny fan of DIY or arts and crafts will love this creative set. The flexible bracelet and colorful decorated tiles will make a thrilling Christmas, birthday or anytime gift for kids aged 6 and up.\nSmall and totally portable. With the bracelet measuring over 7” (20cm) long, this exciting DIY creative kit is perfect for budding designers to practice their creations and then wear their favorite version.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ creative building skills and give them the joy of creating something new all on their own.\nOpen the bag and the fun begins with decorating the bracelet. Easy-to-follow inspiration helps make design a snap, giving kids the joy of making unique jewelry on their own and having loads of creative fun.\nGive kids creative gifts tomake with LEGO® DOTS kits. This clever homemade bracelet offers open-ended design inspiration to help build children’s creativity and confidence with endless fun possibilities.\nLEGO® building bricks and tiles meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and tiles are dropped, heated, crushed, twisted and analyzed to make sure every kids' building kit meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/power-bracelet-41919","description":"Kids who like arts and crafts and making their own jewelry will love this cool LEGO® DOTS (41919) Power Bracelet kit! Made to be an easy, intuitive creation, this DIY set gives kids a guide for designing their own bracelet and changing it to suit their outfit or mood again and again.\n\nEasy DIY creativity\nThis cool bracelet kit features an adjustable band in dark pink that fits around bigger or smaller wrists and 32 tiles, including special tiles decorated with messages of empowerment, so kids can design their own custom-made bracelet toy. The creative play helps stretch their imagination skills while they make a fun and unique piece of jewelry.\n\nCraft sets for kids who love imaginative play\nThe joy of these kits is the chance for kids to build their crafting skills and decorate the bracelets however they like. A great piece for self-expression, letting kids show off different fun designs – anything goes with these bracelets! They make great Christmas, birthday or any time gifts.\n\nSupport your kid’s love of creative DIY with this empowering LEGO® DOTS Power Bracelet (41919) kit, featuring an adjustable band and 32 bold and colorful tiles. Play starts with decorating, straight out of the bag!\nCreative jewelry on display! Kids can push their design and self-expression skills as they decorate the easy DIY bracelet, following the pattern ideas on the packaging or coming up with their own, unique look.\nThe tiles in this kit can be combined with other sets as part of arts and crafts fun. Kids can also use tiles from the LEGO® DOTS Extra DOTS - Series 2 (41916) pack to spice up their bracelets with cute new styles.\nAny fan of DIY or arts and crafts will love this creative set. The flexible bracelet toy and colorful decorated tiles are a thrilling Christmas, birthday or anytime gift for boys and girls aged 6 and up.\nSmall and totally portable. With the bracelet measuring over 7” (20cm) long, this exciting DIY creative kit is perfect for young creatives topractice their designs and then wear their favorite version.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ creative building skills, plus it gives them the joy of making something new all on their own.\nOpen the bag and the fun begins with decorating the bracelet. Easy-to-follow inspiration helps make design a snap, so kids can take pride in making unique jewelry on their own, while having loads of creative fun.\nGive kids fun DIY bracelet ideas to create with LEGO® DOTS sets. This clever custom-made bracelet kit offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® building bricks and tiles meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and tiles are dropped, heated, crushed, twisted and analyzed to make sure every kids' building kit meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/rainbow-bracelet-41900","description":"Kids who like wearable arts and crafts will love this cool LEGO® DOTS (41900) Rainbow Bracelet kit! Made to be quick, easy and intuitive, these DIY sets offer kids the chance to create their own jewelry and change it to suit their outfit or mood or whatever. Creative jewelry kit This cool bracelet kit features an adjustable band in sky blue that fits around bigger or smaller wrists and 32 colorful tiles, including special tiles decorated with rainbows and clouds, to design their own creative bracelet toy, stretch their imagination and self-expressive play skills and make it fun and unique. DIY play for kids who love arts and crafts The joy of this set is the chance for kids to be imaginative and decorate the bracelet however they like. To match their mood, or as a great piece for self-expression to show off their fun designs, because anything goes with these bracelets. They make great gifts for Christmas, birthdays or any time.\nEncourage your child’s love of creative DIY with this adorable LEGO® DOTS™ Rainbow Bracelet (41900) set, featuring an adjustable band and 32 colorful tiles. Play starts with decorating, straight out of the bag!\nCreative jewelry on display! Kids can stretch their design and self-expression skills as they decorate the fun bracelet, following the pattern suggestions on the packaging or coming up with their own, new look.\nThe colorful tiles are great to create with in this set or others as part of DIY fun. Kids can also use tiles from the LEGO® DOTS™ 41908 Extra DOTS - series 1 pack to spice up their bracelets with cool new decorations.\nAny fan of DIY or arts and crafts will love this awesome set. The flexible bracelet and colorful decorated tiles will thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 6 and up.\nSmall and totally portable. With the bracelet measuring over 7” (20cm) long, this exciting DIY creative set is perfect for budding designers to practice their creations and then wear their favorite version.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ independent play skills, plus it gives them the joy of creating something new all on their own.\nOpen the bag and the creating begins with decorating the bracelet. Easy-to-follow instructions help make assembly a breeze, leading to the pride of constructing the jewelry on their own, and loads of creative fun.\nGive kids cool crafts to create with LEGO® DOTS™ sets. This clever jewelry making playset offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® DOTS™ tiles and bracelets meet the highest industry standards and our own quality criteria. They are designed to be consistent, compatible, connect securely and come apart easily every time.\nWe drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® DOTS™ tiles and bracelets to make sure every kid's building toy meet the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/extra-dots-series-2-41916","description":"Kids and fans of arts and crafts items will love this cool LEGO® DOTS (41916) Extra DOTS - Series 2 pack! Designed to work with all the different LEGO DOTS sets, these easy extra tiles offer kids the chance to expand their designs in fun new ways and change them to suit their outfit, mood or room decor.\n\nExtra creativity in a bag\nThis great little pack features 109 colorful tiles, including 20 opalescent glitter tiles and 10 special printed tiles from a range of 16 – so what's in the bag is a surprise! This lets kids decorate their own friendship bracelet kits or room decor items and build on their imagination skills.\n\nMake arts and crafts even more fun\nThe joy of this little pack is the chance for kids to be even more creative in decorating their LEGO DOTS toys, to mix and match with their friends and show off their own unique designs. The sets make great stocking stuffer gifts for Christmas, fun extra birthday presents, or a top add-on purchase with any of the other DOTS sets.\n\nBuild your child’s love of creative DIY with this bag of tiles, with 79 tiles in 4 colors, 20 opalescent glitter tiles, and 10 out of a possible 16 decorated emoticon tiles – exactly what’s in the bag is a surprise!\nImagination on display! Kids can stretch their design and self-expression skills as they decorate using these great tiles, whether following patterns from the different LEGO® DOTS toys or coming up with new ideas.\nThe colorful (41916) Extra DOTS - Series 2 tiles are great for creating new designs with the different DOTS toys or with other LEGO® sets for fun and easy arts and crafts for kids.\nAny DIY or arts and crafts fan will love adding this Extra DOTS - Series 2 pack (41916) to other sets they have. The new colors and decorated tiles will be a fun anytime or add-on gift for boys and girls aged 6 and up.\nSmall and totally portable, this cute imagination toy bag is perfect for young designers to add to their creations and then display their new designs on their bracelet or room decor items.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ imaginative play skills and give them the joy of creating something new all on their own.\nOpen the bag and the creativity begins! With lots of new colors and cute decorated tiles, this set can lead to loads of extra fun crafts as kids add the tiles to any of the other DOTS room decor or bracelet-making kits.\nGive kids cool crafts to create with LEGO® DOTSsets. This fun addition to the bracelet and room decor sets offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® building bricks and tiles meet the highest industry standards to ensure they are consistent, compatible and connect and pull apart easily every time – it's been that way since 1958.\nLEGO® bricks and tiles are dropped, heated, crushed, twisted and analyzed to make sure every kid's building kit meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/gel-pen-6-pack-5006275","description":"Creativity is at your fingertips with this LEGO® DOTS Gel Pen 6 Pack! With a variety of colors to take writing to the next level, each pen comes with 2 authentic LEGO 1x4 plates attached at the top, and the pack includes 25 colorful tiles so kids or LEGO fans can add their own creative flair to the pens. The square shape means they won't roll off a desk or table, and the gel ink and comfort grip make writing a breeze. A cool treat that makes a great addition to any home, office or classroom.\nInspire endless creativity with this LEGO® DOTS Gel Pen 6 Pack. Writing has never been smoother, while the pens’ securely attached plates offer unique decorative possibilities.\nThe slender, square-shaped pens each feature a removable cap, comfort grip and 2 authentic 1x4 LEGO® plates. The pack also includes 25 colorful DOTS tiles so kids or fans can decorate the pens.\nThese cool pens can be redesigned at any time to reflect an ever-changing style. The pens each measure over 6 in. (15 cm) long and will brighten up a desk at home, in the office or at school.\nWarning: choking hazard from small parts."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/marker-6-pack-5006274","description":"Discover the perfect coloring tools for a budding artist in this LEGO® DOTS Marker 6 Pack. With a variety of colors to take creativity up a level, each marker features 2 LEGO 2x4 plates attached at the top, while the pack includes 40 colorful tiles for adding creative designs to the plates. The rectangular shape means the pens won't roll off a desk or table, and the fine marker tip makes detailed coloring effortless. A great treat and an artistic addition to any home, office or classroom.\nInspire endless creativity with this LEGO® DOTS Marker 6 Pack. Coloring has never been easier, while the markers’ securely attached plates offer unique decorative possibilities.\nThe rectangular markers each feature a removable cap and 2 genuine LEGO® 2x4 plates. The pack also includes 40 colorful DOTS tiles so kids or fans can decorate the markers.\nThese cool markers reflect a bold style and can be redesigned at any time. Each one measures over 6 in. (15 cm) long and will look sharp on a desk at home, in the office or at school.\nWarning: choking hazard from small parts."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/secret-diary-with-lock-5006272","description":"Now secrets can be locked away in style! This fierce, hardcover, 96-page LEGO® DOTS Secret Diary with Lock features an authentic, heart-shaped LEGO plate set in the front cover and includes 30 colorful tiles so it can be personalized with fun designs. It also has a lock and 2 keys to make sure that what's inside stays inside. Combine the diary with one of the cool LEGO DOTS gel pens (sold separately) for a totally unique writing experience. Makes a perfect birthday or holiday gift.\nThis hardcover diary with 96 pages of ruled, ivory-colored paper lets the crafts lover or LEGO® fan in your life keep their secrets in a fun and stylish way.\nThe diary features a lock with 2 keys to keep it secure, plus a heart-shaped LEGO® plate and 30 colorful DOTS tiles so kids or LEGO fans can decorate it.\nThe diary measures over 8 in. (21 cm) long and 5.5 in. (14 cm) wide.\nWarning: choking hazard from small parts."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/notebook-with-elastic-band-5006273","description":"Appeal to writers and crafters alike with the LEGO® DOTS Notebook with Elastic Band. This stylish and functional, 96-page, softcover notebook has an integrated elastic band and sliding 4x4 LEGO plate charm to help keep it closed, plus 18 bold, bright tiles to customize the charm. Pair the notebook with one of the LEGO DOTS gel pens (sold separately) for a truly awesome LEGO writing experience. A perfect birthday or holiday gift for any home, office or classroom.\nThis 96-page, ruled, softcover notebook with a customizable LEGO® DOTS 4x4 plate charm lets the LEGO fan in your life keep notes wherever they go.\nThe notebook features an integrated elastic band to keep it closed, plus a 4x4 LEGO® plate charm to help secure it with flair and 18 colorful DOTS tiles so kids or fans can decorate the charm.\nThe LEGO® DOTS notebook measures over 8 in. (21 cm) long and 5 in. (13 cm) wide and will look sharp on a desk at home, in the office or at school.\nWarning: choking hazard from small parts."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/hard-pencil-case-5006277","description":"Crafting fans of all ages will love this cool, useful LEGO® DOTS Hard Pencil Case. There’s loads of room inside for all sorts of LEGO DOTS stationery items, and the sturdy case features 4 embedded LEGO plates: 2 square 4x4 plates, a square 2x2 plate and a rectangular 2x4 plate, plus 46 colorful tiles for endless decorating. Kids can also attach other LEGO bricks or minifigures for even more creative LEGO fun. Makes a great birthday or holiday present for creative kids of all ages.\nSpark creativity with this cool LEGO® DOTS Hard Pencil Case, made from durable ABS plastic that’s built to last. Makes a fun and functional addition to any desk.\nThe pencil case features 4 authentic LEGO® plates: 2 square 4x4 plates, a square 2x2 plate and a rectangular 2x4 plate, plus 46 colorful tiles for endless decorating.\nThis unique pencil case reflects a bold style. The case measures over 8 in. (21 cm) long and 2.5 in. (7 cm) wide.\nWarning: choking hazard from small parts."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/key-chain-with-mini-notebook-5006288","description":"Crafters and LEGO® fans alike will love this totally unique LEGO DOTS Key Chain with Mini Notebook. Featuring a 6x8 LEGO plate cover and 48 colorful tiles, it can be decorated and customized repeatedly, while the 1x6 LEGO brick closure keeps the removable notebook safe. This compact key chain is versatile and fun, and the metal keyring ensures it remains securely attached to keys or backpack. Makes a perfect just-because treat for crafts and LEGO fans of all ages.\nInspire creativity with this fun LEGO® DOTS Key Chain with Mini Notebook. The metal keyring attaches securely to keys or a bag and the plate cover can be decorated again and again to fit any mood.\nThe buildable notebook features a 6x8 LEGO® plate cover and 48 colorful DOTS tiles for kids or LEGO fans to design with, plus a 1x6 brick lock and a removable paper notebook insert.\nThis cool mini notebook on a sturdy key chain is perfect for showing off imaginative style. The key chain and notebook together measure over 4 in. (11 cm) long and 1.5 in. (4 cm) wide.\nWarning: choking hazard from small parts."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/round-4x4-key-chain-5006278","description":"Creativity can go wherever kids go with the LEGO® DOTS Round 4x4 Key Chain. Featuring a 4x4 LEGO plate, 12 colorful tiles and a satin ribbon for an extra pop of color, it can be decorated repeatedly to fit any mood or outfit. This super-cute key chain is a must-have for crafters and LEGO enthusiasts alike, and the metal keyring ensures it remains securely attached to keys or backpacks. Makes a perfect just-because treat or a great birthday or holiday present for creative kids of all ages.\nInspire imagination with this fun LEGO® DOTS Round 4x4 Key Chain. The metal ring attaches securely to keys or a bag and the plate can be decorated again and again.\nThe key chain features a round 4x4 LEGO® plate attached to a sturdy metal ring, a satin ribbon and 12 colorful DOTS tiles for kids or LEGO fans to design with.\nReflect a funky style with this super-cute key chain. The key chain and round plate together measure over 4 in. (10 cm) long and 1.5 in. (4 cm) wide.\nWarning: choking hazard from small parts."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/single-gel-pen-with-dots-lavender-5006279","description":"Work is never boring with the LEGO® DOTS Single Gel Pen with DOTS – Lavender. 2 lavender-colored LEGO 1x4 plates are attached at the top of the pen and 8 colorful tiles are included so kids or LEGO fans can create their own designs. The plates also work with other LEGO bricks or minifigures. The square shape means the pen won't roll off a desk or table, and the gel ink and lavender comfort grip make writing a breeze. A great little gift that is a fun addition to any home, office or classroom.\nInspire a child’s creativity with this cool LEGO® DOTS Single Gel Pen with DOTS – Lavender. Writing has never been smoother, and kids can show off their own designs on the securely attached plates.\nThe slender, square-shaped pen features a removable cap, 2 lavender-colored 1x4 LEGO® plates and 8 colorful DOTS tiles for kids or LEGO fans to use as decoration, plus a lavender-colored comfort grip.\nThis cool pen can be redesigned any time to show off imaginative style. The pen measures over 6 in. (15 cm) long, and will look sharp on a desk at home, in the office or at school.\nWarning: choking hazard from small parts."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/single-gel-pen-with-dots-medium-azure-5006287","description":"Work is never dull with the LEGO® DOTS Single Gel Pen – Medium Azure. 2 azure-colored LEGO 1x4 plates are attached at the top of the pen and 8 colorful tiles are included so kids and LEGO fans can add their own creative flair. The plates also work with other LEGO bricks or minifigures. The square shape means the pen won't roll off a desk or table, and the gel ink and azure-colored comfort grip make writing a breeze. A cool treat that makes a great addition to any home, office or classroom.\nInspire creativity with this LEGO® DOTS Single Gel Pen – Medium Azure. Writing has never been smoother, and kids or LEGO fans can show off their unique designs on the securely attached plates.\nThe slender, square-shaped pen has a removable cap, 2 authentic, azure-colored 1x4 LEGO® plates and 8 colorful DOTS tiles for kids or fans to use as decoration, plus an azure-colored comfort grip.\nThis cool pen reflects personal style and can be redesigned at any time. The pen measures over 6 in. (15 cm) long, and will look sharp on a desk at home, in the office or at school.\nWarning: choking hazard from small parts."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/animal-picture-holders-41904","description":"Arts and crafts fans will love this cool LEGO® DOTS (41904) Animal Picture Holders set! Designed to be easily assembled and customizable, this unique DIY toy set offers kids the chance to create their own room decor and change it to fit their room colors or mood. Cleanup and sorting are also a breeze with the enclosed storage and sorting tray. Do-it-yourself room decor kit This set of 3 small cubes features lids and picture holders, plus colorful tiles for designing adorable cat, dog, llamaor any other animal faces a child might like. Kids can stretch their imagination and self-expressive play skills while they make the picture holder boxes fun and unique. Creative play for kids who love arts and crafts The fun of this set is the chance for kids to be imaginative and decorate the cubes however they like. They can then display those designs, as well as favorite photos, while keeping little treasures or secrets safe. This set will make a great gift for Christmas, birthdays or any time.\nAdd to your child’s love of creative DIY with this sweet LEGO® DOTS (41904) cube set, featuring 3 animal cubes with lids and photo holders. Play starts with assembling the Animal Picture Holders, straight out of the box!\nCreativity on show! Kids can flex their self-expression skills as they decorate the cubes, following suggestions in the packaging to design the cat, dog, llama or other animal faces, or coming up with their own ideas.\nThe colorful tiles are great to create with. Kids can add the tiles from other DOTS sets or the Extra DOTS - series 1 pack (41908) to make the cubes into their favorite animal or decorate them to match their room decor!\nAny fan of DIY or arts and crafts will love this creative set. The customizable cubes and colorful decorated tiles will thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 6 and up.\nSmall and made to be used. With each box measuring over 1” (4cm) cubed, this clever DIY creative set is perfect for new crafters to practice their creations and then display their favorite version.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ independent play skills, plus it gives them the joy of creating something new all on their own.\nOpen the package and creating begins. Kids can build the cubes with easy instructions, then find inspiration for decorating them and designing animal faces. Cleanup and sorting are a breeze with the enclosed storage tray.\nGive kids cool crafts to create with LEGO® DOTS sets. This clever kit offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® bricks and tiles meet the highest industry standards and our own quality criteria, so they are consistent, compatible, connect securely and come apart easily every time – it's been that way since 1958.\nWe drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and tiles to make sure every kid's toy meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/rainbow-jewellery-stand-41905","description":"Kids will love decorating and displaying this LEGO® DOTS™ (41905) Rainbow Jewelry Stand kit! Made to be an easy, intuitive creation, this DIY bedroom accessory set offers kids the chance to create their own jewelry stand and then change it to suit their mood or room decor. Cleanup and sorting are also a breeze with the enclosed storage and sorting tray. Creative and functional jewelry stand The jewelry stand toy features 5 hooks to hang jewelry or any of the LEGO DOTS wearables from and a tray to keep accessories, plus tiles for kids to decorate with, using their imagination and self-expression skills to make it uniquely their own. Kids can put the ‘fun’ in functional arts and crafts The joy of this set is the chance for kids to be imaginative and decorate the jewelry stand however they like. To match their mood or their room and show off their fun designs, because anything goes with all the LEGO DOTS sets. They make great gifts for Christmas, birthdays or any time.\nHelp your child explore their love of creative DIY with this fun Rainbow-themed Jewelry Stand set. All surfaces can be decorated, there are 5 hooks for hanging items ‘in the clouds’ and a tray to hold smaller jewelry.\nKids can grow their design and self-expression skills as they decorate the jewelry stand, following the pattern ideas included in the LEGO® DOTS™ (41905) packaging or coming up with their own, fresh looks.\nKids can assemble the jewelry stand and mix the tiles from any of the other DOTS™ items, including the colorful Extra DOTS - series 1 pack (41908), to make the stand really fit into their room decor however they like!\nAny fan of DIY or arts and crafts will love this awesome set. The buildable jewelry stand and colorful decorated tiles will thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 6+.\nPerfect size for a child's bedroom. With the jewelry stand measuring over 7” (18cm) high, this DIY creative set is perfect for young designers to practice their creations and display their jewelry in their favorite style.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ independent play and problem-solving skills, plus it gives them the joy of creating something new all on their own.\nOpen the box and be creative. Easy-to-follow instructions make assembling the jewelry stand fun. An idea sheet offers decorating inspiration. Cleanup and sorting are a breeze with theenclosed storage and sorting tray.\nGive kids cool crafts to create with LEGO® DOTS™ sets. This clever jewelry stand set offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® bricks and tiles meet the highest industry standards and our own quality criteria, so they are consistent, compatible, connect securely and come apart easily every time – it's been that way since 1958.\nWe drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and tiles to make sure every kid’s building toy meets the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/cosmic-wonder-bracelet-41903","description":"Kids who like arts and crafts and creating their own jewelry will love this cool LEGO® DOTS (41903) Cosmic Wonder Bracelet kit! Made to be an easy, intuitive creation, this DIY set offers kids the chance to make their own jewelry and change it to suit their outfit or mood or whatever. Customizable jewelry kit This cool bracelet kit features an adjustable band in black that fits around bigger or smaller wrists and 32 colorful tiles, including special tiles decorated with shooting stars and planets and unique diamond elements to design their own creative bracelet toy, stretch their imagination and self-expressive play skills and make it fun and unique. Designing fun for kids who love arts and crafts The joy of this set is the chance for kids to be imaginative and decorate the bracelet however they like. To match their mood, or as a great piece for self-expression to show off their fun designs, because anything goes with these bracelets. They make great gifts for Christmas, birthdays or any time.\nEncourage your child’s love of creative DIY with this adorable LEGO® DOTS™ Cosmic Wonder Bracelet (41903) set, featuring an adjustable band and 32 colorful tiles. Play starts with decorating, straight out of the bag!\nPersonalized jewelry on display! Kids can stretch their design and self-expression skills as they decorate the fun bracelet, following the pattern ideas on the packaging or coming up with their own unique look.\nThe colorful tiles are great to create with in this set or others as part of imaginative fun. Kids can also use tiles from the LEGO® DOTS™ 41908 Extra DOTS - series 1 pack to spice up their bracelets with cool new styles.\nAny fan of DIY or arts and crafts will love this awesome set. The flexible bracelet and colorful decorated tiles will thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 6 and up.\nSmall and totally portable. With the bracelet measuring over 7” (20cm) long, this exciting DIY creative set is perfect for beginning designers to practice their creations and then wear their favorite version.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ independent play skills, plus it gives them the joy of creating something new all on their own.\nOpen the bag and the fun begins with decorating the bracelet. Easy-to-follow inspiration helps make design a snap, leading to pride of creating unique jewelry on their own, and loads of creative fun.\nGive kids cool crafts to create with LEGO® DOTS™ sets. This clever jewelry making playset offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® DOTS™ tiles and bracelets meet the highest industry standards and our own quality criteria. They are designed to be consistent, compatible, connect securely and come apart easily every time.\nWe drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® tiles and bracelets to make sure every kid's building toy meet the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/sparkly-unicorn-bracelet-41902","description":"Something magical awaits arts and crafts fans in this hot LEGO® DOTS (41902) Sparkly Unicorn Bracelet kit toy! Made to be a quick, easy, intuitive kit, this DIY set offers kids the chance to create their own jewelry and change it to suit their outfit or mood or whatever. Unique DIY jewelry kit This awesome bracelet kit features an adjustable band in lavender that fits around bigger or smaller wrists and 32 colorful tiles, including special tiles decorated with unicorn heads and starry skies, to design their own creative bracelet toy, stretch their imagination and self-expressive play skills and make it fun and unique. Easy crafts for kids who love creative jewelry The joy of this set is the chance for kids to be imaginative and decorate the bracelet however they like. To match their mood, or as a great piece for self-expression to show off their sparkly designs, because anything goes with these bracelets. They make great gifts for Christmas, birthdays or any time.\nEncourage your child’s love of DIY with this delightful LEGO® DOTS™ Sparkly Unicorn Bracelet (41902) set, featuring an adjustable band and 32 colorful tiles. Play starts with decorating, straight out of the bag!\nCreativity in jewelry on display! Kids can stretch their design and self-expression skills as they decorate the fun bracelet, following the pattern suggestions on the package or coming up with their own, individual look.\nThe colorful tiles are great to create with in this set orothers as part of imaginative fun. Kids can also use tiles from the LEGO® DOTS™ 41908 Extra DOTS - series 1 pack to jazz up their bracelets with cool new styles.\nAny fan of DIY or arts and crafts will love this awesome set. The flexible bracelet and colorful decorated tiles will thrill any child as a great Christmas, birthday or anytime gift for boys and girls aged 6 and up.\nSmall and totally portable. With the bracelet measuring over 7” (20cm) long, this exciting DIY creative set is perfect for young designers to practice their creations and then wear their favorite version.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ independent play skills, plus it gives them the joy of creating something new all on their own.\nOpen the bag and the creating begins with decorating the bracelet. Easy-to-follow inspiration on the package help make design a snap, leading to pride of creating unique jewelry on their own, and loads of creative fun.\nGive kids cool crafts to create with LEGO® DOTS™ sets. This clever jewelry making playset offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® DOTS™ tiles and bracelets meet the highest industry standards and our own quality criteria. They are designed to be consistent, compatible, connect securely and come apart easily every time.\nWe drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® bricks and pieces to make sure every kid's building toy meet the highest global safety and quality standards."},{"theme":"products","themeUrl":"https://www.lego.com/en-us/themes/dots/products","productUrl":"https://www.lego.com/en-us/product/extra-dots-series-1-41908","description":"Kids and fans of arts and crafts items will love this cool LEGO® DOTS (41908) Extra DOTS - series 1 pack! Designed to work with all the LEGO DOTS sets, these extra tiles offer kids the chance to expand their designs in fun new ways and change them to suit their outfit, mood or room decor. Extra creativity in a bag This great little pack includes 109 colorful tiles, including 20 translucent blue glitter tiles and 10 special printed tiles, to decorate their own creative jewelry or room decor items, stretch their imagination skills and have fun expressing themselves how they like. More arts and crafts items to make designing even more fun The joy of this little pack is the chance for kids to be even more imaginative in decorating their LEGO DOTS items however they like, to match their mood, to mix and match with their friends and to show off their own unique designs. They make great stocking stuffer gifts for Christmas or birthdays or make a great add-on purchase with any of the other DOTS sets.\nGrow your child’s love of creative DIY with this bag of tiles, with 79 tiles in 4 colors, 20 translucent blue glitter tiles, and 10 out of a possible 16 decorated tiles (what’s in the bag is a surprise!).\nCreativity on display! Kids can stretch their design and self-expression skills as they decorate using these great tiles, whether following patterns from the different LEGO® DOTS sets or coming up with new ideas.\nThe colorful (41908) Extra DOTS – series 1 are great to create new designs with in the different DOTS sets or with other LEGO® sets as part of creative arts and crafts fun.\nAny DIY or arts and crafts fan will love getting this Extra DOTS - series 1 pack (41908) to add to other sets they have. The new colors and decorated tiles will be a fun anytime or add-on gift for boys and girls aged 6+.\nSmall and totally portable. This cute DIY creative bag is perfect for young designers to add to their creations and then display their new designs on their bracelet or room décor items.\nPowered by a child’s imagination for endless fun and creativity! Battery-free toys help boost kids’ independent play skills, plus it gives them the joy of creating something new all on their own.\nOpen the bag and the creating begins. With lots of new colors and cute decorated tiles, this bag can lead to loads of extra creative fun. Kids can add the tiles to any of the other DOTS room decor or wearable sets!\nGive kids cool crafts to create with LEGO® DOTS sets. This fun addition for the bracelet and room decor sets offers open-ended design inspiration that helps build children’s creativity and confidence.\nLEGO® tiles meet the highest industry standards and our own quality criteria, so they are consistent, compatible, connect securely and come apart easily every time.\nWe drop, squash, twist, heat, bite, bend, scratch and stretch LEGO® tiles to make sure every kid's building toy meets the highest global safety and quality standards."}]