[{"theme":"serious-play","themeUrl":"https://www.lego.com/en-us/themes/serious-play","productUrl":"https://www.lego.com/en-us/product/identity-and-landscape-kit-2000430","description":"The LEGO® SERIOUS PLAY® program is a radical and innovative process designed to enhance business performance through building with LEGO bricks.\n\nThe LEGO® SERIOUS PLAY® Identity and Landscape Kit is designed for use in conjunction with the Starter Kit (2000414) for workshops longer than 3 – 5 hours. It supports a group of 10 - 12 workshop participants.\n\nIncludes:\nLarge special mix of LEGO bricks combined with DUPLO elements including animals.\nExtensive selection of special elements such as wheels, tires, windows, trees, mini figure parts, sticks, globes, spiral tubes, ladders, and fences.\nLarge selection of base plates.\n3 orange plastic sorting trays\n\nIf you are a certified LEGO® Serious Play Facilitator and need to purchase quantities greater than the limitations noted on this page, please contact Consumer Services at Customer Service 00-800-5346-5555.\n\nNote: The Identity and Landscape kit does not come with any kind of instructions or instructor’s manual. Training in how to design and facilitate LEGO SERIOUS PLAY workshops using the Identity and Landscape kit can be obtained through the LEGO SERIOUS PLAY Community."},{"theme":"serious-play","themeUrl":"https://www.lego.com/en-us/themes/serious-play","productUrl":"https://www.lego.com/en-us/product/connections-kit-2000431","description":"The LEGO® SERIOUS PLAY® program is a radical and innovative process designed to enhance business performance through building with LEGO bricks.\n\nThe LEGO® SERIOUS PLAY® Connections Kit is designed for use in conjunction with the Starter Kit (2000414) and the Identity and Landscape Kit (2000430). It supports a group of 10 - 12 workshop participants. It is designed to support 1 – 2 day workshops, participants focus on the relations and connections structure of the business landscape with its network of interdependent factors and explore how the systems responds to change.\n\nIncludes:\n\nExtensive selection of connecting elements such as spiral tubes, ladders, fences, bridges and strings\nExtensive selection of connectors making it possible to build a large interconnected LEGO model\nBricks for making10 identical bags containing bricks for the “pencil case” exercise. \n3 orange plastic sorting trays\n \n\nNote: The Connections Kit does not come with any kind of instructor’s manual. Training in how to design and facilitate LEGO SERIOUS PLAY workshops using the Connections Kit can be obtained through the LEGO SERIOUS PLAY Community."},{"theme":"serious-play","themeUrl":"https://www.lego.com/en-us/themes/serious-play","productUrl":"https://www.lego.com/en-us/product/window-exploration-bag-2000409","description":"The LEGO® SERIOUS PLAY® program is a radical and innovative process designed to enhance business performance through building with LEGO bricks. \n\nThe LEGO® SERIOUS PLAY® Window Exploration Bag is for one person to use and is aimed at learning the basic principles and skills of the LEGO® SERIOUS PLAY® method. It is well suited for shorter workshops less than app. 3 hours. Article 2000409 includes 100 individual Window Exploration Bags.\n\nIncludes:\n\nSmall selection of standard bricks representing multiple colors and shapes\nSmall selection of special elements and mini figure parts. \n\nIf you are a certified LEGO® Serious Play Facilitator and need to purchase quantities greater than the limitations noted on this page, please contact Consumer Services at Customer Service 00-800-5346-5555.\n\nNote: The Window Exploration Bag does not come with any kind of instructions or instructor’s manual. Training in how to design and facilitate LEGO SERIOUS PLAY workshops using the Identity and Landscape kit can be obtained through the LEGO SERIOUS PLAY Community."},{"theme":"serious-play","themeUrl":"https://www.lego.com/en-us/themes/serious-play","productUrl":"https://www.lego.com/en-us/product/starter-kit-2000414","description":"The LEGO® SERIOUS PLAY® program is a radical and innovative process designed to enhance business performance through building with LEGO bricks.\n\nThe LEGO® SERIOUS PLAY® Starter Kit is for one person to use. The Starter Kit provides a rich variety of LEGO bricks needed for a workshop that goes beyond a basic introduction to the LEGO SERIOUS PLAY methodology. The kit is applicable for the introductory skills building as well as the deeper imagination and problem-solving aspects of the workshop.\n\nIncludes:\n\nSelection of standard LEGO bricks combined with a few DUPLO elements. \nSelection of special elements such as wheels, tires, windows, trees, mini figure parts, tubes, globes and small base plates \nImaginopedia booklet with simple model building instructions LEGO skills building\n \n\nNote: The Starter Kit does not come with any kind of instructor’s manual. Training in how to design and facilitate LEGO SERIOUS PLAY workshops using the Starter Kit can be obtained through the LEGO SERIOUS PLAY Community."}]