[{"theme":"speed-champions","themeUrl":"https://www.lego.com/en-us/themes/speed-champions","productUrl":"https://www.lego.com/en-us/product/lamborghini-urus-st-x-lamborghini-huracan-super-trofeo-evo-76899","description":"Fans of racing toys will love building these LEGO® Speed Champions Lamborghini Huracán Super Trofeo EVO and Lamborghini Urus ST-X (76899) replica model cars. With 2 cool race cars in this building set, kids can create epic races or proudly display the LEGO replicas in their bedrooms. The fun is in the details New for January 2020, the Lamborghini Huracán Super Trofeo EVO race car competes in the fastest one-make championship in the world and boasts brilliantly realistic details including a shark fin and front diffuser. The Lamborghini Urus ST-X toy car is also new and is the world’s first racing Super SUV to compete on the track and off-road. Recreate race-day action! LEGO Speed Champions model kits let car enthusiasts of all ages build mini versions of their favorite cars from LEGO bricks and recreate all the thrills and spills of the racetrack. New for January 2020, these exciting toy cars are now bigger and more authentic than ever.\n\nStunning, collectible toy playset featuring 2 LEGO® Lamborghini race cars packed with authentic details. This building kit is perfect for those who love race cars and staging thrilling race action.\nThe buildable Lamborghini Huracán Super Trofeo EVO and Lamborghini Urus ST-X LEGO® replicas come with a start line with ’lights’, plus 2 racing driver minifigures.\nNew for January 2020, Lamborghini makes an exciting LEGO® Speed Champions debut. This is a collectible set to build model cars to show off at home or use to create thrilling stories with other mini replicas.\nThis 659-piece Lamborghini model car building kit offers a rewarding challenge for boys and girls aged 8+ and makes a great LEGO® gift. The car toy playset inspires independent play or the fun can be shared with friends.\nSpeed Champions toy racing cars are now 25% bigger. The Lamborghini Huracán model measures over 1” (5cm) high, 6” (16cm) long and 2” (7cm) wide, and both cars are the perfect size to play with at home or on the go.\nNo batteries are required for this building set – it’s ready to play with once built. These toy model cars are fueled solely by kids’ imaginations, so the racing action never stops!\nThinking of giving this Lamborghini toy playset to a rookie LEGO® builder? Don’t worry! The bricks come with simple, easy-to-follow instructions so the fun can start straight away.\nLEGO® Speed Champions construction toy car sets let racing fans build and display toy models of their favorite cars and recreate all the epic drama of the racetrack.\nLEGO® bricks have met the highest industry standards since 1958, ensuring they are always consistent, compatible and pull apart with ease every time.\nThese LEGO® bricks and pieces have been relentlessly tested and meet the highest global safety and quality standards."},{"theme":"speed-champions","themeUrl":"https://www.lego.com/en-us/themes/speed-champions","productUrl":"https://www.lego.com/en-us/product/2018-dodge-challenger-srt-demon-and-1970-dodge-charger-r-t-75893","description":"Enjoy a thrilling building and drag racing experience for kids and adults with this awesome LEGO® Speed Champions 75893 2018 Dodge Challenger SRT Demon and 1970 Dodge Charger R/T toy car playset! The Dodge Challenger features 2 sets of wheel rims, authentic design details and decorative stickers while the cool LEGO version of the Dodge Charger, an iconic American muscle car, has a removable supercharger and alternate engine cover. Get the car racing action going with a buildable Christmas tree start light, plus a race marshal with a checkered flag and 2 driver minifigures.\n\nIncludes 3 minifigures: a Challenger driver, Charger driver and a race marshal.\nThe race-ready, buildable 2018 Dodge Challenger SRT Demon features a minifigure cockpit, removable windshield, wheels with rubber tires, 2 sets of rims, rear spoiler, dual exhaust, and authentic design details and decorative stickers.\nThe muscular, buildable 1970 Dodge Charger R/T features a minifigure cockpit, removable windshield, wheels with rubber tires, removable supercharger and alternate engine cover, translucent light-style elements, and authentic design details and decorative stickers.\nRemove the windshields to place a minifigure in each car.\nThis toy car set includes a buildable, lever-operated Christmas tree start light with translucent light-style elements.\nSlide the lever down to flip up the start lights and begin the race.\nAccessory elements include the Dodge Challenger driver's and Dodge Charger driver's helmets, and the race marshal's cap and checkered flag.\n2018 Dodge Challenger SRT Demon measures over 1” (4cm) high, 5” (14cm) long and 2” (6cm) wide.\n1970 Dodge Charger R/T muscle car measures over 1” (4cm) high, 5” (15cm) long and 1” (5cm) wide.\nChristmas tree start light measures over 4” (11cm) high, 1” (4cm) wide and 1” (3cm) deep."},{"theme":"speed-champions","themeUrl":"https://www.lego.com/en-us/themes/speed-champions","productUrl":"https://www.lego.com/en-us/product/formula-e-panasonic-jaguar-racing-gen2-car-jaguar-i-pace-etrophy-76898","description":"The perfect gift for kids who love building and playing with toy racing cars. With 2 exciting electric Jaguar model cars, a detailed start line and 2 minifigures in Jaguar race suits, they have all they need for independent play and staging fun race action. Own your very own replica Formula E and I-PACE eTROPHY Jaguar model cars New for January 2020, this is the first chance to build a LEGO® Speed Champions (76898) model based on 2 exciting all-electric race cars. The Formula E Panasonic Jaguar Racing Gen2 car is a slick single-seater that races in the exciting ABB FIA Formula E Championship, while the Jaguar I-PACE eTROPHY, with its distinctive fin, competes around the world in the official support series. The best race car kits! LEGO Speed Champions race car kits allow car fans of all ages to build replicas of their favorite cars, and then use their imaginations to recreate the drama of the racetrack. New for January 2020, these toy model cars are now bigger and more realistic than ever!\n\nAwesome building kit featuring 2 replica Formula E and I-PACE eTROPHY Jaguar race cars with realistic details. This is an ideal LEGO® gift for those who love to build car toys and create thrilling stories around them.\nThese Buildable Formula E Panasonic Jaguar Racing Gen2 car and Jaguar I-PACE eTROPHY LEGO® models are accompanied by 2 minifigures in racing suits and a start line with three ‘lights' for staging fun racing action.\nNew for January 2020, LEGO® Speed Champions cars are 25% bigger than ever before. These Jaguar toy cars are perfect for showing off on display or battling it out with other cars in your own championships at home.\nThis 564-piece building kit provides boys and girls aged 8+ with a fun challenge to complete, inspiring them to create thrilling scenes with their Jaguar racing cars on their own or with friends.\nBoth toy racing cars are the ideal size to play with at home or on the go. The Jaguar I-PACE eTROPHY car measures over 2” (6cm) high, 6” (16cm) long and 2” (6cm) wide.\nNo batteries are required for this playset – just your kids’ imaginations, which means they never need to pull in for a pit stop!\nWhether you are an experienced or first-time LEGO® builder, this model car kit comes with simple, easy-to-follow instructions to help you build the cars with the bricks straightaway.\nLEGO® Speed Champions collectible model car kits let race fans build mini models of their favorite cars and recreate all the drama of the racetrack.\nLEGO® building bricks have met the highest industry standards since 1958, ensuring they are always consistent, compatible and pull apart with ease every time.\nThese LEGO® bricks and pieces have been relentlessly tested and meet the highest global safety and quality standards."},{"theme":"speed-champions","themeUrl":"https://www.lego.com/en-us/themes/speed-champions","productUrl":"https://www.lego.com/en-us/product/ferrari-f8-tributo-76895","description":"This LEGO® Speed Champions Ferrari F8 Tributo (76895) is perfect for fans of toy cars and Ferrari! Racing enthusiasts of all ages will love to build this mini replica from LEGO bricks. They can create their very own super-fast F8 Tributo model car before displaying the sleek mini replica or challenging other cars to thrilling races. The most realistic Ferrari ever LEGO Speed Champions cars are now 25% bigger than ever before, meaning even more authentic details. This F8 Tributo toy model car has the same beautiful design as the original, which boasts the fastest V8 engine in Ferrari’s history. This red toy model car kit also comes with a Ferrari racing minifigure. Place him behind the wheel and away you go! Recreate all the drama of the racetrack! LEGO Speed Champions building kits for kids let car fans construct mini versions of some of the world’s most famous cars. They can then display the models, enjoy some independent play, or stage thrilling races against their friends.\n\nA spectacular toy playset featuring a brilliantly detailed Ferrari F8 Tributo. The ideal birthday gift for those with a passion for building LEGO® replicas and then using their Ferrari model car to stage their own races.\nIncludes a building kit of a Ferrari F8 Tributo model and 1 collectible Ferrari racing driver minifigure. This build your own toy car playset will fire up kids’ imaginations as they recreate the drama of the racetrack.\nThe first ever opportunity to build a car toy replica of the super-fast Ferrari F8 Tributo. Kids can display it at home or use it to stage exciting races with their friends.\nThis 275-piece model car kit for boys and girls aged 8+ makes a great birthday gift for those who love to build and play with Ferrari replicas, and fans of the glamour of the Italian car maker.\nThe Ferrari F8 Tributo measures over 1” (4cm) high, 5” (15cm) long and 3” (8cm) wide. All 2020 LEGO® Speed Champions are 25% bigger, meaning the toy model cars reflect the real-life versions better than ever before!\nBuying this set for someone new to LEGO® building kits? No problem. Easy-to-follow, step-by-step instructions are included to help create this stunning toy model car."},{"theme":"speed-champions","themeUrl":"https://www.lego.com/en-us/themes/speed-champions","productUrl":"https://www.lego.com/en-us/product/nissan-gt-r-nismo-76896","description":"The Nissan GT-R NISMO (76896) has fans all over the world and holds the record for the fastest drift. Now fans of all ages can create their very own toy model car with LEGO® building bricks – the ideal LEGO gift for those who love to build cool replicas. Put the Nissan GT-R on display or challenge other cars to a race! Own your very own Nissan GT-R NISMO toy car Tuners, drivers and race fans have loved the Nissan GT-R for half a century and can now build a LEGO replica of the legendary GT-R NISMO. This toy model car features some of the same realistic details seen on the real-life model. The toy playset also includes a driver minifigure in a Nissan race suit to place behind the wheel for exhilarating racing action. Racing toys to star on the racetrack! New for January 2020, LEGO Speed Champions replicas are now 25% bigger and more realistic than ever. They allow car fans to build mini versions of the world’s most famous cars, and display them or use to create thrilling racing stories.\n\nA rare chance to own an authentically detailed LEGO® replica of the legendary Nissan GT-R NISMO. This is the perfect gift for those passionate about building toys and racing them.\nA buildable Nissan GT-R NISMO and 1 collectible minifigure in a Nissan racing suit. This model car kit will captivate both kids and car fans, inspiring them to independent play and letting them stage races with friends.\nNew for January 2020, the mini version of the Nissan GT-R NISMO can be built and displayed or used to race against other LEGO® Speed Champions cars.\nThis 298-piece Nissan GT-R NISMO model car kit provides an exciting mission for boys and girls aged 8+ who love to create and play with toy racing cars. It will make a cherished gift at any time of year.\nThe Nissan GT-R NISMO measures 1” (5cm) high, 6” (16cm) long and 2” (7cm) wide. New for January 2020, all LEGO® Speed Champions cars are now 25% bigger to include even more details from the original versions!\nNo batteries required, so the fun and racing action never have to stop. This action toy is always ready to zoom away and take to the track!\nThis building kit comes with easy-to-follow, step-by-step instructions, so fans have nothing to worry about and can put together their racing toy as quickly as they choose.\nLEGO® Speed Champions building toys give car fans the chance to create some of the world’s most famous and exciting models. They can either show off their race cars or stage thrilling battles against other models.\nLEGO® bricks have met the highest industry standards since 1958, ensuring they are always consistent, compatible and pull apart with ease every time.\nThese LEGO® bricks and pieces have been relentlessly tested and meet the highest global safety and quality standards."},{"theme":"speed-champions","themeUrl":"https://www.lego.com/en-us/themes/speed-champions","productUrl":"https://www.lego.com/en-us/product/1974-porsche-911-turbo-3-0-75895","description":"Porsche fans will love to build, race and proudly display the LEGO® Speed Champions 75895 1974 Porsche 911 Turbo 3.0. This white, collectible toy car model for kids of one of the world’s most recognizable classic sports cars features a minifigure cockpit with a removable windshield and is packed with authentic details, including the iconic ‘whale tail' rear spoiler. A classic Porsche 911 driver minifigure and 3 cones to play out race scenarios are also included in this LEGO car set. Fans can add an exciting digital dimension to their racing play and ‘drive’ this car in the Forza Horizon 4 LEGO Speed Champions expansion pack (sold separately).\nThis model car kit includes a new-for-August-2019 classic Porsche 911 driver minifigure.\nThe white, buildable 1974 Porsche 911 Turbo 3.0 toy car for kids features a minifigure cockpit with removable windshield, wheels with rubber racing tires and authentic design details such as the 911 Turbo's iconic ‘whale tail' rear spoiler.\nRemove the windshield to place the minifigure in the car.\nAccessory elements include the Porsche 911 driver's helmet, plus 3 cones for racing play action.\nKids can add an exciting digital dimension to their racing play and ‘drive’ this car in the Forza Horizon 4 LEGO® Speed Champions expansion pack (sold separately).\nThis cool toy model car for kids makes a great birthday gift.\n1974 Porsche 911 Turbo 3.0 measures over 1” (4cm) high, 5” (15cm) long and 2” (6cm) wide."},{"theme":"speed-champions","themeUrl":"https://www.lego.com/en-us/themes/speed-champions","productUrl":"https://www.lego.com/en-us/product/chevrolet-camaro-zl1-race-car-75891","description":"Race for victory with the LEGO® Speed Champions 75891 Chevrolet Camaro ZL1 Race Car toy, featuring a minifigure cockpit with an adjustable roll cage, removable windshield and wheels with Chevrolet Camaro-branded rims. This cool stock car racing toy comes with a Chevy Camaro racing driver minifigure and a fuel canister element to play out racing and pit-stop scenarios.\n\nIncludes a Camaro racing driver minifigure.\nThe race-ready, buildable Chevrolet Camaro ZL1 stock car features a minifigure cockpit with an adjustable roll cage, removable windshield, wheels with rubber tires and Chevrolet Camaro-branded rims, translucent light-style elements, racing colors, race-graphics stickers and authentic design details.\nRemove the windshield and lift the roll cage to place the minifigure in the car.\nAccessory elements include a fuel canister, spanner and the Camaro racing driver’s helmet.\nThis toy construction set makes a great gift for kids and car lovers of all ages.\nMeasures over 1” (4cm) high, 5” (14cm) long and 1” (5cm) wide."},{"theme":"speed-champions","themeUrl":"https://www.lego.com/en-us/themes/speed-champions","productUrl":"https://www.lego.com/en-us/product/mclaren-senna-75892","description":"Drive on the edge with the LEGO® Speed Champions 75892 McLaren Senna model car toy! This cool LEGO version of the road car inspired by the late, great and legendarily daring racing driver Ayrton Senna features a minifigure cockpit, removable windshield, interchangeable rims, and McLaren and Senna logo stickers. This super toy car for kids comes with a buildable wind tunnel with rotating fan and a McLaren racing driver minifigure to play out car development and fast car racing scenarios.\n\nIncludes a McLaren racing driver minifigure in a racing suit featuring the McLaren Senna and Pirelli logos.\nThe race-ready, buildable McLaren Senna features a minifigure cockpit, removable windshield, wheels with rubber tires and interchangeable rims, rear spoiler, translucent light-style elements, McLaren and Senna logo stickers and authentic design details.\nRemove the windshield to place the minifigure in the car.\nAlso includes a buildable wind tunnel with a rotating fan.\nAccessory elements include the McLaren racing driver’s helmet and a spanner.\nThis car playset offers endless creative fun for car-loving kids.\nMcLaren Senna toy car measures over 1” (4cm) high, 5” (15cm) long and 1” (5cm) wide.\nWind tunnel measures over 1” (5cm) high, 2” (6cm) wide and 1” (4cm) deep."},{"theme":"speed-champions","themeUrl":"https://www.lego.com/en-us/themes/speed-champions","productUrl":"https://www.lego.com/en-us/product/1985-audi-sport-quattro-s1-76897","description":"The 1985 Audi Sport quattro S1 (76897) was one of the kings of the Group B rally racing circuit. Race fans can now construct their own car toy of this beloved model from LEGO® building bricks. Celebrate the 35th anniversary of the quattro by owning a model car replicating this rally icon. A classic rally car reborn! This racing car model of the famous 1985 Audi Sport quattro S1 brilliantly reflects the original with its famous yellow and white livery, front engine, bulked-up bumper and vast rear wing. This model car kit also comes with a minifigure in an Audi Sport quattro race suit. Jump behind the wheel of this Audi toy car and make a lasting impression – just like the original did! Recreate all the drama of the racetrack LEGO Speed Champions building kits provide car fans of all ages with the chance to create racing toys of their favourite models and recreate the thrills of the racetrack. New for January 2020, these cool replicas are now more realistic and 25% bigger than ever before.\n\nBrilliantly detailed and collectible model car kit featuring a 1985 Audi Sport quattro S1 LEGO® replica and 1 driver minifigure. The perfect LEGO gift for the many devoted fans of this classic car.\nA buildable 1985 Audi Sport quattro S1 toy car based on the original model and 1 collectible minifigure in an authentic Audi race suit. This toy playset will captivate kids as they use their imaginations to stage races.\nFans of the 1985 Audi Sport quattro S1 will be thrilled to build a mini version from LEGO® building bricks. They have the choice to proudly display it or test its powers by racing it against other models.\nThis 250-piece building kit for boys and girls aged 8+ makes a wonderful gift for both passionate fans of this famous car and those who love to play with racing toys.\nLEGO® Speed Champions cars are now 25% bigger and even more realistic. The 1985 Audi Sport quattro S1 rally car measures over 2” (6cm) high, 6” (16cm) long and 2” (7cm) wide, so it’s compact enough to take with you on the go.\nEasy-to-follow instructions are included so the fun can start as soon as possible."},{"theme":"speed-champions","themeUrl":"https://www.lego.com/en-us/themes/speed-champions","productUrl":"https://www.lego.com/en-us/product/ferrari-f40-competizione-75890","description":"Build, race and display the LEGO® Speed Champions 75890 Ferrari F40 Competizione toy car, then transform it into the classic F40 road car, the last car that Enzo Ferrari oversaw in his lifetime! Packed with authentic details, this 2-in-1 model features a minifigure cockpit with a removable windshield, plus interchangeable hoods and spoilers to turn the Competizione into the road version of the F40. This car toy also includes a Ferrari racing driver minifigure to play out exciting race scenarios.\n\nIncludes a Ferrari racing driver minifigure.\nThe race-ready, buildable Ferrari F40 Competizione vehicle features a minifigure cockpit with removable windshield, wheels with rubber racing tires, translucent light-style elements, racing colors, authentic design details, plus interchangeable hoods and rear spoilers.\nRemove the windshield to place the minifigure in the car.\nChange the hood and the spoiler to transform the F40 Competizione into the classic Ferrari F40 road car.\nAlso includes the Ferrari racing driver’s helmet.\nFerrari F40 Competizione car for kids measures over 1” (4cm) high, 5” (13cm) long and 1” (5cm) wide."},{"theme":"speed-champions","themeUrl":"https://www.lego.com/en-us/themes/speed-champions","productUrl":"https://www.lego.com/en-us/product/1967-mini-cooper-s-rally-and-2018-mini-john-cooper-works-buggy-75894","description":"Stage a classic vs. modern rally race with these cool LEGO® Speed Champions 75894 1967 Mini Cooper S Rally and 2018 MINI John Cooper Works Buggy car toys! The 1967 Mini Cooper S Rally features a roof rack with 2 spare tires, just like the original car, while the 2018 MINI John Cooper Works Buggy has suspension to drive over rough terrain. Play out exciting rally racing scenarios with 4 LEGO minifigures and a fully equipped pit stop station, including a buildable car jack stand, a mechanic's creeper, tool racks, assorted tools and computer screen elements.\n\nIncludes 4 minifigures: Mini Cooper S Rally driver, MINI John Cooper Works Buggy rally driver, race marshal and a mechanic.\nThe race-ready, buildable 1967 Mini Cooper S Rally features a minifigure cockpit, removable windshield, wheels with rubber tires, roof rack with 2 spare tires, racing colors, race-graphics stickers, translucent light-style elements and authentic design details.\nThe speedy, buildable 2018 MINI John Cooper Works Buggy features a minifigure cockpit, removable windshield, wheels with rubber tires, suspension, racing colors, race-graphics stickers, translucent light-style elements and authentic design details.\nRemove the windshields to place a minifigure in each car.\nPit stop station features tool racks, a buildable car jack stand, 2 mobile opening tool cabinets, a mechanic's creeper with wheels and assorted elements including 2 TV screens, a ‘MINI' sign, trophy, gas can, camera, flag and various tools.\nPlace a car on the jack stand and use the mechanic's creeper to check underneath.\nAccessory elements include a helmet for each driver and the race marshal’s cap and checkered flag.\n1967 Mini Cooper S Rally toy car for kids measures over 2” (6cm) high, 3” (9cm) long and 1” (4cm) wide.\n2018 MINI John Cooper Works Buggy measures over 2” (7cm) high, 5” (13cm) long and 2” (7cm) wide.\nPit stop station measures over 5” (13cm) high, 11” (30cm) wide and 4” (12cm) deep."}]