[{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/imperial-shuttle-75302","description":"Fans can play out exciting scenes from the classic Star Wars™ trilogy with this buildable Imperial Shuttle (75302) model. The elegant design of the shuttle is beautifully recreated in LEGO® bricks, with an opening minifigure cockpit, opening main compartment with space for 2 LEGO minifigures, foldable wings for flight and landing mode, plus 2 stud shooters. Between playtime adventures, it makes a cool display piece.\n\nRole-play fun\nThis awesome building toy for kids also includes Darth Vader,Imperial Officer and Luke Skywalker LEGO minifigures with lightsabers and a blaster pistol.\n\nAwesome gifts\nThe LEGO Group has been recreating iconic starships, vehicles, locations and characters from the Star Wars universe since 1999. LEGO Star Wars is now its most successful theme, with fun, creative gift ideas for fans of all ages.\n\nBuild a LEGO® brick version of the elegant Imperial Shuttle and play out scenes from the classic Star Wars™ trilogy with this action-packed building toy for kids (75302).\nIncludes 3 LEGO® minifigures – Darth Vader and Luke Skywalker, both with a lightsaber, and an Imperial Officer with a blaster pistol, plus a handcuffs accessory element – for fun, creative play.\nThe Imperial Shuttle features an opening minifigure cockpit, opening main compartment with space for 2 LEGO® minifigures, foldable wings for flight and landing mode, plus 2 stud shooters.\nThis awesome building toy makes the best birthday, holiday or surprise gift for kids and any Star Wars™ fan aged 9 and up. It’s fun to build and play with solo or with family and friends.\nThe Imperial Shuttle measures over 10 in. (25 cm) high, 9 in. (24 cm) long and 14 in. (35 cm) wide. Kids will be proud to display their creation in their bedroom between playtime adventures.\nThinking of buying this buildable playset for a Star Wars™ fan who is a LEGO® beginner? No problem. It comes with easy-to-follow instructions so they will soon be building with Jedi-like confidence.\nThere are LEGO® Star Wars™ sets to delight people of all ages, whether they want to recreate memorable scenes, role-play their own stories or just build and display the striking construction models.\nLEGO® components satisfy stringent industry standards, meaning that they are compatible and connect consistently for robust builds.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to ensure they meet some of the highest safety standards here on Earth – and in galaxies far, far away!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/imperial-tie-fighter-75300","description":"Kids can role-play as the villains from the classic Star Wars™ trilogy with this cool LEGO® brick version of the Imperial TIE Fighter (75300). Capturing the authentic, sleek design of an iconic starfighter in the Imperial fleet, it features an opening LEGO minifigure cockpit and 2 spring-loaded shooters.\n\nRole-play adventures\nThere are also 2 LEGO minifigures: a TIE Fighter Pilot with a blaster pistol and Stormtrooper with a blaster, plus an NI-L8 Protocol Droid to inspire fun, creative role play and storytelling.\n\nStar Wars action in LEGO style\nThe LEGO Group has been creating brick-built versions of iconic Star Wars starfighters, vehicles, locations and characters since 1999. It’s become a hugely successful theme with an awesome assortment of toy building sets and the best gift ideas for kids and fans of all ages.\n\nFans can build their own missile-shooting LEGO® brick version of the iconic Imperial TIE Fighter (75300) and reimagine scenes from the classic Star Wars™ trilogy with this buildable playset.\nIncludes 2 LEGO® Star Wars™ minifigures: a TIE Fighter Pilot with a blaster pistol and a Stormtrooper with a blaster, plus an NI-L8 Protocol Droid LEGO figure for role-play adventures.\nThe TIE Fighter features an opening LEGO® minifigure cockpit and 2 spring-loaded shooters for action-packed play.\nGreat for solo building or sharing the fun with friends and family, this set makes the best birthday present, holiday gift or surprise treat for creative kids and any Star Wars™ fan aged 8 and up.\nMeasuring over 6.5 in. (17 cm) high, 5.5 in. (14 cm) long and 6 in. (15 cm) wide, it makes a striking display piece in any child’s bedroom between playtime battles.\nLooking for an engaging building toy for a child who is new to LEGO® sets? This 432-piece Star Wars™ set comes with clear instructions so they can build independently and with Jedi-level confidence.\nLEGO® Star Wars™ sets are fantastic for kids (and adult fans) to recreate scenes from the saga, play out their own creative stories or just build and display the collectible construction models.\nEver since 1958, LEGO® components have met stringent industry standards to ensure they are compatible and connect consistently – no need to use the Force.\nLEGO® components are dropped, heated, crushed, twisted and rigorously analyzed to satisfy demanding safety standards."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/trouble-on-tatooine-75299","description":"Children will love teaming up with The Mandalorian and a Tusken Raider for desert missions with this LEGO® Star Wars™ Trouble on Tatooine set (75299). It features The Mandalorian’s speeder bike with a LEGO minifigure seat and saddlebag for the Child to sit in, plus a buildable Tusken hut and a new-for-January-2021, missile-shooting ballista for the Tusken Raider.\n\nRole-play action\nThis awesome kids’ building toy includes The Mandalorian and Tusken Raider LEGO minifigures, a LEGO figure of the Child (affectionately known as Baby Yoda), plus cool weapons to inspire hours of role-play fun. A great gift idea for young Star Wars: The Mandalorian fans, it comes with clear instructions so even LEGO first-timers can enjoy the building experience.\n\nGalaxy of delights\nSince 1999, the LEGO Group has been recreating iconic starships, vehicles, locations and characters from the Star Wars universe. LEGO Star Wars has become its most successful theme with a huge variety of sets to excite fans of all ages.\n\nKids can recreate scenes from Star Wars: The Mandalorian Season 2 and play out their own speeder-bike-riding, missile-shooting battle stories with this Trouble on Tatooine (75299) building toy.\nIncludes The Mandalorian and Tusken Raider LEGO® minifigures, each with weapons for role-play battles, plus a LEGO figure of the Child (the popular character affectionately known as Baby Yoda).\nThe speeder has a LEGO® minifigure seat and saddlebag for the Child to sit in. The set also features a buildable Tusken hut hideout and spring-loaded, missile-shooting ballista for the Tusken Raider.\nGreat for solo building and play or for sharing the fun with friends, this awesome construction toy makes the best birthday present, holiday gift or surprise treat for creative kids aged 7 and up.\nThe speeder measures over 1.5 in. (3 cm) high, 5 in. (13 cm) long and 1.5 in. (3 cm) wide, and this complete set combines brilliantly with other LEGO® Star Wars™ buildable playsets for creative play.\nThinking of buying this 277-piece set for a newcomer to LEGO® building? No worries. It comes with easy-to-follow illustrated instructions so they can build with confidence.\nThere are LEGO® Star Wars™ sets to thrill fans of all ages, whether they want to recreate famous scenes, role-play their own stories or just build and display the authentic construction models.\nLEGO® components meet the highest industry standards to ensure they are consistent and compatible for a simple, strong connection every time – it’s been that way since 1958.\nLEGO® bricks and pieces are tested to the max to make sure they meet stringent safety standards."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/at-at-vs-tauntaun-microfighters-75298","description":"Inspire young children to reimagine the Battle of Hoth from Star Wars: The Empire Strikes Back and play out their own stories with this AT-AT vs. Tauntaun Microfighters (75298) building set. It features a quick-to-build, posable AT-AT Walker and Tauntaun construction models for the 2 LEGO® minifigures to sit on.\n\nRole-play fun\nThe Luke Skywalker and AT-AT Driver LEGO minifigures each have a stud shooter and an electrobinoculars element, and Luke also has a lightsaber for battle play. This fun, creative set comes with clear instructions so even LEGO beginners can build with Jedi-like confidence, and it combines perfectly with the Millennium Falcon Microfighter (75295).\n\nWelcome to the LEGO Star Wars™ universe\nFor over two decades, the LEGO Group has been creating amazing, brick-built versions of iconic Star Wars starships, vehicles, locations and characters. This building toy makes an awesome birthday, holiday or surprise gift for young kids to introduce them to this action-packed galaxy of fun.\n\nKids can recreate the Battle of Hoth from Star Wars: The Empire Strikes Back and role-play their own stories with these quick-build, LEGO® brick AT-AT Walker and Tauntaun Microfighters.\nThis AT-AT vs. Tauntaun Microfighters (75298) set features 2 LEGO® minifigures: Luke Skywalker, with a lightsaber, and an AT-AT Driver. Each has a stud shooter and an electrobinoculars element.\nThe Tauntaun and the posable AT-AT each have a seat for a LEGO® minifigure, and the set combines brilliantly with the Millennium Falcon Microfighter (75295) for extra battle action.\nThis awesome 205-piece construction toy makes the best birthday present, holiday gift or unexpected treat for kids aged 6 and up to introduce them to the fun, creative LEGO® Star Wars™ universe.\nThe Tauntaun measures over 2.5 in. (7 cm) high, 3.5 in. (9 cm) long and 2 in. (5 cm) wide. Along with the AT-AT and LEGO® minifigures, the set fits in a child's backpack for play on their travels.\nThinking of buying this buildable playset for a young Star Wars™ fan who is a LEGO® beginner? No problem. It comes with easy-to-follow instructions so they can build independently.\nLEGO® Star Wars™ building toys are great for kids (and adult fans) to recreate Star Wars saga scenes, dream up their own unique stories or simply build and display the collectible construction models.\nNo need to use the Force to connect LEGO® bricks! Ever since 1958, they have met the highest industry standards to ensure consistency, compatibility and robust builds.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and thoroughly analyzed, ensuring that they satisfy some of the highest safety standards on planet Earth – and in galaxies far, far away!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/resistance-x-wing-75297","description":"Let youngsters learn to build and role-play with this LEGO® Star Wars™ Resistance X-wing (75297) for ages 4 and up. A simple-to-build version of the starfighter from Star Wars: The Force Awakens, this awesome building toy has wings that fold out for flight and in for landing. The Poe Dameron LEGO minifigure, which comes with a blaster pistol, fits in the X-wing's opening cockpit and there is space behind for the BB-8 droid LEGO figure.\n\nInstructions PLUS\nCheck out interactive Instructions PLUS, available in the free LEGO Building Instructions app. It has cool zoom and rotate viewing tools to make building this starfighter even more rewarding for kids.\n\nWelcome to 4+\nLEGO Star Wars 4+ buildable toy playsets give younger kids aged 4 and up the best introduction to LEGO building and the Star Wars saga. With Starter Brick bases to help them, they can construct vehicles, buildings and more – on their own, or with assistance from an older sibling or adult – and get playing fast.\n\nGive younger children a great first experience of LEGO® Star Wars™ with this Resistance X-wing (75297) construction toy, featuring a starter brick chassis for a quick build so the action starts fast.\nThe buildable starfighter toy comes with a Poe Dameron LEGO® minifigure with a blaster pistol, plus a BB-8 droid LEGO figure to inspire creative role-play fun.\nThe X-wing has an opening cockpit for Poe Dameron, space for BB-8 and wings that fold out for flight mode.\nEasy to build and rebuild after playtime battles, this 60-piece LEGO® Star Wars™ starter set makes the best birthday present, holiday gift or surprise treat for creative kids aged 4 and up.\nThis awesome starfighter building toy measures over 1.5 in. (5 cm) high, 6 in. (15 cm) long and 7.5 in. (19 cm) wide, so it can fit easily into a child's backpack ready for play on the go.\nThis is an ideal construction model for young children to attempt to build on their own or with the assistance of an older sibling or adult.\nMake building this starfighter extra exciting for children with Instructions PLUS, available in the free LEGO® Building Instructions app, featuring zoom and rotate viewing tools.\nLEGO® Star Wars™ 4+ building toys give kids a fun-packed introduction to the Star Wars universe, helping them learn to build and develop their creativity through play.\nLEGO® components satisfy the highest industry standards to ensure a consistent, secure connection and robust builds – it's been that way since 1958.\nLEGO® bricks and pieces are tested to the max to make sure they meet some of the most stringent safety standards on planet Earth – and in galaxies far, far away!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/brick-sketches-bb-8-40431","description":"Create an awesome 3-D illustration of BB-8 with this cool LEGO® Brick Sketches™ construction set (40431) for youngsters and all fans of the astromech droid. Built on a 12x16 baseplate, the portrait looks great displayed freestanding or the built-in hook can be used to hang it on a wall. An awesome birthday or holiday gift or surprise any-time present, it makes a great addition to any builder's collection of LEGO Brick Sketches character artworks.\nStar Wars™ fans young and old will enjoy creating and displaying a LEGO® brick-built artwork of the lovable Stars Wars droid BB-8 with this LEGO Brick Sketches™ construction model kit.\nA great gift idea for ages 8 and up, this 171-piece building set is part of the LEGO® Brick Sketches™ theme which features collectible, buildable, 3-D illustrations of iconic characters on 12x16 baseplates.\nLEGO® Brick Sketches™ BB-8 measures over 5” (13cm) high, 3” (9cm) wide and 1” (3cm) deep. It makes a striking display piece freestanding on the mantelpiece or hung by the built-in hook on a wall."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/first-order-stormtrooper-40391","description":"Show off the strength of the First Order with this LEGO® Brick Sketches™ First Order Stormtrooper (40391) construction set. This collectible, brick-built illustration of an iconic Star Wars character is created on a 12x16 baseplate and can be displayed standing up or hung by its built-in hook on a wall. An awesome birthday or holiday gift for kids and Star Wars fans, it makes a great addition to any builder's collection of LEGO Brick Sketches character portraits.\nYoung builders and any Star Wars™ fan will love creating and displaying a LEGO® brick-built portrait of a Stars Wars First Order Stormtrooper, with this LEGO Brick Sketches™ construction set.\nA super gift idea for ages 8 and up, this 151-piece construction kit is part of the LEGO® Brick Sketches™ theme, which features collectible, buildable, 3-D illustrations of iconic characters on 12x16 baseplates.\nThe LEGO® Brick Sketches™ First Order Stormtrooper measures over 5” (13cm) high, 3” (9cm) wide and 1” (3cm) deep. It will grab people’s attention whether hung by the built-in hook on a wall or displayed freestanding."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/millennium-falcon-microfighter-75295","description":"Give a young child an unexpected treat with this LEGO® Star Wars™ Millennium Falcon Microfighter (75295). Based on the iconic vehicle’s design in the classic Star Wars trilogy, this awesome brick-built toy has 2 stud shooters and a LEGO minifigure seat. The set also includes a Han Solo LEGO minifigure with his blaster pistol so kids can role-play as the Rebel hero in their everyday playtime adventures.\n\nEasy to build\nThere are step-by-step instructions so even LEGO beginners can build independently. This construction model also combines perfectly with the AT-AT vs. Tauntaun Microfighters (75298) set for extra battle action.\n\nThe LEGO Star Wars universe\nSince 1999, the LEGO Group has been recreating iconic starships, vehicles, locations and characters from the Star Wars universe. LEGO Star Wars has become its most successful theme with a wide variety of building toys that make the best gifts for kids and fans of all ages.\n\nYoung children can role-play as the Rebel hero from Star Wars™ in their own stories with this quick-to-build LEGO® Microfighters version of the Millennium Falcon from the classic Star Wars trilogy.\nThe Millennium Falcon Microfighter (75295) features a seat for the Han Solo LEGO® minifigure and 2 stud shooters, for fun, creative play. Han Solo also has a blaster pistol.\nThis buildable playset combines brilliantly with the AT-AT vs. Tauntaun Microfighters (75298) set to open up even more play options.\nEasy to build – and to rebuild after battles – this durable, 101-piece, building toy makes the best birthday present, holiday gift or fun surprise treat for creative kids aged 6+.\nThe Microfighter measures over 1.5 in. (4 cm) high, 3 in. (8 cm) long and 3 in. (7 cm) wide – a nice, compact size to slip into a child’s backpack ready for play on their travels.\nThinking of buying this set for a young Star Wars™ fan who is a LEGO® newcomer? No worries. It comes with illustrated, step-by-step instructions so they can build with confidence.\nLEGO® Star Wars™ building sets are awesome for kids (and adult fans) to recreate scenes from the Star Wars saga, make up their own adventures and/or display the collectible construction toys.\nEver since 1958, LEGO® components have met the highest industry standards to ensure they connect consistently – no need to use the Force.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet rigorous safety standards."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/imperial-star-destroyer-75252","description":"Build and display an icon of the Galactic Empire – the Devastator. With over 4,700 LEGO® pieces, this Ultimate Collector Series 75252 Imperial Star Destroyer model captures all the authentic details of the starship as it appeared in the opening scene of Star Wars: A New Hope, including swiveling guns, a tilting radar dish, huge engine exhausts, intricate surface detailing and of course a buildable scale version of the Rebels' Tantive IV starship to chase down. This galactic civil war UCS set also includes a display stand with informational fact plaque and 2 Imperial minifigures, making it the perfect LEGO Star Wars collectible for discerning fans.\n\nIncludes Imperial Officer and Imperial Crewmember minifigures.\nThe Devastator Imperial Star Destroyer model features swiveling guns, a tilting radar dish, huge engine exhausts and intricate surface detailing.\nAlso includes an attachable, buildable scale version Tantive IV starship for added Star Wars: A New Hope authenticity.\nWith a display stand with informational fact plaque for the ultimate display piece.\nAlso comes with 2 blaster pistol weapons.\nThis Ultimate Collector Series set has 4,784 pieces.\nInspire unforgettable Star Wars: A New Hope moments.\nThe perfect LEGO® Star Wars™ collectible for fans of the Star Wars saga.\nUCS model on display stand measures over 17” (44cm) high, 43” (110cm) long and 26” (66cm) wide, and over 14” (37cm) high without stand.\n\nFor this item FedEx will require an in-person direct signature at the time of delivery. FedEx will make three (3) delivery attempts before returning the shipment to LEGO. At which point, we ask that you please contact Consumer Services to discuss reshipping the item, or sending it to an alternative address where a signature can be obtained."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/a-wing-starfighter-75275","description":"Inspire memories of the classic Star Wars: Return of the Jedi movie with this cool Ultimate Collectors Series LEGO® A-wing Starfighter (75275) building set! The sleek, arrowhead shape is beautifully reproduced in LEGO bricks and fans will appreciate authentic details such as the pivoting laser cannons and new-for-May-2020 removable canopy on the cockpit.\n\nCool display piece\nA testing building challenge for ages 18+ to enjoy solo or with friends and family, this model comes with a display stand, information plaque and an A-wing Pilot minifigure. And look out for other collectible build-and-display models, including the Stormtrooper Helmet (75276) and Boba Fett Helmet (75277).\n\nUniverse of excitement!\nThe LEGO Group has been creating brick-built versions of iconic starships, vehicles, locations and characters from the Star Wars™ universe since 1999. LEGO Star Wars is its most successful theme, with building sets that make great birthday, Christmas or surprise gifts for fans of all ages.\n\nCreate a stunning display with the first-ever LEGO® Ultimate Collector Series version of the A-wing Starfighter (75275) from Star Wars: Return of the Jedi, featuring a new-for-January-2020 removable cockpit canopy!\nStar Wars™ fans will love authentic details such as the pivoting laser cannons. Also includes an adjustable display stand, information plaque and A-wing Pilot character to complete a striking Star Wars centerpiece.\nThis A-wing LEGO® set is part of the Star Wars™ Ultimate Collector Series (UCS). Also check out the brilliant Stormtrooper Helmet (75276) and Boba Fett Helmet (75277) build-to-display models.\nThis 1,673-piece LEGO® Star Wars™ A-wing fighter building set offers a fun, rewarding challenge for Star Wars fans aged 18+, and makes a fantastic birthday gift, Christmas present or special occasion surprise.\nMeasuring 10.5” (27cm) high including display stand, 16.5” (42cm) long and 10” (26cm) wide, this collectible LEGO® Star Wars™ A-wing fighter model is bound to make a big impression displayed at home or in the office.\nThis battery-free building set is a peaceful way for adults to unwind after a hard day at work. Forget your worries for a while, find your building Zen and create an incredible LEGO® Star Wars™ A-wing model!\nThinking of buying this A-wing Starfighter model kit for a Star Wars™ fan who is new to LEGO® sets? No worries. It comes with step-by-step instructions so they can take on this challenging build with confidence.\nThere is a huge variety of LEGO® Star Wars™ building sets to delight fans of all ages, whether they want to play out famous movie scenes, create their own epic stories or just build and display the awesome models.\nYou won’t need to use the Force to connect or pull apart LEGO® bricks! They meet the highest industry standards to ensure consistency and a perfect, easy connection.\nLEGO® bricks and pieces are tested in almost every way imaginable so you can be sure that this cool Star Wars™ A-wing fighter building set meets the highest safety standards on planet Earth (and in any galaxy!)."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/at-at-75288","description":"Relive the Battle of Hoth and other classic Star Wars™ trilogy scenes with this AT-AT (75288) LEGO® building kit for kids! Different sections of the All Terrain Armored Transport vehicle open up for easy play, and it has spring-loaded shooters, plus a speeder bike inside. Fans will also love authentic details such as a winch to pull up Luke and his thermal detonator element.\n\nThe Empire vs. Rebel Alliance\nThis action-packed set includes 6 LEGO minifigures – Luke Skywalker, General Veers, 2 AT-AT Drivers and 2 Snowtroopers. They all have weapons, including Luke’s Lightsaber and the Snowtroopers’ tripod gun, to inspire Star Wars role-play missions. A wonderful gift idea for any LEGO Star Wars collector, it’s great for solo or group play.\n\nLove for LEGO Star Wars sets!\nThe LEGO Group has been recreating iconic starships, vehicles, locations and characters from the Star Wars universe for more than two decades and LEGO Star Wars has become a hugely successful theme. What's not to love?\nFans of the classic Star Wars™ trilogy and the LEGO® Star Wars: The Skywalker Saga video game will love recreating Battle of Hoth action with this detailed, posable LEGO brick version of the iconic AT-AT (75288) Walker.\nThis fun, creative building toy for kids includes 6 LEGO® Star Wars™ minifigures – Luke Skywalker, General Veers, 2 AT-AT Drivers and 2 Snowtroopers, all with weapons to role-play the Empire vs. Rebel Alliance battles.\nThe AT-AT has a cockpit for 3 LEGO® minifigures, foldout panels, spring-loaded shooters, a speeder bike, winch, bottom hatch so Luke can throw in the thermal detonator element, and more for realistic, creative play.\nThis 1,267-piece set makes a super birthday present, holiday gift or special treat for boys and girls aged 10+ who can look forward to a rewarding building challenge and hours of fun solo or social play.\nThe AT-AT vehicle measures over 13” (34cm) high, 14.5” (38cm) long and 5.5” (15cm) wide. Fans can also drive it in the LEGO® Star Wars: The Skywalker Saga video game.\nNo batteries are needed for this Star Wars™ AT-AT Walker building kit – it’s constructed purely with LEGO® bricks and powered by kids’ imaginations for unlimited galactic adventures and creative fun.\nThinking of buying this awesome construction toy for a Star Wars™ fan new to LEGO® sets? No worries. It comes with step-by-step instructions so they can take on this complex building challenge with confidence.\nLEGO® Star Wars™ building toys are greatfor kids and adult fans to construct, display and recreate classic Star Wars saga scenes or create their own fun missions. There’s something for everyone!\nNo need to summon up the Force to connect or pull apart LEGO® bricks! They meet the highest industry standards so you can be assured that the bricks in this construction playset fit together perfectly and with ease.\nLEGO® bricks and pieces are heated, crushed, dropped, twisted and analyzed to ensure that every action-packed Star Wars™ set meets the highest quality and safety standards here on Earth – and in galaxies far, far away!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/millennium-falcon-75257","description":"Inspire youngsters and grownups with this 75257 LEGO® Star Wars™ Millennium Falcon model. This brick-built version of the iconic Corellian freighter features an array of details, like rotating top and bottom gun turrets, 2 spring-loaded shooters, a lowering ramp and an opening cockpit with space for 2 minifigures. The top panels also open out to reveal a detailed interior in which kids will love to play out scenes from the Star Wars: The Rise of Skywalker movie featuring Star Wars characters Finn, Chewbacca, Lando Calrissian, Boolio, C-3PO, R2-D2 and D-O. This iconic LEGO Star Wars set also makes a great collectible for any fan.\n\nIncludes 7 LEGO® Star Wars™ characters: Finn, Chewbacca, C-3PO, Lando Calrissian and Boolio minifigures, plus R2-D2 and D-O LEGO droid figures.\nLEGO® Star Wars™ Millennium Falcon model external features include a rotating top and bottom gun turrets (bottom turret fits 2 minifigures), 2 spring-loaded shooters, a lowering ramp and an opening cockpit with space for 2 minifigures.\nInterior details include a cargo area with 2 containers, navigation computer with rotating chair, couch and Dejarik hologame table, galley, bunk, hidden smuggling compartment and a hyperdrive with repair tools.\nWeapons include Chewbacca’s stud-firing bowcaster, Finn’s blaster and Lando’s blaster.\nInspire role-play scenes from the Star Wars: The Rise of Skywalker movie with the legendary Corellian freighter.\nThis LEGO® Star Wars™ set makes a great birthday gift, Christmas present or just a Star Wars collectible for any occasion.\nStarship measures over 5” (14cm) high, 17” (44cm) long and 12” (32cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/darth-vader-s-castle-75251","description":"Set the scene for action on planet Mustafar with LEGO® Star Wars 75251 Darth Vader’s Castle! This building set of Vader’s menacing-looking home features lots of great details, including a brick-built lava flow, an underground hangar with mouse droid and docking station, ancient Sith shrine with holocron, racks for extra ammunition, and secret compartments hiding more Sith relics. The hangar also houses a buildable TIE Advanced Fighter model with stud shooters and space to sit the Darth Vader minifigure. There’s also a bacta tank, Darth Vader’s meditation chamber with holographic communication unit, and a meeting platform at the top with a defensive stud-shooter cannon. As well as classic Darth Vader, the set also includes a bacta tank version of the Dark Lord, plus 2 Royal Guards and an Imperial Transport Pilot.\n\nIncludes 5 minifigures: Darth Vader, Darth Vader (bacta tank), 2 Royal Guards and an Imperial Transport Pilot.\nFeatures Darth Vader’s Castle and a buildable version of Vader’s TIE Advanced Fighter.\nUnderground hangar with mouse droid and docking station, ancient Sith shrine with holocron, racks for extra ammunition, Sith relics, secret compartments hiding a Lightsaber handle and a red kyber crystal element, plus space for Vader’s TIE Advanced Fighter.\nCastle also features a side access door, opening bacta tank, a hook for Lord Vader’s cape, meditation chamber with space for a minifigure and holographic communication unit, plus a circular meeting area at the top with a defensive stud-shooter cannon.\nTIE Advanced Fighter features 2 stud shooters and an opening minifigure cockpit.\nWeapons include Darth Vader’s red Lightsaber, the Imperial Transport Pilot’s blaster pistol and the Royal Guards’ Force pikes.\nDarth Vader’s Castle Star Wars building set measures over 16” (41cm) high, 11” (28cm) wide and 9” (23cm) deep.\nTIE Advanced Fighter measures over 2” (6cm) high, 4” (11cm) wide and 3” (9cm) long."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/kylo-ren-s-shuttle-75256","description":"Play out space-faring LEGO® Star Wars™ adventures with 75256 Kylo Ren’s Shuttle. This brick-built version of the Supreme Leader’s personal transport ship from the Star Wars: The Rise of Skywalker movie has lots of details to excite kids and collectors alike, such as a rotatable right engine for folding in the wings when landing and the ability to shorten the wings by folding the top part down. There's also an opening access ramp, 2 spring-loaded shooters and a cockpit with space to sit Supreme Leader Kylo Ren and 2 minifigures behind. As well as the Supreme Leader, this great LEGO Star Wars ship also includes General Pryde, a Sith Trooper, First Order Stormtrooper and 2 Knights of Ren for instant play action.\n\nIncludes 6 LEGO® Star Wars™ minifigures: Supreme Leader Kylo Ren, General Pryde, a Sith Trooper, a First Order Stormtrooper and 2 Knights of Ren.\nKylo Ren’s command shuttle features rotatable right engine for folding in the wings when landing, the ability to shorten the wings by folding the top part down, 2 spring-loaded shooters, lowering access ramp and a 3-minifigure cockpit.\nWeapons include Kylo Ren's Lightsaber, General Pryde's blaster pistol, the Sith Trooper's blaster rifle, the First Order Stormtrooper’s blaster and the Knights of Ren’s axe and mace.\nIncludes a new-for-October-2019 Knights of Ren helmet design.\nInspire role-play scenes from the Star Wars: The Rise of Skywalker movie with Kylo Ren’s personal transport ship.\nMakes a great birthday gift, Christmas present or just a Star Wars™ gift for any occasion.\nLEGO® Star Wars™ ship with wings extended measures over 13” (35cm) high, 8” (21cm) long and 19” (50cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/star-wars-the-sith-31200","description":"If you’re a Star Wars™ fan, this is a great set for you. Create an iconic art piece with this LEGO® Art Star Wars The Sith (31200) set. Enjoy a well-earned break as you make a special display piece for your home or office.\n\nCreative building project\nCelebrate the Sith Lords, Darth Maul, Kylo Ren and Darth Vader, with this 3in1 portrait set. If you want more, you can buy and combine 3 sets into an ultimate Darth Vader wall piece. While you build, listen to the included Soundtrack to enjoy details and audio stories linked to the set. Finish the build with the Star Wars signature plate, then display on a wall or shelf.\n\nHands-on, minds on\nYou don’t need to be a painter or have lots of LEGO models to enjoy building this portrait kit. Once you’re done, you’ll have a piece you can be proud to display. This LEGO set is part of a collection of inspiring building kits for adults interested in pop culture, art, design and architecture. The sets also make a great gift for anyone – including yourself.\n\nImmerse yourself in this LEGO® Art Star Wars™ The Sith (31200) canvas art set for adults, featuring a model with 3 build options. Display iconic Star Wars Sith Lords on your wall or shelf after you create it.\nExplore your creative ‘dark side’ with a 3,395-piece LEGO® set that includes 9 canvas wall decor plates, a Star Wars™ signature plate, brick-built LEGO frame, unique new hanging element and piece separator.\nReimagine these epic Sith Lords and relieve stress as you create a unique LEGO® portrait. With the complementary Soundtrack, you can dive deep into the build with fun Star Wars™-related stories and interviews.\nEnjoy the appeal of iconic Sith Lords while building this unique LEGO® kit. To really push your creativity, buy and combine 3 of the sets to create an ultimate Darth Vader wall piece to display in your home or office.\nThis 3in1 LEGO® Art set measures over 15.5” (40cm) square. Display it on a wall or shelf, where its details help it stand out. It also makes a great gift for you or another creative builder who may be a Star Wars™ fan.\nNo batteries needed. This art set for adults offers an immersive build with LEGO® pieces and the informative Soundtrack. Escape your daily routine, have some creative fun and make an incredible display piece.\nThe coffee-table-quality instructions guide you through the project, starting with a deep dive into Darth Vader before you begin building. Enjoy the Soundtrack, made for this LEGO® set, while you assemble the piece.\nPerfect for display on a wall or shelf, this LEGO® Art portrait of iconic Sith Lords offers you a rewarding building experience while you explore your passion for creative arts and crafts.\nLEGO® building pieces meet exacting quality standards, which ensures they are consistent, compatible and work every time – it’s been that way since 1958.\nLEGO® pieces are tested to ensure that every LEGO Art building set meets strict safety standards, helping to ensure that this Star Wars™ The Sith wall decor piece is as robust as it is beautiful."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/death-star-final-duel-75291","description":"Kids can play out the epic Death Star Final Duel (75291) between Luke Skywalker and Darth Vader with this LEGO® Star Wars: Return of the Jedi building set. Emperor Palpatine’s throne room has many cool features to inspire creative fun, including a LEGO minifigure Force-jump function. The stairs and bridge can also be collapsed, and Darth Vader can throw the Emperor in the reactor shaft just like in the classic scene.\n\nRole-play action\nThis Death Star construction kit offers a testing building challenge and includes 5 LEGO Star Wars™ minifigures with Lightsabers and force pikes for fans to role-play action-packed battles. It also comes with a code to unlock a character in the LEGO Star Wars: The Skywalker Saga video game.\n\nGreat gift ideas\nSince 1999, the LEGO Group has been recreating iconic starships, vehicles, locations and characters from the Star Wars universe. LEGO Star Wars is now its most successful theme with exciting gift ideas to suit fans of all ages.\n\nStar Wars: Return of the Jedi fans can recreate the epic Lightsaber battle between Luke Skywalker and Darth Vader in Emperor Palpatine’s throne room with this Death Star Final Duel (75291) building toy.\nThis LEGO® Star Wars™ Death Star final duel set comes with 5 LEGO minifigures – Darth Vader, Luke Skywalker and Emperor Palpatine with Lightsabers, plus 2 Imperial Royal Guards with force pikes, to inspire battle action.\nThe throne room folds out for easy play and has lots of fun features including a LEGO® minifigure Force-jump function, collapsing stairs and bridge, rotating throne and a reactor shaft.\nThis 775-piece Death Star construction kit offers a challenging and rewarding build for kids aged 9+. It makes an ideal birthday present or holiday gift and combines brilliantly with other LEGO® Star Wars™ sets.\nThis buildable Death Star playset measures over 5.5” (14cm) high, 8.5” (22cm) long and 12.5” (31cm) wide. Use the code in the building instructions to unlock a character in the LEGO® Star Wars: The Skywalker Saga video game.\nNo batteries are needed with this awesome kids’ building toy – it’s built purely from LEGO® bricks and powered by children’s imaginations so the fun, creative play never stops.\nThinking of buying this action-packed Star Wars™ set for someone new to LEGO® construction? No problem. It comes with easy-to-follow instructions so they will be building with Jedi-like confidence in no time.\nLEGO® Star Wars™ sets are great fun for kids (and adult fans) who can recreate scenes from the Star Wars saga, make up their own original galactic adventures or simply display these awesome construction toys.\nEver since 1958, LEGO® bricks have met the highest industry standards so they are robust, connect perfectly and pull apart easily every time – no need to use the Force!\nLEGO® bricks and pieces are tested in almost every way imaginable so you can be sure that this Death Star construction playset meets the highest safety and quality standards on Earth – and in galaxies far, far away!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/resistance-i-ts-transport-75293","description":"Young Resistance fighters can play out heroic missions with this LEGO® brick-built model of the Resistance I-TS Transport (75293) from Star Wars: Galaxy's Edge – a new land at Walt Disney World Resort and the Disneyland Resort. The top of the shuttle lifts off and the sides open for easy play, and there are 4 rotating stud shooters by the cockpit and 4 rear stud shooters for battle action.\n\nUnlimited creative play\nGreat for solo building and play or sharing the fun with friends, the set includes 4 Star Wars™ characters: Lieutenant Bek and Vi Moradi, plus Astromech Droid and GNK Power Droid LEGO figures. This construction toy also makes an awesome display piece and it combines with other LEGO Star Wars sets for even more creative fun.\n\nTop gift ideas\nThe LEGO Group has been recreating iconic starships, vehicles, locations and characters from the legendary Star Wars universe since 1999. LEGO Star Wars is now its most successful theme with top gift ideas for kids and adults.\n\nRecreate the excitement of Disney’s Star Wars™ theme park Galaxy’s Edge in LEGO® style with this fantastic LEGO Star Wars Resistance I-TS Transport (75293) building toy for kids.\nThis brick-built Star Wars™ playset includes Lieutenant Bek and Vi Moradi LEGO® minifigures, plus Astromech Droid and GNK Power Droid LEGO figures, for fun, creative solo or group role play.\nThe top of the shuttle lifts off and it has opening sides for easy play. It has a LEGO® minifigure cockpit, cargo hold with space for the droids, plus 4 rotating stud shooters and 4 rear stud shooters for battle action.\nThis 932-piece construction toy offers a fun and rewarding building challenge for kids aged 9+ and makes an awesome birthday present or holiday gift for any Star Wars™ enthusiast.\nThe Resistance I-TS Transport measures over 3” (8cm) high, 13.5” (34cm) long and 6.5” (17cm) wide and makes a striking centerpiece in any room when it's not being deployed on playtime Resistance missions!\nNo batteries are needed with this Galaxy’s Edge building toy – it’s constructed purely from LEGO® bricks and powered by kids’ free-thinking creativity for unlimited Star Wars™ action adventures.\nBuying this Galaxy’s Edge merchandise for a big Star Wars™ fan who is a LEGO® beginner? Don't worry. It comes with step-by-step, illustrated instructions so they can open the box and build with Jedi-like confidence.\nLEGO® Star Wars™ building toys are the best for kids (and adult fans) to recreate scenes from the saga, dream up original stories or just build and proudly display the collectible construction models.\nNo need to use the Force to connect or pull apart LEGO® bricks! Ever since 1958, they have met the highest industry standards to ensure they fit together with ease to create robust builds.\nLEGO® bricks and pieces are tested to the absolute max so you can be sure that this building toy for kids meets the highest quality and safety standards on planet Earth – and in galaxies far, far away!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/yoda-75255","description":"Add to any fan’s collection with two Yoda LEGO® Star Wars™ characters in one set! This intricately detailed 75255 display model of powerful Jedi Master Yoda is based on the character from Star Wars: Attack of the Clones, and includes a posable head and eyebrows, moving fingers and toes, and Yoda's signature green Lightsaber. This characterful LEGO Star Wars figure also includes a fact plaque with details about Yoda and a stand to mount the included Yoda minifigure with Lightsaber, making for an ideal Star Wars collectible for any fan.\n\nFeatures intricate detailing, posable head and eyebrows, movable fingers and toes, Yoda’s green Lightsaber, as well as a fact plaque with details about the Jedi master and a stand for the included Yoda minifigure and Lightsaber.\nThis Star Wars: Attack of the Clones collectible makes a great birthday gift, Christmas present or just a Star Wars™ present for any occasion.\nCollect two Yoda LEGO® Star Wars™ characters in one set!\nLEGO® Star Wars™ Yoda figure with Lightsaber stands over 16” (41cm) tall."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/poe-dameron-s-x-wing-fighter-75273","description":"Let your youngster feel like Resistance hero Poe Dameron with this X-wing fighter (75273)! Fans will love the sleek new-for-January-2020 design, just like the X-wing in Star Wars: The Rise of Skywalker. It’s got loads of play-inspiring features – adjustable wings for cruise and attack modes, shooting functions, retractable landing gear and more! Resistance vs. First Order battles! This cool starfighter comes with 3 minifigures – Poe Dameron, Knight of Ren, Jannah – with weapons, plus R2-D2 to inspire Resistance vs. First Order role-play. An epic gift idea for any young Star Wars™ fan, this construction playset is great for solo or group play and add the 75272 Sith TIE Fighter for even more action. Star Wars action in LEGO style! The LEGO Group has been creating brick-built versions of iconic Star Wars starfighters, vehicles, locations and characters since 1999. It's become a hugely successful theme with a fantastic variety of sets to thrill fans of all ages – so join in the fun!\nKids can role-play as Resistance hero Poe Dameron and fly into battle with this new-for-January-2020 LEGO® Star Wars™ version of the classic X-wing starfighter (75273) from Star Wars: The Rise of Skywalker.\nLoads of play-inspiring features including an opening minifigure cockpit, space for R2-D2, adjustable wings for cruise and attack mode, stud and spring-loaded shooters and retractable landing gear.\nIncludes an R2-D2 LEGO® droid plus 3 Star Wars™ character toy minifigures – Poe Dameron, Knight of Ren and Jannah – with new-for-January-2020 features, plus blaster pistols, a bowcaster and other weapons for battles.\nThis 761-piece LEGO® Star Wars™ set makes a great gift idea and offers a fun, rewarding building challenge for boys and girls aged 9+. Add the Sith TIE Fighter (75273) for epic First Order vs. Resistance battles.\nThe X-wing fighter building toy measures over 3” (8cm) high, 14” (37cm) long and 12” (32cm) wide so it makes an eye-catching centerpiece to show off to friends when it’s not being flown on Resistance missions!\nThis collectible X-wing LEGO® set is powered by creative kids’ free-thinking – no batteries required – so the action adventures never stop!\nIs your youngster new to LEGO® sets? Don’t worry. This X-wing building toy comes with easy-to-follow, printed instructions so they can open the box, start building straightaway… and feel Jedi-level awesome!\nLEGO® Star Wars™ construction toys are great for kids (and adult fans) to build and display, recreate scenes from the memorable Star Wars saga and create their own unique stories.\nEver since 1958, LEGO® bricks have met the highest industry standards, which ensures they are consistent and that they connect and pull apart easily every time – no need to use the Force!\nLEGO® bricks and pieces are tested in almost every way imaginable to make sure that every building set meets the highest safety standards here on planet earth (and in galaxies far, far away!)."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/general-grievous-s-starfighter-75286","description":"Open up a galaxy of creative play adventures with this awesome LEGO® Star Wars™ spacecraft building toy for kids: General Grievous’s Starfighter (75286)! Fans will love the authentic, play-inspiring features such as the opening cockpit, spring-loaded shooters and retractable landing gear.\n\nGeneral Grievous vs. Obi-Wan\nThis building set comes with 3 LEGO® minifigures – General Grievous, Obi-Wan Kenobi and an Airborne Clone Trooper with weapons for youngsters to role-play classic action battles from Star Wars: Revenge of the Sith or create their own original stories. A super gift idea for any young Star Wars fan, this building kit is great for solo or group play and makes a fine addition to any LEGO collection.\n\nStar Wars action in LEGO style!\nThe LEGO Group has been creating brick-built versions of iconic Star Wars starfighters, vehicles, locations and characters since 1999. It's become a hugely successful theme with a fantastic variety of fun construction toys to thrill fans of all ages.\n\nKids can stage epic General Grievous vs. Obi-Wan Kenobi battles with this construction playset featuring General Grievous’s Starfighter (75286) from Star Wars: Revenge of the Sith.\nThis awesome building toy for kids includes 3 LEGO® Star Wars™ minifigures – General Grievous, Obi-Wan Kenobi with a Lightsaber, and an Airborne Clone Trooper with a blaster – to role-play fun, creative stories.\nGeneral Grievous's Starfighter features an opening LEGO® minifigure cockpit, 2 spring-loaded shooters and retractable landing gear to spark fans’ imaginations as they play solo or share the fun with friends.\nThere are lots of ways to play with this 487-piece set, making it a great birthday present or holiday gift for boys and girls aged 9+ to introduce them to LEGO® Star Wars™ building toys or expand their collection.\nThis construction model measures over 3” (8cm) high, 11.5” (30cm) long and 6.5” (17cm) wide. Fans can also fly it in the LEGO® Star Wars: The Skywalker Saga video game.\nNo batteries required! This popular LEGO® Star Wars™ spacecraft building toy is powered by kids’ imaginations, so they can use the starfighter and LEGO minifigures to play out the best galactic adventures.\nThinking of buying this spacecraft building kit for a Star Wars™ fan who is new to LEGO® sets? No worries. It comes with illustrated, step-by-step instructions so they can build independently and feel Jedi-level awesome!\nThere are LEGO® Star Wars™ sets to delight fans of any age, whether they want to recreate classic action from the saga, role-play their own stories or simply build and display the spectacular construction models.\nEver since 1958, LEGO® bricks have met the highest industry standards, which ensures they are consistent and connect and pull apart easily every time – no need to use the Force!\nLEGO® bricks and pieces are tested in almost every way imaginable so you can be sure that this Star Wars: Revenge of the Sith building set meets the highest safety standards here on planet Earth – and in galaxies far, far away!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/sith-tie-fighter-75272","description":"Open up a galaxy of adventures for youngsters with this super-sleek LEGO® brick model (75272) of the Sith TIE Fighter from Star Wars: The Rise of Skywalker! It has a minifigure cockpit so kids can pretend to be a First Order TIE fighter pilot firing the spring-loaded shooters. There's also a docking tower to recreate launch and landing… or to display this striking building toy. First Order vs. Resistance battles! A great gift idea for kids, this building kit also includes 3 minifigures – First Order TIE Pilot, Knight of Ren and Finn – with cool weapons to inspire children to role-play their own First Order vs. Resistance battles. And you can add 75273 Poe Dameron's X-wing Fighter™ for yet more exciting play possibilities. Lots of love for LEGO Star Wars™ sets! The LEGO Group has been recreating iconic starships, vehicles, locations and characters from the Star Wars universe for more than two decades and LEGO Star Wars has become a hugely successful theme. Everyone loves it!\nLet kids fly First Order pilot missions with this buildable Sith TIE fighter model (75272) featuring a slick, new-for-January-2020 design, just like in Star Wars: The Rise of Skywalker!\nThe TIE fighter features an opening minifigure cockpit and 2 spring-loaded missiles. There's also a docking tower for launch, landing and to display the construction model, plus 3 minifigures for role-play action.\nThe First Order TIE Pilot, Knight of Ren and Finn minifigures have cool weapons, and this set combines brilliantly with Poe Dameron's X-wing Fighter (75273) for epic First Order vs. Resistance battles.\nThis 470-piece set with iconic Star Wars™ characters offers a fun and rewarding building challenge for boys and girls aged 9+, and makes a super gift for kids on birthdays, at Christmas or as a special treat.\nThe Star Wars™ TIE fighter build measures over 8” (21cm) high, 9” (24cm) long and 8” (22cm) wide so it makes a striking construction model to display in any room when not being flown on First Order missions!\nNo batteries are needed with this fun TIE fighter building toy playset – it’s constructed purely from LEGO® bricks and powered by kids’ creativity for unlimited Star Wars™ action adventures.\nThinking of buying this Star Wars™ building toy for someone new to LEGO® sets? No problem. It comes with easy-to-follow, printed building instructions. Open the box and away they go!\nLEGO® Star Wars™ collectible construction toys are great for kids (and adult fans) to build and display, recreate favorite scenes from the saga and create unique stories with iconic Star Wars characters.\nNo need to use the Force to connect or pull apart LEGO® bricks! They meet the highest industry standards to ensure consistency and a perfect, easy connection.\nLEGO® bricks and pieces are heated, crushed, dropped, twisted and analyzed to ensure that every building set meets the highest safety standards here on earth (and in galaxies far, far away!)."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/the-child-75318","description":"Turn the cuteness factor up to the max with this LEGO® Star Wars™ The Child (75318) build-and-display model. Authentic details of this popular character, affectionately known as Baby Yoda, are recreated in LEGO style, with posable head, ears and mouth for different expressions, plus the Child’s favorite toy – a gearshift knob (element included) – for it to hold just like it does in Star Wars: The Mandalorian.\n\nTotally charming\nA super gift idea for kids aged 10+ and any Star Wars fan, it includes clear building instructions so even LEGO beginners can enjoy the fun, creative process. This buildable model also comes with an information sign and the Child LEGO minifigure to complete a charming display.\n\nLEGO Star Wars for all!\nThe LEGO Group has been recreating iconic starships, vehicles, locations and characters from the legendary Star Wars universe since 1999. LEGO Star Wars has become a hugely successful theme, with a wide range of sets for play and display to excite fans of all ages.\n\nFans can build their own charming, brick-built toy model of The Child (75318) from Star Wars: The Mandalorian, reproducing authentic details in LEGO® style to create a delightful display piece.\nThis new-for-November-2020 buildable model captures all the cute features of this hugely popular little Star Wars™ character, including a posable head, movable ears and an adjustable mouth for different expressions.\nThe set includes a gearshift knob element – the Child’s favorite toy – which can be placed in its hand, plus an information sign and the Child LEGO® minifigure to complete a delightful display.\nThis 1,073-piece, collectible LEGO® Star Wars™ building toy makes the best birthday gift, Christmas or holiday present or special occasion surprise for kids aged 10+ and all Star Wars: The Mandalorian fans.\nMeasuring over 7.5” (19cm) high, 8.5” (21cm) wide and 5” (13cm) deep, this brick-built model of the Child won’t take up too much space, but is sure to make a big visual impact wherever it is displayed.\nPiecing together this battery-free building toy is a great way to relax on your own or with family and friends. So take your time and enjoy creating a fantastic Star Wars™ build-and-display model.\nThinking of buying this for a Star Wars™ fan who is new to LEGO® building kits? No worries. It comes with step-by-step, illustrated instructions so they can take on this challenge with confidence.\nThere are LEGO® Star Wars™ sets to thrill fans of all ages, whether they want to recreate famous scenes, role-play their own stories or simply build and display the authentic replica construction models.\nNo need to summon the Force to connect or pull apart LEGO® bricks! They meet the highest industry standards to ensure consistency and a perfect, easy connection.\nLEGO® bricks and pieces are comprehensively tested and analyzed so you can be sure that this collectible LEGO Star Wars™ construction toy meets the highest safety standards on Earth – and in galaxies far, far away!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/d-o-75278","description":"Spark memories of exciting Star Wars: The Rise of Skywalker movie scenes with this cool LEGO® Star Wars™ D-O (75278) droid building toy. Authentic details of this lovable Star Wars character are superbly recreated with LEGO bricks and fans will be delighted by D-O's 360-degree-rotating and tilting head, and posable antennas.\n\nDesigned for display\nThis LEGO set includes a built-in stand for the construction model, plus an information sign with a cute D-O minifigure to make an eye-catching display at home or in a workplace.\n\nWelcome to the LEGO Star Wars universe\nThe LEGO Group has been recreating iconic starships, vehicles, locations and characters from the legendary Star Wars universe since 1999. LEGO Star Wars is its most successful theme with cool gift ideas for all ages, so why not join in the fun?\n\nFans can build their own collectible model of the lovable D-O (75278) droid from the Star Wars: The Rise of Skywalker movie, reproducing authentic details in LEGO® style to create a fantastic build-and-display piece.\nThe model has posable antennas and its head tilts and rotates 360 degrees just like the Star Wars™ character. It comes with a built-in display stand, plus an information sign and D-O minifigure to delight collectors.\nThis D-O droid build-and-display model is new for May 2020 and makes a delightful addition to any Star Wars™ fan or LEGO® builder’s collection.\nThis cool, 519-piece LEGO® Star Wars™ droid building toy is great fun for creative Star Wars fans aged 10+, and makes the best birthday gift, Christmas present or special occasion surprise.\nThe buildable D-O droid measures 10.5” (27cm) high, 4” (10cm) wide and 6” (16cm) deep – it doesn't take up too much space but will make a big impression displayed at home or in the office for friends to admire.\nThis cool, battery-free building toy offers a stress-relieving building experience. So take time out and enjoy constructing a fantastic Star Wars™ character build-and-display model on your own, with family or friends.\nThinking of buying this D-O model for a Star Wars™ fan new to LEGO® sets? No worries. It comes with clear, step-by-step instructions so they can take on this building challenge with Jedi-level confidence.\nLEGO® Star Wars™ construction kits are great for fans of all ages to buildand display the models, recreate epic scenes from the Star Wars saga and create their own exciting stories. There’s something for everyone!\nEver since 1958, LEGO® bricks have met the highest industry standards, which ensures that they connect strongly and pull apart easily – no need to use the Force!\nLEGO® bricks and pieces are tested in almost every way imaginable to ensure that this Star Wars™ D-O construction toy meets the highest safety standards on Earth (and in any other galaxy you travel to!)."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/knights-of-ren-transport-ship-75284","description":"Fans can relive epic Star Wars: The Rise of Skywalker action scenes with this Knights of Ren Transport Ship (75284) LEGO® building set. Hidden ‘skis’ underneath this Star Wars™ villains’ starship replicate the hover effect, and it has 2 opening cockpits for the Knights of Ren, a compartment for a captured LEGO minifigure and 2 spring-loaded shooters to inspire creative play.\n\nKnights of Ren vs. Rey\nBrilliant for solo or group play, this spacecraft building kit comes with 3 LEGO Star Wars minifigures – Rey and 2 Knights of Ren – for role-play battles. It combines brilliantly with other LEGO Star Wars construction playsets for even more creative fun and it makes an eye-catching display piece in any room between playtime missions.\n\nGreat gifts!\nThe LEGO Group has been recreating iconic starships, vehicles, locations and characters from the legendary Star Wars universe since 1999. LEGO Star Wars is now its most successful theme with top birthday, holiday and surprise gifts for kids and adults.\nRecreate battles from Star Wars: The Rise of Skywalker with this awesome Knights of Ren Transport Ship (75284) LEGO® building toy for kids.\nThis spacecraft building kit includes 3 LEGO® Star Wars™ minifigures – 2 Knights of Ren with new-for-August-2020 helmets and lots of weapons, and Rey with a Lightsaber – to role-play stories solo or with friends.\nThe space vehicle building toy has ‘skis' underneath for a hover effect, opening LEGO® minifigure cockpits for each of the Knights, a compartment to keep Rey captive, and 2 spring-loaded shooters for fun battles.\nThis 595-piece set offers a fun, creative and rewarding building challenge for boys and girls aged 9+ and makes a super holiday gift, birthday present or special surprise for kids and any Star Wars™ enthusiast.\nThis Star Wars™ spacecraft construction toy measures over 3.5” (8cm) high, 11.5” (29cm) long and 6.5” (17cm) wide. Fans can also fly it in the LEGO® Star Wars: The Skywalker Saga video game.\nNo batteries are needed for this fun space vehicle building toy – it’s constructed purely from LEGO® bricks and powered by kids’ creativity for unlimited Star Wars™ role-play adventures.\nBuying this cool Star Wars™ villains’ vehicle for a big Star Wars fan who is a LEGO® beginner? Don't worry. It comes with easy-to-follow, illustrated instructions so they can build with Jedi-like confidence.\nLEGO® Star Wars™ building kits are fantastic for kids (and adult fans) to recreate scenes from the saga, play outtheir own creative stories or just build and display the collectible construction models.\nNo need to use the Force to connect or pull apart LEGO® building bricks! Ever since 1958, they have met the highest industry standards to ensure they fit together with ease.\nLEGO® bricks and pieces are tested to the max so you can be sure that this Star Wars: The Rise of Skywalker set meets the highest quality and safety standards on planet Earth – and in galaxies far, far away!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/resistance-y-wing-starfighter-75249","description":"Inspire young minds and collectors with this LEGO® Star Wars™ 75249 Resistance Y-Wing Starfighter model. This updated version of the classic fighter-bomber, a.k.a. wishbone, featured in the Star Wars: The Rise of Skywalker movie, has a new-for-October-2019 color scheme, opening cockpit with space for a minifigure inside, firing spring-loaded shooters and dropping bombs that will inspire kids to create action-packed Star Wars scenes with their friends. With Poe Dameron, Zorii Bliss and First Order Snowtrooper Star Wars characters, plus D-O and astromech droid LEGO figures, this starship playset makes a great addition to any fan’s collection.\n\nIncludes 5 LEGO® Star Wars™ characters: Poe Dameron, Zorii Bliss and First Order Snowtrooper minifigures, and D-O and astromech droid LEGO figures.\nStar Wars™ Resistance Y-wing Starfighter, a.k.a. wishbone, features an opening minifigure cockpit, folding landing gear, 2 spring-loaded shooters and top-loaded bombs with trigger-activated release.\nWeapons include Poe's blaster pistol, Zorii's 2 blaster pistols and the First Order Snowtrooper's blaster.\nThe Y-wing's color scheme and Zorii's molded helmet are new for October 2019.\nRecreate exciting moments from the Star Wars: The Rise of Skywalker movie.\nThis starship makes a great birthday gift, Christmas present or just a fun Star Wars™ gift for any occasion.\nStar Wars™ building set measures over 2” (7cm) high, 16” (43cm) long and 7” (19cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/boba-fett-helmet-75277","description":"Build and display a LEGO® clone of one of the galaxy’s deadliest bounty hunters with this Boba Fett Helmet (75277) model kit! It’s a super LEGO Star Wars™ gift idea for adult fans and offers a testing challenge for experienced LEGO builders, with the familiar shape and authentic details of the helmet beautifully recreated using LEGO bricks.\n\nBuild to display\nThis LEGO Boba Fett collectible has a base with a nameplate to display it at home, in the office or wherever else you like in the galaxy. For another building challenge, check out the new-for-January-2020 LEGO Star Wars Stormtrooper Helmet (75276) model kit.\n\nStar Wars action for all!\nThe LEGO Group has been creating brick-built versions of iconic Star Wars starships, vehicles, locations and characters since 1999. LEGO Star Wars has become a hugely successful theme, with a vast array of building sets to thrill fans of all ages, so why not get involved?\n\nPay homage to one of the most fearsome bounty hunters in the Star Wars™ universe and challenge your LEGO® building skills to construct this awesome Boba Fett Helmet (75277) memorabilia model for display.\nThe authentic details of the Boba Fett Helmet are beautifully reproduced with LEGO® bricks. Displayed on its base with nameplate, this model will spark memories of thrilling Star Wars™ scenes.\nThis Boba Fett Helmet is part of a range of collectible LEGO® Star Wars™ build-and-display models – also watch out for the Stormtrooper Helmet (75276).\nThe best birthday gift, Christmas present or special surprise for Star Wars™ fans aged 18+ and any experienced LEGO® builder, this 625-piece Star Wars Boba Fett Helmet offers a challenging construction project.\nThis LEGO® Star Wars™ Boba Fett Helmet measures 8.5” (21cm) high, 4.5” (11cm) wide and 4.5” (11cm) deep – it doesn’t take up lot of space, but its striking details are sure to delight any Star Wars fan.\nThis cool, battery-free construction set for creative adults offers a stress-relieving, relaxing build. So, take time out, find your building Zen and construct a fantastic Star Wars™ character build-and-display model!\nThinking of buying this Boba Fett memorabilia for a Star Wars™ fan new to LEGO® sets? No worries. It comes with clear, step-by-step instructions so they can take on this complex building challenge with confidence.\nLEGO® Star Wars™ construction sets are great for kids and adult fans to build and display the models, recreate classic Star Wars movie scenes and create their own exciting stories. There’s something for everyone!\nNo need to use the Force to connect or pull apart LEGO® bricks! They meet the highest industry standards to ensure consistency and a perfect, easy connection.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and analyzed to ensure that this LEGO Star Wars™ set meets the highest safety standards on Earth (and in galaxies far, far away!)."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/stormtrooper-helmet-75276","description":"Test your construction skills and spark memories of epic Star Wars™ scenes with this super-detailed LEGO® Star Wars Stormtrooper Helmet (75276) building set! The Stormtrooper’s sinister look is reproduced in detail with LEGO bricks plus graphics stickers, and the helmet comes with a base and nameplate to show it off at home or as an eye-catching office desk ornament.\n\nCollectible series\nThis Stormtrooper Helmet model kit is a great gift idea for Star Wars fans aged 18+ and offers a fun challenge for any experienced LEGO builder. It’s part of a new-for-January-2020, collectible series of cool LEGO Star Wars build-to-display model kits, including the Boba Fett Helmet (75277).\n\nLots of love for LEGO Star Wars sets! The LEGO Group has been recreating iconic Star Wars starships, vehicles, locations and characters for more than two decades, and LEGO Star Wars has become its most successful theme. Kids love it, adults love it… everyone loves it!\n\nStar Wars™ fans can show off their loyalty to the Empire – and elite LEGO® building skills – when they construct and display this stunningly detailed replica of a Stormtrooper Helmet (75276).\nThe iconic shape and authentic details of a Stormtrooper’s helmet are recreated with LEGO® bricks plus graphics stickers. Display it on the base with nameplate, to evoke memories of epic Star Wars™ movie action.\nThis helmet is part of a range of awesome, collectible LEGO® Star Wars™ build-to-display model kits – also check out Boba Fett Helmet (75277).\nThis 647-piece Star Wars™ character model kit makes a top birthday gift, Christmas present or special surprise for fans aged 18+ and offers a rewarding challenge for any experienced LEGO® builder.\nThis cool, collectible LEGO® Star Wars™ Stormtrooper Helmet measures 7” (18cm) high, 5” (13cm) wide and 5” (13cm) deep and will make a big visual impact displayed at home or at your workplace.\nThis battery-free building set for adults offers an immersive, peaceful way to relieve stress. So chill out, find your building Zen and create an awesome LEGO® Star Wars™ Stormtrooper Helmet model!\nBuying for an avid Star Wars fan new to LEGO® sets? Don’t worry. It comes with step-by-step instructions so they can take on this challenging build and create an awesome build-and-display model for their collection.\nThere is a LEGO® Star Wars™ set to delight fans of ages, whether they want to recreate scenes from the movies, role-play their own stories or simply build and display the spectacular models.\nNo need to summon the dark side of the Force to connect or pull apart LEGO® bricks! They meet the highest industry standards so you can be assured that they fit together perfectly and with ease.\nLEGO® bricks and pieces are tested in almost every way imaginable so you can be sure that this collectible Stormtrooper LEGO Star Wars™ set meets the highest galactic safety standards!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/tie-fighter-pilot-helmet-75274","description":"Challenge your construction skills and evoke memories of classic Star Wars™ battle scenes with this LEGO® Star Wars TIE Fighter Pilot Helmet (75274) buildable display model! A wonderful gift idea for Star Wars connoisseurs aged 18+ and any experienced LEGO builder, the iconic contours and details of the helmet are beautifully recreated with LEGO bricks plus graphics stickers.\n\nBuild and display\nThis collectible Star Wars helmet has a base with a nameplate and is sure to grab attention displayed at home or in the office. And check out the other new-for-May-2020 LEGO Star Wars build-to-display model kits – Stormtrooper Helmet (75276) and Boba Fett Helmet (75277).\n\nGalaxy of fun!\nThe LEGO Group has been recreating iconic starships, vehicles, locations and characters from the Star Wars universe since 1999. LEGO Star Wars is its most successful theme, with a huge array of sets for play and display to delight fans of all ages.\n\nShow off elite-class building skills to construct this sleek Star Wars™ TIE Fighter Pilot Helmet (75274). A wonderful display model to delight any fan, it’s all about the beautiful LEGO® brick-built details.\nThe iconic design of a TIE Fighter Pilot Helmet is replicated in LEGO® bricks plus graphics stickers to spark memories of epic Star Wars™ movie scenes, and the base with nameplate makes for a cool display.\nThis LEGO® set is part of a series of collectible LEGO Star Wars™ build-to-display model kits – also check out the Stormtrooper Helmet (75276) and Boba Fett Helmet (75277).\nThis 723-piece Star Wars™ construction kit delivers an immersive, challenging build for experienced LEGO® builders and makes the best birthday gift, Christmas present or special surprise for any Star Wars fan aged 18+.\nThe TIE Fighter Pilot Helmet measures 7” (18cm) high, 5” (13cm) wide and 6” (15cm) deep – it doesn’t need much space for display, but its striking, authentic details are sure to catch the eye of every passerby!\nNo batteries required! This collectible LEGO® Star Wars™ TIE Fighter Pilot Helmet building set offers a stress-relieving build with LEGO bricks only. So zone out and enjoy creating a beautiful display piece!\nBuying this cool building toy for a big Star Wars™ fan who is a LEGO® beginner? Don’t worry. It comes with easy-to-follow instructions so they can open the box and take on this complex build with confidence.\nThere is a rich variety of LEGO® Star Wars™ sets to delight fans of all ages, whether they want to role-play scenes from the movies, dream up their own epic stories or just build and display the awesome models.\nNo need to use the Force to connect or pull apart LEGO® bricks! Ever since 1958, they have met the highest industry standards to ensure that they fit together perfectly and with ease.\nLEGO® bricks and pieces are crushed, twisted, dropped, heated and analyzed to ensure that this fun Star Wars™ building set meets the highest safety standards on planet Earth (and in every galaxy!)."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/armored-assault-tank-aat-75283","description":"Kids can enjoy hours of epic battle action with this LEGO® Star Wars: The Clone Wars Armored Assault Tank (AAT) building set (75283). The AAT has lots of realistic details to inspire fun, creative play, including opening hatches with space inside for the Battle Droids, LEGO minifigures, 2 spring-loaded shooters and a rotating turret with an elevating cannon.\n\n501st Legion vs. Battle Droids!\nThis action-packed set comes with 2 LEGO Star Wars™ minifigures – Ahsoka Tano and Ahsoka's Clone Trooper – AAT Driver Battle Droid and Battle Droid LEGO figures, and assorted weapons to inspire role play. An awesome gift idea to enhance any fan’s LEGO Star Wars collection, this toy building kit is great for solo or group play.\n\nStar Wars action in LEGO style!\nThe LEGO Group has been creating brick-built versions of iconic Star Wars starfighters, vehicles, locations and characters since 1999. It's become a hugely successful theme with a fantastic variety of sets to thrill fans of all ages.\n\nRecreate thrilling 501st Legion vs. Battle Droid conflicts from Star Wars: The Clone Wars with this awesome Armored Assault Tank (AAT) LEGO® building toy for kids (75283).\nThis set includes 2 LEGO® Star Wars™ minifigures – Ahsoka Tano and Ahsoka's Clone Trooper – AAT Driver Battle Droid and Battle Droid LEGO figures, and cool weapons including 2 Lightsabers to role-play action stories.\nThe AAT building toy has many cool features to inspire battle play including 2 spring-loaded shooters,a rotating turret with an elevating cannon, plus opening front and turret hatches to place the Battle Droids inside.\nThis 286-piece construction toy makes a great holiday gift and offers a fun, rewarding building challenge for boys and girls aged 7+. It combines brilliantly with other LEGO® Star Wars™ sets for even more creative fun.\nThe AAT building toy measures over 4.5” (12cm) high, 8.5” (21cm) long and 5.5” (14cm) wide. Fans can also command the vehicle in the LEGO® Star Wars: The Skywalker Saga video game for extra creative fun.\nThis construction playset is powered by creative kids’ free-thinking – no batteries required – so whether building and playing solo or sharing the fun with family and friends, the galactic adventures never stop!\nLooking for the best building toy for a kid who is new to LEGO® sets? This Star Wars: The Clone Wars set comes with easy-to-follow, printed instructions so they can build independently… and feel Jedi-level awesome!\nLEGO® Star Wars™ construction playsets are great for kids (and adult fans) to build and display, recreate scenes from the memorable Star Wars saga and create their own unique stories.\nEver since 1958, LEGO® bricks have met the highest industry standards, which ensures they are consistent and connect and pull apart easily every time – no need to use the Force!\nLEGO® bricks and pieces are tested in almost every way imaginable so you can be sure that this LEGO Star Wars™ AAT set meets the highest safety standards here on planet Earth – and in galaxies far, far away!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/action-battle-hoth-generator-attack-75239","description":"Give an all-new-for-April-2019 build and play experience with this 75239 Action Battle Hoth Generator Attack LEGO® Star Wars™ action construction toy. Kids will love to build the power generator with Rebel Trooper and tripod gun with Snowtrooper from Star Wars: The Empire Strikes Back with their friends and family, load the powerful shooters and enter an exciting battle as they try to hit each other's target and send everything flying! This fun-filled LEGO Star Wars playset offers endless creative play for kids of any age. Includes 2 LEGO Star Wars minifigures.\n\nIncludes 2 LEGO® Star Wars™ minifigures: a Snowtrooper and a Rebel Trooper.\nBuilding toy features a tripod gun and buildable power generator, both on a base with target.\n2 shooters and 4 missiles are also included in this construction toy set.\nKids can enjoy endless fun challenging friends and family to see who can hit their opponent's target and send their character flying.\nHit the red target to send the Snowtrooper and his tripod gun toppling off the base. Hit the blue target to ‘explode’ the power generator and send the Rebel Trooper flying.\nPlay out your own LEGO® Star Wars™ battle scenes from Star Wars: The Empire Strikes Back with this fun movie merchandise.\nPower generator building toy measures over 1” (5cm) high, 5” (13cm) wide and 3” (10cm) deep.\nTripod gun measures over 1” (5cm) high, 1” (5cm) wide and 2” (7cm) deep."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/anakin-s-jedi-interceptor-75281","description":"Young Jedi can role-play Anakin Skywalker launching into battle piloting Anakin’s Jedi Interceptor (75281) with this action-packed LEGO® Star Wars™ set. This brick-built toy has lots of features to inspire creative play, including an opening LEGO minifigure cockpit, spring-loaded shooters, foldable wing flaps with space for R2-D2 and clips for spare ammo and Anakin's Lightsaber.\n\nRole-play adventures\nThe construction set includes an Anakin Skywalker LEGO minifigure and an R2-D2 LEGO droid figure to role-play scenes from Star Wars: Revenge of the Sith and Star Wars: The Clone Wars. Great for solo or group play, this fun building toy for kids combines with other LEGO Star Wars sets for yet more galactic action adventures and creative fun.\n\nGalaxy of fun!\nSince 1999, the LEGO Group has been recreating iconic starships, vehicles, locations and characters from the legendary Star Wars universe. LEGO Star Wars building toys are very popular, with great gift ideas for fans of all ages and tastes.\n\nKids will love pretending to be Anakin Skywalker piloting this LEGO® brick-built model of Anakin’s Jedi Interceptor (75281), the iconic vehicle featured in Star Wars: Revenge of the Sith and Star Wars: The Clone Wars.\nThis LEGO® Star Wars™ building toy includes an Anakin Skywalker LEGO minifigure, plus an R2-D2 LEGO droid figure for role-play action. Anakin fits in the Jedi Interceptor's opening cockpit and R2-D2 can sit on the wing.\nThe Jedi Interceptor construction toy features a new-for-August-2020 design, 2 spring-loaded shooters for battle play and foldout wing flaps for attack mode. Anakin’s Lightsaber and spare ammo clip under the wing.\nGreat for solo or group play, this 248-piece construction kit combines brilliantly with other LEGO® Star Wars™ sets and makes a top birthday present, holiday gift or special surprise for kids aged 7+.\nAnakin's Jedi Interceptor measures over 2.5” (6cm) high, 6.5” (19cm) long and 7.5” (17cm) wide. For even more creative fun, fans canalso pilot the vehicle in the LEGO® Star Wars: The Skywalker Saga video game.\nThis LEGO® Star Wars: The Clone Wars set is made purely with LEGO building bricks and powered by children’s creativity – no batteries required – so their galactic action adventures never run out of energy!\nIs your youngster new to LEGO® sets? Don't worry. This Star Wars™ construction toy playset comes with step-by-step, illustrated instructions so they can build with confidence… and feel Jedi-level awesome!\nLEGO® Star Wars™ construction toys open up a rich galaxy of fun building and role-play adventures for kids (and adult fans) to recreate scenes from the saga or dream up their own creative play adventures.\nNo need to use the Force to connect or pull apart LEGO® bricks in this Anakin Skywalker set! They meet the highest industry standards to ensure consistency and a perfect, easy connection.\nLEGO® bricks and pieces are dropped, crushed, twisted, heated and analyzed to ensure that every building set meets the highest safety standards here on Earth – and in galaxies far, far away!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/luke-skywalker-s-landspeeder-75271","description":"Young Jedi will love pretending to power across the Tatooine desert with this new-for-January-2020, collectible LEGO® Star Wars™ Luke Skywalker’s X-34 Landspeeder (75271)! More detailed than ever before, there’s space for the Luke and C-3PO minifigures, an opening trunk with macrobinoculars inside, and a clip for Luke's blaster rifle to inspire creative play. And kids can reimagine Star Wars: A New Hope action with the buildable cave hideout for an armed Jawa minifigure. Another dimension! Intuitive Instructions PLUS are available within the free LEGO Life app for this popular Star Wars building toy for kids – even younger children can easily zoom in on, rotate and view the construction model as they build the real-life version. Awesome! Galaxy of fun! Since 1999, the LEGO Group has been recreating iconic starships, vehicles, locations and characters from the legendary Star Wars universe. LEGO Star Wars building toys are very popular with great gift ideas for fans of all ages and tastes.\nZoom! Let young Jedi role-play as Luke Skywalker driving this new-for-January 2020 Star Wars™ X-34 landspeeder (75271), with cool details including a trunk for his macrobinoculars and a clip for his blaster rifle.\nThis popular building toy includes 3 minifigures – famous Star Wars™ character Luke Skywalker (with a new-for-January-2020 fabric poncho), C-3PO, plus an armed Jawa in its buildable cave hideout for conflict play.\nFans can reimagine action from Star Wars: A New Hope with this brilliantly detailed buildable Star Wars™ toy vehicle – and there are plenty of LEGO® bricks to encourage endless creative building and play.\nFun to build and great for solo or group play, this 236-piece Star Wars™ building toy for kids makes a top birthday or Christmas gift for youngsters aged 7+, or a nostalgic surprise for any fan of Star Wars: A New Hope.\nLuke's landspeeder measures over 1” (5cm) high, 7” (20cm) long and 4” (11cm) wide – small enough to pop into a bag with the cave build and Star Wars™ minifigures, ready for play wherever kids go!\nThis LEGO® Star Wars™ collectible construction toy is made purely with LEGO building bricks and powered by children’s creativity – no batteries required – so the playtime adventures never run out of energy!\nMake building extra fun for kids with intuitive Instructions PLUS via the LEGO® Life app. Even younger builders can zoom, rotate and visualize this buildable Star Wars™ model as they create the real-life version.\nLEGO® Star Wars™ construction playsets open up a rich galaxy of building and role-play adventures for kids (and adult fans) to recreate scenes from the saga or dream up their own unique adventures.\nNo need to use the Force to connect or pull apart LEGO® bricks! They meet the highest industry standards to ensure consistency and a perfect, easy connection.\nLEGO® bricks and pieces are dropped, crushed, twisted, heated and analyzed to ensure that every building set meets the highest safety standards here on earth (and in galaxies far, far away!)."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/obi-wan-s-hut-75270","description":"Your young Jedi master will love this detailed LEGO® Star Wars™ Obi-Wan’s Hut (75270) building set. The hut folds out for easy access and there are lots of fun items to spark kids’ creativity, including a training remote and a new-for-January 2020 Princess Leia hologram element to recreate classic Star Wars: A New Hope scenes. This hot building toy for kids includes iconic Star Wars hero minifigures Obi-Wan Kenobi and Luke Skywalker with Lightsabers, R2-D2, plus a Tusken Raider for role-play battles. Extra fun! Instructions PLUS offer an interactive guide that makes building this Star Wars starter set extra fun. Available in the free LEGO Life app, they have zoom and rotate viewing tools to help even younger children build independently. LEGO Star Wars joy! The LEGO Group has been recreating iconic Star Wars starships, vehicles, locations and characters since 1999. LEGO Star Wars is its most popular theme with a huge variety of construction toys and gift ideas to delight fans of all ages.\nFeel the Force! This buildable LEGO® toy model (75270) of Obi-Wan Kenobi’s Tatooine house opens up for easy play and has many details to inspire kids to replay scenes from Star Wars: A New Hope and create epic new tales!\nThis hot Star Wars™ building toy includes Obi-Wan Kenobi and Luke Skywalker minifigures with Lightsabers, R2-D2, plus a Tusken Raider minifigure for conflict play. And fans will love the Princess Leia hologram element!\nWith macrobinoculars, a training remote to practiceLightsaber skills and more, there are many play-starting elements and LEGO® bricks to inspire young fans to build and play with other LEGO Star Wars™ sets.\nGreat for solo or group play, this 200-piece set, makes a top birthday or Christmas present or a special surprise gift for kids aged 7+ to introduce them to LEGO® Star Wars™ construction model toys.\nObi Wan's Tatooine house measures over 3” (9cm) high, 4” (12cm) wide and 4” (11cm) deep when closed – a nice, compact size to pack in a bag with the Star Wars™ minifigures ready to entertain kids on your travels.\nSet kids’ imaginations free with this battery-free construction playset, encouraging them to develop their creative abilities while pretending to be Star Wars™ heroes and role-playing unlimited exciting stories.\nMake this Star Wars™ building toy extra fun for kids with digital Instructions PLUS in the LEGO® Life app. Even younger builders can zoom, rotate and visualize this construction model as they build the real-life version.\nLEGO® Star Wars™ building toys open up a galaxy of building and role-play adventures for kids (and adult fans) to make up their own adventures, recreate scenes from the saga or just show off the cool models to friends.\nBuilders will not need Jedi powers to connect or pull apart LEGO® bricks! Ever since 1958, they have met the highest industry standards to ensure consistency and robust building.\nLEGO® bricks and pieces are tested to the max so you can be sure that this popular children’s building toy meets the highest safety standards here on Earth (and on the desert planet of Tatooine!)."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/death-star-cannon-75246","description":"Let any fan play out exciting LEGO® Star Wars: A New Hope moments with this 75246 Death Star Cannon playset. Featuring a tractor beam control tower for Obi-Wan Kenobi to disable and a firing laser cannon manned by a Death Star Gunner minifigure, this fun set will give children a great build and play experience. Older builders and fans will also enjoy displaying this LEGO Death Star Cannon model inspired by the original Star Wars™ movie with their existing collection.\n\nIncludes Obi-Wan Kenobi and Death Star Gunner LEGO® Star Wars™ minifigures.\nA LEGO® Death Star Cannon model based on a pivotal scene from the original Star Wars: A New Hope movie, featuring a tractor beam control tower and a rotating/elevating laser cannon with spring-loaded shooter and storage clips for the missiles.\nWeapons include Obi-Wan's blue Lightsaber and the Death Star Gunner's blaster pistol.\nThis LEGO® Star Wars™ merchandise makes a great birthday gift, Christmas present or just a Star Wars gift for any occasion.\nHot construction toy based on the original Star Wars™ movie measures over 3” (9cm) high, 6” (16cm) wide and 4” (11cm) deep."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/duel-on-mustafar-75269","description":"Recreate Anakin Skywalker and Obi-Wan Kenobi’s memorable Duel on Mustafar from Star Wars: Revenge of the Sith with this action-packed LEGO® Star Wars™ construction playset (75269) for kids! The buildable Mustafarian mine has sliding, rotating platforms for the 2 Lightsaber-wielding minifigures to do battle. The construction model also folds out and has a cool lava explosion function to inspire unlimited adventures. Interactive instructions! This LEGO set comes with printed building instructions. Kids can also use Instructions PLUS, available within the free LEGO Life app, to let them zoom in on, rotate and visualize the mine while building the real thing. Awesome! With love from LEGO Star Wars universe! Since 1999, the LEGO Group has been creating brick-built versions of iconic starships, vehicles, locations and characters from the Star Wars universe. There is a huge array of sets for play and display that make great gift ideas for fans of all ages.\nIconic Star Wars™ rivals? Check! Lightsabers? Check! ‘Molten lava’ explosion function? Check! This foldout LEGO® set (75269) has all youngsters need to role-play Anakin vs. Obi-Wan battles on the planet Mustafar!\nKids can build a Mustafarian mine and place the Lightsaber-wielding Anakin Skywalker and Obi-Wan Kenobi LEGO® minifigures on sliding, rotating platforms to recreate the epic Lightsaber Duel on Mustafar.\nBoth minifigures are new for January 2020, with burnt, battle-worn clothingdecorations, and there are lots of LEGO® bricks to inspire young fans to build creatively with other LEGO Star Wars™ sets.\nThere are many ways to play with this 208-piece LEGO® set, making it a fun birthday gift or Christmas present for boys and girls aged 7+ to introduce them to LEGO Star Wars™ building toys or expand their collection.\nThe Mustafarian mine measures over 5” (14cm) high, 4” (12cm) wide and 4” (12cm) deep – a compact size for portability – and opens up to a width of 9” (23cm) for alternative play experiences.\nPower up kids’ imaginations with this battery-free Mustafar building toy playset, encouraging them to develop their creativity while playing out fun adventures inspired by Star Wars: Revenge of the Sith.\nEasy-to-follow Instructions PLUS, available in the free LEGO® Life app, allow even younger builders to visualize this construction model from all angles as they build it, adding to their feelings of awesomeness!\nLEGO® Star Wars™ building kits are fabulous for kids (and adult fans) to relive scenes from Star Wars saga, create their own unique stories or just build and display the collectible construction models.\nBuilders will not need Jedi powers to connect or pull apart LEGO® bricks! Ever since 1958, they have met the highest industry standards to ensure consistency and robust building.\nLEGO® bricks and pieces are stringently tested to make sure that every building set meets the highest safety standards here on planet Earth (and in galaxies far, far away!)."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/snowspeeder-75268","description":"Give young kids an exciting introduction to the LEGO® Star Wars™ universe with this Snowspeeder (75268) starship toy building set for ages 4 and up. The Snowspeeder, Echo Base defense station and speeder bike are all easy to build and have cool weapons, including a disc shooter, for battle play. There are also 2 minifigures – Star Wars Rebel pilot hero Wedge Antilles and a Snowtrooper – to inspire role-play adventures. Try Instructions PLUS! Instructions PLUS offer a digital, interactive guide to building these construction models. Available in the free LEGO Life app for smartphones and tablets, they have zoom and rotate viewing tools to help kids create the LEGO brick versions. Welcome to 4+! LEGO Star Wars 4+ children’s building toys introduce preschool kids to the Star Wars universe and its heroes and villains. With Starter Brick bases to help them learn to build, even first-time builders can experience the pride of constructing buildings, vehicles and more, all on their own.\nWith a simple-to-build Snowspeeder, speeder bike and Echo Base defense station, this children’s building toy (75268) is a fun and safe way to introduce little Rebels aged 4 and up to LEGO® Star Wars™ action.\nThe Snowspeeder has a Starter Brick chassis to help children learn to build, and they can create their own role-play stories with 2 minifigures – Star Wars™ Rebel pilot hero Wedge Antilles and a Snowtrooper with weapons.\nTo inspire extra play possibilities, the defense station has a‘laser’ disc shooter for Wedge Antilles, and kids can use the building bricks to build creatively with other LEGO® Star Wars™ sets.\nWith 3 construction models that are easy to rebuild after battles, this 91-piece LEGO® Star Wars™ starter set makes a top birthday present, Christmas gift or special surprise for preschoolers and kids aged 4 and up.\nThe Snowspeeder starship building toy measures over 1” (5cm) high, 4” (11cm) long and 3” (9cm) wide, so it easily fits into a bag with the other Star Wars™ builds and minifigures to keep kids entertained on the go.\nNo batteries required! This preschool-learning buildable toy is powered by children’s imaginations, so they can develop their creative skills while making up unlimited adventures and having lots of fun.\nGive preschool kids an awesome, digitally interactive building activity with Instructions PLUS, featuring intuitive modes like zoom and rotate to help them build this LEGO® Star Wars™ starship construction toy playset.\nLEGO® Star Wars™ 4+ buildable toys introduce younger children to the Star Wars saga, heroes and villains, and help them to understand the purpose of building steps while boosting their confidence.\nEver since 1958, LEGO® bricks have met the highest industry standards, thus ensuring that they connect perfectly and pull apart easily every time – no need to use the Force!\nLEGO® bricks and pieces are tested in almost every way you can imagine, ensuring that this Star Wars: The Empire Strikes Back building toy for kids meets the highest safety standards in the galaxy!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/the-mandalorian-the-child-75317","description":"Inspire memories of epic Star Wars: The Mandalorian stories with this fun building toy for creative kids, featuring LEGO® BrickHeadz™ versions of The Mandalorian and the Child (75317). Fans will appreciate authentic details such as The Mandalorian’s signature weapons – a blaster rifle and a blaster pistol. The Child has adjustable ears to create happy and sad expressions, and it sits in a hoverpram ‘floating’ on 4 transparent LEGO elements.\n\nRewarding build, cool display\nA great addition to any Star Wars™ fan’s collection, this awesome construction toy is fun to build solo or with friends and family, and each of the buildable LEGO figures has a baseplate to create an eye-catching display.\n\nTop gifts\nThe LEGO Group has been recreating iconic starships, vehicles, locations and characters from the legendary Star Wars universe since 1999. LEGO Star Wars is now its most successful theme offering a huge variety of birthday, holiday and surprise gift ideas to delight all ages.\n\nStar Wars: The Mandalorian fans and creative kids will love building their own LEGO® BrickHeadz™ versions of the Child and The Mandalorian (75317), recreating authentic details to create a cool display.\nThe Mandalorian buildable LEGO® figure has signature weapons – a blaster rifle clipped on the back and a blaster pistol in hand – to spark memories of thrilling Star Wars: The Mandalorian scenes.\nYoungsters will love the Child building toy with adjustable ears for different expressions, and its hoverpram ‘floating’ on a transparent LEGO® element. Both construction models have baseplates for display.\nThis 295-piece LEGO® BrickHeadz™ Star Wars™ building toy makes an awesome birthday present, holiday gift or anytime surprise for Star Wars: The Mandalorian fans and LEGO builders aged 10 and up.\nThe Mandalorian measures 3” (8cm) tall and the Child and hoverpram building toy measures 3” (8cm) high – they won’t take up too much space but are sure to make a big impression wherever they are displayed.\nThis battery-free construction toy offers a fun building experience, so fans can enjoy time alone or with family and friends creating LEGO® BrickHeadz™ versions of 2 popular Star Wars: The Mandalorian characters.\nThinking of buying this building set for a Star Wars™ fan new to LEGO® sets? No problem. It comes with step-by-step, illustrated instructions so they can take on the construction project with Jedi-level confidence. v The exciting LEGO® Star Wars™ range of building toys includes collectible, build-and-display models and construction playsets to recreate epic scenes from the Star Wars saga. There’s something for fans of all ages.\nNo need to use the Force to connect or pull apart LEGO® bricks in this building set! The bricks meet the highest industry standards to ensure consistency and a perfect, easy connection.\nLEGO® bricks and pieces are dropped, crushed, twisted, heated and analyzed to ensure that every building set meets the highest safety standards here on Earth – and in any galaxy you travel to!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/mandalorian-battle-pack-75267","description":"Limitless adventures await youngsters as they build their own army with this Mandalorian Battle Pack (75267)! This compact construction playset includes 4 LEGO® Star Wars™ Mandalorian warrior minifigures with stud-shooting blasters, a buildable defense fort and a Mandalorian speeder bike with 2 stud shooters to spark children's imaginations. Another dimension! The printed building instructions that come with all LEGO sets are easy to follow, but interactive Instructions PLUS, available within the free LEGO Life app, add another dimension. Even younger kids can simply zoom in on, rotate and view the construction model as they build the real-life version. Awesome! Star Wars action in LEGO style! The LEGO Group has been creating brick-built versions of iconic Star Wars starships, vehicles, locations and characters for over two decades. There is a huge array of sets for play and display that make great Christmas presents and birthday or special occasion gifts for fans of all ages.\nKids can build a fearsome Mandalorian army, recreate exciting scenes from Star Wars: The Mandalorian TV show and develop their own exciting stories with this cool kids’ building toy (75267).\nThere are many ways to play out battles with 4 Star Wars™ Mandalorian warrior minifigures, each with stud-shooting blasters, a defense fort with an attachment point for a blaster, and a stud-shooting speeder bike.\nA fun way for young Star Wars™ fans to collect an army, and there are lots of LEGO® building bricks to inspire them to build and play solo, with friends and in combination with other LEGO Star Wars sets they own.\nFast to build – and to rebuild after battles – the 102-piece Star Wars™ Mandalorian construction toy playset is a great-value gift for boys and girls aged 6+ on their birthday, at Christmas or for a special surprise.\nThe LEGO® Star Wars™ Mandalorian Speeder measures over 1” (4cm) high, 3” (8cm) long and 2” (6cm) wide – a nice size to slip into your child's backpackalong with the fort and minifigures for play on the go.\nThis collectible LEGO® construction toy is powered by children’s creativity – no batteries required – so their adventures with Star Wars™ characters never stop!\nHelp even younger children develop their building skills with Instructions PLUS, available in the free LEGO® Life app, which allow them to zoom in on, rotate and visualize the construction model while they build.\nLEGO® Star Wars™ sets are brilliant for kids (and adult fans) to recreate iconic scenes from the Star Wars saga, make up their own unique stories or build and display the cool construction toys.\nEver since 1958, LEGO® bricks have met the highest industry standards, which ensures that they connect perfectly and pull apart easily every time – no need to use the Force!\nLEGO® bricks and pieces are heated, crushed, dropped, twisted and analyzed, ensuring that every building set meets the highest safety standards on planet Earth (and in galaxies far, faraway!)."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/sith-troopers-battle-pack-75266","description":"Youngsters can create their own First Order army and lead them into battle on the speeder with this LEGO® Sith Troopers Battle Pack (75266)! This action-packed Star Wars: The Rise of Skywalker construction playset includes First Order Officer, Sith Trooper and 2 Sith Jet Trooper minifigures with stud-shooting blasters (a blaster can be attached to the LEGO brick-built Stormtrooper speeder) plus jetpack elements to inspire imaginative role-play. Instructions PLUS! Check out digital Instructions PLUS, available within the free LEGO Life app, for this First Order Stormtrooper toy vehicle. Tools to zoom in on, rotate and view the First Order speeder help kids confidently build the real thing. The LEGO Star Wars™ universe! For over two decades, the LEGO Group has been creating amazing brick-built versions of iconic Star Wars starships, vehicles, locations and characters. LEGO Star Wars is now a hugely successful theme and offers building toys for kids and gift ideas to delight fansof all ages.\nLet young kids lead an army of Star Wars™ Sith troopers into battle and recreate action from Star Wars: The Rise of Skywalker with this awesome LEGO® Stormtrooper construction toy vehicle (75266).\nWith 4 cool minifigures – First Order Officer, Sith Trooper and 2 Sith Jet Troopers – equipped with 4 stud-shooting blasters and 2 jetpack elements, there's plenty to inspire creative storytelling.\nAn ideal way to collect a LEGO® Stormtrooper army, the First Order Officer and Sith Jet Trooper minifigures are new for January 2020, and there are lots of building bricks to stimulate young fans’ imaginations.\nThis quick-build, 105-piece Sith Troopers Battle Pack makes a great Christmas present or gift idea for any occasion for boys and girls aged 6+ to introduce them to the action-packed LEGO® Star Wars™ universe.\nThe Star Wars™ First Order Stormtrooper speeder measures over 1” (4cm) high, 3” (10cm) long and 3” (8cm) wide – a nice, compact construction model to carry with the minifigures in your bag or child’s backpack for play on the go.\nThis battery-free kids’ building toy is powered by children’s imaginations, encouraging them to develop their creative skills with Star Wars™ characters while playing out Star Wars: The Rise of Skywalker scenes.\nLet younger children build independently and experience an amazing sense of achievement with digital Instructions PLUS, available in the free LEGO® Life app. They'll become master builders in no time!\nLEGO® Star Wars™ building kits are brilliant for kids (and adult fans) to recreate scenes from the Star Wars saga, dream up their own unique stories or simply build and display the collectible construction models.\nNo need to use the Force to connect or pull apart LEGO® bricks! Ever since 1958, they have met the highest industry standards to ensure consistency and compatibility.\nLEGO® bricks and pieces are dropped, heated, crushed, twisted and thoroughly analyzed, ensuring that every building set meets the highest safety standards on planet Earth (and in galaxies far, far away!)."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/501st-legion-clone-troopers-75280","description":"Stage an epic battle between elite 501st Legion Clone Troopers and the Separatist Army’s Battle Droids. Look out for the droids from the AT-RT cockpit using the electrobinoculars. Launch into attack with the BARC Speeder and fire the stud shooters. Fight back with the Battle Droids' blasters. Who will triumph in this exciting LEGO® Star Wars™ adventure? You decide.\nKids can role-play as 501st Legion Clone Troopers and relive exciting action from Star Wars: The Clone Wars with this LEGO Star Wars™ action set (75280), featuring an AT-RT Walker and BARC Speeder.\nThis LEGO® Star Wars™ building kit includes 4 LEGO minifigures: 3 new-for-2020 501st Clone Troopers and a 501st Jet Trooper, with jetpack element, plus 2 Battle Droids and weapons for battles.\nThe AT-RT Walker has a new-for-August-2020 color scheme, posable legs, a stud shooter, attachment points for a blaster and electrobinoculars element, and the BARC Speeder has 2 stud shooters to inspire creative play.\nThis 285-piece construction playset makes an ideal birthday present or holiday gift for boys and girls aged 7+. The 2 vehicles can also be driven in the LEGO® Star Wars: The Skywalker Saga video game.\nThe compact, robust LEGO® Star Wars™ AT-RT Walker measures over 7” (17cm) high, 3.5” (9cm) long and 3” (8cm) wide – a convenient size to slip into a child's backpack with the BARC Speeder ready for play wherever they go.\nNo batteries are needed with this awesome kids’ building toy – it’s built purely from LEGO® bricks and powered by children’s imaginations so the action never stops.\nThinking of buying this Star Wars™ building kit for someone new to LEGO® sets? No problem. It comes with easy-to-follow, illustrated instructions. Open the box and away they go!\nLEGO® Star Wars™ building toys are fantastic for kids (and adult fans) to recreate scenes from the StarWars saga, make up their own galactic adventures and display the collectible construction models.\nEver since 1958, LEGO® bricks have met the highest industry standards so they are robust and connect and pull apart easily every time – no need to use the Force!\nLEGO® bricks and pieces are tested in almost every way imaginable to make sure that every building set meets the highest safety and quality standards on planet Earth – and in galaxies far, far away!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/the-mandalorian-keyring-854124","description":"Fans of Star Wars: The Mandalorian can show their affinity for the legendary bounty hunter with this cool LEGO® Star Wars™ The Mandalorian™ Key Chain (854124). Attached to a durable metal ring and chain, the minifigure has an outfit just like the one the character wears in the Disney+ series. A super little gift for kids and adult fans, it is simple to attach to keys or a bag so the owner can take The Mandalorian with them on every mission.\nThis LEGO® Star Wars™ key chain (854124) features The Mandalorian™ minifigure attached to a durable metal ring and chain. The minifigure is fixed to the metal chain and cannot be removed.\nMetal ring attaches easily and securely to keys, backpacks and more.\nMeasuring over 3 in. (9 cm) long, it makes a wonderful little gift for Star Wars: The Mandalorian fans aged 6 and up."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/holiday-bag-tag-darth-vader-5006033","description":"Let your youngster enjoy fun adventures with this Darth Vader holiday bag tag (5006033). Featuring the Sith Lord with a Santa hat and candy cane, this easily attachable, flexible silicone tag adds a fun and festive look to any backpack, bag or lunchbox. An awesome Christmas gift for any LEGO® Star Wars™ fan, there's also space on the back to write contact details.\n\nThis festive LEGO® Star Wars™ bag tag is made from flexible, durable silicone in the shape of a Darth Vader minifigure wearing a Santa hat and holding a candy cane.\nIncludes a flexible loop for easy attachment and space on the back to write contact information.\nMakes a super Christmas gift for LEGO® Star Wars™ fans aged 6 and up.\nWarning: choking hazard from small parts.\nMeasures over 6” (17cm) long and 2” (6cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/holiday-bag-tag-r2-d2-5006031","description":"Kids can team up with R2-D2 on their daily missions with this fun LEGO® Star Wars™ holiday bag tag (5006031). Fans will love this flexible silicone tag featuring R2-D2 wearing a festive top hat and scarf, with space to write contact details on the back. An awesome Christmas gift for ages 6 and up, this easily attachable tag will make any youngster's bag, backpack or lunchbox stand out from the crowd.\n\nThis LEGO® Star Wars™ bag tag is made from flexible, durable silicone in the shape of an R2-D2 minifigure wearing a festive top hat and scarf.\nIncludes a flexible loop for easy attachment and space on the back to write contact information.\nMakes a cool Christmas gift for LEGO® Star Wars™ fans aged 6 and up.\nWarning: choking hazard from small parts.\nMeasures over 6” (17cm) long and 2” (6cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/holiday-bag-tag-stormtrooper-5006035","description":"Kids can take a loyal soldier with them on their travels when they attach this LEGO® Star Wars™ Stormtrooper holiday bag tag (5006035) to their bag, backpack or lunchbox. This flexible silicone tag features a Stormtrooper looking festive, wearing a jester's hat and holding a TIE Fighter! A cool Christmas gift for ages 6 and up, there's also space on the back to write personal contact information.\nThis LEGO® Star Wars™ bag tag is made from flexible, durable silicone in the shape of a Stormtrooper minifigure wearing a jester’s hat and holding a TIE Fighter.\nIncludes a flexible loop for easy attachment and space on the back to write contact information.\nMakes a fun Christmas gift for LEGO® Star Wars™ fans aged 6 and up.\nWarning: choking hazard from small parts.\nMeasures over 6” (17cm) long and 2” (6cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/keychain-chewbacca-2015-853451","description":"Walk with your very own Wookiee™ companion with this LEGO® Star Wars™ Chewbacca™ Key Chain. Featuring a sturdy key ring and chain, this fun minifigure will look great attached to your keys or backpack.\n\nFeatures an authentic LEGO® Star Wars™ Chewbacca™ minifigure attached to a sturdy metal ring and chain\nAttach to your keys or backpack\nMinifigure is not detachable from metal chain\nMakes a great gift for fans of LEGO® Star Wars™ building sets\nSuitable for ages 6 and over"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/lego-star-wars-darth-vader-keyring-850996","description":"Surrender to the Dark Lord, ruthless commander of the Imperial fleet! Take a step to the dark side when you attach this authentic LEGO® Star Wars™ Darth Vader™ minifigure to your keys or backpack.\n\nFeatures an authentic LEGO® Star Wars™ Darth Vader™ minifigure attached to a sturdy metal ring and chain\nAttach to your keys or backpack\nMinifigure is not detachable from metal chain\nMakes a great gift for fans of LEGO® Star Wars™ building sets\nSuitable for ages 6 and over"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/lego-star-wars-r2-d2-keyring-853470","description":"Turn every trip into an exciting adventure with this LEGO® Star Wars™ R2-D2™ Key Chain. Attach it to your keys or backpack using the durable key ring and chain and let this pint-size Astromech Droid bring a smile to your face wherever you go.\n\nFeatures an authentic LEGO® Star Wars™ R2-D2 figure attached to a sturdy metal ring and chain\nAttach to your keys or backpack\nFigure is not detachable from metal chain\nMakes a great gift for fans of LEGO® Star Wars™ building sets\nSuitable for ages 6 and over"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/lego-star-wars-yoda-keyring-853449","description":"Protect yourself from the dark side with wise and powerful Yoda™! Attach this iconic LEGO® Star Wars™ minifigure to your keys or backpack using the tough key ring and chain and take your own personal Jedi Master™ with your everywhere you go.\n\nFeatures an authentic LEGO® Star Wars™ Yoda™ minifigure attached to a sturdy metal ring and chain\nAttach to your keys or backpack\nMinifigure is not detachable from metal chain\nMakes a great gift for fans of LEGO® Star Wars™ building sets\nSuitable for ages 6 and over"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/r2-d2-bag-tag-5005820","description":"Transform any bag into a LEGO® Star Wars™ bag with this 5005820 R2-D2 Bag Tag. Colored and shaped like the smartest, bravest droid in the galaxy, this 100% silicone tag is flexible and durable. It’s also easy to attach and has plenty of space on the back to write your contact details.\n\nR2-D2 Bag Tag is made from flexible, durable silicone in the shape of an R2-D2 LEGO® figure with space on the back to write contact information.\nMeasures over 4” (12cm) long and 2” (6cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/stormtrooper-keyring-853946","description":"Show your allegiance to the Imperial cause with this LEGO® Star Wars™ 853946 Stormtrooper Key Chain. Attach it to your keys or backpack using the sturdy ring and chain and prepare to enforce the will of the Empire, wherever you go.\n\nFeatures a LEGO® Star Wars™ Stormtrooper minifigure linked to a durable metal ring and chain.\nAttach it to your keys or backpack.\nMinifigure is not detachable from metal chain."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/landspeeder-bag-charm-853768","description":"Race to your destination with this mini LEGO® Star Wars 853768 Landspeeder Bag Charm attached to a sturdy ring and chain. The pieces are also glued so it will never come apart on your travels across the galaxy!\n\nFeatures a LEGO® Star Wars Landspeeder mini build attached to a sturdy metal ring and chain.\nAttach it your keys, bag or backpack.\nMini build is not detachable from metal ring and chain and cannot be disassembled."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/luke-skywalker-s-x-wing-fighter-75301","description":"Children become heroes in their own epic stories with this cool LEGO® brick version of Luke Skywalker’s X-wing Fighter (75301) from the classic Star Wars™ trilogy. It’s packed with authentic details to delight fans, including an opening LEGO minifigure cockpit with space behind for R2-D2, wings that can be switched to attack position at the touch of a button, retractable landing gear and 2 spring-loaded shooters.\n\nPlay and display\nThis awesome building toy for kids features Luke Skywalker, Princess Leia and General Dodonna LEGO minifigures, each with weapons, including Luke’s lightsaber, plus an R2-D2 LEGO droid figure.\n\nThe best buildable toys for kids\nThe LEGO Group has been recreating iconic starships, vehicles, locations and characters from the Star Wars universe since 1999. LEGO Star Wars is now its most successful theme with fun gift ideas for creative kids, and adults too.\n\nRecreate scenes from the classic Star Wars™ trilogy with this awesome building toy for kids, featuring a LEGO® brick-built version of Luke Skywalker’s iconic X-wing Fighter (75301).\nIncludes Luke Skywalker, Princess Leia and General Dodonna LEGO® minifigures, each with weapons including Luke’s lightsaber, plus an R2-D2 LEGO droid figure for role-play adventures.\nThe X-wing features an opening LEGO® minifigure cockpit, space for R2-D2, wings that can be switched to attack position at the touch of a button, retractable landing gear and 2 spring-loaded shooters.\nFun to build and play with solo or as a group activity, this building toy makes a super birthday present, holiday gift or surprise treat for creative kids and any Star Wars™ fan aged 9 and up.\nThis starfighter construction model measures over 3 in. (8 cm) high, 12.5 in. (31 cm) long and 11 in. (28 cm) wide, and looks awesome displayed in a child’s bedroom between playtime missions.\nBuying for a big Star Wars™ fan who is a LEGO® beginner? Don’t worry. This set comes with step-by-step, illustrated instructions so they can build with Jedi-like confidence.\nLEGO® Star Wars™ sets are fabulous for kids (and adult fans) to recreate scenes from the saga, dream up original stories or just build and proudly display the construction models.\nEver since 1958, LEGO® components have met stringent industry standards, meaning they are compatible and connect consistently – no need to use the Force!\nLEGO® components are tested in almost every way imaginable to ensure they meet rigorous safety standards."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/millennium-falcon-75192","description":"Welcome to the largest, most detailed LEGO® Star Wars Millennium Falcon model we’ve ever created—in fact, with 7,500 pieces it’s one of our biggest LEGO models, period! This amazing LEGO interpretation of Han Solo’s unforgettable Corellian freighter has all the details that Star Wars fans of any age could wish for, including intricate exterior detailing, upper and lower quad laser cannons, landing legs, lowering boarding ramp and a 4-minifigure cockpit with detachable canopy. Remove individual hull plates to reveal the highly detailed main hold, rear compartment and gunnery station. This amazing model also features interchangeable sensor dishes and crew, so you decide whether to play out classic LEGO Star Wars adventures with Han, Leia, Chewbacca and C-3PO, or enter the world of Episode VII and VIII with older Han, Rey, Finn and BB-8!\n\nIncludes 4 classic crew minifigures: Han Solo, Chewbacca, Princess Leia and C-3PO.\nAlso includes 3 Episode VII/VIII crew minifigures: Older Han Solo, Rey and Finn.\nFigures include a BB-8 droid, 2 buildable Porgs and a buildable Mynock.\nExterior features include intricately detailed and removable hull panels, a lowering boarding ramp, concealed blaster cannon, 4-minifigure cockpit with detachable canopy, interchangeable round/rectangular sensor dishes, upper and lower quad laser cannons, and 7 landing legs.\nMain hold features a seating area, Dejarik holographic game, combat remote training helmet, engineering station with turning minifigure seat and a doorway build with passageway decoration.\nRear compartment features the engine room with hyperdrive and console, 2 doorways, hidden floor compartment, 2 escape pod hatches, engineering console and an access ladder to the gunnery station.\nGunnery station features a minifigure gunner’s seat and detachable hull panel with fully rotating quad laser cannon. An additional quad laser cannon is also mounted on the underside.\nThis model includes 7,500 pieces.\nAlso includes an informational fact plaque.\nFeatures a new-for-October-2017 cockpit canopy element.\nClassic crew weapons include Han’s blaster pistol and Chewbacca’s stud-firing bowcaster.\nMeasures over 8” (21cm) high, 33” (84cm) long and 22” (56cm) wide.\n\nFor this item FedEx will require an in-person direct signature at the time of delivery. FedEx will make three (3) delivery attempts before returning the shipment to LEGO. At which point, we ask that you please contact Consumer Services to discuss reshipping the item, or sending it to an alternative address where a signature can be obtained.\n\n*Please be advised that for the “LEGO® STAR WARS™ MILLENNIUM FALCON™ #75192 (“Product”) the following additional terms and conditions shall apply for Product exchange: Always subject to applicable federal or state law, any request for exchange of the Product (“Return Product”) with another Product (“New Product”) is subject to you providing LEGO with a valid credit card as security for LEGO receiving the Return Product. If LEGO has not received the Return Product within 30 days of the date where LEGO has shipped the New Product to you, LEGO will charge the full purchase price listed at the time of shipment on shop.LEGO.com/US to your credit card. Please provide track and trace information to Customer Service to allow LEGO to track your shipment of the Return Product."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/mos-eisley-cantina-75290","description":"Enjoy quality me-time and relive iconic Star Wars: A New Hope moments with the awesome LEGO® Star Wars™ Mos Eisley Cantina (75290) construction model for display. This 3,187-piece Master Builder Series set features the Cantina with lots of authentic details to delight fans, plus attachable buildings to recreate a Mos Eisley city scene.\n\nBuild and display\nThis immersive build is a great way to relax and reconnect with your Star Wars passion. A Dewback LEGO figure and 2 Landspeeders complete a wonderful display piece. Bring your Tatooine scene to life with 21 LEGO minifigures, including Luke Skywalker, Han Solo and C-3PO, new-for-October-2020 Ponda Baba, Garindan and Labria, plus an R2-D2 LEGO droid figure.\n\nYour next DIY project\n\n\nThis building kit comes with clear instructions so you can enjoy every step of the hands-on, DIY experience. One of a huge variety of LEGO Star Wars sets, this building set for adults makes a super gift for yourself, Star Wars fans and hobbyists in your life.\n\nImmerse yourself in a challenging build and then recreate classic Star Wars: A New Hope scenes with this highly detailed LEGO® Star Wars™ Mos Eisley Cantina (75290) Master Builder Series display model.\nThis building kit features 21 LEGO® minifigures, including Chewbacca, Obi-Wan Kenobi, Ponda Baba, Garindan and Labria, plus an R2-D2 LEGO droid figure and a Dewback LEGO figure to bring the Tatooine tavern to life.\nThe Cantina has a removable roof for easy access to the different booths so you can explore the many authentic details and play out stories with the heroes and an array of smugglers, bounty hunters and aliens.\nThe perfect way to click your stress away, this 3,187-piece Star Wars™ construction kit makes a wonderful treat for yourself and a special birthday or holiday gift for the Star Wars fan or hobbyist in your life.\nThe buildable Mos Eisley Cantina model measures over 7.5” (19cm) high, 20.5” (52cm) wide and 23” (58cm) deep when opened up. Alongside the attachable buildings and 2 Landspeeders it makes an awesome display piece.\nNo batteries required – this set offers a hands-on, mindful building experience with LEGO® bricks only. So give yourself a well-earned break and enjoy recreating an iconic Star Wars™ location.\nIncludes easy-to-follow instructions so even LEGO® newcomers can build confidently, plus an illustrated booklet about the set, its model designer and the Star Wars™ stories that inspired it.\nThis LEGO® Star Wars™ set for adults is part of a collection of inspiring LEGO building kits designed for you, the discerning hobbyist, as you look for your next fun and creative DIY project.\nEver since 1958, LEGO® building bricks have met the highest industry standards, which ensures they are consistent, compatible and connect and pull apart easily every time. No need to use the Force!\nLEGO® bricks and pieces are rigorously tested and analyzed so that all Star Wars™ construction sets meet the highest safety and quality standards on planet Earth – and in every galaxy!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/default-the-mandalorian-bounty-hunter-transport-au-the-razor-crest-nz-the-razor-crest-75292","description":"Relive bounty hunter The Mandalorian and the Child’s battles against Scout Trooper and other enemies with The Razor Crest (75292) LEGO® Star Wars™ building toy for kids. This brick-built armored transport shuttle features a cargo hold with opening sides that double as access ramps and carbonite bounty elements inside, a dual LEGO minifigure cockpit, spring-loaded shooters, escape pod and more authentic details to inspire creative play.\n\nRole-play adventures\nA challenging build for ages 10 and up, this 1,023-piece starship construction kit includes 5 collectible LEGO Star Wars characters, including new-for-August-2020 The Mandalorian and the Child LEGO minifigures. It’s great for role play and combines with other LEGO Star Wars sets for even more action.\n\nGreat gift ideas\nSince 1999, the LEGO Group has been recreating iconic starships, vehicles, locations and characters from the legendary Star Wars universe. LEGO Star Wars building toys are hugely popular with awesome gift ideas for all ages.\nKids can role-play as heroic warrior The Mandalorian and play out action-packed Star Wars: The Mandalorian scenes with this detailed, LEGO® brick model of The Razor Crest (75292) starship.\nThis fun buildable toy includes 4 LEGO® minifigures: The Mandalorian, Greef Karga, Scout Trooper and the Child, plus an IG-11 LEGO® figure, all with cool weapons to role-play exciting battles.\nThe Razor Crest has a dual LEGO® minifigure cockpit, 2 spring-loaded shooters, cargo hold with opening sides/access ramps and carbonite bounty elements inside, sleeping area and detachable escape pod for creative play.\nThis 1,023-piece construction playset offers a challenging build and combines brilliantly with other LEGO® Star Wars™ sets. It makes a super holiday gift or birthday present for boys and girls aged 10+.\nThe Razor Crest dreadnought measures over 5.5” (14cm) high, 15” (38cm) long and 11” (28cm) wide. It makes an eye-catching Star Wars: The Mandalorian display piece when it is not being used to transport vital cargo!\nThis LEGO® Star Wars™ collectible building toy is made purely with LEGO building bricks and powered by children’s imaginations – no batteries required – so the fun, creative, playtime adventures never run out of energy!\nIs your youngster new to LEGO® sets? Don’t worry. This buildable playset comes with step-by-step, illustrated instructions so they can piece together the Mandalorian dreadnought building toy with Jedi-like confidence!\nLEGO® Star Wars™ building toys are the best for kids (and adult fans) to recreate scenes from the Star Wars saga, dream up their own original stories or simply display the awesome construction models.\nNo need to use the Force to connect or pull apart LEGO® bricks! They meet the highest industry standards to ensure a perfect, easy connection every time and consistently robust builds.\nLEGO® bricks and pieces are dropped, crushed, twisted, heated and rigorously analyzed so you can be sure that this Star Wars: The Mandalorian building set meets the highest safety standards."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/at-st-raider-75254","description":"Excite any LEGO® builder or fan with this 75254 Star Wars™ AT-ST Raider vehicle. This brick-built Star Wars construction toy features the same cannibalized look of the walker from the hit Star Wars TV series, The Mandalorian, including jointed posable legs, a turning turret that opens up to reveal a detailed interior with space to sit a minifigure, plus 2 firing shooters. The set also includes Star Wars characters The Mandalorian, Cara Dune and 2 Klatooinian Raider minifigures to really get the action going.\n\nIncludes 4 LEGO® Star Wars™ characters: The Mandalorian, Cara Dune and 2 Klatooinian Raider minifigures.\nLEGO® Star Wars™ AT-ST vehicle features posable jointed legs, a wheel-activated turning turret, opening canopy with space for a minifigure inside a detailed cockpit, and specially decorated elements for a cannibalized look.\nWeapons include 3 blaster rifles and a blaster.\nRecreate amazing adventures from the hit Star Wars: TV series The Mandalorian.\nMakes a great birthday gift, Christmas present or just a Star Wars™ gift for any occasion.\nLEGO® Star Wars™ AT-ST walker building toy measures over 9” (25cm) high, 5” (15cm) long and 5” (13cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/tantive-iv-75244","description":"Build, play and display a legendary Star Wars™ starship! This LEGO® Star Wars 75244 interpretation of Tantive IV, seen fleeing from an Imperial Star Destroyer in the opening moments of Star Wars: A New Hope, faithfully recreates all of the Rebel cruiser's signature details, including an elongated hull, detachable escape pods, elevating gun turrets, cargo hold and 11 massive engines at the back. Remove the hull plating of this fantastic LEGO Star Wars vehicle to reveal a detailed 2-minifigure cockpit, conference area with table, weapon rack and a control console with 2 seats. The radar dish also doubles as a convenient carry handle, which makes it perfect for flying around the room. When the mission is over, this amazing kids’ buildable toy also makes a great centerpiece for any LEGO Star Wars collection. The set also includes 5 minifigures and an R2-D2 droid LEGO figure.\n\nIncludes 5 LEGO® Star Wars™ minifigures: Bail Organa, Princess Leia, Captain Antilles, C-3PO and a Rebel Fleet Trooper, plus an R2-D2 droid LEGO figure.\nTantive IV LEGO® Star Wars™ construction toy features a radar that doubles as a carry handle, 2 detachable escape pods with space for a minifigure inside, opening cargo hold and removable cargo box, opening 2-minifigure cockpit, rotating and elevating stud-shooting turrets on top and 2 spring-loaded shooters underneath. The top hull detaches to reveal a detailed interior including a conference table, weapon rack and a control console with 2 seats for the minifigures.\nWeapons include a blaster pistol and 3 blasters.\nAlso includes a pair of electrobinoculars.\nCaptain Antilles minifigure is an updated version from 2009, while Princess Leia's skirt and Bail Organa are new for April 2019.\nThis highly detailed building toy construction set includes over 1,750 pieces.\nRecreate amazing moments from the opening scene of Star Wars: A New Hope or play out your own exciting adventures!\nLEGO® Star Wars™ starship measures over 5” (14cm) high, 24” (62cm) long and 7” (19cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/nebulon-b-frigate-77904","description":"Let fans celebrate the 40th anniversary of Star Wars: The Empire Strikes Back with this delightful LEGO® brick display model of the Nebulon-B Frigate (77904). A super gift idea for fans aged 9 and up, this collectible inspires memories of Luke Skywalker recovering from injury following his epic lightsaber duel with Darth Vader and other dramatic scenes aboard the versatile Rebel cruiser.\n\nDesigned for display\nPacked with authentic details, the starship comes with a brick-built stand to complete a classic LEGO Star Wars™ centerpiece that will grab people’s attention wherever it is displayed.\n\nThe LEGO Star Wars universe\nSince 1999, the LEGO Group has been recreating iconic starships, vehicles, locations and characters from the Star Wars universe. LEGO Star Wars has become its most successful theme with a wide variety of sets to delight fans of all ages.\n\nLet fans mark the 40th anniversary of Star Wars: The Empire Strikes Back and inspire memories of epic scenes with this collectible, brick-built version of the Nebulon-B Frigate (77904).\nThe distinctive design of the Nebulon-B Frigate is beautifully recreated in LEGO® bricks and the display stand completes an impressive centerpiece.\nThis 459-piece construction kit offers an enjoyable challenge for LEGO® builders and makes the best birthday present, holiday gift or special surprise for Star Wars™ fans aged 9 and up.\nMeasuring 7.5 in. (19 cm) high, 12 in. (31 cm) long and 2.5 in (7 cm) wide, this buildable model is sure to draw admiring looks wherever it is displayed.\nThinking of buying this set for a young Star Wars™ fan who is a LEGO® beginner? No problem. It comes with illustrated, step-by-step instructions so they can build independently and with confidence.\nLEGO® Star Wars™ building sets are great for kids (and adult fans) to recreate scenes from the Star Wars saga,make up their own adventures or simply display the collectible construction toys.\nLEGO® components meet rigorous industry standards to ensure they connect consistently and securely.\nLEGO® bricks and pieces are tested to the max to make sure that they satisfy stringent global safety standards."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/death-star-75159","description":"Reenact amazing scenes from the Star Wars saga with the Empire’s ultimate planet-zapping weapon—the Death Star! With over 4,000 pieces, this fantastic model has a galaxy of intricate and authentic environments, including a superlaser control room, Imperial conference chamber, hangar bay with moving launch rack and Lord Vader’s TIE Advanced with space for Vader inside, Emperor Palpatine’s throne room, Droid maintenance room, detention block, trash compactor, tractor beam, cargo area, turbo laser with spring-loaded shooters and seats for the 2 Death Star Gunners, and 2 movable turbo laser towers. This fantastic set also includes 23 iconic minifigures and 2 Droids to ensure hours of Star Wars battle fun.\n\nBuild the giant, super-detailed ultimate battle station of the evil Empire\nIncludes key locations and features from Star Wars: Episode IV A New Hope and Star Wars: Episode VI Return of the Jedi\nIncludes 23 minifigures: Grand Moff Tarkin, Darth Vader, Emperor Palpatine, Imperial Navy Officer, Imperial Officer, 2 Stormtroopers, 2 Death Star Troopers, 2 Emperor’s Royal Guards, 2 Death Star Gunners, Death Star Droid, Obi-Wan Kenobi, Chewbacca, Princess Leia, C-3PO, Han Solo (disguised), Luke Skywalker (Tatooine), Luke Skywalker (disguised) and Luke Skywalker (Final Duel), plus R2-D2, an Imperial Astromech and a buildable Dianoga trash compactor monster\nLEGO Star Wars building toys are compatible with all LEGO construction sets for creative building\nMeasures over 16” high and 16” wide\n4,016 pieces – For boys and girls 14 years and older"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/droid-commander-75253","description":"Introduce your Star Wars™ fan to a rich LEGO® brick galaxy of lovable droids, exciting missions and coding fun for kids with the LEGO Star Wars BOOST Droid Commander set. This interactive robot toy puts your child in command of 3 app-controlled Star Wars LEGO droids: R2-D2, a Gonk Droid and a Mouse Droid, each with their own personalities and skills. Using the free LEGO BOOST Star Wars app, your young commander builds the droids, inserts the Bluetooth-controlled Move Hub into the one that will solve each mission, and brings it to life using the intuitive drag-and-drop coding environment (visit LEGO.com/devicecheck for a list of compatible devices). Your youngster then constructs tools, weapons, targets, obstacles and lots more as they progress through over 40 exciting missions – they’ll love it! This set makes a great birthday or Christmas gift or just a gift for any occasion. It also helps youngsters develop their critical thinking and creative problem-solving skills, introduces them to basic engineering and robotics, and, just as importantly, lets them play in a rich and expansive galaxy filled with unforgettable icons like Luke Skywalker, X-wings, the Death Star and many more.\n\nKids will learn to code and develop creative problem-solving skills as they play with this interactive STEM toy, featuring 3 buildable LEGO® Star Wars™ droids and over 40 interactive missions.\nThis fun LEGO® Star Wars™ tech toy for kids includes a color & distance sensor, interactive motor, Move Hub and 1,177 pieces – enough to build all 3 lovable R2-D2, Gonk Droid and Mouse Droid LEGO figures. Please note that only one robot can be brought to life at a time using the included Bluetooth-controlled Move Hub.\nBuildable props include rocket boosters, a catapult, a cake shooter, a target, color decoder, obstacles and many more.\nKids aged 8+ will love building the robot toys using the free LEGO® BOOST Star Wars™ app, attaching the tools and weapons, and bringing them to life to solve fun, challenging missions with the easy-to-use coding environment. Visit LEGO.com/devicecheck for a list of compatible devices.\nThis great Christmas, birthday or gift idea for any occasion features unforgettable characters, locations, sounds and music from episodes I-VI of the Star Wars™ movie saga, which kids and adults will love to interact with.\nLEGO® brick R2-D2 measures over 7” (20cm) high, 3” (10cm) long and 5” (14cm) wide. LEGO Gonk Droid measures over 7” (18cm) high, 6” (16cm) long and 3” (9cm) wide. LEGO Mouse Droid measures over 5” (14cm) high, 6” (17cm) long and 3” (9cm) wide.\nFree LEGO® BOOST Star Wars™ Droid Commander app is available for selected iOS, Android and Fire smart devices. Ask your parents’ permission before going online.\nIncludes LEGO® Light Brick.\nThis set features digital building instructions. Now it’s easy to follow the steps on your mobile device or download a PDF of the printed building guide. Click the Building Instructions button at the bottom of this page to find and download the instructions."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/slave-l-20th-anniversary-edition-75243","description":"Celebrate the 20th anniversary of LEGO® Star Wars™ playsets with this detailed reinterpretation of Boba Fett’s classic Slave I. This iconic 75243 LEGO Star Wars starship is the most detailed version to date with features such as a self-leveling cockpit seat and side wings, a carry handle for easy transport and trigger-fired spring-loaded shooters. This amazing LEGO Star Wars collectible construction toy also includes a closing rear hatch to store the Han Solo in Carbonite element and 4 LEGO Star Wars minifigures, plus a bonus Princess Leia minifigure and display stand with 20th anniversary logo to mark this momentous milestone in the history of LEGO Star Wars sets.\n\nIncludes 4 LEGO® Star Wars™ minifigures: Boba Fett, Han Solo, Zuckuss and 4-LOM, plus a bonus 20th anniversary Princess Leia minifigure with display stand.\nSlave I LEGO® Star Wars™ set features a detachable cockpit canopy with space for a minifigure inside, a self-leveling cockpit seat and side wings, a carry handle, separate triggers for the 2 spring-loaded shooters, rotating guns and a closing rear hatch to store the Han Solo in Carbonite element.\nWeapons include 3 blasters, Han Solo's blaster pistol and Princess Leia’s original blaster pistol for creative play.\nPrincess Leia minifigure is a faithful representation of the original version from 2000 and includes a 20th anniversary logo.\nNew-for-April-2019 details include a new molded head for Zuckuss and left/right angled stone 3x3 elements.\nConnect the LEGO® Star Wars™ 20th anniversary minifigure display stands for the perfect centerpiece.\nThis building toy makes a great LEGO® Star Wars™ gift for builders aged 9 and above.\nSlave I construction toy measures over 5” (13cm) high, 11” (29cm) long and 12” (31cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/major-vonreg-s-tie-fighter-75240","description":"Give any kid a great introduction to the Star Wars Resistance TV series with this LEGO® Star Wars™ 75240 Major Vonreg’s TIE Fighter starship construction toy. This detailed model includes a special black and red color scheme, opening cockpit with space to sit the Major Vonreg minifigure inside, plus 2 spring-loaded shooters that are fired by moving the trigger left and right. This building toy also includes General Leia and Kaz Xiono LEGO Star Wars minifigures and an R1-J5 droid LEGO figure, a.k.a. Bucket.\n\nIncludes 3 LEGO® Star Wars™ minifigures: Major Vonreg, Kaz Xiono and General Leia, plus Bucket (R1-J5).\nLEGO® Star Wars™ TIE Fighter construction toy features an opening minifigure pilot cockpit, special black and red detailing, and 2 spring-loaded shooters that are fired by sliding the trigger left and right.\nAlso includes 3 blaster pistols.\nNew-for-April-2019 details include Major Vonreg's helmet, Kaz's hair element and new molded 4x6 left- and right-wing elements.\nRecreate fun space fighter missions from the hit Star Wars Resistance TV series.\nLEGO® Star Wars™ building toy starship measures over 6” (16cm) high, 9” (23cm) long and 7” (18cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/at-ap-walker-75234","description":"Add some heavy firepower to any LEGO® fan’s collection with the tough LEGO Star Wars™ 75234 AT-AP Walker. This impressive model features articulated legs and a retractable third leg, plus an opening top and sides that reveal a detailed 2-minifigure cockpit. The model also includes a rotating and elevating top turret with a seat for a minifigure and a spring-loaded shooter for exciting battling action. With Chewbacca, Clone Commander Gree and Kashyyyk Clone Trooper minifigures plus 2 Kashyyyk Battle Droid LEGO figures, this collectible construction toy makes for a great birthday gift for kids.\n\nIncludes 3 LEGO® Star Wars™ minifigures: Chewbacca, Clone Commander Gree and a Kashyyyk Clone Trooper, plus 2 Kashyyyk Battle Droid LEGO figures.\nAT-AP Walker features articulated legs and retractable third leg, a detailed 2-minifigure cockpit accessible from the top and side hatches, a locking, rotating and elevating upper turret with a seat for a minifigure and spring-loaded shooter.\nWeapons include Chewbacca's bowcaster and 4 blasters.\nBattle Droid Star Wars™ LEGO® figures feature new-for-January-2019 head decoration and torso color.\nRecreate action-filled Star Wars™: Revenge of the Sith style Kashyyyk battles!\nGo up against the 75233 Droid Gunship for even more Kashyyyk action!\nImperial walker Star Wars™ building toy measures over 9” (24cm) high, 11” (29cm) long and 5” (15cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/action-battle-echo-base-defense-75241","description":"Give an all-new-for-April-2019 build and play experience with this LEGO® Star Wars™ 75241 Action Battle Echo Base Defense building toy. Kids will love to share the building experience with their friends as they construct a LEGO brick Echo Base scene from Star Wars: The Empire Strikes Back, featuring a Rebel base entrance gate, blaster tower, trench section with Probe Droid and an Imperial AT-AT Walker. Opponents load up their powerful shooters and take turns to hit each other's targets to blast the Rebel Trooper and Snowtrooper minifigures into the air, blast open the Rebel base gate and bring the AT-AT crashing to the ground. This entertaining LEGO Star Wars battle construction playset offers endless creative play for kids of any age. Includes 5 LEGO Star Wars minifigures.\n\nIncludes 5 LEGO® Star Wars™ minifigures: 2 Snowtroopers and 3 Rebel Troopers.\nBuilding toy features a Rebel base entrance gate, blaster tower, trench section with a buildable Probe Droid, and a collapsible AT-AT Walker. Each side has 3 targets to hit.\nConstruction toy set also comes with 2 shooters and 4 missiles.\nEnjoy endless LEGO® Star Wars™ battles with friends and family to see who can defeat their opponent by hitting their targets.\nHit the red targets to send the Snowtroopers flying and AT-AT crashing to the ground. Hit the blue targets to send the Rebel Troopers flying and blast the entrance gate open.\nCreate exciting Star Wars: The Empire Strikes Back battles with this creative play LEGO Star Wars™ merchandise.\nEntrance gate with tower measures over 3” (10cm) high, 9” (25cm) wide and 3” (10cm) deep.\nAT-AT Walker construction toy measures over 5” (13cm) high, 5” (15cm) long and 2” (7cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/black-ace-tie-interceptor-75242","description":"Let kids build and play with the amazing LEGO® Star Wars™ 75242 Black Ace TIE Interceptor™ building toy from the hit TV show, Star Wars Resistance. This detailed Star Wars starship features an opening cockpit to sit ace pilot Griff Halloran, 2 spring-loaded shooters on the wingtips and a removable panel at the back to store a spare missile. This fun construction toy includes 2 LEGO Star Wars minifigures and a droid LEGO figure.\n\nLEGO® Star Wars™ building toy includes 2 minifigures: Griff Halloran and Poe Dameron, plus a BB-8 droid LEGO figure.\nTIE Interceptor LEGO® Star Wars™ model features an opening minifigure cockpit, wingtip-mounted spring-loaded shooters, plus an opening rear hold to store the spare missile.\nAlso includes 2 blaster pistol weapons.\nTIE Interceptor building set for kids measures over 3” (8cm) high, 14” (36cm) long and 8” (21cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/bespin-duel-75294","description":"Disconnect from the daily grind and reconnect with nostalgic Star Wars™ memories with this detailed Bespin Duel build-and-display LEGO® model (75294). Marking the 40th anniversary of Star Wars: The Empire Strikes Back, it cleverly recreates the iconic Luke Skywalker vs. Darth Vader Cloud City duel scene.\n\nBuild and display\nThis fun, creative construction set features Luke Skywalker and Darth Vader LEGO minifigures with lightsabers. It also has a display stand with a 40th anniversary nameplate to complete a wonderful centerpiece for your home or office. And don’t worry if you are a LEGO® newcomer – step-by-step instructions are included so you can enjoy a stress-free building experience.\n\nMindful relaxation\nThe LEGO Group has been recreating iconic starships, vehicles, locations and characters from the Star Wars universe since 1999. This building set for adults makes a super gift for yourself or Star Wars fans and hobbyists in your life looking for a mindful way to unwind from the daily grind.\n\nTake time out to relax, reawaken nostalgic Star Wars™ memories and celebrate the 40th anniversary of Star Wars: The Empire Strikes Back in LEGO® style with this Bespin Duel (75294) build-and-display model.\nWith this construction set, you can recreate the iconic Cloud City duel scene on a stand with a nameplate, adding lightsaber-wielding Luke Skywalker and Darth Vader LEGO® minifigures to complete a classic display piece.\nThis beautifully detailed Bespin building set makes a great addition to Star Wars™ fans’ memorabilia collections, and any LEGO® enthusiast will love to show it off alongside their other creations.\nThis 295-piece Star Wars™ construction kit is great for solo building or sharing the creative fun with your friends. It also makes a super birthday or holiday gift for the Star Wars fan or hobbyist in your life.\nThe buildable model measures over 8” (20cm) high, 9” (23cm) wide and 4” (11cm) deep – it doesn't need a huge amount of space for display, but its striking, authentic details are sure to grab people’s attention.\nNo batteries required. This awesome LEGO® Star Wars™ building set offers a fun, stress-relieving build with LEGO bricks only. So chill out and enjoy creating a beautiful display piece.\nIncludes step-by-step instructions so even LEGO® newcomers can build confidently and enjoy the calm, quiet joy of building, plus an illustrated booklet about the set, the stories that inspired it and its model designer.\nThis construction set foradults is part of a collection of inspiring LEGO® building kits designed for you, the discerning hobbyist, as you look for your next creative DIY project.\nNo need to use the Force to connect or pull apart LEGO® bricks! Ever since 1958, they have met the highest industry standards to ensure that they fit together perfectly and with ease.\nLEGO® bricks and pieces are crushed, twisted, dropped, heated and analyzed to ensure that all Star Wars™ building sets meet the highest safety and qualitystandards on Earth – and in every galaxy!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/lego-star-wars-advent-calendar-75279","description":"Kids can wake up to a gift every day in the run-up to Christmas with the 2020 LEGO® Star Wars™ Advent Calendar (75279) holiday building set. Behind each of the 24 doors is a Star Wars LEGO minifigure, LEGO figure, buildable starship, vehicle or location. Also, look out for a code to unlock Star Wars: The Skywalker Saga game content. Quick builds, unlimited creative fun There are 6 LEGO minifigures and 6 LEGO figures to discover, such as Darth Vader with Christmas sweater decoration and D-O with a festive hat, plus a foldout playmat with an image of the Millennium Falcon with Christmas lights to inspire creative play. The 12 mini builds in this holiday calendar include Anakin’s Podracer, a Republic Cruiser and Darth Vader’s Castle. Great gift ideas Since 1999, the LEGO Group has been recreating iconic starships, vehicles, locations and characters from the legendary Star Wars universe. LEGO Star Wars building toys are hugely popular, with fun Christmas gift ideas for kids and fans of all ages.\nBuild Christmas joy with the LEGO® Star Wars™ Advent Calendar (75279), featuring buildable characters, vehicles and locations behind each door. There is also a code to unlock Star Wars: The Skywalker Saga game content.\nIncludes 6 LEGO® minifigures and 6 LEGO figures, such as Poe Dameron and Darth Vader with Christmas sweater decorations and Tauntaun with a red nose, plus a foldout playmat with a Millennium Falcon image for role play.\nThere are also 12 mini build toys including the Millennium Falcon, an A-wing, TIE Fighter, X-wing, Droid Control Ship, Anakin’s Podracer and Darth Vader’s Castle to spark kids’ imaginations in the run-up to Christmas.\nThis 311-piece advent calendar building set makes a fun Christmas holiday gift for kids aged 7 and up, and the characters and construction models can be used with other LEGO® Star Wars™ sets for even more creative play.\nBetween door-opening ceremonies and playtime adventures, the 2020 LEGO® Star Wars™ Advent Calendar makes an eye-catching, festive display piece in any room.\nThe collectibles found in this LEGO® Star Wars™ Advent Calendar construction playset are built with LEGO bricks and powered by children’s creativity – no batteries required – so their galactic adventures never stop!\nIs your youngster a LEGO® newbie? Don't worry. There is a drawing showing the bricks for each mini build in this Star Wars™ Xmas Advent calendar to guide them, so they can build with the confidence of a true Jedi!\nLEGO® Star Wars™ building toys are awesome for kids (and adult fans) to recreate scenes from the saga, dream up original stories or just build and display the awesome construction models.\nNo need to use the Force to connect or pull apart LEGO® bricks! Ever since 1958, they have met the highest industry standards to ensure that they fit together perfectly and with ease.\nLEGO® bricks and pieces are tested in almost every way imaginable so you can be sure that this Xmas Advent calendar meets the highest safety and quality standards on planet Earth – and in galaxies far, far away!"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/pasaana-speeder-chase-75250","description":"Inspire action-packed play with these 2 LEGO® Star Wars™ construction toys from the Star Wars: The Rise of Skywalker movie. Creative kids and collectors will love the fun details, like the treadspeeder’s tank track, side-mounted stud shooters and a transparent stand for a ‘hovering' look. This fun set also includes Star Wars characters Rey, a First Order Jet Trooper and a First Order Treadspeeder Driver, plus a BB-8 droid LEGO figure.\n\nComes with exciting LEGO® Star Wars™ characters including 3 minifigures – Rey, First Order Jet Trooper and a First Order Treadspeeder Driver – plus a BB-8 droid LEGO figure.\nTransport speeder has space for Rey and BB-8 and features a transparent stand for an authentic ‘hovering' look.\nTreadspeeder has a seat for a trooper plus a rubber tank track and 2 side-mounted stud shooters for exciting role-play action.\nMolded rocket element and Jet Trooper rocket elements are new for October 2019.\nWeapons include Rey’s blue Lightsaber, the Treadspeeder Driver’s blaster pistol and the Jet Trooper’s blaster.\nRecreate exciting moments from the Star Wars: The Rise of Skywalker movie with this fun LEGO® Star Wars™ kids’ toy.\nThis set makes a great birthday gift, Christmas present or just a Star Wars™ gift for any occasion.\nTransport speeder measures over 3” (10cm) high, 7” (19cm) long and 4” (11cm) wide.\nTreadspeeder measures over 1” (4cm) high, 5” (15cm) long and 2” (6cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/action-battle-endor-assault-75238","description":"Give an all-new-for-April-2019 LEGO® Star Wars™ build and play experience with this 75238 Action Battle Endor Assault set. Kids will love to build the tree and Imperial speeder bike models with friends and family. Then get ready for action as they load the powerful shooters and try to hit each other's target to send Wicket the Ewok flying and the Scout Trooper on his speeder bike toppling off the base. This fun-filled LEGO Star Wars construction playset offers endless creative play for kids of any age. Includes 2 minifigures.\n\nIncludes 2 LEGO® Star Wars™ minifigures: Ewok warrior Wicket and a Scout Trooper.\nBattle of Endor construction toy set features a speeder bike LEGO® Star Wars™ vehicle on a base and a buildable tree, both with a target.\nAlso comes with 2 shooters and 4 missiles.\nKids can enjoy hours of construction toy fun challenging friends and family to see who can hit their opponent's target and send their character flying.\nScout Trooper features a new-for-April-2019 helmet element and new torso and leg decoration.\nSpeeder bike building toy measures over 2” (6cm) high, 3” (10cm) long and 2” (7cm) wide.\nTree measures over 4” (11cm) high, 3” (10cm) wide and 2” (6cm) deep."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/anakin-s-podracer-20th-anniversary-edition-75258","description":"Celebrate 20 years of LEGO® Star Wars™ sets with 75258 Anakin’s Podracer. This reinterpretation of the original 7131 model released in 1999 features big engines, extending flaps, space to fit the young Anakin minifigure in the cockpit and a play handle that let kids play out endless Star Wars: The Phantom Menace races around the living room. This cool building toy also includes a Padmé Amidala minifigure plus a bonus Luke Skywalker minifigure and display stand with 20th anniversary logo to celebrate this milestone in LEGO Star Wars history.\n\nIncludes 3 LEGO® Star Wars™ minifigures: Anakin Skywalker, Padmé Amidala and bonus anniversary Luke Skywalker in his X-wing pilot suit on a detachable display stand.\nLEGO® Star Wars™ construction toy features big engines, extending flaps, an open minifigure cockpit and a convenient play handle.\nWeapons include Luke Skywalker's blue Lightsaber and a blaster for Padmé.\nAlso includes Luke's wrench accessory element.\nPadmé's wig element is new for April 2019.\nThis classic building toy is a reinterpretation of the 7131 Anakin’s Podracer set from 1999 and makes a great LEGO® Star Wars™ gift for builders of any age.\nPilot Luke Skywalker minifigure is a faithful representation of the original minifigure from 1999 and includes a 20th anniversary logo.\nConnect the LEGO® Star Wars™ 20th anniversary minifigure display stands for the perfect centerpiece.\nPlay out exciting race scenes from Star Wars: The Phantom Menace and other scenes from the Star Wars saga.\nLEGO® Star Wars™ vehicle measures over 3” (10cm) high, 13” (35cm) long and 4” (12cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/resistance-a-wing-starfighter-75248","description":"Let the LEGO® builder or Star Wars™ fan in your life enjoy this brick-built 75248 Resistance A-Wing Starfighter playset. Featuring an opening cockpit with space for the included Snap Wexley Star Wars character, retractable landing gear, non-firing wingtip cannons and 2 integrated spring-loaded shooters, this detailed starship from the Star Wars: The Rise of Skywalker movie will inspire young minds and makes a great collectible for any fan. The set also includes a Lieutenant Connix minifigure for even more fun space adventures.\n\nIncludes Snap Wexley and Lieutenant Connix LEGO® Star Wars™ minifigures.\nThis Star Wars™ building toy features an opening minifigure cockpit, retractable landing gear, wingtip cannons and 2 integrated spring-loaded shooters.\nPlayset weapons include Snap Wexley's blaster pistol and Lieutenant Connix's blaster.\nRecreate exciting moments from the Star Wars: The Rise of Skywalker movie.\nMakes a great birthday gift, Christmas present or surprise gift for any occasion.\nLEGO® Star Wars™ starship measures over 2” (7cm) high, 7” (20cm) long and 4” (12cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/x-wing-starfighter-trench-run-75235","description":"Let your child play out unforgettable LEGO® Star Wars™ space adventures with the 75235 X-Wing Starfighter Trench Run collectible building toy. This LEGO 4+ set is designed to be fun and easy for youngsters, with folding wings and an opening minifigure cockpit, plus a special Starter Brick base that lets even first-time builders experience the pride of constructing buildings, vehicles and more, all on their own. The included simple guide to build and play will also help your young Rebel warrior understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO brick building in a familiar Star Wars setting. This simple LEGO set also includes a rotating turret for endless action play as well as Luke Skywalker and Stormtrooper minifigures, plus an R2-D2 Star Wars LEGO droid figure.\n\nLEGO® 4+ sets are specially designed to be fun and easy for youngsters and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nIncludes 2 LEGO® Star Wars™ minifigures: Luke Skywalker in his X-wing pilot suit and a Stormtrooper, plus an R2-D2 LEGO figure.\nThis set features an easy-to-build X-wing Starfighter and a turret with firing disc shooters.\nX-wing, as seen in the blockbuster Star Wars™: A New Hope movie, features opening wings and a cockpit to sit Luke in, plus a Starter Brick base to quickly get your child building and playing in an exciting LEGO® Star Wars galaxy far, far away.\nWeapons include Luke’s Lightsaber and the Stormtrooper’s blaster.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ play sets were previously branded as LEGO Juniors and are compatible with all LEGO building toys for creative play.\nMakes an ideal gift for preschoolers and youngsters.\nCombines with the 75237 TIE Fighter Attack and 75247 Rebel A-Wing Starfighter 4+ sets for loads of fun-filled Star Wars™ adventures in the stars.\nX-wing LEGO® Star Wars™ construction toy measures over 3” (9cm) high, 5” (15cm) long and 7” (18cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/anakin-s-jedi-starfighter-75214","description":"Boost any young Padawan’s collection with LEGO® Star Wars 75214 Anakin’s Jedi Starfighter. The sleek shape of this instantly recognizable interceptor from Star Wars: The Clone Wars features retractable landing gear, an opening LEGO minifigure cockpit for Anakin to sit in, a clip underneath for his Lightsaber, a hidden compartment for extra ammo, space for R2-D2 and wing-mounted stud shooters.\n\nIncludes an Anakin Skywalker minifigure and R2-D2 droid figure.\nAnakin’s Jedi Starfighter features retractable landing gear, an opening minifigure cockpit, space for R2-D2, a storage clip for Anakin’s Lightsaber, hidden compartment for extra ammo and stud shooters on the wings.\nIncludes Anakin's Lightsaber.\nMeasures over 3” (8cm) high, 10” (27cm) long and 5” (13cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/duel-on-starkiller-base-75236","description":"Play out unforgettable moments from Star Wars: The Force Awakens with the 75236 Duel on Starkiller Base™ construction toy. Featuring a forest scene set on the First Order’s failing Starkiller Base, your Star Wars™ fan can place Rey and her nemesis Kylo Ren on the rotating bases and play out a spinning Lightsaber battle. This fun LEGO® Star Wars building toy is also hinged to recreate a crevice opening up as the base breaks up, as well as trees that the characters can topple to reveal a hidden blaster. Get set for epic creative play on Starkiller Base!\n\nIncludes Rey and Kylo Ren LEGO® Star Wars™ minifigures.\nStar Wars™ collectible construction toy features rotating bases for spinning Lightsaber duels, toppling trees (one with a hidden blaster), and a hinged design to recreate an opening crevice for the characters to dodge.\nWeapons include Rey's blue Lightsaber and Kylo Ren's red Lightsaber.\nRotate the bases to send Rey and Kylo into a spinning Lightsaber battle!\nKnock down the Starkiller Base trees to reveal the hidden blaster.\nKylo Ren minifigure features new-for-April-2019 torso, head and leg decoration.\nLEGO® Star Wars™ construction playset measures over 3” (8cm) high, 4” (12cm) wide and 3” (9cm) deep."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/kylo-ren-sith-trooper-75232","description":"Build and display legendary Star Wars™ villains Supreme Leader Kylo Ren and a Sith Trooper. This LEGO® BrickHeadz™ 75232 set features brick-built versions of the characters from the blockbuster Star Wars: The Rise of Skywalker movie, plus fun details like Kylo's signature Lightsaber and helmet, and the Sith Trooper's weapon and unique red armor. Fans can also mount these LEGO Star Wars building toy construction characters on the included baseplates to show their devotion to the mighty First Order.\n\nSupreme Leader Kylo Ren & Sith Trooper LEGO® BrickHeadz™ Star Wars™ building toys feature lots of authentic details from the blockbuster Star Wars: The Rise of Skywalker movie, including Kylo’s signature Lightsaber, cape and helmet, and the Sith Trooper's weapon and unique red armor.\nLEGO® BrickHeadz™ construction characters come with their own buildable collector's baseplate.\nEach LEGO® Star Wars™ figure stands over 2” (7cm) tall.\nBaseplates each measure over 1” (4cm) square."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/t-16-skyhopper-vs-bantha-microfighters-75265","description":"Give young kids an exciting introduction to the LEGO® Star Wars™ universe with this T-16 Skyhopper vs Bantha Microfighters (75265) starship toy building set. The Bantha and stud-shooting Skyhopper building toys, inspired by Star Wars: A New Hope, are easy to build so the battle play starts fast. Great for solo or group play, children can team up with the Skyhopper pilot or Tusken Raider buildable toy minifigure riding the Bantha into battle. Instructions PLUS! Instructions PLUS offer a digital, interactive guide to building this popular, collectible Star Wars construction toy. Available in the free LEGO Life app, they have zoom and rotate viewing tools to help even younger children build the LEGO brick models. Cool! Top gifts! The LEGO Group has been recreating iconic starships, vehicles, locations and characters from the legendary Star Wars universe since 1999. LEGO Star Wars is now its most successful theme with top birthday, Christmas and surprise gifts for kids and adults.\nYoung kids will love role-playing duels and creating their own exciting stories with this LEGO® Star Wars™ Microfighters starship toy building set (75265), featuring quick-to-build T-16 Skyhopper and Bantha models.\nThe T-16 Skyhopper has 2 stud-shooters and a seat for the pilot minifigure, and the posable Star Wars™ Bantha figure has a saddle for the Tusken Raider minifigure and a Bantha stick holder to inspire action play.\nGreat for solo or social play with friends, this collectible building toy has plenty of LEGO® building bricks to spark fans’ imaginations and build creatively with other LEGO Star Wars™ sets.\nWith 2 easy-to-build models, this 198-piece starship construction playset makes a great birthday gift, Christmas present or special-occasion surprise for kids aged 6+ to introduce them to LEGO® Star Wars™ sets.\nThe Bantha measures over 1” (5cm) high, 4” (12cm) long and 1” (4cm) wide and the T-16 Skyhopper measures over 2” (7cm) high, 3” (8cm) long and 3” (8cm) wide – a nice size to fit in a child’s bag for play on the go.\nNo batteries required! This popular LEGO® Star Wars™ buildable toy starship is powered by kids’ imaginations, so they can use the Skyhopper, buildable Bantha figure, pilot and Tusken Raider for unlimited adventures.\nHelp even younger children build independently with Instructions PLUS, available in the free LEGO® Life app, which allow them to view a virtual version of the construction models while they build them. Awesome!\nLEGO® Star Wars™ buildable toys are fantastic for kids (and adult fans) to recreate scenes from the saga, make up their own stories or just build and display the collectible construction models.\nNo need to use the Force to connect or pull apart LEGO® building bricks! Ever since 1958, they have met the highest industry standards to ensure they fit together with ease.\nLEGO® bricks and pieces are tested to the max to make sure that every building set meets the highest safety standards on planet Earth (and in galaxies far, far away!)."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/tie-fighter-attack-75237","description":"Give your young Imperial pilot the perfect introduction to LEGO® Star Wars™ starship battles with this 75237 TIE Fighter Attack set. With an opening cockpit with space inside for the TIE Fighter Pilot minifigure and special Starter Bricks that let even first-time builders experience the pride of constructing the model, all on their own, LEGO 4+ safe learning sets are specially designed to be fun and easy for preschoolers and youngsters. This TIE Fighter also includes a small Rebel command station and Rebel Fleet Trooper minifigure for endless play fun, while the included simple guide to build and play will also help youngsters understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO brick building in an inspiring Star Wars setting.\n\nLEGO® 4+ sets are specially designed to be fun and easy for youngsters and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nIncludes 2 LEGO® Star Wars™ minifigures: a TIE Fighter Pilot and a Rebel Fleet Trooper.\nThis set features an easy-to-build TIE Fighter and a small Rebel command station.\nTIE Fighter, as seen in the blockbuster Star Wars™: A New Hope movie, features an opening minifigure cockpit with space to sit the TIE Fighter Pilot, plus Starter Brick lower frame and wings to quickly get your child building and playing in an exciting LEGO® Star Wars galaxy far, far away.\nAlso includes 2 blaster weapons.\nLEGO® 4+ play sets were previously branded as LEGO Juniors and are compatible with all LEGO building toys for creative play.\nLEGO® 4+ construction toys introduce your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nMakes an ideal LEGO® building brick gift for preschoolers and youngsters.\nCombines with the 75235 X-Wing Starfighter Trench Run and 75247 Rebel A-Wing Starfighter 4+ sets for loads of fun-filled LEGO® Star Wars™ adventures.\nTIE Fighter LEGO® Star Wars™ ship measures over 5” (14cm) high, 4” (11cm) long and 4” (12cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/kylo-ren-s-shuttle-microfighter-75264","description":"Open up a galaxy of adventures for young kids with LEGO® Star Wars™ Kylo Ren’s Shuttle Microfighter (75264) from Star Wars: The Rise of Skywalker. The quick-build Star Wars shuttle has foldable wings for flight and landing modes, plus 2 stud shooters for battle action. A minifigure of iconic Star Wars character Kylo Ren with a Lightsaber for role-play completes this compact, collectible building toy. Zoom, rotate and visualize! Instructions PLUS are available via the LEGO Life App! Kids canzoom in on, rotate and visualize the Star Wars Upsilon-class shuttle to guide the real-life building process, allowing even younger children to build independently. Awesome! Enter the LEGO Star Wars universe The LEGO Group has been recreating iconic starfighters, vehicles, locations and characters from the legendary Star Wars universe for more than two decades. LEGO Star Wars has become a hugely successful theme, with birthday, Christmas and special occasion gift ideas to delight all ages. So why not get involved?\nNewcomers to LEGO® Star Wars™ building toys can role-play as an iconic villain with this quick-to-build, stud-shooting LEGO version of Kylo Ren’s Shuttle Microfighter (75264), first seen in Star Wars: The Force Awakens.\nKids will love playing the bad guy – piloting the shuttle, adjusting its wings for flight or landing mode, and attacking the Resistance with 2 stud shooters and the Kylo Ren minifigure's Lightsaber!\nKylo Ren has a new-for-January-2020 helmet (with cracked decoration) andhis own Lightsaber, and there are lots of LEGO® bricks to inspire young fans to build creatively with other LEGO Star Wars™ sets.\nThis buildable 72-piece playset makes a cool birthday gift for boys and girls aged 6+ to introduce them to LEGO® Star Wars™ action. Add the 75263 Resistance Y-wing Microfighter for First Order vs. Resistance battles.\nThis LEGO® Star Wars™ Kylo Ren's command shuttle measures over 2” (7cm) high, 2” (7cm) long and 2” (6cm) wide – so it fits easily into your own bag or a child’s backpack ready for play on the go.\nNo batteries required! This buildable toy playset is powered purely by free-thinking creativity, so children can let their imaginations run wild and the action never stops!\nGive even younger builders an awesome, digitally interactive building experience with Instructions PLUS, featuring intuitive zoom, rotate and ghost modes to help build this Star Wars™ Upsilon-class shuttle.\nLEGO® Star Wars™ building kits open up a galaxy of adventuresfor kids (and adult fans) to recreate Star Wars saga scenes and make up their own stories… or simply show off the collectible build-and-display models.\nNo need to use the Force to connect or pull apart LEGO® bricks! Ever since 1958, they have met the highest industry standards to ensure that they fit together perfectly and with ease.\nLEGO® bricks and pieces are tested in almost every way imaginable to make sure that every building set meets the highest safety standards on planet Earth (and in galaxies far, far away!)."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/resistance-y-wing-microfighter-75263","description":"Give your youngster an inspiring introduction to LEGO® Star Wars™ construction toy playsets with this easy-to-build Star Wars: The Rise of Skywalker Resistance Y-wing Microfighter (75263). Featuring a new-for-January-2020 red and white color scheme, the Y-wing fighter also has flick missiles and a rotating gun turret for battle action. Kids can also role-play as a heroic Resistance pilot with the Zorii Bliss minifigure. Go digital! This building toy is a great gift idea for young LEGO Star Wars fans and Instructions PLUS, available in the free LEGO Life app, offer an exciting, interactive way to build it. With zoom and rotate viewing tools to help them, even rookie builders get a feeling of independence… and Jedi-level awesomeness! Welcome to the LEGO Star Wars universe Since 1999, the LEGO Group has been recreating iconic starships, vehicles, locations and characters from the Star Wars universe. LEGO Star Wars is now its most successful theme with something for all ages. What's not to love?\nKids can role-play battles as Resistance heroine Zorii Bliss with this quick-to-build LEGO® version of the Resistance Y-wing Microfighter (75263) from Star Wars: The Rise of Skywalker!\nThis LEGO® brick Microfighter version of the Y-wing is ready to fight the First Order! It's got 2 flick missiles, a rotating gun turret, guns (non-firing) and a cockpit for the Zorii Bliss minifigure.\nThe buildable Y-wing model's color scheme and Zorii Bliss's helmet are both new for January 2020, and there's plenty to inspire young Star Wars™ fans to play creatively and combine with other LEGO® Star Wars sets.\nEasy to build – and to rebuild after battles against 75264 Kylo Ren’s Shuttle Microfighter – this 86-piece Y-wing Microfighter construction playset makes an ideal birthday or surprise gift for boys and girls aged 6+.\nThis compact and robust LEGO® Star Wars™ Y-wing fighter measures over 1” (3cm) high, 4” (11cm) long and 3” (8cm) wide – a convenient size to slip into a child's backpack ready for play wherever they go.\nNo batteries are needed with this kids’ construction toy – it’s built purely from LEGO® bricks and powered by children’s imaginations so the action never stops.\nMake building even more fun for kids with digital Instructions PLUS. Using the LEGO® Life app, even younger builders can zoom, rotate and visualize this construction model as they build the real-life version… Awesome!\nLEGO® Star Wars™ sets are fantastic for kids (and adult fans) to recreate scenes from the Star Wars saga, make up their own stories and display the collectible construction models.\nEver since 1958, LEGO® bricks have met the highest industry standards so they are robust and connect and pull apart easily every time – no need to use The Force!\nAt the LEGO Group, we drop, heat, crush, twist and analyze LEGO® bricks and pieces to make sure that every building set meets the highest safety standards on Earth (and in galaxies far, far away!)."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/obi-wan-kenobi-minifigure-30624","description":"Celebrate Triple Force Friday and the 20th anniversary of LEGO® Star Wars™ sets with this faithful representation of the original Obi-Wan Kenobi minifigure from 1999 on a display stand."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/stormtrooper-bag-tag-5005825","description":"Give any bag a LEGO® Star Wars™ makeover with this 5005825 Stormtrooper Bag Tag. Colored and shaped like one of the Galactic Empire’s most fearless soldiers, this 100% silicone tag is flexible and durable. It’s also easy to attach and has plenty of space on the back to write your contact details.\n\nStormtrooper Bag Tag is made from flexible, durable silicone in the shape of a Stormtrooper LEGO® minifigure with space on the back to write contact information.\nMeasures over 6” (16cm) long and 2” (6cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/lego-sw-darth-maul-watch-5004606","description":"Build your own LEGO® Star Wars™ watch! Start with the red and black face, then add red, black and gray links to build the watch band in any pattern you like. Includes an illustrated image of a LEGO Star Wars Darth Maul™ minifigure on the face. The two links around the face feature standard LEGO studs for attaching the additional LEGO elements that are included. Add the studded bezel and minifigure, and you're ready to tell time the LEGO Star Wars way!\nDarth Maul minifigure with lightsaber included!\nWatch face features image of LEGO Star Wars Darth Maul minifigure!\nLEGO ClicTime watches are tested to ISO standard 2281 to a static depth of 50m. This means that our watches are splash proof.\nBattery included."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/lego-sw-darth-vader-watch-5004607","description":"It's the only watch you connect and build yourself! Start with the black, red and grey pieces and build the watchband in any pattern and size you want. Add the studded bezel and minifigure, and you're ready to tell time the LEGO® Star Wars™ way!\n\nIncludes a Darth Vader™ minifigure, with lightsaber!\nWatch face features an image of Darth Vader on a Star Wars background!\nLEGO ClicTime watches are tested to ISO standard 2281 to a static depth of 50m. This means that our watches are splash proof.\nWatch face measures 1\" (2.5cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/lego-sw-storm-trooper-watch-5004609","description":"Take your Star Wars style to the next level with this durable LEGO® Star Wars Stormtrooper Minifigure Link Watch, featuring an easy-to-read, Stormtrooper-illustrated watch face with a red knurled crown and a buildable strap. Join the multicolored, interchangeable links to create galactic strap designs that fit comfortably around your wrist. Includes a Stormtrooper Minifigure.\n\nThis analog watch features a Stormtrooper face design, quartz movement, a scratch-resistant lens, hour, minute and second hands, plus interchangeable multicolored links.\nIncludes a Stormtrooper Minifigure.\nAdd and remove links to create your own strap designs to fit any wrist size.\nWater resistant up to 164’ (50m).\nBattery included."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/boba-fett-bag-tag-5005818","description":"Transform any bag into a LEGO® Star Wars™ bag with this 5005818 Boba Fett Bag Tag. Colored and shaped like the infamous Mandalorian bounty hunter, this 100% silicone tag is flexible and durable. It’s also easy to attach and has plenty of space on the back to write your contact details.\n\nBoba Fett Bag Tag is made from flexible, durable silicone in the shape of a Boba Fett LEGO® minifigure with space on the back to write contact information.\nMeasures over 5” (15cm) long and 1” (5cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/darth-vader-bag-tag-5005819","description":"Transform any bag into a LEGO® Star Wars™ bag with this 5005819 Darth Vader Bag Tag. Colored and shaped like the most iconic villain in the galaxy, this 100% silicone tag is flexible and durable. It’s also easy to attach and has plenty of space on the back to write your contact details.\n\nDarth Vader Bag Tag is made from flexible, durable silicone in the shape of a Darth Vader LEGO® minifigure with space on the back to write contact information.\nMeasures over 5” (15cm) long and 2” (6cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/holiday-bag-tag-yoda-5006034","description":"Add a fun touch to any LEGO® Star Wars™ fan’s bag, backpack or lunchbox with this cute Yoda holiday bag tag (5006034). This silicone tag features festive-looking Yoda with a flexible loop for easy attachment and space on the back to write personal contact details. A very wise Christmas present for ages 6 and up, this is.\n\nThis LEGO® Star Wars™ bag tag is made from flexible, durable silicone in the shape of a Yoda minifigure wearing a Santa hat and scarf, holding a candy cane.\nIncludes a flexible loop for easy attachment and space on the back to write contact information.\nMakes a fun Christmas gift for LEGO® Star Wars™ fans aged 6 and up.\nWarning: choking hazard from small parts.\nMeasures over 7” (19cm) long and 2” (6cm) wide."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/lego-star-wars-bb-8-keyring-853604","description":"Go on your own Star Wars themed adventures with this awesome BB-8 Key Chain. Attach it to your keys or backpack using the durable metal ring and chain and roll with this fun little astromech droid.\n\nFeatures an authentic LEGO® Star Wars BB-8 astromech droid attached to a durable metal ring and chain.\nAttach it to your keys or backpack.\nMinifigure is not detachable from metal chain.\nMakes a great gift for fans of Star Wars and LEGO® play sets.\nThis item offers an age-appropriate experience for ages 6 and over."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/bb-9e-keyring-853770","description":"Keep an Imperial Astromech with you on your travels with this LEGO® Star Wars 853770 BB-9E Key Chain. Attach BB-8’s Imperial counterpart on a durable metal ring and chain to your keys or backpack and get ready to roll into action!\n\nFeatures a LEGO® Star Wars BB-9E figure attached to a durable metal ring and chain.\nAttach it your keys, bag or backpack.\nFigure is not detachable from metal chain."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/han-solo-keyring-853769","description":"Carry an iconic smuggler on your daily adventures with this fun LEGO® Star Wars 853769 Han Solo Key Chain. Attach the minifigure on a durable metal ring and chain to your keys or backpack and get ready to take on gangsters, the Empire or the galaxy!\n\nFeatures a LEGO® Star Wars Han Solo minifigure attached to a durable metal ring and chain.\nAttach it your keys, bag or backpack.\nMinifigure is not detachable from metal chain."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/kylo-ren-keyring-853949","description":"Keep a true First Order legend by your side with this LEGO® Star Wars™ 853949 Kylo Ren Key Chain. Attach him to your keys or backpack using the sturdy metal ring and chain and travel the galaxy in search of Resistance fighters… or just your friends!\n\nFeatures a LEGO® Star Wars™ Kylo Ren minifigure linked to a durable metal ring and chain.\nAttach it to your keys or backpack.\nMinifigure is not detachable from metal chain."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/lego-star-wars-boba-fett-keyring-850998","description":"Connect with warrior and bounty hunter Boba Fett™ as you carry out your inter-galactic assignments! It’s simple when you attach the authentic LEGO® Star Wars™ Boba Fett minifigure, equipped with cool Mandalorian armor, to your keys or backpack.\n\nFeatures an authentic LEGO® Star Wars™ Boba Fett™ minifigure attached to a sturdy metal ring and chain\nAttach to your keys or backpack\nMinifigure is not detachable from metal chain\nMakes a great gift for fans of LEGO® Star Wars™ building sets\nSuitable for ages 6 and over"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/lego-star-wars-c-3po-keyring-853471","description":"Make every mission a success with this fun C-3PO™ Key Chain. Attach ‘Threepio’ to your keys or backpack using the sturdy key ring and chain, and set off with your very own miniature LEGO® Star Wars™ droid.\n\nFeatures an authentic LEGO® Star Wars™ C-3PO minifigure attached to a sturdy metal ring and chain\nAttach to your keys or backpack\nMinifigure is not detachable from metal chain\nMakes a great gift for fans of LEGO® Star Wars™ building sets\nSuitable for ages 6 and over"},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/luke-skywalker-key-chain-853947","description":"Keep a sharpshooting wingman by your side with this LEGO® Star Wars™ 853947 Luke Skywalker Key Chain. Attach this classic version of Luke in his X-wing pilot outfit to your keys or backpack with the sturdy ring and chain and fly with him on your travels through the galaxy.\n\nFeatures a LEGO® Star Wars™ Luke Skywalker minifigure linked to a durable metal ring and chain.\nAttach it to your keys or backpack.\nMinifigure is not detachable from metal chain."},{"theme":"star-wars","themeUrl":"https://www.lego.com/en-us/themes/star-wars","productUrl":"https://www.lego.com/en-us/product/star-destroyer-bag-charm-853767","description":"Decorate your bag or backpack with this mini LEGO® Star Wars Star Destroyer. The pieces are glued so it will never come apart, while the sturdy ring and chain are just the thing for trips into hyperspace… or the schoolyard!\n\nFeatures a LEGO® Star Wars Star Destroyer mini build attached to a sturdy metal ring and chain.\nAttach it your keys, bag or backpack.\nMini build is not detachable from metal ring and chain and cannot be disassembled.\nA great gift for fans of LEGO® building sets and the Star Wars universe."}]