[{"theme":"stranger-things","themeUrl":"https://www.lego.com/en-us/themes/stranger-things","productUrl":"https://www.lego.com/en-us/product/the-upside-down-75810","description":"Fans of the global hit Netflix original series will appreciate the authentic details of this highly collectible LEGO® Stranger Things toy – 75810 The Upside Down. This sturdy, brick-built model can flip between the real world and The Upside Down. The design of the model's building instructions makes it a great shared building experience with friends and family. The Byers' house features Will's bedroom, the living room and the dining room. The Upside Down version of the house, from an alternate dimension, features all the rooms from the real-world model but with a dark, vine-covered, dilapidated look that fans will instantly recognize from the series. With 8 Stranger Things figures, each with its own accessories, this playset makes a great gift for Stranger Things fans who will love to build and display this model to show their passion for the series.\n\nThis LEGO® Stranger Things toy includes 8 instantly recognizable Stranger Things minifigures from the hit Netflix original series: Eleven, Mike Wheeler, Lucas Sinclair, Dustin Henderson, Will Byers, Joyce Byers, Chief Jim Hopper and the Demogorgon.\nThe Byers' house features a front porch with furniture, living room, dining room and Will's bedroom.\nThe living room features authentic details from the series, like the alphabet wall with a light-up function, couch, coffee table, telephone, axe, ‘have you seen me?’ flyer stickered element and a bear trap to catch the Demogorgon.\nWill’s bedroom plays a central role in the series, which this model faithfully replicates, including details like Will’s boombox, bed, desk, desk lamp, drawings and movie posters.\nThe dining room includes an armchair, boxes that store Christmas lights, fantasy game rule book stickered element and a potted plant.\nThe attic space includes a Mind Flayer drawing stickered element and a wizard hat for ‘Will the Wise’.\nThe Upside Down set captures the look and feel from the Netflix original series, including creepy vines, dark coloring and a dilapidated look.\nChief Jim Hopper’s police truck includes a removable roof for easy access to the interior and a pumpkin element as a reminder of Season 2.\nAccessory elements include Lucas' slingshot and flashlight, Dustin's walkie-talkie and compass, Mike's flashlight and walkie-talkie, Hopper's coffee mug, Joyce's flashlight and drawing of ‘Will the Wise’, and Eleven’s waffle.\nThis Stranger Things collectible includes over 2,200 pieces and comes in 11 bags, so the real world and The Upside Down can be built at the same time for a shared building experience.\nMeasures over 12” (32cm) tall, 17” (44cm) wide and 8” (21cm) deep."}]