[{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/ferrari-488-gte-af-corse-51-42125","description":"Delivering prestigious wins for the Prancing Horse in the world’s toughest endurance races, the Ferrari 488 GTE is a car unlike any other. Now you can create your own LEGO® Technic™ model version, complete with authentic design details – just like on the iconic original.\n\nFaithful detailing\nWith amazing attention to detail, this racing car model is a true expression of Ferrari’s endurance racer. Features include front and back suspension, opening doors, a V8 engine with moving pistons and a steering wheel that steers the car. Original stickers and authentic colors add the perfect finish to this epic model.\n\nEscape the ordinary\nThis set is part of a collection of LEGO building kits for adults who appreciate excellent design. A new hands-on project for yourself, or the ideal gift for a motorsport fan, this LEGO Technic building kit provides an immersive build with a beautiful display model to enjoy.\n\nImmerse yourself in the exciting world of endurance racing, creating your own displayable LEGO® Technic™ model version of the iconic Ferrari 488 GTE racing car.\nAuthentic features include front and back suspension, opening doors, a V8 engine with moving pistons and functioning steering wheel.\nWith original race stickers and a faithful color scheme, the LEGO® Technic™ Ferrari 488 GTE “AF Corse #51” (42125) will take pride of place in the home or office of any motorsport fan.\nA rewarding building project for adults and an inspired birthday or special occasion gift for anyone who loves endurance racing, Ferrari racing cars and motorsport.\nModel measures over 5 in. (13 cm) high, 19 in. (48 cm) long and 8.5 in. (21 cm) wide.\nEasily explore all the details packed inside, thanks to the opening doors and hood.\nThis set comes with a special building instruction book featuring exclusive content, including details about the car and the AF Corse 51 team.\nWith elegant designs and realistic functions, LEGO® Technic™ sets offer a rewarding build and models packed with impressive features for anyone interested in engineering and technology.\nLEGO® Technic™ components meet stringent industry standards to ensure they are consistent, compatible and connect reliably every time – it’s been that way since 1958.\nLEGO® Technic™ components are dropped, heated, crushed, twisted and analyzed to make sure they meet high global safety standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/off-road-buggy-42124","description":"Travel back to the 1980s with this LEGO® Technic™ Off-Road Buggy (42124) – it’s fun for all ages from 10 and up. After creating the model, bring it to life using the free CONTROL+ app. The buggy is angled at the front to give stability when jumping and performing tricks, just like classic RC toy cars. With front and back suspension (a first for LEGO Technic), plus huge tires, an opening hood, antenna and retro stickers, this car is packed with attitude.\n\nUnleash epic stunts with the app\nDownload the free CONTROL+ app to really put this Off-Road Buggy car to the test. Use the app to drive forwards and backwards, steer and perform stunts. With different controls, sound effects, challenges, achievements and more, there’s so much to explore.\n\nA rewarding build\nLEGO Technic sets feature realistic movement and mechanisms that introduce LEGO builders to the universe of engineering in an approachable and realistic way.\n\nUnleash hours of fun with the LEGO® Off-Road Buggy (42124) building kit. This RC Off-Road Buggy car is packed with features inspired by the original 1980s RC toy cars.\nAmazing tricks are easy to perform thanks to the car’s front and rear suspension, massive tires and angled front.\nDownload the free CONTROL+ app to add a new dimension to this remote-control buggy. Use the app to control the car, perform stunts and unlock challenges, sound effects and more.\nThis Off-Road Buggy is an awesome gift for kids aged 10 and up. Adults who remember the classic 1980s RC toy cars will love it too, making it a fun experience for all generations to enjoy together.\nCheck out the retro color scheme, complete with 1980s-inspired sticker details.\nThe RC Off-Road Buggy model measures over 5 in. (13 cm) high to roof, 7.5 in. (19 cm) high including antenna, 11 in. (28 cm) long and 6.5 in. (16 cm) wide.\nTo enjoy all the features of this app-controlled toy you'll need to add 6 x LR6/AA batteries (not included).\nThe LEGO® Technic™ universe offers advanced building toys for LEGO fans who are ready for their next building challenge.\nLEGO® Technic™ components meet stringent industry standards to ensure they are consistent, compatible and connect reliably every time – it's been that way since 1958.\nLEGO® Technic™ components are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global safety standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/jeep-wrangler-42122","description":"Any vehicle-loving kid would be proud to own a high-performance 4X4. Now you can make that dream a reality with the LEGO® Technic™ Jeep® Wrangler (42122) toy model. Boys and girls aged 9 and up will have fun exploring this iconic off-roader. There’s a button to operate the front steering and its powerful axle-articulation suspension means kids will love testing out their model on obstacles around the home.\n\nPacked with authentic details\nWith opening doors and hood, fold-down rear seats, a full-size spare tire, winch and classic Jeep branding, this fun toy model car brings kids closer than ever to the real Jeep Wrangler Rubicon. The eye-catching, yellow-and-black color scheme means this model looks great in action or on display.\n\nAn engaging challenge for young LEGO builders\nThe world of LEGO Technic offers advanced building toys for young LEGO fans ready for their next fun challenge. With realistic mechanisms, these collectible toys are a great way to introduce kids to engineering concepts.\n\nKnow a kid who’d love to build their very own off-road 4X4? This LEGO® Technic™ Jeep® Wrangler (42122) is packed full of authentic details, making it a great toy for kids who love fun vehicles.\nWith front steering, powerful axle-articulation suspension and a winch, kids can play out a world of off-roading adventures, inspired by the world-famous Jeep® Wrangler.\nThis awesome model comes complete with authentic Jeep® Wrangler details, like the classic round headlamps, seven-slot grille, full-size spare tire and fold-down rear seats.\nLooking for the best toys for kids who love collectible car toys? This Jeep® Wrangler Rubicon model makes a great gift for young LEGO® fans who are ready for their next challenge.\nThis Jeep® Wrangler Rubicon toy model measures over 4.5 in. (12 cm) high, 9.5 in. (24 cm) long and 5 in. (13 cm) wide, making this car a great size for play or display.\nKids will love the car's eye-catching yellow-and-black color scheme and prestigious Jeep® Wrangler Rubicon branding.\nWith opening doors and hood, it’s easy to explore the SUV toy car’s detailed interior.\nThe LEGO® Technic™ universe opens up the world of engineering for young LEGO fans ready for their next building challenge.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect reliably every time – it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/mclaren-senna-gtr-42123","description":"Looking for the ultimate gift for a child or teen who loves supercar toys? This LEGO® Technic™ McLaren Senna GTR™ (42123) is a great choice – and adult McLaren fans will love it too! Packed with authentic features inspired by the original track-focused supercar icon, this collectible model toy is sure to set pulses racing.\n\nRealistic details and powerful functions\nThe McLaren Senna GTR is a car unlike any other. And this awesome LEGO Technic toy version is equally impressive. Check out the V8 engine with moving pistons, iconic dihedral doors that open, plus authentic graphics and colors, just like on the real car. Steer using the wheel, then put the model on display where it’s sure to draw many admiring glances.\n\nOpen up the world of engineering\nLEGO Technic sets feature realistic movement and mechanisms that introduce LEGO builders to the universe of engineering in an approachable and realistic way.\n\nA stunning build for supercar fans, the LEGO® Technic™ McLaren Senna GTR™ 42123 model building kit is packed with realistic details inspired by the iconic original.\nCheck out this supercar toy model’s authentic features, like the detailed V8 engine with moving pistons and dihedral doors that open ‘up and out' in the unmistakable style of the real McLaren.\nEnjoy steering the McLaren toy car using the wheel on top.\nLooking for the best gift ideas for a motorsport fan or supercar lover?This set makes a great choice for kids aged 10 and up who’d love to build and display their own McLaren race car.\nThis awesome track-focused supercar toy model looks great on display and is sure to capture the imagination of any kid or adult with a passion for supercars, motorsport and McLaren.\nModel measures over 3 in. (9 cm) high, 12 in. (32 cm) long and 4 in. (12 cm) wide.\nThis collectible McLaren toy car features eye-catching graphics and colors, just like on the real supercar.\nThe LEGO® Technic™ universe offers advanced building toys for LEGO fans who are ready for their next building challenge.\nLEGO® Technic™ components meet rigorous industry standards to ensure they are consistent, compatible and connect reliably every time – it's been that way since 1958.\nLEGO® Technic™ components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/heavy-duty-excavator-42121","description":"Looking for a special gift for kids who love construction toy sets? This 2-in-1 LEGO® Technic™ Heavy-Duty Excavator (42121) toy has plenty of features for hours of creative play. Boys and girls aged 8 and up will enjoy an immersive building challenge before exploring the digger toy's realistic features.\n\nSee how an excavator works\nDigging, driving, rotating; there's so much to discover in this cool kids' excavator toy. Check out the shovel that moves up and down, plus the movable arm, running belts and rotating body. There’s also a detailed cabin with a driver’s seat and control panel. The set comes with extra LEGO brick ‘stones’ to dig and 4 cones. When it’s time for a new challenge, the model rebuilds into a tracked tractor with backhoe.\n\nA rewarding build for young LEGO fans\nThe LEGO Technic universe offers advanced building toys for LEGO fans ready for their next challenge. With realistic mechanisms, these rewarding sets are a great way to introduce kids to the world of engineering.\n\nWhether it’s a birthday, Christmas, or ‘just because’ gift, young construction fans will love building and exploring this 2-in-1 LEGO® Technic™ Heavy-Duty Excavator (42121) toy set.\nPacked with realistic features, this digger toy set lets kids see how construction vehicles really work. Check out the moving shovel and arm, plus running belts, just like on a real excavator.\nWhen kids are ready for a new challenge, the 2-in-1 toy model rebuilds into a tracked tractor with backhoe.\nThis cool excavator toy for kids is ideal for boys and girls aged 8 and up who love construction vehicles.\nWith the authentic cabin and control panel to explore, it’s easy for kids to imagine life on a construction site with this cool excavator toy.\nRole-play is easy with this cool set. There are 4 cones to manage the building site, plus extra LEGO® pieces to use as bricks for scooping up with the digger truck toy.\nThis kids' excavator toy model measures over 9 in. (23 cm) high, with arm up,14.5 in. (37 cm) long, with arm fully extended, and 4 in. (11 cm) wide.\nThe LEGO® Technic™ universe opens up the world of engineering for young LEGO fans ready for their next building challenge.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect reliably every time – it's been that way since 1958.\nLEGO® components are dropped, heated, crushed, twisted and analyzed to make sure they meet strict global safety standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/rescue-hovercraft-42120","description":"Looking for the perfect gift for kids who enjoy exciting vehicles? They’re sure to love this LEGO® Technic™ Rescue Hovercraft (42120) toy. Filled with authentic features, it’s perfect for recreating daring missions. Boys and girls aged 8 and up will love seeing the toy vehicle ‘hover' as it rolls on concealed wheels. With turning fans, a warning light, cockpit with seats, control panel and steering handlebar, there's lots to discover. And when kids are ready for a new challenge, the hovercraft toy rebuilds into a Twin-Engine Aircraft, packed with realistic features, including moving rudders and moving ailerons.\n\nBuilding toys to engage young minds\nThe LEGO Technic universe includes a range of exciting toy vehicles, designed especially for young LEGO fans who are ready for their next building challenge. With realistic functions and design, these models are ideal for any child interested in how things work.\n\nGive kids who love rescue vehicle toys a special treat with this awesome hovercraft toy. It’s filled with authentic details, making it perfect for role-play adventures.\nCheck out all the cool features, including the ‘hover’ effect, turning fans, cockpit and rotating warning light, just like on a real hovercraft air cushion vehicle (ACV).\nThe 2-in-1 design means more role-play fun for young heroes. Rebuild the model hovercraft to create a Twin-Engine Aircraft with moving rudders and ailerons.\nThe LEGO® Technic™ Rescue Hovercraft (42120) makes a great birthday, holiday or anytime gift for kids aged 8 and up who love rescue vehicle toys.\nThis hovercraft toy model measures over 4.5 in. (12 cm) high, 9.5 in. (24 cm) long and 5 in. (13 cm) wide.\nThe LEGO® Technic™ universe offers advanced building toys for young LEGO fans who are ready for their next building challenge.\nLEGO® Technic™ components meet stringent industry standards to ensure they are consistent, compatible and connect securely every time – it’s been that way since 1958.\nLEGO® Technic™ components are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global safety standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/monster-jam-grave-digger-42118","description":"Looking for a fun toy or gift for boys and girls who love Monster Jam® trucks? The LEGO® Technic™ Monster Jam Grave Digger® 42118 pull-back truck is packed with features that kids will love. Authentic touches include Grave Digger graphics with ghost and fire details, plus huge tires, a movable flag and red headlights. See the exciting world of Monster Jam come to life as kids recreate the epic stunts of one of the most famous and iconic monster trucks of all time.\n\nAwesome 2-in-1 toy\nTime for a new challenge? Great news! The Grave Digger model rebuilds into an off-road buggy for even more building fun. Check out the free LEGO Building Instructions app to find Instructions PLUS. This interactive guide includes zoom and rotate tools to help kids get building.\n\nInspiring the next generation of engineers\nWith vehicles that look and function like the real thing, the LEGO Technic universe offers a great introduction to engineering and mechanics for young LEGO fans.\n\nLet monster truck fans recreate favorite stunts with the LEGO® Technic™ Monster Jam® Grave Digger®(42118) building kit. Authentic features include huge tires, sticker details and more.\nTwice the fun! The monster truck toy rebuilds into an off-road buggy so kids can enjoy 2 building challenges and heaps of vehicle role-play action.\nWith a pull-back motor, the monster truck and off-road buggy speed along easily, just like the real-life vehicles.\nLooking for the best gifts for kids who love monster truck toys? This set is ideal for kids aged 7 and up who love Monster Jam® shows or awesome toy vehicles.\nCool features include the bendable flag which moves up and down and red headlights, just like on the real Grave Digger® truck.\nThis Monster Jam® toy measures over 4 in. (11 cm) high, 9.5 in. (24 cm) long (with flag) and 4 in. (11 cm) wide.\nInstructions for the Grave Digger® model are included. You'll also find digital Instructions PLUS in the free LEGO® Building Instructions app. Instructions for the off-road buggy are available online.\nThe LEGO® Technic™ universe offers advanced buildable models for young LEGO fans ready for their next building challenge.\nLEGO® Technic™ components meet stringent industry standards to ensure they are consistent, compatible and connect reliably every time – it's been that way since 1958.\nLEGO® Technic™ components are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global safety standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/monster-jam-max-d-42119","description":"Inspire kids who love Monster Jam® to build their very own monster truck with this LEGO® Technic™ Monster Jam Max-D® 42119 building kit. With its pull-back action, boys and girls will be recreating daring stunts from the Monster Jam arena in no time. The 2-in-1 toy truck is packed with powerful features, just like the real thing. Check out the authentic graphics and colors, spikes and movable flag.\n\n2-in-1 for twice the fun!\nThis cool Monster Jam truck toy offers two building challenges in one. After building the Max-D model, kids can rebuild it into a quad bike for even more high-speed adventures. Check out the free LEGO Building Instructions app to find Instructions PLUS. This interactive guide makes building easy with zoom and rotate tools.\n\nLearn through play\nThe LEGO Technic universe offers a great introduction to engineering and mechanics for young LEGO fans. With detailed models, inspired by real-world vehicles, kids learn as they play.\n\nLet Monster truck fans recreate their favorite arena moments with the LEGO® Technic™ Monster Jam® Max-D® (42119) toy building kit.\nTwo building challenges! This cool Max-D® 2-in-1 monster truck toy rebuilds into a pull-back quad bike, so playtime lasts even longer.\nWith pull-back action, it's easy for kids to power their truck and quad bike. Simply pull back and let go to send them speeding along.\nLooking for hot toys for kids who love monster trucks? This buildable model set is ideal for boys and girls aged 7 and up who love exciting vehicles.\nDetails include Max-D®’s iconic spikes and a rough metallic surface with fire graphics just like on the real truck.\nMonster Jam® truck toy measures over 4 in. (10 cm) high, 10 in. (25 cm) long (with flag) and 4 in. (11 cm) wide.\nInstructions for the Max-D® model are included, plus digital Instructions PLUS are available in the free LEGO® Building Instructions app. Instructions for the quad bike are available online.\nThe LEGO® Technic™ universe offers advanced buildable models for young LEGO fans ready for their next building challenge.\nLEGO® components meet stringent industry standards to ensure they are consistent, compatible and connect reliably every time – it’s been that way since 1958.\nLEGO® Technic™ components are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global safety standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/race-plane-42117","description":"Bring the thrilling world of stunt planes to life with this LEGO® Technic™ Race Plane (42117). This treat for boys and girls aged 7 and up includes details like a propeller that spins when the plane is pushed along, plus opening engine covers. The eye-catching, teal and orange color scheme with sponsor details completes a cool little gift for any occasion – it's just like a real race plane!\n\n2-in-1 model\nThis toy airplane rebuilds into a Jet Airplane so kids can enjoy even more building fun.It's easy to get started since this set comes with Instructions PLUS. Available in the free LEGO Building Instructions app, this interactive guide includes zoom and rotate tools, plus ghost mode, to help children build independently.\n\nHours of creative play\nThe LEGO Technic universe offers advanced building toys for young LEGO fans who are ready for their next challenge. With vehicles that look and function like the real thing, these sets offer a great introduction to engineering and mechanics.\n\nGive aspiring pilots a treat with this LEGO® Technic™ Race Plane (42117) toy. With vibrant colors, sponsor details and a spinning propeller, it looks just like the real thing.\nThere are lots of details to discover for kids who love flying toys. Check out the opening engine covers, landing gear and spinning propeller for plane racing role play.\nKids will love building this durable aerobatic aircraft toy before rebuilding it into a Jet Airplane for even more creative fun.\nMakes a greatholiday or birthday gift or an anytime treat for kids aged 7 and up who love stunt plane toys.\nThe Race Plane model measures over 3 in. (9 cm) high (including propeller), 7 in. (18 cm) long and 9 in. (23 cm) wide.\nInstructions PLUS is an interactive guide that makes building extra fun. Available in the free LEGO® Building Instructions app, it has zoom and rotate tools to help children build independently.\nThe LEGO® Technic™ universe offers advanced building toys for young LEGO fans whoare ready for their next building challenge.\nLEGO® Technic™ components meet stringent industry standards to ensure they are consistent, compatible and connect securely every time – it’s been that way since 1958.\nLEGO® Technic™ components are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global safety standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/skid-steer-loader-42116","description":"If you’re looking for a gift for kids who love construction-site role play, this LEGO® Technic™ Skid Steer Loader (42116) is sure to keep them busy. Boys and girls aged 7 and up will enjoy building the loader – and that’s just the start! Once they’ve built it, they can create endless construction adventures as they check out the vehicle's realistic features. A 2-function bucket for scooping, operator's cab, control panel, roll cage and front and rear lights give kids everything they need for hours of creative play.\n\n2-in-1 model\nWhen kids are ready for a new challenge, the model rebuilds into a Hot Rod. Getting started is easy because this cool toy includes Instructions PLUS. Available in the free LEGO Building Instructions app, this digital guide includes zoom and rotate tools, plus ghost mode, to help children build.\n\nEngaging building toys\nThe LEGO Technic universe offers advanced building toys for young LEGO fans who are ready for their next building challenge.\n\nGive young construction fans a treat with this cool LEGO® Technic™ Skid Steer Loader (42116) toy construction set. Authentic details include a bucket for lifting and scooping.\nKids will love building the loader before checking out all of its features, like the opening cab, bucket that lifts and tilts, control panel and roll cage. Then the model rebuilds into a Hot Rod.\nWith realistic details, this is a toy that kids will return to time and again as they role-play different adventures onthe construction site, roadside or farm.\nIf you’re looking for a gift for boys and girls aged 7 and up, this high-quality model is a great choice.\nThe Skid Steer Loader model measures over 3.5 in. (9 cm) high, 5.5 in. (14 cm) long and 2.5 in. (6 cm) wide.\nKids can rebuild this 2-in-1 model into a Hot Rod for even more construction fun.\nInstructions PLUS is an interactive guide that makes building extra fun. Available in the free LEGO® Building Instructions app, it has zoom and rotate tools to help children build independently.\nThe LEGO® Technic™ universe offers advanced building toys for young LEGO fans who are ready for their next building challenge.\nLEGO® Technic™ components meet stringent industry standards to ensure they are consistent, compatible and form a secure connection every time – it's been that way since 1958.\nLEGO® Technic™ components are dropped, heated, crushed, twisted and analyzed to make sure they meet stringent global safety standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/lamborghini-sian-fkp-37-42115","description":"Experience the unmistakable power and looks of the Lamborghini Sián FKP 37 as you become immersed in this LEGO® Technic™ building kit (42115). With superb detailing, the model car is a faithful representation of the original Sián FKP 37 in eye-catching lime green with golden rims.\n\nThe beauty is in the details\nAuthentic features include the 8-speed transmission, activated by the movable paddle gearshift, V12 engine with moving pistons, and 4-wheel drive. Use the steering wheel to position the car, then check out the front and rear suspension. Just like the full-size super sports car, this model car features classic scissor opening doors.\n\nLuxurious features\nThis buildable car set lets you enjoy quality downtime as you bring the beautiful Sián FKP 37 to life. Presented in a luxury box, it includes an exclusive coffee-table-quality book with building instructions, images and behind-the-scenes interviews. Open the hood to discover your unique serial number and unlock special onlinecontent.\n\nEnjoy immersive building with this LEGO® Technic™ Lamborghini Sián FKP 37 set (42115). Then explore the car’s faithful features, including V12 engine with moving pistons, steering, and front and rear suspension.\nWith an 8-speed sequential transmission, movable rear spoiler, opening front and rear hood, detailed disc brakes and golden rims, this LEGO® Technic™ set brings you closer than ever to the real Lamborghini Sián FKP 37.\nDesigned especially for super sports car fans, with superb detailing, this advanced LEGO® Technic™ construction set comes with a decorative display plate and unique serial number to unlock exclusive online content.\nA rewarding building project for you, or a special birthday present or holiday gift for a loved one. This LEGO® set is presented in exclusive luxury packaging and provides a stunning display piece to own and enjoy.\nIn a vivid lime green color scheme, with golden rims and decorated elements, this 1:8 scale buildable model car measures over 5” (13cm) high, 23” (60cm) long and 9” (25cm) wide.\nPowered by passion! No batteries are required for this LEGO® Technic™ set, so you can get stuck into your immersive building project right away.\nExclusive collectors’ booklet featuring comprehensive building instructions, images and behind-the-scenes interviews from the two teams that worked on this project: the LEGO Group and Automobili Lamborghini.\nWith elegant designs and realistic functions, LEGO® Technic™ sets offer a rewarding build and models packed with impressive features.\nLEGO® Technic™ sets meet the highest industry standards, which ensures the elements connect easily.\nLEGO® Technic™ sets are thoroughly tested to make sure they meet the highest global safety and quality standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/bugatti-chiron-42083","description":"Explore engineering excellence with the LEGO® Technic™ 42083 Bugatti Chiron advanced building set. This exclusive model has been developed in partnership with Bugatti Automobiles S.A.S to capture the essence of the quintessential super sports car, and comes with gleaming aerodynamic bodywork, logoed spoked rims with low-profile tires, and detailed brake discs. The accessible cockpit features a Technic 8-speed gearbox with movable paddle gearshift and a steering wheel bearing the Bugatti emblem. Insert the top speed key and you can switch the active rear wing from handling to top speed position. The rear lid affords a glimpse of the detailed W16 engine with moving pistons, while beneath the hood you’ll discover a unique serial number and a compact storage compartment containing a stylish Bugatti overnight bag. This 1:8 scale model comes with a classic Bugatti duo-tone blue color scheme that reflects the brand's signature color, and a set of stickers for additional detailing. The set is delivered in luxurious box packaging and includes a color collector’s booklet with comprehensive building instructions.\n\nExclusive 1:8 scale LEGO® Bugatti Chiron replica model with a wealth of luxurious features, including aerodynamic bodywork with an active rear wing, logoed spoked rims with low-profile tires, detailed brake discs and a W16 engine with moving pistons.\nOpen the doors to access the detailed cockpit featuring a LEGO® Technic™ 8-speed gearbox with movable paddle gearshift and a steering wheel bearing the Bugatti emblem.\nInsert the top speed key to switch the active rear wing from handling to top speed position.\nLift the hood to access a compact storage compartment containing a stylish Bugatti overnight bag.\nCheck out the detailed W16 engine with moving pistons.\nIncludes a unique serial number located beneath the hood.\nComes with a classic Bugatti duo-tone blue color scheme that reflects the brand's signature color, plus a set of cool stickers for additional detailing.\nDelivered in luxurious box packaging.\nIncludes a color collector's booklet with comprehensive building instructions.\nThis LEGO® Technic™ model is designed to provide an immersive and rewarding building experience.\nThis set includes 3,599 pieces.\nSuitable for ages 16+.\nBugatti Chiron measures over 5” (14cm) high, 22” (56cm) long and 12.5”(32cm) wide."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/liebherr-r-9800-excavator-42100","description":"Get ready for a colossal LEGO® build and play experience with the 4,108-piece LEGO Technic™ Liebherr R 9800 Excavator. Developed in partnership with Liebherr, this replica model is operated via the intuitive LEGO TECHNIC CONTROL+ app and powered by 2 advanced Smart Hubs with 7 motors. The sophisticated app technology enables super-precise movement and amazing functionality, while delivering endless authentic digital play combinations via 4 different control screens with cool graphics. The Multi-function control screen enables users to drive the machine in all directions, rotate the superstructure, extend and raise the boom, open and tilt the bucket, play realistic sound effects and get real-time feedback, such as boom position, power usage and drive distance. With the One-touch screen, users can use drag patterns to control the boom, arm and bucket, while the Custom-built movements screen enables them to choose pre-set commands or record the model’s actions to create complex sequences of movements. And, with the Challenges & achievements screen, users can complete challenges to unlock reward badges.\n\nThis excavator model features the LEGO® TECHNIC™ CONTROL+ app for a more immersive and realistic play experience and hours of fun.\nThe app-controlled LEGO® Technic™ Liebherr R 9800 Excavator is operated via a smart device with 4 alternative control screens. Go to LEGO.com/devicecheck for a list of compatible smart devices.\nMulti-function control: Drive forward, reverse, steer, rotate the superstructure, extend, raise and lower the boom, open and tilt the bucket and get model feedback, such as boom and superstructure position, power usage and drive distance.\nOne-touch control: Select an on-screen drag pattern and see the excavator respond to your command.\nCustom-built movements: Use pre-set commands or record the model’s actions to create complex sequences of movements.\nChallenges & achievements: Complete challenges to unlock reward badges.\nReplica of the Liebherr R 9800 Excavator with an array of true-to-life features and functions, finished with an authentic color scheme and cool sticker detailing.\nIncludes 3 XL Motors, 4 L Motors and 2 Bluetooth-controlled Smart Hubs.\nSmart Hubs feature Bluetooth Low Energy (BLE) connectivity, activation button, 6 axis sensor (3 gyro and 3 accelerometer sensors) and 4 connectivity ports.\nThe app allows users to connect to multiple hubs, ensuring precise and true-to-life movements.\nDownload the app from the App Store or Google Play. Ask your parents’ permission before going online.\nThis excavator toy requires batteries (not included). Please refer to the product packaging for type and quantity.\nThis LEGO® Technic™ construction toy introduces LEGO builders to advanced elements of engineering.\nNot compatible with the Power Functions systems.\nLiebherr R 9800 Excavator measures over 15” (39cm) high, 25” (65cm) long and 10” (27cm) wide."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/4x4-x-treme-off-roader-42099","description":"Are you ready to take your LEGO® play experience to another level? The LEGO Technic™ 4x4 X-treme Off-Roader is powered by an advanced Smart Hub with 3 motors and controlled via the intuitive LEGO TECHNIC CONTROL+ app. The sophisticated app technology enables super-precise movement and functionality, while delivering endless authentic digital play combinations with authentic sound effects. Users can choose from different control screens to drive forward, reverse, steer, accelerate, brake and traverse obstacles. You can also get real-time feedback, such as a speed and tilt log or test out your skills in the app’s challenges and achievement section. This sturdy 4x4 app-controlled truck comes with high-rise independent suspension, large wheels with chunky tires and a fresh color scheme with intricate sticker detailing. Its complex gear mechanisms and technologies introduce LEGO builders to advanced elements of engineering, while improving reaction times, cognitive thinking and creative problem-solving skills.\n\nThis cool toy truck model is controlled via the LEGO® TECHNIC™ CONTROL+ app and powered by an advanced Smart Hub with 2 XL motors and 1 L motor for a more immersive play experience, authentic movements and hours of fun.\nThe app-controlled LEGO® 4x4 X-treme Off-Roader is operated via a smart device with 3 alternative screens. Go to LEGO.com/devicecheck for a list of compatible smart devices.\nMulti-function control: Drive forward, reverse, steer, accelerate, brake, traverse obstacles, play sound effects and get real-time feedback, such as a speed and tilt log.\nOne-touch control: Drag a direction on the screen and see the 4x4 carry out the maneuver.\nChallenges & achievements: Complete challenges to unlock achievement badges.\nSturdy app-controlled LEGO® truck with high-rise independent suspension, large wheels and chunky tires.\nSmart Hub features Bluetooth Low Energy (BLE) connectivity, activation button, 6 axis sensor (3 gyro and 3 accelerometer sensors) and 4 connectivity ports.\nDownload the LEGO® TECHNIC™ CONTROL+ app from the App Store or Google Play. Ask your parents’ permission before going online.\nThis remote-controlled truck requires batteries (not included). Please refer to the product packaging for type and quantity.\nThis buildable LEGO® Technic™ model introduces LEGO builders to advanced elements of engineering, while improving reaction times, cognitive thinking and creative problem-solving skills.\nNot compatible with LEGO® Power Functions systems.\n4x4 X-treme Off-Roader measures over 7” (19cm) high, 12” (33cm) long and 8” (22cm) wide."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/6x6-volvo-articulated-hauler-42114","description":"A realistic model version of Volvo’s biggest articulated hauler, the LEGO® Technic™ 6x6 Volvo Articulated Hauler (42114) is ideal for kids who love construction vehicles. The truck is powered by 1 large angular position motor, 1 XL motor and 1 L motor with a Bluetooth controlled Smart Hub for realistic functionality.\n\nExplore the app for new ways to play\nThere are lots of authentic details to discover and kids can take control of the truck using the LEGO Technic CONTROL+ app. Use the different control screens to drive forward, reverse, steer, change speed and gear, or unload the hauler’s bucket. Kids also get a personalized dashboard with authentic cockpit controls. Challenges and achievements help kids develop their driving skills and there’s inspirational content to discover in the app too.\n\nAuthentic details inspire creative play\nLEGO Technic construction vehicle playsets are ideal for LEGO fans ready for a new challenge with vehicles that look and drive like the real thing.\n\nKids will love building their very own model version of the classic A60H Articulated Hauler from Volvo. And with cool functions in the LEGO® Technic™ CONTROL+ app, the fun goes on long after the model is built.\nWith this LEGO® Technic™ 6x6 Volvo Articulated Hauler (42114) building kit, kids can learn the secrets of mega construction machines as they steer, tip the bucket and change gear using the app.\nThis model is packed with authentic details. The LEGO® Technic™ CONTROL+ app puts kids in charge as they explore the different control screens, challenges, achievements and exclusive content in the app.\nLooking for a cool remote control truck toy? Take creative play to the next level with this awesome app-controlled LEGO® Technic™ Volvo model kit, which makes a great birthday present for any young builder aged 11 and up.\nThe Volvo truck toy model measures over: 7” (20cm) high, 23” (60cm) long and 7” (20cm) wide, making it ideal for construction role play. Combine with other construction playsets for even more fun.\nBuilding can start without batteries, but to enjoy the full power and cool technical functions of this app-controlled toy you’ll need to provide 6 x AA 1.5V batteries.\nPrinted instructions are included so the creative fun starts straightaway with this awesome building set for kids.\nLEGO® Technic™ building kits are ideal for kids who love to build and are ready for a new challenge. With a range of fun buildable toys, the LEGO Technic universe is loved by kids and adults alike.\nEach LEGO® Technic™ set meets the highest industry standards, which ensures each vehicle connects easily every time.\nLEGO® Technic™ sets are thoroughly tested to make sure each one meets the highest global safety and quality standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/porsche-911-rsr-42096","description":"Celebrate an icon of engineering excellence with the LEGO® Technic™ 42096 Porsche 911 RSR. Developed in partnership with Porsche, this authentic replica captures the vehicle’s powerful appearance with its sharp contours and aerodynamic detailing, including a rear wing with ‘swan neck' mounts, extended rear diffuser and specially designed side mirrors. Functions include a visible, working differential, independent suspension and a six-cylinder boxer engine with moving pistons positioned in front of the rear axle, while the accessible cockpit features a radar screen, working steering, fire extinguisher system and even a track map of the Laguna Seca circuit printed onto the driver’s door. Black spoked rims, realistic head and tail lights and an authentic white, red and black color scheme with sticker detailing add the final touches to this awesome LEGO Technic Porsche 911 RSR model, a perfect display piece for the home or office!\n\nPorsche 911 RSR replica model with a wealth of authentic features, including a rear wing with ‘swan neck’ mounts, extended rear diffuser and aerodynamic side mirrors, plus black spoked rims and realistic head and tail lights. Also includes a detailed cockpit, working differential, independent suspension and a six-cylinder boxer engine with moving pistons positioned in front of the rear axle.\nThis collectible toy car also features an authentic white, red and black color scheme and a sticker sheet for additional detailing.\nOpen the doors to access a cockpit packed with realistic details, including a radar screen, working steering, fire extinguisher system and a track map of the Laguna Seca circuit printed onto the driver’s door.\nCheck out the six-cylinder boxer engine with moving pistons.\nThis set includes 1,580 pieces.\nThis LEGO® Technic™ model is designed to provide an immersive and rewarding building experience.\nSuitable for ages 10+.\nLEGO® Technic™ sets feature realistic movement and mechanisms that introduce young LEGO builders to the universe of engineering in an approachable and realistic way.\nPorsche 911 RSR measures over 5” (13cm) high, 19” (50cm) long and 7” (20cm) wide."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/app-controlled-top-gear-rally-car-42109","description":"Know a race car fan who would love to drive like the Stig from TV’s BBC Top Gear? Let them put their skills to the test with this awesome LEGO® Technic™ (42109) App-Controlled Top Gear Rally Car. First, they can have fun building the rally car toy, discovering all the elements that make this Rally Car model work. Then the adrenaline builds as they try out cool moves – all using the LEGO Technic CONTROL+ App. Powered by a smart hub, the app allows super-precise movement, giving endless play combinations with authentic sound effects. Choose from different control screens to drive forward, reverse, steer, accelerate, brake and tackle obstacles. They will also get real-time feedback, including a speed and tilt log and can test out their skills in the app’s racing challenges section. There’s inspirational content and videos to discover in the app too! LEGO Technic sets bring an advanced building challenge for kids and adults who love to learn new engineering skills.\n\nLet race car fans take on a driving challenge with this LEGO® Technic™ app-controlled Top Gear Rally Car (42109). It’s operated via a smart device with 3 screens. Go to LEGO.com/devicecheck for compatible devices.\nThis toy rally car model is controlled via the LEGO® Technic™ CONTROL+ app and powered by an advanced Smart Hub with 1 XL motor and 1 L motor for a more immersive play experience, authentic movements and hours of fun.\nBuild the car. Download the app. Get ready for action. With multi-function control, drivers can go forward, reverse, steer, accelerate, brake, or play sound effects and get real-time feedback!\nLooking for Top Gear gifts or LEGO® gifts? Racing fans aged 9+ will love this toy building set.\nAt over 10” (26cm) long, 3” (10cm) high and 5” (14cm) wide, this motorised toy car is the perfect size for driving or for display. Please note: this set is not compatible with LEGO® Power Functions systems.\nBuilding can start without batteries but to enjoy the full power of digital play with the app controls, you’ll need to pop 6 x AA 1.5V batteries into the Smart Hub.\nGetting started with this app-controlled toy is super-fast as full, easy-to-follow instructions are included in the box.\nLEGO® Technic™ plastic model kits are thoroughly tested to make sure every one of these unique toys meets the highest global safety and quality standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/concrete-mixer-truck-42112","description":"Bring the world of construction to life for kids who love to see how things work. Youngsters with a passion for vehicles will enjoy building this LEGO® Technic™ Concrete Mixer Truck (42112). With 8 robust wheels, a moving motor, opening driver’s cab and large mixing drum, it looks just like the real thing. Kids can turn the drum manually or set it to automatic to see it turn as they push the truck. When they turn the drum counterclockwise, they'll see the concrete unload.\n\nCreative play at the toy construction site\nImaginative role play is easy with this construction toy building set. The truck comes with 100 1x1 LEGO bricks to use as the concrete. Kids can turn the bricks in the blender then use the handle to control the funnel and pour the concrete into position.\n\nAdvanced building kits for kids\nLEGO Technic model building kits are ideal for LEGO fans ready for a new challenge. These vehicles look and move like the real thing, so kids will love playing with their creations.\n\nKids who love construction vehicle playsets will discover lots of cool functions in this LEGO® Technic™ Concrete Mixer Truck (42112). With a rotating mixer drum, this model looks and moves just like the real thing.\nWith 1,163 pieces, kids will enjoy a challenging build before exploring all the features of the concrete mixer truck, including 100 1x1 LEGO® system bricks to use as the concrete.\nTurn the drum manually to mix the concrete or set it to automatic and see the mixer rotate as the truck drives along. Turn the drum counterclockwise to unload the concrete, using the funnel to guide it.\nKids who love concrete truck toys will have lots of fun exploring all the features of this concrete mixer truck construction model kit. It makes a great birthday present or holiday gift for kids aged 10 and up.\nThe concrete truck toy measures over 16” (42cm) long, 7” (19cm) high and 4” (12cm) wide, making it ideal for creative play.\nNo batteries are required for this construction toy so the fun starts right away and never slows down.\nPrinted instructions are included for this concrete truck toy LEGO® Technic™ building set for kids.\nLEGO® Technic™ model kits give kids a great introduction to engineering. With awesome designs and realistic functions, LEGO Technic offers advanced building kits packed with realistic features.\nLEGO® Technic™ sets meet the highest industry standards, which ensures each of these building sets for kids connects easily every time.\nLEGO® Technic™ sets are thoroughly tested to make sure each one meets the highest global safety and quality standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/dom-s-dodge-charger-42111","description":"Give fans of Fast & Furious the ultimate thrill with this LEGO® Technic™ Dom’s Dodge Charger (42111) building set for kids and adults. Based on the iconic 1970s Dodge Charger R/T, it’s packed with authentic details. The opening hood reveals a model version of the iconic V8 engine. Other cool features include moving pistons, wishbone suspension, steering system and air blower. There are even nitro bottles in the trunk to bring Dom's daring high-speed chases to life. Just like the real thing! Fans aged 10 and up will love building their very own replica model of Dominic Toretto’s famous car. After building the Dodge Charger, the fun ramps up as fans role-play classic scenes from The Fast and The Furious movie, bringing the adrenaline-fuelled world of street racing to life. Awesome building toy for creative play The LEGO Technic universe offers advanced building toys for LEGO fans who are ready for their next building challenge.\nInspire kids to recreate their favorite scenes from the Fast & Furious movies with this amazing LEGO® Technic™ Dom’s Dodge Charger (42111), an awesome replica model of the classic muscle car.\nWith 1,077 pieces, this cool building set provides a fun challenge for kids who love toy model cars. Inspired by the original 1970s Dodge Charger R/T, this faithful replica is packed with realistic details.\nAuthentic features let kids recreate the thrill of driving the real car, with moving pistons, suspension, steering system and air blower. After playing, kids can show off the model in the famous wheelstand position.\nLooking for a cool holiday gift for kids aged 10+? This is a great choice. Kids can build the model version of Dom’s car then explore its cool features as they recreate Fast & Furious movie scenes.\nMeasuring 15” (39cm) long, 6” (16cm) wide and 4” (11cm) high, this model car is just the right size for role-playing high-speed adventures. Leave it in the wheelstand position for an eye-catching display piece.\nNo batteries are required for this fun race-car toy. Great news for kids who love creative play!\nPrinted instructions are included, so it’s easy for young builders to get started.\nIntroduce youngsters to a world of building fun with LEGO® Technic™ sets. With awesome vehicle designs and cool functions, the fun goes on long after the model is built.\nLEGO® Technic™ sets meet the highest industry standards, which ensures these building sets for kidsconnect easily every time.\nLEGO® Technic™ building kits are thoroughly tested to make sure each one meets the highest global safety and quality standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/mobile-crane-42108","description":"An action-packed set for crane toy fans. Anyone who loves discovering how mega-machines work will have lots of fun with this LEGO® Technic™ 42108 Mobile Crane. It’s a challenging build, perfect for LEGO Technic fans looking for a model packed with functionality. A feature-packed crane truck for construction site fun With its classic black and yellow design, this model looks just like the real thing. And with a mighty range of realistic features, it operates just like a real crane too. First, steer and drive the vehicle to the right spot. Then use the outriggers to secure the crane in place. From the crane cabin, raise the boom and extend the telescopic arm – see how high it reaches! Then use the hoist to carry the concrete pillar – great for role-play, or just for testing what this mega-crane can do. An immersive and rewarding construction site toy This is a challenging and advanced build from the LEGO Technic universe, bringing the world of engineering to life.\nSee how a real crane works with this action-packed LEGO® set for construction fans. Steer the truck, put out the outriggers, raise the boom and hoist the concrete pillar.\nThere’s plenty to learn about engineering and movement with this cool building toy. 8-wheel steering, 4 individually controlled outriggers, 2 cabins and super-high telescopic arm all add up to create an awesome crane!\nHave fun building this challenging model. Then explore what all the different features can do. Use thepillar to put the crane through its paces before moving the truck to the next job.\nCrane fans aged 10+ will love this amazing LEGO® Technic™ (42108) set. It’s a great choice if you’re looking for the best gifts for anyone who loves LEGO Technic and is ready for a new building challenge.\nThe thing you'll notice about this LEGO® crane is its size. With a 30” (78cm) crane arm, it's certainly tall! Its impressive dimensions make this a super display model at 18” (48cm) long and 4” (11cm) wide.\nNo batteries are needed for this crane truck toy. Just bring curiosity and a desire to build to get started!\nEager to get building? Let’s go! With easy-to-follow instructions included in the box, the fun starts straightaway.\nOpen up a whole new world of building fun for LEGO® fans young and old with LEGO Technic™. With cool vehicle designs and awesome functions, the fun goes on long after the model is built.\nConstruction toys need to be tough. So, it's good to know LEGO® Technic™ sets meet the highest industry quality controls. That means building kits that connect easily every time.\nLEGO® Technic™ pieces are tested to the extreme to create toy building sets that meet the highest global safety and quality standards. Great news if you're looking for the best gifts for a LEGO fan."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/technic-hub-88012","description":"Bring LEGO® Technic™ creations to life with the LEGO Powered Up Technic Hub (88012). This advanced control unit features an integrated tilt sensor, as well as 4 input/output ports to program and control LEGO Powered Up sensors, motors and lights.\nFeatures an integrated tilt sensor and 4 input/output ports to program and control LEGO® Powered Up motors, lights and sensors.\nConnects via Bluetooth® to the LEGO® Technic™ CONTROL+ app and is compatible with the Powered Up app.\nDesigned for use with the LEGO® Technic™ building system.\nRequires 6x AA batteries (not included).\nA great addition to STEM learning and robotics projects."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/ducati-panigale-v4-r-42107","description":"Style, sophistication, performance. With breathtaking looks, this LEGO® Technic™ 42107 Ducati Panigale V4 R captures the spirit and design of the original. It’s the first model motorcycle in LEGO Technic history to include a gearbox for exploring different speeds and techniques. Other amazing features include steering, front and rear suspension for realistic movement, plus front and rear disc brakes.\n\nAmazing details capture the spirit of Ducati\nDucati fans will appreciate the attention-to-detail in this amazing motorcycle replica. A kickstand, exhaust pipe, windshield and dashboard add the little details that make this model toy so true to the full-size version. And of course, the classic red color scheme is sure to quicken the pulse of any Ducati fan.\n\nBuild and learn with LEGO Technic model toys\nAs part of the LEGO Technic universe, this motorcycle model kit provides an immersive and rewarding building experience. With realistic features, it introduces builders to the world of engineering, as they discover how gear mechanisms work.\n\nA representation of the famous Ducati Panigale V4 R to build, explore and display. LEGO® Technic™ fans and motorcycle enthusiasts will love this stunning building challenge.\nBuild your own Ducati Panigale V4 R to gain a unique insight into the features and functions that make up this iconic motorcycle. Also includes a 2-speed gear-box – a first for LEGO® Technic™ motorcycles.\nRecreate the thrill of owning a Ducati Panigale V4 R, with front and rear suspension for realistic model movement. The classic red color scheme brings the motorcycle to life, with true Italian flair.\nLooking for the best gifts for motorbike fans? This is a great choice. It’s also a super challenge for LEGO® Technic™ fans aged 10+ who will get a thrill from seeing how a motorcycle works.\nThis eye-catching model (42107) looks stunning on display. Its dimensions have been designed to give a true representation of the real-life model. Measures over 12” (32cm) long, 6” (16cm) high and 3” (8cm) wide.\nNo batteries are needed for this Ducati motorbike toy. Passion, imagination and a desire to discover something new are all you need.\nIt’s easy to get started with this amazing LEGO® set. Just open the box and you’ll find easy-to-follow instructions so building the Ducati toy motorcycle can begin straightaway.\nLEGO® Technic™ engineering toys are designed to provide an immersive and rewarding building experience, featuring realistic movement and mechanisms to help kids and adults explore the world of engineering.\nQuality is important. So, it’s good to know LEGO® building kits meet the highest industry standards ensuring they connect easily every time – it’s been that way since 1958.\nLEGO® Technic™ plastic model toys are put through their paces. Each one is thoroughly tested to make sure every building toy meets the highest global safety and quality standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/catamaran-42105","description":"Kids can recreate the thrill of boat racing with this super-cool LEGO® Technic™ (42105) Catamaran toy. For the first time ever, this LEGO Technic model toy floats on water! So, sailing enthusiasts can learn while they play. See how the sails work. Or how the dagger boards maximise stability and how the rudder steers. With the classic 2-hull catamaran design, this model boat is a fantastic recreation of the real thing. Learn how to build and sail an awesome toy boat Build… rebuild… play… display... There’s so much for kids to discover with this LEGO engineering toy. Have fun building the Catamaran – inspired by real race boats. Then set it in the bathtub to recreate speed sailing adventures before rebuilding into a Race Power Boat. If you're looking for toy boats that really float, this set is a great choice. Unique toys and immersive building experiences LEGO Technic sets are ideal for LEGO fans looking for a new challenge. They offer an advanced building experience for kids and adults who enjoy learning new engineering skills – or simply love to build.\nTake to the water with this racing Catamaran floating toy sailboat. Packed with realistic features, it includes 2 sails, 2 dagger boards and rudder.\nIdeal for developing engineering skills, this 2-in-1 model sailboat kit lets kids build, play and rebuild, giving an introduction to how boats really work.\nMaster the tactics of a world-class speed-sailor. Angle the sails for the ultimate racing position. Raise and lower the 2 dagger boards to maximize stability. Then use the rudder to steer.\nLooking for the best gifts for a toy boat fan? This LEGO® Technic™ Catamaran (42105) is a great choice. Designed for ages 8+, it’s ideal for LEGO fans looking for a new challenge, or for anyone with a passion for sailing.\nAt over 12” (32cm) long, 8” (22cm) wide and 17” (44cm) high (from the bottom of the rudder to the top of the mast), this model sailboat is made for easy handling in the bathtub.\nWho needs batteries when you've got sails? Certainly not this LEGO® Catamaran! It's powered by imagination, so no batteries are required.\nGet building straightaway with full instructions for the Catamaran in the box. Ready to build the Race Power Boat? You’ll find extra instructions for this online.\nYoung LEGO® fans can discover a whole new world of building fun with LEGO Technic™ plastic model kits. With cool vehicle designs and realistic functions, the action goes on long after the model is built.\nLEGO® building bricks are designed to the highest industry standards. LEGOTechnic™ building kits are consistent, compatible and connect easily every time.\nLEGO® Technic™ pieces go through robust testing to make sure every building set meets the highest global safety and quality standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/chevrolet-corvette-zr1-42093","description":"Recreate engineering excellence with this LEGO® Technic™ 42093 Chevrolet Corvette ZR1. Developed in partnership with Corvette, this exclusive model really captures the essence of the iconic supercar and comes with an authentic orange and black color scheme, black spoked rims with low-profile tires, large rear wing and 4 tailpipes. This Chevrolet Corvette ZR1 replica also features working steering and a visible detailed V8 engine with moving pistons. Rebuild this awesome 2-in1 model to create a realistic Hot Rod replica.\n\nExclusive Chevrolet Corvette ZR1 replica model with a wealth of realistic features, including a large rear wing, 4 tailpipes, black spoked rims with low-profile tires, working steering and a detailed V8 engine with moving pistons.\nThis collectible toy car comes with an authentic orange and black color scheme plus a cool sticker sheet for additional detailing.\nOperate the working steering and maneuver the vehicle to activate the visible V8 pistons.\n2-in-1 LEGO® Technic™ set: rebuilds into a Hot Rod.\nThis LEGO® Technic™ model is designed to provide an immersive and rewarding building experience.\nLEGO® Technic™ sets feature realistic movement and mechanisms that introduce young LEGO builders to the universe of engineering in an approachable and realistic way.\nSuitable for ages 9+.\nChevrolet Corvette measures over 3” (8cm) high, 11” (29cm) long and 4” (12cm) wide.\nHot Rod measures over 3” (8cm) high, 9” (23cm) long and 4” (12cm) wide."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/stunt-show-truck-bike-42106","description":"An action-packed building challenge, with motorbike, toy pick-up truck and trailer. And for extra-daring adventures – a flaming ring of fire! With easy-to-use pull-back control, motorbike fans can create heroic stunts as they send their stunt motorcycle soaring towards the flames. The truck features top steering, opening doors and cool stickers to fire kids' imaginations. Meanwhile, the motorbike has chunky tires and even more sticker details. 2-in-1 model for stunning stadium adventures This building kit is packed with exciting features to keep builders and motorbike fans busy. The detachable trailer transforms into a toy ramp to power the bike into the air. Then after performing cool stunts, transport the motorcycle in the trailer, ready for the next hair-raising event. Or for a new challenge, rebuild the model into a Stadium Truck set. Learn new skills with LEGO® Technic™ building toys LEGO builders can discover the basics of force and movement with this LEGO Technic (42106) Stunt Show Truck & Bike set. Ideal for LEGO fans or anyone looking for a cool building challenge.\nThis super building kit includes motorbike, truck, trailer and ring of fire for stunt-action fun. With its pull-back action, kids will love competing with friends to perform the ultimate leap through the flames.\nThe trailer cleverly transforms into a ramp to propel the motorbike towards the ring of fire. After perfecting their jaw-dropping stunts, the truck is ready to transport the motorbike to the next event.\nKids aged 8+ will love this building challenge, creating all the elements of this super-fun set. Once built, they can recreate the thrills of a daring motorcycle show, then rebuild the model into a Stadium Truck set.\nThis action-packed building set (42106) makes a great LEGO® gift for kids aged 8+. It’s also a brilliant choice if you're looking for the best gifts for kids who love toy trucks, stunt cars and action toys.\nWhen all the elements are combined, this makes an impressive set that's the ideal size for role-play. With the ring of fire, width is over 7” (18cm) and height is 11” (28cm).\nNo batteries required so play can start straightaway and the action never slows down.\nOpen the box and get building. Full easy-to-follow instructions are included in the box, so the action can start straightaway. For the Stadium Truck, you'll find instructions online.\nLEGO® Technic™ building kits open up the world of engineering for anyone who loves to discover how things work. These unique toys feature awesome functions so the fun goes on long after the model toy is built.\nFun toys are quality toys. So, it’s good to know LEGO® building bricks meet the highest industry standards and quality tests. They’re consistent, compatible and connect easily every time.\nThe LEGO Group takes safety seriously and thoroughly tests Technic™ pieces to make sure every plastic model kit meets the highest global safety and quality standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/rescue-helicopter-42092","description":"Call in the awesome 2-in-1 LEGO® Technic™ 42092 Rescue Helicopter, with an array of realistic features and functions including spinning rotors, opening side and rear doors, working winch and a rescue stretcher. This sturdy LEGO Technic helicopter for kids comes with an authentic red, white and black color scheme and can be rebuilt to create a futuristic Concept Plane for a double build-and-play experience!\n\nFeatures spinning rotors, opening side and rear doors, working winch and a rescue stretcher.\nCheck out the cool red, white and black color scheme.\nOpen the side doors and operate the winch to lower the rescue stretcher.\nThis LEGO® Technic™ play helicopter model is designed to provide an immersive and rewarding building experience.\nThis easy to build set is ideal for budding LEGO® Technic™ builders.\nLEGO® Technic™ sets feature realistic movement and mechanisms that introduce young LEGO builders to the universe of engineering in an approachable and realistic way.\n2-in-1 LEGO® Technic™ set: rebuilds into a Concept Plane.\nRescue Helicopter measures over 4” (12cm) high, 11” (29cm) long and 9” (23cm) wide.\nConcept Plane measures over 2” (7cm) high, 10” (27cm) long and 11” (30cm) wide."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/technic-large-motor-88013","description":"Breathe life into LEGO® Technic™ creations with the LEGO Powered Up Technic Large Motor (88013). Whether it's powering a steering mechanism or system of gears, this motor gets the job done.\nFeatures an integrated rotation sensor and absolute positioning for accurate speed and position control.\nIncludes a connecting wire and connector for LEGO® Powered Up Hubs (required, sold separately).\nPerfect for higher-load tasks.\nDesigned for use with the LEGO® Technic™ building system.\nUsed with the LEGO® Technic™ CONTROL+ app.\nA great addition to STEM learning and robotics projects.\nLEGO® Powered Up Technic™ Hub required (sold separately)."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/technic-xl-motor-88014","description":"Power up LEGO® Technic™ creations with the LEGO Powered Up Technic XL Motor (88014). Whether turning wheels or lifting heavy loads, this super-strong motor is perfect for the most demanding tasks.\nFeatures an integrated rotation sensor and absolute positioning for accurate speed and position control.\nMaximum power for the most demanding needs.\nIncludes a connecting wire and connector for LEGO® Powered Up Hubs (required, sold separately).\nDesigned for use with the LEGO® Technic™ building system.\nUsed with the LEGO® Technic™ CONTROL+ app.\nA great addition to STEM learning and robotics projects.\nLEGO® Powered Up Technic™ Hub required (sold separately)."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/dragster-42103","description":"Give your little racing driver a cool challenge with this LEGO® Technic™ (42103) Dragster. They’ll love learning how to assemble their very own Dragster model kit. Once built, the fun goes on. Set up the mini traffic lights then pull back the toy car and release to send it zooming along. Action-packed LEGO gifts Kids will love the bold colors of this car. See the flames shooting from the exhaust, just like a real dragster! And with this 2-in-1 set, kids can develop problem-solving skills, rebuilding the drag racing toy into an ace pull-back Hot Rod. Which is their favourite? The wheelie-performing Dragster or the super-cool Hot Rod? Learn and play with this cool engineering toy The LEGO Technic universe offers advanced building toys for young LEGO fans ready for their next building challenge. Printed instructions are included. Or to discover a fun new way to build the model drag car, see the digital Instructions PLUS, from the free LEGO Life app. With zoom and rotate tools, this cool app helps kids build independently.\nIt’s always race day with this 2-in-1 Dragster that rebuilds into a cool Hot Rod. This pull-back toy car is really easy for kids to power – see how fast it speeds along!\nKids can learn how a dragster works. Then lock in the wheelie bar to perform heart-pumping wheelies – or keep on the ground to attempt the speed record. Use the toy traffic light accessory to get play started.\nPull back and release. It really is that simple! Even young racers will be able to recreate the thrill and speed of race day. Ready for a new challenge? Kids can rebuild their Dragster into a pull-back LEGO® Hot Rod.\nLooking for fun toys for kids aged 7 and up? This LEGO® Technic™ (42103) set makes a great gift idea for LEGO fans, race car toy lovers or anyone who loves a building challenge.\nWhen built, the LEGO® Dragster measures over 12” (32cm) long, 4” (12cm) high and 3” (10cm) wide, making this building toy just the right size for race-day role-play.\nIt's got speed but amazingly, this set doesn't need batteries. Everything is powered purely through the pull-back motor, so play can start right away.\nEvery LEGO® set comes with printed instructions. And this set also comes with digital Instructions PLUS, available in the free LEGO Life app for smartphones and tablets.\nLEGO® Technic™ sets feature realistic movement and mechanisms, introducing young LEGO builders to the universe of engineering in an approachable and realistic way.\nDesigned to the highest industry standards, LEGO® Technic™ plastic model kits are consistent; connecting easily every time.\nLEGO® Technic™ pieces are thoroughly tested to make sure every building set meets the highest global safety and quality standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/getaway-truck-42090","description":"Enjoy high-speed action with the LEGO® Technic™ 42090 Getaway Truck, featuring a rugged design with extra-wide rims and huge chunky tires, 2 large side-mounted exhaust pipes, heavy-duty front bumper and a red, black and gray color scheme with flame stickers for a distinct bad-guy look! This robust model truck is also equipped with a powerful pull-back motor. Combine it with the 42091 Police Pursuit pull-back for action-packed car chases, or to create the Ultimate 4x4 combi model.\n\nFeatures a powerful pull-back motor, extra-wide rims, huge chunky tires, 2 large side-mounted exhaust pipes and a heavy-duty front bumper.\nCheck out the red, black and gray color scheme with flame stickers for a distinct bad-guy look!\nBring on the 42091 Police Pursuit pull-back and let the chase begin!\nActivate the pull-back motor to launch the super-rugged Getaway Truck.\nThis play vehicle will help budding LEGO® Technic™ builders develop their motor and creative skills.\nCombine with the 42091 Police Pursuit pull-back to create the awesome Ultimate 4x4 combi model!\nGetaway Truck measures over 2” (7cm) high, 7” (18cm) long and 3” (10cm) wide.\nUltimate 4x4 combi model measures over 3” (10cm) high, 9” (23cm) long and 3” (10cm) wide."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/race-truck-42104","description":"A fantastic model truck for kids who love action toys. Your little racing driver will enjoy building this LEGO® Technic™ (42104) Race Truck. And that’s just the start! Once built, pull back then watch the truck speed towards the finish line, recreating the thrills of a real race day. Awesome toy truck set for racing adventures This model truck is sure to capture the imagination of young car fans. A huge exhaust and giant spoiler, plus opening doors and hood offer plenty role-play options for kids. And that’s not all! With this 2-in-1 plastic model kit, kids can rebuild the truck into a cool Racer, giving them even more opportunity to develop their new building skills. Engineering toys to fire young imaginations LEGO Technic is ideal for building fans who want a challenging build with models packed with realistic features. Each set comes with printed instructions, but this set also has digital Instructions PLUS. Available in the free LEGO Life app, with zoom and rotate viewing,giving builders a sense of achievement.\nRecreate the thrills of the race track with this action-packed pull-back Race Truck. Perfect for kids who love racing toys, it rebuilds into a 2-in-1 Racer for a new building challenge.\nYoung LEGO® builders will love developing their problem-solving skills as they create this LEGO Technic™ (42104) truck. Build, race, then rebuild the 2-in-1 model for even more fun.\nCreating speed is easy with the truck's pull-back and release action. Race Truck features include a big exhaust, huge spoiler and jaw-dropping color scheme to delight car fans.\nLooking for the best gifts for a truck-loving child aged 7+? Well, if they love to build and are ready for a new challenge, this is a great choice.\nWhen built, the toy truck measures over 6” (17cm) long, 3” (8cm) high and 3” (9cm) wide, making it the perfect size for racing and role-play.\nCleverly powered using the pull-back motor, this racing truck doesn't require batteries, so the action starts straightaway!\nPrinted instructionsare included, so it’s easy for young builders to get started. This LEGO Technic™ truck also features digital Instructions PLUS, available in the free LEGO Life app for smartphones and tablets.\nIntroduce youngsters to a world of building fun with LEGO® Technic™ sets. With awesome vehicle designs and cool functions, the fun goes on long after the model is built with these unique toys.\nLEGO® toy building sets meet the highest industry standards, which ensures these fun toys connect easily every time – it’s been that way since 1958.\nLEGO® Technic™ building kits are thoroughly tested to make sure every building set meets the highest global safety and quality standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/mini-claas-xerion-42102","description":"Youngsters with a passion for farming toys will love this LEGO® Technic™ (42102) Mini CLAAS XERION toy tractor set. Developed alongside the world-famous tractor maker CLAAS, it features the iconic green, red and gray color scheme just like the real CLAAS XERION tractor. This cool tractor model packs a punch in functionality too, giving kids even more play. The small tractor toy with big features With working steering, this tractor model features a rotary cutter driven by the wheels. Kids will love lifting and lowering the cutter, just like the real thing. Time to gather the harvest? No problem! With its 2-in-1 design, this model rebuilds into a Harvester, so the fun goes on. Play and learn with LEGO Technic building toys Know a building fan who's ready for a new challenge? LEGO Technic sets are a great choice. With printed instructions, this LEGO tractor set also comes with Instructions PLUS, making it extra fun to build. Available in the LEGO Life app for smartphones and tablets, it has zoom and rotate viewing tools to help kids build the LEGO brick versions independently.\nBuild, play and rebuild. There’s plenty for kids to discover with this LEGO® Technic™ Mini CLAAS XERION (42102) tractor. A super gift for boys and girls who love farm tractor toys. Rebuild into a Harvester for extra fun.\nWorking steering and a rotary cutter driven by the wheels gives kids a great introduction to engineering and lets them create their own small tractor adventures.\nKids can build the Mini CLAAS XERION tractor to tackle jobs around the farm, then rebuild the model into a cool Harvester, so the play lasts even longer.\nDesigned for tractor lovers and building fans, this classic Mini CLAAS XERION tractor makes a thoughtful present if you’re looking for the best gifts for boys and girls aged 7+.\nMeasuring over 5” (14cm) long, 2” (7cm) high, and 3” (8cm) wide, this small tractor toy is the ideal size for role-play adventures. It looks super on display with other toy farm equipment too.\nKids eager to get building their mini tractor toy? Great news! This toy tractor set doesn’t require batteries, so play can start straightaway.\nFind instructions for this toy tractor building set in the box, with instructions for the Harvester online. Or download the digital Instructions PLUS from the LEGO Life app to bring the building process to life.\nOpen up a whole new world of building fun for young LEGO® fans with LEGO Technic™. With realistic vehicle designs and awesome functions, the fun goes on long after the model is built.\nLEGO® Technic™ plastic model kits meet the highest industry standards. This ensures they are consistent, compatible and connect easily every time.\nLEGO® Technic™ plastic model kits are thoroughly tested to make sure every one of these unique toys meets the highest global safety and quality standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/land-rover-defender-42110","description":"Experience world-leading vehicle design firsthand with this highly authentic and displayable 42110 LEGO® Technic™ Land Rover Defender model. Developed in partnership with Land Rover, this impressive LEGO replica captures the vehicle’s outstanding level of refinement with its clean, modern lines and sculpted surfaces, and comes with original-design rims with ground-gripping tires, plus a host of realistic features and functions. Opening doors allow access to an elaborate cabin with a working steering wheel, detailed dashboard and a new-for-October-2019 transmission system with 2 levers for engaging high or low gear ratios and a selector for changing gear – the most sophisticated LEGO Technic gearbox to date! The interior also features forward-folding rear seats that give visual access to the 4-speed sequential gearbox. And, the attention to detail doesn't end there. This awesome replica model also has an in-line 6-cylinder engine with moving pistons beneath the bonnet, working All Wheel Drive with 3 differentials, independent suspension on both axles and a working winch! You can even open the tail door with a turn of the rear-mounted spare wheel. Finished with a removable roof rack with storage box, pannier, ladder and traction mats, this impressive interpretation of the quintessential all-terrain vehicle has been designed to provide a truly immersive and rewarding building experience. The perfect gift for Land Rover enthusiasts and fans of classic collectible model cars.\n\nFeatures authentically designed bodywork with Land Rover emblems, original-design rims with ground-gripping tires, removable roof rack with storage box, pannier, ladder and traction mats, opening doors, bonnet and tail door, plus a detailed cabin.\nFunctions include a 4-speed sequential gearbox, All Wheel Drive with 3 differentials, independent suspension on both axles, detailed in-line 6-cylinder engine and a working winch.\nCabin features a detailed dashboard, working steering wheel and forward-folding rear seats that reveal the 4-speed sequential gearbox.\nNew-for-October-2019 transmission system with 2 levers for engaging high or low gear ratios and a selector for changing gear – the most sophisticated LEGO® Technic™ gearbox to date!\nCheck out the olive green, gray and black color scheme.\nLift the bonnet to see the detailed in-line 6-cylinder engine with moving pistons.\nOpen the doors to access the detailed cabin.\nTurn the rear-mounted spare wheel to open the tail door.\nIncludes a collection of authentic stickers.\nThis LEGO® Technic™ set is designed to provide an immersive and rewarding building experience.\nThis set includes over 2,500 pieces.\nLand Rover Defender measures over 8” (22cm) high, 16” (42cm) long and 7” (20cm) wide."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/remote-controlled-stunt-racer-42095","description":"Pull high-speed wheelies, spins and turns, and traverse rough terrain with this fully motorized LEGO® Technic™ 42095 Remote-Controlled Stunt Racer. This tough model features large ground-gripping tracks with large rear sprockets for optimal acceleration, plus a modern design with a fresh yellow and blue color scheme and decorative stickers. Drive forward, backward, left or right and make 360° turns. Rebuild this 2-in-1 remote-controlled tracked vehicle to create a Remote-Controlled Racer for a double build-and-play experience.\n\nFeatures a high-speed, fully motorized, remote-controlled vehicle with tracks and large rear sprockets for amazing acceleration.\nCheck out the fresh yellow and blue color scheme with cool stickers.\nTraverse rough terrain and obstacles, drive forward, backward, left and right, perform 360° turns and pull awesome wheelies at high speed.\nIncludes the following LEGO® Power Functions components: 2 large motors, receiver, battery box and a remote control.\nThis LEGO® Technic™ set is designed to provide an immersive and rewarding building experience, and features realistic movement and mechanisms, helping young builders enhance their motor skills, hand-eye coordination and imagination.\nThis 2-in-1 motorized toy rebuilds into a Remote-Controlled Racer.\nRemote-Controlled Stunt Racer measures over 6” (17cm) high, 8” (22cm) long and 5” (15cm) wide.\nRemote-Controlled Racer measures over 4” (12cm) high, 7” (20cm) long and 7” (19cm) wide."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/rough-terrain-crane-42082","description":"Enjoy an immense build and play experience with the LEGO® Technic™ 42082 Rough Terrain Crane, our largest and tallest LEGO Technic crane to date, pre-August 2018. Activate the Power Functions and select upper or lower crane mode for complete control over an array of easy‑to‑operate, motorized functions. Lower the stabilizer legs, rotate the superstructure through 360°, operate the lifting winch or send the extendable boom a meter into the air. Manual functions include 4-wheel steering, 4-wheel drive, detailed V8 engine with moving pistons and fan, and adjustable wing mirrors, plus a detailed operator’s cab with an opening door. This amazing model also includes 2 opening compartments with tools, chains and a fire extinguisher, plus 4 outrigger landing plates and 4 LEGO Technic building sections that can be lifted and assembled. This 2‑in‑1 LEGO Technic set comes with a red and black color scheme and can be rebuilt to create a Mobile Pile Driver.\n\nFeatures a LEGO® Power Functions large motor for controlling the cranes upper and lower functions.\nSelect upper and lower crane mode for complete control over an array of easy-to-operate, motorized functions. Lower the stabilizer legs, rotate the superstructure through 360°, operate the lifting winch or send the extendable boom a meter into the air!\nManual functions include 4-wheel steering, 4-wheel drive, detailed V8 engine with moving pistons and fan, adjustable wing mirrors and an opening cab door.\nHook up the included LEGO® Technic building sections and put your LEGO crane operator skills to the test!\nOpen the door to access the detailed operator’s cab.\nOpen the storage compartments to access the chains, tools and fire extinguisher.\nComes with a red and black color scheme.\nThis LEGO® Technic™ Set is designed to provide an immersive and rewarding building experience.\nThe largest and tallest LEGO® Technic™ crane to date—pre-August 2018—with more than 4,050 pieces.\n2-in-1 LEGO® Technic™ Set: rebuilds into a Mobile Pile Driver.\nRough Terrain Crane measures over 39” (100cm) high, 25” (66cm) long and 10” (26cm) wide in working position, and over 10” (27cm) high, 29” (76cm) long and 7” (20cm) wide in driving position.\nMobile Pile Driver measures over 9” (24cm) high, 19” (50cm) long and 7” (20cm) wide in driving position."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/compact-crawler-crane-42097","description":"Help young LEGO® builders understand the basics of gears, force and movement with the LEGO Technic™ 42097 Compact Crawler Crane. This detailed, robust model comes with an array of realistic features and functions, including extendable outriggers that move both laterally and vertically, an extendable boom, a hoist with extensive cabling and safety lock, and a 180°-rotating superstructure. The Crawler Crane folds into a compact vehicle that travels on rugged crawler tracks and comes with a classic yellow and black color scheme with authentic sticker detailing. Rebuild this 2-in-1 construction toy to create the LEGO Technic Compact Tower Crane.\n\nFeatures extendable outriggers that move both laterally and vertically, an extendable boom, a hoist with extensive cabling and safety lock, 180°-rotating superstructure and rugged crawler tracks.\nDrive the Compact Crawler Crane into position, then operate the winch and superstructure to lift and deliver the load with pinpoint accuracy.\nThis LEGO® Technic™ set is designed to provide an immersive and rewarding building experience.\nHelp your young LEGO® builder understand the basics of gears, force and movement with this realistic LEGO Technic™ building set.\nThis construction set is ideal for both beginners and builders who are familiar with the LEGO® Technic™ system of building.\n2-in-1 model: rebuilds into a Compact Tower Crane.\nCompact Crawler Crane, with boom and legs extended, measures over 20\" (51 cm) high, 19\" (49 cm) long and 15\" (40 cm) wide.\nCompact Tower Crane, with boom and legs extended, measures over 19” (50 cm) high, 13” (35 cm) long and 8” (22 cm) wide."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/car-transporter-42098","description":"Introduce young LEGO® builders to the basics of engineering with this highly detailed LEGO Technic™ 42098 Car Transporter toy. This authentic replica model comes with a host of realistic features and functions for hours of play and design exploration. You can raise and lower the car decks and rear ramp for seamless navigation to the upper and lower levels, lock vehicles into position for safe transportation, and tilt the driver's cab to access a detailed V6 engine with moving pistons. This 2,493-piece building set also includes a blue car with working steering and V8 piston engine and is compatible in scale with the 42093 Chevrolet Corvette ZR1 (sold separately). It comes with a classic red, gray and black color scheme with stickers for additional detailing. Rebuild this 2-in-1 vehicle transporter to create the LEGO Technic Truck and Show Cars model.\n\nCar Transporter features adjustable car decks and rear ramp for loading and unloading, lock for securing vehicles during transportation and a tilting driver’s cab that gives access to a detailed V6 engine with moving pistons.\nAlso includes a blue car with working steering and V8 piston engine.\nCar Transporter comes with a classic red, gray and black color scheme, plus a sticker sheet for additional detailing.\nLower the deck, drive on board, apply the transportation lock and you're ready to roll!\nThis LEGO® Technic™ toy truck set introduces LEGO builders to the basics of engineering.\nRealistic features and functions for hours of play and design exploration.\nThis Car Transporter toy is compatible in scale the LEGO® Technic™ 42093 Chevrolet Corvette ZR1 for extended play opportunities.\nCar Transporter measures over 8” (22cm) high, 33” (86cm) long and 5” (13cm) wide.\nBlue car measures over 3” (8cm) high, 10” (27cm) long and 4” (12cm) wide.\nLEGO® Technic™ Truck and Show Cars measures over 5” (14 cm) high, 34” (87 cm) long and 5” (15 cm) wide."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/police-pursuit-42091","description":"Power up the pull-back motor and start a high-speed chase with the sturdy LEGO® Technic™ 42091 Police Pursuit vehicle! This police car toy features an awesome blue, white and black color scheme with cool police stickers, red and blue warning beacons, aerodynamic front bumper, large rear spoiler and wide black rims with low profile tires. Combine it with the 42090 Getaway Truck pull-back for action-packed car chases, or to create the Ultimate 4x4 combi model.\n\nFeatures a powerful pull-back motor, red and blue warning beacons, aerodynamic front bumper, large rear spoiler and wide black rims with low profile tires.\nCheck out the blue, white and black color scheme with cool police stickers.\nBring on the 42090 Getaway Truck pull-back and let the chase begin!\nActivate the pull-back motor to experience the awesome power of this Police Pursuit vehicle.\nThis play vehicle is ideal for budding LEGO® Technic™ builders, improving hand-eye coordination and sparking imaginative play.\nCombine with the 42090 Getaway Truck to create the awesome Ultimate 4x4 combi model!\nPolice Pursuit model measures over 2” (6cm) high, 7” (20cm) long and 3” (10cm) wide.\nUltimate 4x4 combi model measures over 3” (10cm) high, 9” (23cm) long and 3” (10cm) wide."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/buggy-42101","description":"Children get double the fun with this super LEGO® Technic™ (42101) Buggy set. Let young imaginations run wild as they recreate the thrill of powering over sand dunes in their Buggy. And the fun doesn’t end there! The toy Buggy cleverly rebuilds into a sleek toy Racing Car for kids to bring even more adventures. A LEGO set with lots to discover Hot color scheme? Check! Skull stickers? Check! Working steering and suspension? Of course! If you're looking for feature-packed action toys that kids will love, this awesome set has it all. Buildable toys to help kids develop new skills LEGO Technic building kits are ideal for LEGO fans ready for a new challenge. These vehicles look and drive like the real thing, so kids will love building and playing with their creations. Each set comes with printed instructions but there's also a new way to build this car toy with Instructions PLUS, available in the free LEGO Life app. This interactive guide has zoom and rotate viewing tools to help even younger children build this cool engineering toy.\nHere’s a fun building challenge for kids who love racing toys! Build the Buggy and recreate an off-road adventure. Then rebuild into a Racing Car for even more building and role-play fun.\nWith working suspension and steering, this action toy set (42101) creates an interesting building challenge. It promotes problem-solving skills, and there's plenty of opportunity for imaginative play too.\nThe 2-in-1 design means twice the fun. Kids can build the Buggy, then rebuild the model into a sleek Racing Car. Once built, kids will love playing with their creation, or enjoying it with other buildable toy vehicles.\nKids who love action toys will have plenty of fun building and playing with this Buggy. This educational engineering toy makes a great LEGO® gift for boys and girls aged 7+ who enjoy racing toys.\nOnce built, the Buggy car toy measures over 5” (13cm) long, 2” (7cm) high and 2” (7cm) wide, making it ideal for role-play and a super addition to any existing car collection.\nNo batteries are required for this Buggy car toy, so the fun starts straightaway and never slows down.\nPrinted instructions are included for the Buggy plus an online PDF for the Racing Car. This model toy set also has Instructions PLUS, available in the free LEGO® Life app.\nLEGO® Technic™ building kits are ideal for kids who love to build and are ready for a new challenge. With a range of buildable toys, the LEGO Technic universe is loved by kids and adults alike.\nLEGO® plastic model kits meet the highest industry standards. They’re consistent, compatible and connect easily every time – it’s been that way since 1958.\nLEGO® Technic™ pieces are tested to the max to ensure every one of the model toy sets meets the highest global safety and quality standards."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/cherry-picker-42088","description":"Help your young LEGO® builder understand the basics of gears, force and movement with this cool LEGO Technic™ 42088 Cherry Picker. This 2-in-1 model comes with realistic functions and features, including a detailed lifting mechanism with working boom and basket, 4 hazard warning lights, 2 warning beacons and chunky tires. Rebuild this 2-in-1 LEGO Technic set to create a robust Tow Truck.\n\nFeatures a detailed lifting mechanism with working boom and basket, brick-built hazard warning lights and warning beacons, and working wheels with chunky tires.\nDrive the cherry picker into position, then operate the boom and raise the basket into the air.\nThis LEGO® Technic™ set is designed to provide an immersive and rewarding building experience.\nHelp your young LEGO® builder understand the basics of gears, force and movement with this realistic LEGO Technic™ set.\nThis set is a great introduction to the LEGO® Technic™ system of building.\n2-in-1 model: rebuilds into a Tow Truck.\nCherry Picker (with boom lowered) measures over 2” (7cm) high, 5” (14cm) long and 1” (5cm) wide, and more than 4” (12cm) high with boom extended.\nTow Truck measures over 2” (7cm) high, 4” (12cm) long and 1” (5cm) wide."},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/power-functions-l-motor-88003","description":"Motorize your large LEGO® builds with LEGO® Power Functions elements! Bring your creations to life by powering them with the large L-Motor. Spin wheels, turn gears and get your models moving! Designed to fit-and-lock onto LEGO Technic pin and axles.\n\nFeatures the 380 rpm speed L-Motor for animating larger models\nDesigned for use with LEGO® Technic elements\nRequires a Power Functions Battery Box (sold separately)\nAdd movement to your models!"},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/power-functions-servo-motor-88004","description":"Drive your LEGO® Technic creations to a whole new level with the LEGO Power Functions motor made for the ultimate 4-wheel steering experience. Power through the turns like never before with ultra-realistic steering.  Steer your Technic vehicle left, right or straight ahead with any one of 15 steering axle positions. Rotates 90 degrees clockwise or counterclockwise. It’s easy to add 4-wheel steering to your models with the Servo Motor’s front and back power outputs!\n\n Servo Motor features 90-degree rotation clockwise or counterclockwise\n Designed for use with LEGO® Technic elements and vehicles\n Includes front and back power output ports for easy 4-wheel steering functionality\n Steer 90 degrees in either direction with a total of 15 fixed positions!\n Requires a Power Functions Battery Box (sold separately)\n Add 4-wheel steering functionality to your models!"},{"theme":"technic","themeUrl":"https://www.lego.com/en-us/themes/technic","productUrl":"https://www.lego.com/en-us/product/lego-power-functions-xl-motor-8882","description":"Add an extra XL-Motor to your LEGO® creations! This super-strong motor will give plenty of power to your models, whether it’s spinning a wheel or turning a system of gears.\nUse the \"XL\" Motor to animate larger builds.\nRequires battery box (Item #8881), not included."}]