[{"theme":"toy-story-4","themeUrl":"https://www.lego.com/en-us/themes/toy-story-4","productUrl":"https://www.lego.com/en-us/product/toy-story-train-10894","description":"Inspire imagination and role-play adventures with your little Disney•Pixar Toy Story fan, as Woody and Buzz Lightyear take a ride on the LEGO® DUPLO® l Disney•Pixar 10894 Toy Story Train. Teach them about teamwork and help build social and emotional skills as these two iconic characters work together to protect the bank vault from the evil Dr. Porkchop, who is featured on a ‘Wanted' poster. This classic buildable steam train toy is easy to build, helping preschoolers develop early construction and fine motor skills in a much-loved Pixar setting. Includes 2 LEGO DUPLO figures: Woody and Buzz Lightyear.\n\nIncludes 2 LEGO® DUPLO® figures: Woody and Buzz Lightyear with detachable wings.\nFeatures a LEGO® DUPLO® steam train with opening roofs and a separate cactus.\nAccessory elements include a bank vault, lasso and bricks decorated as money and a ‘Wanted' sign—great story starters!\nHelp your child master basic construction skills with this easy-to-build Disney\nPixar Toy Story Train set for toddlers.\nYoung children will love to push Woody around on the steam train and attach Buzz Lightyear's wings to fly him in for backup.\nEncourage language development and social and emotional skills through role-play with favorite Disney\nPixar Toy Story characters.\nThe endless creative play possibilities of LEGO® DUPLO® building toys set the stage for toddlers to become creative thinkers.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nMakes an ideal gift for preschoolers.\nSteam train measures over 5” (14cm) high, 7” (19cm) long and 2” (6cm) wide."},{"theme":"toy-story-4","themeUrl":"https://www.lego.com/en-us/themes/toy-story-4","productUrl":"https://www.lego.com/en-us/product/buzz-woody-s-carnival-mania-10770","description":"Share the excitement and joy of a carnival with your child, with Disney•Pixar’s Toy Story 10770 Buzz & Woody’s Carnival Mania LEGO® 4+ set! This action-packed play set is specially designed to be fun and easy for preschoolers and smaller children, featuring a colorful carnival shooting game with a large sign and laser cannon, plus a special Starter Brick baseplate that gives first-time builders the experience and pride of constructing buildings, vehicles and more on their own. This fun preschool toy building set also includes a spinning Terrorantulus ride with adjustable arms, 2 bumper cars with Starter Brick chassis and an ice cream shop with register, table and benches and a sign. The included simple guide to build and play will also help your young carnival visitor understand the purpose of the building steps and grow their imagination and confidence for the perfect start to easy LEGO brick building in a familiar Toy Story setting. Includes Woody, Buzz Lightyear and Bo Peep minifigures, plus Ducky and Bunny LEGO figures.\n\nLEGO® 4+ sets are made specifically to be fun and easy for youngsters, to grow their confidence, with simple steps for an easy start to LEGO brick building.\nIncludes 3 Toy Story character minifigures: Woody, Buzz Lightyear and Bo Peep, plus Ducky and Bunny LEGO® figures.\nFeatures a carnival shooting game, decorated rocket elements that can be knocked down and separate, working cannon, plus a Starter Brick baseplate and decorated wall plate to get your child building and playing quickly with LEGO® bricks in a fun Disney\nPixar Toy Story world. Also includes an ice cream shop with register, a table and benches.\nThis cute set also includes a Terrorantulus ride that turns and has adjustable arms, plus 2 bumper cars with Starter Brick chassis.\nAccessory elements include 6 studs, crate, 3 decorated rocket elements, large ice cream, 2 small ice creams, ice cream sundae, ice cream spoon, bucket and Bo Peep's shepherd crook.\nHelp your child replay exciting Toy Story movie scenes or make up their own stories.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ play sets were previously branded as LEGO Juniors and can be built together with all LEGO construction toys for creative building.\nThis Toy Story 4 creative play set makes an ideal gift for preschoolers and youngsters.\nCarnival shooting game measures over 3” (10cm) high, 4” (12cm) wide and 1” (3cm) deep.\nBumper cars each measure over 3” (9cm) high, 1” (3cm) long and 1” (3cm) wide.\nIce cream stand measures over 4” (11cm) high, 2” (6cm) wide and 3” (8cm) deep.\nTerrorantulus ride measures over 3” (8cm) high, 7” (19cm) wide and 7” (19cm) deep."},{"theme":"toy-story-4","themeUrl":"https://www.lego.com/en-us/themes/toy-story-4","productUrl":"https://www.lego.com/en-us/product/toy-story-4-rv-vacation-10769","description":"Help your child experience the adventure and fun of Disney•Pixar’s Toy Story 4 with the 10769 Toy Story 4 RV Vacation LEGO® 4+ set! This jaunty set is developed to be fun and easy for preschoolers and youngsters, featuring a recreational vehicle (RV) with special Starter Brick chassis, removable roof and interior with bed, toilet and sink, plus a park building wall with special Starter Brick baseplate, tree, picnic table and a grill. The Starter Brick pieces help even first-time builders experience the pride of building vehicles, structures and more, all on their own. This great easy LEGO set also includes an RV Park sign with tree and opening gate. The included simple guide to build and play will help your young camper understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO model kits in an exciting new Toy Story 4 movie setting. Includes Jessie and Alien minifigures, plus Rex and Forky LEGO figures.\n\nLEGO® 4+ sets are developed to be fun and easy for young children and help to grow their confidence with simple building steps for an excellent start to LEGO brick building.\nIncludes 2 minifigures: Jessie and Alien, plus Rex and Forky LEGO® figures.\nThis great camping set features an RV with special Starter Brick chassis, removable roof, interior with bed, toilet and sink, and a ladder to get youngsters building and playing quickly with LEGO® bricks in a Disney\nPixar Toy Story 4 world.\nAlso includes a park building wall with special Starter Brick baseplate, picnic table and a grill, plus an RV Park sign with opening gate.\nThis fun set also features 2 of the new sustainable LEGO® plant-based plastic trees.\nAccessory elements include 2 mugs, croissant, skateboard, camera, plate, apple, hot dog and a marshmallow on a stick.\nRemove the roof for easy play inside the RV.\nYoung children with love to replay exciting Toy Story 4 movie scenes or make up their own stories.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ play sets were previously branded as LEGO Juniors and can be built together with all LEGO building toys for creative building.\nThis Toy Story 4 construction set makes an ideal gift for preschoolers and youngsters.\nRV measures over 3” (10cm) high, 5” (14cm) long and 2” (7cm) wide.\nPark building wall measures over 2” (7cm) high, 6” (16cm) wide and 3” (9cm) deep.\nRV Park sign measures over 5” (13cm) high, 5” (13cm) wide and 1” (3cm) deep."},{"theme":"toy-story-4","themeUrl":"https://www.lego.com/en-us/themes/toy-story-4","productUrl":"https://www.lego.com/en-us/product/buzz-bo-peep-s-playground-adventure-10768","description":"Introduce your youngster to the fun and excitement of Disney•Pixar’s Toy Story 4 with this adorable 10768 Buzz & Bo Peep’s Playground Adventure LEGO® 4+ play set! This sweet set is specially designed to be easy and fun for young children and preschoolers, featuring a 2-level playhouse with kitchen area, slide, bridge, climbing wall, bubble window stand and a special Starter Brick baseplate that lets even first-time builders experience the pride of constructing buildings, vehicles and more on their own. The cute playground toy building set also includes a merry-go-round and movable bushes under the bridge that open to reveal a hiding spot and a skunk-mobile. The included simple guide to build and play will also help your young adventure-seeker understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO brick building in a well-known Toy Story setting. Includes Buzz Lightyear, Bo Peep and Gabby Gabby minifigures.\n\nLEGO® 4+ learning toy sets are specially designed to be fun and easy for your child and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nIncludes 3 Toy Story 4 minifigures: Buzz Lightyear, Bo Peep and Gabby Gabby.\nFeatures a 2-level playhouse with kitchen area, slide, bridge with movable bushes underneath, climbing wall, bubble window stand, and a Starter Brick baseplate to get youngsters building and playing quickly with LEGO® bricks in a Disney\nPixar Toy Story world.\nThis sweet set also includes a merry-go-round and a skunk-mobile.\nThis fun set also features the new sustainable LEGO® plant-based plastic trees.\nAccessory elements include Bo Peep’s shepherd crook, frying pan and an egg.\nHelp your child replay exciting Toy Story movie scenes or make up their own stories.\nLEGO® 4+ preschool toys introduce your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ construction toy sets were previously branded as LEGO Juniors and can be built together with all LEGO building toys for creative building.\nThis Toy Story 4 construction set makes an ideal gift for preschoolers and youngsters.\nPlayhouse measures over 6” (17cm) high, 9” (25cm) wide and 4” (12cm) deep.\nMerry-go-round measures over 2” (6cm) wide and 2” (7cm) deep.\nSkunk-mobile measures over 5” (14cm) long and 1” (3cm) wide."},{"theme":"toy-story-4","themeUrl":"https://www.lego.com/en-us/themes/toy-story-4","productUrl":"https://www.lego.com/en-us/product/carnival-thrill-coaster-10771","description":"Share the excitement and joy of a carnival with you child, with the Disney•Pixar Toy Story 4 10771 Carnival Thrill Coaster LEGO® 4+ construction toy! The action-packed play set is specially designed to be fun and easy for preschoolers and smaller children. This great set features a colorful carnival roller coaster with 3 cars, 6 sturdy track sections and a large entrance arch with spinning turnstile, plus a special Starter Brick baseplate that gives first-time builders the experience and pride of constructing buildings, vehicles and more on their own. This fun preschool toy building set also comes with a cute ice cream wagon with balloon and pizza pie. The included simple guide to build and play will also help your young carnival visitor understand the purpose of the building steps and grow their imagination and confidence for the perfect start to easy LEGO brick building in a fun Toy Story setting. Includes Buzz Lightyear and Alien minifigures.\n\nLEGO® 4+ sets are made specifically to be fun and easy for youngsters, to grow their confidence, with simple steps for an easy start to LEGO brick building.\nIncludes 2 Toy Story character minifigures: Buzz Lightyear and Alien.\nFeatures a roller coaster track with a large entrance arch, flags, camera, spinning turnstile, 6 purple track sections and a special Starter Brick baseplate to get youngsters building and playing quickly with LEGO® bricks in a Disney\nPixar Toy Story 4 world.\nThis exciting set also includes 3 coaster cars and an ice cream wagon with balloon.\nAccessory elements include a camera, 1 ice cream element and a pizza pie.\nYoungsters will love to replay exciting Toy Story movie scenes or make up their own stories.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ starter play sets were previously branded as LEGO Juniors and can be built together with all LEGO building toys for creative building.\nThis Toy Story 4 construction set makes an ideal gift for preschoolers and youngsters.\nIncludes a digital building extension via LEGO® Life.\nThrill Coaster with arch measures over 3” (10cm) high, 11” (28cm) wide and 11” (29cm) deep.\nCoaster cars each measure over 6” (16cm) long and 1” (3cm) wide.\nPizza wagon with balloon measures over 2” (7cm) high and 1” (4cm) long."},{"theme":"toy-story-4","themeUrl":"https://www.lego.com/en-us/themes/toy-story-4","productUrl":"https://www.lego.com/en-us/product/duke-caboom-s-stunt-show-10767","description":"Help your youngster see the thrill and adventure of Disney•Pixar’s Toy Story 4 with this 10767 Duke Caboom’s Stunt Show LEGO® 4+ set. This fun preschool toy building set is specially designed to be easy and enjoyable for preschoolers and youngsters, featuring an adjustable ring of fire with attached ramp and 2 special Starter Brick plates that let even first-time builders have the pride of constructing vehicles, buildings and more all on their own. This fun set also includes a buildable toy motorcycle, 3 stackable cans, 2 cars and a stunt sign that can be knocked down. The simple guide to build and play, included in the box, will help your young stunt driver understand the purpose of the building steps and boost their imagination and confidence, for a great start to LEGO building toys in a fun Toy Story setting. Includes 2 minifigures for role-play fun.\n\nThe design of LEGO® 4+ starter sets makes it fun and easy for youngsters to grow their confidence, with simple building steps for the perfect start to LEGO brick building.\nIncludes 2 minifigures: Woody and Duke Caboom.\nThis cool set features a striped ramp with a gap for cars and an adjustable ring of fire, plus 2 Starter Brick plates to get your child building with LEGO® bricks and playing quickly in a thrilling Disney\nPixar Toy Story world.\nAlso includes a motorcycle and two cars, plus a small stunt sign with ramp.\nAccessory elements include 4 fire elements, cape and an extra wig, plus 3 buildable, stackable cans.\nHelp your child move the ring of fire into different positions and more challenging stunt jumps.\nYoungsters will enjoy replaying exciting Toy Story movie scenes or making up their own stories.\nLEGO® 4+ starter sets introduce your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ play sets were previously branded as LEGO Juniors and can be built together with all LEGO building toys for creative building.\nThis Toy Story 4 building set makes an ideal gift for preschoolers and youngsters.\nRamp with ring of fire measures over 7” (18cm) high, 8” (22cm) wide and 4” (12cm) deep.\nMotorcycle measures over 1” (3cm) high and 2” (6cm) long.\nCars each measure over 1” (4cm) long and 1” (3cm) wide."},{"theme":"toy-story-4","themeUrl":"https://www.lego.com/en-us/themes/toy-story-4","productUrl":"https://www.lego.com/en-us/product/woody-rc-10766","description":"Introduce your child to the fun of LEGO® building and the excitement of Disney•Pixar’s Toy Story 4 with the 10766 Woody & RC set. This simple LEGO 4+ set is specially designed to be fun and easy for preschoolers and youngsters, featuring an easy to build Toy Story RC character car with a special Starter Brick chassis that lets even first-time builders have the pride of constructing vehicles and more, all on their own. The included simple guide to build and play will also help your young race car driver understand the purpose of the building steps, and grow their confidence and imagination for a great start to LEGO brick building in a familiar Disney•Pixar setting. Includes a Woody minifigure for role-play fun.\n\nLEGO® 4+ sets are specially designed to be fun and easy for youngsters and help to grow their confidence with simple building steps for the perfect start to LEGO brick building.\nIncludes a Woody minifigure.\nFeatures an easy-to-build RC toy car with big back fin, front fender with eyes and remote antenna, plus a Starter Brick base to get your child building with LEGO® bricks and playing quickly in a fun Disney\nPixar Toy Story 4 world.\nAccessory elements include 3 green army men, remote control element for RC, 6 colorful, buildable display bricks and 3 buildable cones.\nHelp your child replay exciting Toy Story movie scenes or make up their own stories.\nLEGO® 4+ introduces your child to a wide universe of their movie favorites, TV characters and everyday heroes.\nLEGO® 4+ play sets were previously branded as LEGO Juniors and can be built together with all LEGO building kits for creative building.\nThis Toy Story 4 construction set makes an ideal gift for preschoolers and youngsters.\nRC car measures over 2” (6cm) high, 3” (9cm) long and 2” (6cm) wide."}]