[{"theme":"trolls","themeUrl":"https://www.lego.com/en-us/themes/trolls","productUrl":"https://www.lego.com/en-us/product/vibe-city-concert-41258","description":"Inspire kids to explore the world of music as they go on an amazing journey with the LEGO® Trolls World Tour Vibe City Concert (41258) playset. There are many musical accessories to discover, including a keyboard, 2 guitars, tuba and trumpet. There's also a DJ booth, microphones and a recording room – ideal for kids who love to imagine singing with the Trolls.\n\nRole-play singing adventures with the Trolls\nKids will love recreating fun scenes from the Trolls World Tour movie. With 5 minifigures, creative play is easy. Take the Trolls for a ride down the slide or pop them onto the spinning platforms. Check out the cute felt speaker, glittery details and moving stars, plus the collectible string from the movie.\n\nCool toys for kids who love Trolls characters\nWith fun hair features and collectible accessories, these building kits for kids bring the Trolls universe to life. And with digital Instructions PLUS, available in the free LEGO Building Instructions app, kids can enjoy a new way to build.\n\nLet little Trolls fans explore the wonderful world of music with this fun-filled LEGO® Trolls World Tour Vibe City Concert playset (41258) inspired by the Trolls World Tour movie.\nWith 5 Trolls minifigures, including the exclusive character Funk Troll, play starts right away. Kids will enjoy building the cool concert scene before creating a host of adventures for their Trolls.\nThis action-packed set features many accessories for role-play fun, including a keyboard, 2 guitars, tuba, trumpet and microphones. There are also cool Troll hair features to help little ones style up the Trolls.\nWith so many features to discover, this set makes a great Christmas gift or thoughtful present for boys and girls aged 6 and up who love Trolls dolls, figurines and playsets.\nThis colorful Trolls building toy measures over 9” (25cm) high and 8” (21cm) deep, making this a fun toy for kids who love imaginative play.\nNo batteries are required for this fun toy for kids, which is great news for Trolls fans who love creative play.\nNow even younger builders can enjoy the sense of achievement from building independently with digital Instructions PLUS, available in the free LEGO® Building Instructions app.\nEach LEGO® Trolls World Tour building kit for kids encourages children to role-play scenes from the DreamWorks Trolls World Tour movie, boosting creativity.\nEver since 1958, LEGO® bricks have met the highest industry standards plus the LEGO Group's own quality criteria, to ensure they are consistent, compatible and connect and pull apart easily every time.\nLEGO® bricks and pieces are dropped, squashed, twisted, heated, bent, scratched and stretched to ensure they meet the highest global safety and quality standards."},{"theme":"trolls","themeUrl":"https://www.lego.com/en-us/themes/trolls","productUrl":"https://www.lego.com/en-us/product/pop-village-celebration-41255","description":"With amazing detail, this awesome LEGO® Trolls World Tour Pop Village Celebration (41255) Trolls tree house building set opens a world of imaginative play for young Trolls fans. From the branches of this super-cool tree hang two pods: one for the glitter-tastic exclusive LEGO® Trolls characters Guy Diamond and Tiny Diamond, plus another for Cooper. There’s even space to add an optional third pod – Poppy’s Pod (41251). There’s so much for kids to discover in this Trolls playhouse. With lots of interactive features and accessories, they’ll love creating their own stories. They can even take the fun with them since the Trolls’ pods close and are portable! If you’re looking for creative gifts or cute toys for kids who love the Trolls movies, the LEGO Trolls World Tour building sets are a great choice. Each set includes printed instructions and comes with Instructions PLUS to help youngsters build.\n\nSee young imaginations grow with this action-packed tree house playset (41255) inspired by the Trolls World Tour movie.\nWith 5 Trolls minifigures, including exclusive characters Guy Diamond and Tiny Diamond, play starts straightaway. Kids can enjoy a fun building challenge before creating a host of adventures for their Trolls.\nHang the two pods on the tree or close them up for fun on the move! Kids can even add a third pod – Poppy’s Pod (41251) – for even more fun from the new Trolls movie.\nWith lots of accessories and features to discover, this set makes a great Christmas gift. So, if you’re looking for creative Trolls gifts or cute toys for boys and girls age 6+, this is a cool choice.\nAt over 8” (22cm) high, this Trolls tree house toy looks so impressive once built. And the clever thing is that the pod toys are removable and portable – measuring over 4” (11cm) high for fun on the go.\nNo batteries required at the Pop Village Celebration! A love of imaginative play is all kids will need to build this model and create their own Trolls stories – or recreate favourite scenes from the new Trolls movie.\nWant to give even younger builders a more awesome building experience? Now you can with digital Instructions PLUS! With intuitive modes like zoom, rotate and ghost mode, it’s LEGO® building for the digital age!"},{"theme":"trolls","themeUrl":"https://www.lego.com/en-us/themes/trolls","productUrl":"https://www.lego.com/en-us/product/volcano-rock-city-concert-41254","description":"This cool LEGO® Trolls World Tour Volcano Rock City Concert toy brings the world of music to life for Trolls fans. With 3 minifigures, play starts straightaway. Kids will love helping Poppy get ready, with different hair accessories, as she prepares to take on Queen Barb in the ultimate rock battle. Then they can put Poppy and Barb on the spinning podiums to role-play dramatic music scenes from the movie. Kids will enjoy imaginative play long after this Trolls movie toy set is built. Check out the movable felt wings, the spinning platforms and backstage snacks. Kids will love finding the collectible string to place in the lyre – along with strings collected from other LEGO Trolls World Tour sets. LEGO Trolls World Tour opens a world of play for fans of the DreamWorks Trolls movies. Each set has printed instructions and comes with Instructions PLUS to help youngsters enjoy building.\n\nAwesome rock toy building fun for young Trolls fans! Kids will love recreating musical scenes from the Trolls World Tour movie, with plenty of opportunity for role-play long after the toy model is built.\nWith 3 minifigures, including an exclusive Barb minifigure, kids can play with their Trolls as they explore the many features included in this set, making it ideal for kids who love creative play.\nIt’s the little details that make this set so much fun! Poppy and Branch come with exclusive rock outfits, plus, there are accessories for the Trolls’ hair and two collectible toy musical strings to store in the lyre.\nCreative building fun for kids age 6 and up. With 3 Trolls collectible minifigures included, this set (41254) makes a great holiday gift for any fan of Trolls movie toys.\nWith a stage measuring over 6” (17cm) high, 8” (22cm) long and 4” (11cm) wide, this set is the ideal size for role-play alone or with friends. It also looks great on display.\nAlong with printed instructions, this set has digital Instructions PLUS. Find them in the free LEGO® Life app to make building this set easy even for young builders.\nLEGO® building bricks always meet the highest industry standards, undergoing rigorous quality tests to ensure they are consistent, compatible and connect and pull apart easily every time."},{"theme":"trolls","themeUrl":"https://www.lego.com/en-us/themes/trolls","productUrl":"https://www.lego.com/en-us/product/poppy-s-hot-air-balloon-adventure-41252","description":"See kids’ imaginations soar as they join their favourite Trolls on an epic journey with the LEGO® Trolls World Tour Poppy’s Hot Air Balloon Adventure . As kids explore the Trolls minifigures, features and accessories, they can role-play scenes from the movie – or create their own. Epic storytelling with an awesome Trolls figure set 3 minifigures (plus Mr. Dinkles) are included in this play vehicle set, so the fun starts right away. With a map and binoculars to navigate, plus flapping hearts to change position, kids will love steering the balloon towards Symphonyville – just like Poppy, Branch and pals in the movie! LEGO® Trolls World Tour opens a world of creative play for fans of the DreamWorks Trolls movies. With collectible toy accessories, plus cool removable Troll hair, these building kits for kids bring the Trolls universe to life. Instructions PLUS with interactive viewing tools makes building this pink hot air balloon toy extra fun.\n\nA pink hot air balloon toy that’s perfect for any Trolls fan. Packed with features, it lets kids recreate favourite scenes from the Trolls World Tour movie for lots of role-play adventures.\nWith 3 Trolls minifigures in this set, (Poppy, Branch, plus exclusive character Biggie (and Mr. Dinkles)), play begins right away. And with a stack of Trolls-inspired extras, the fun goes on after the model is built.\nLots for kids to discover! Use the flapping hearts to alter the position of the balloon, play with the minifigures (and the Trolls’ hair!), then find the collectible musical string hidden in the metronome.\nA creative gift to encourage imaginative play for Trolls fans aged 6 and up. This new-for-January-2020 LEGO® set makes a great present for anyone who loves play vehicles and Trolls characters.\nThis cute Trolls gift for girls and boys (41252) is a great size for role-play fun. The balloon measures over: 8” (22cm) high, 6” (17cm) long, 5” (13cm) wide.\nWith digital Instructions PLUS, available in the free LEGO® Life app, kids can enjoy a new building experience, learning to build their model with the cool interactive viewing tools.\nEach LEGO® Trolls World Tour movie toy set lets kids bring their favourite scenes from the Trolls World Tour movie to life. It’s the perfect way to encourage creative play with lots of adventure along the way!"},{"theme":"trolls","themeUrl":"https://www.lego.com/en-us/themes/trolls","productUrl":"https://www.lego.com/en-us/product/poppy-s-pod-41251","description":"Kids who love Poppy and Trolls movie toys will adore this LEGO® Trolls World Tour Poppy’s Pod. There’s lots to discover as your little Trolls fan joins Poppy at the start of her journey. They can help Poppy take a shower, style her hair and look for the treasure map. With lots of imaginative play, this LEGO 4+ set is a fun way for youngsters to learn to build. Fun on the go – Trolls playhouse and Poppy Troll minifigure Poppy’s Pod folds and closes into a portable travel toy to keep little ones entertained wherever they go, making it a great gift for kids who love pocket toys. Collectible toys for Trolls fans New for January 2020, LEGO Trolls World Tour toys open a world of creative play for fans of the Trolls movies. Kids will love building the cute toy sets before recreating their favourite music scenes from the story.\n\nIntroduce young Trolls fans to a world of music and adventure. With the LEGO® Trolls World Tour Poppy’s Pod (41251), kids can enjoy recreating scenes from the movie, then close the pod to create a cute travel toy.\nPoppy’s Pod is packed with features and accessories so kids can let their imaginations run wild, creating new adventures for Poppy. Play with her hair or take a swing on the felt fabric flower; the fun never ends.\nCombine Poppy’s Pod with the LEGO® Trolls World Tour Pop Village Celebration (41255) building kit where Poppy’s Pod can be placed on top of the large tree.\nLooking for Trolls merchandise to give as a special Christmas gift? This is a great choice! LEGO® 4+ sets are a fun way for youngsters to learn to build, increasing their confidence with simple building steps.\nThis Trolls pod is just the right size for fun on the move. When closed, the pod toy measures over 4” (11cm) high, 3” (9cm) wide and 3” (9cm) deep.\nNo batteries are required for this Troll’s Poppy toy. Which is great news because we all know the Trolls are powered by hugs, rainbows and cupcakes – not batteries!\nEasy to build! Give even younger builders an amazing sense of achievement and independence with digital Instructions PLUS. Available in the free LEGO® Life app, they’ll be building this model like a pro in no time."},{"theme":"trolls","themeUrl":"https://www.lego.com/en-us/themes/trolls","productUrl":"https://www.lego.com/en-us/product/branch-key-chain-854004","description":"Bring a touch of Trolls’ flair to bags and keys with this cute LEGO® Trolls Branch Key Chain (854004). With a Branch minifigure, it’s the perfect accessory for fans of the Trolls movies. Branch, with his trademark purple hair, is attached to a durable metal chain and ring, ready to add to bags or to keep keys safe.\nFeatures a LEGO® Trolls Branch minifigure attached to a durable metal chain and ring. Minifigure is not detachable from the metal chain.\nAttaches securely to a backpack, bag or keys, adding a little Trolls happiness to everyday life.\nMeasures over 5” (15cm) high and 1” (4cm) wide – just the right size for bags and keys."},{"theme":"trolls","themeUrl":"https://www.lego.com/en-us/themes/trolls","productUrl":"https://www.lego.com/en-us/product/techno-reef-dance-party-41250","description":"A music-inspired underwater adventure for Trolls fans! Kids will love playing out their favorite movie scenes with the LEGO® Trolls World Tour Techno Reef Dance Party (41250). They can create the toy DJ booth and stage then put the mermaid on the heart-shaped reef to see her spin. There's even a cool felt heart and a slide for the mermaid and her octopus pal to enjoy. Collectible toys and creative gifts Know a child who loves imaginative play? This Trolls set makes a great gift. And any child who loves Trolls figures or mermaids will adore the mermaid LEGO minifigure. Open a world of imaginative play Kids will love building this cool set before recreating favorite scenes from the Trolls World Tour story. With collectible toy accessories, figures and fun hair features, these building kits for kids bring the Trolls universe to life. There's even removable Troll hair to which kids can add the cute accessories. Instructions PLUS features zoom and rotate tools to give kids even more fun.\n\nA creative gift for any Trolls fan who wants to recreate musical scenes from the DreamWorks Trolls World Tour movie. This toy is packed with accessories, providing plenty of fun once the set is built.\nWith a Trolls exclusive mermaid collectible figure and octopus toy, kids can act out the underwater scenes from the Trolls World Tour movie as they join the mermaid at the Techno Reef Dance Party.\nSpeakers, strobe lights, a dancefloor and a DJ booth toy: this cool set has lots for kids to discover. Spin on the dancefloor, whizz down the slide, then find the collectible musical string – just like in the movie.\nLooking for Trolls playsets for a holiday gift? This set (41250) is a great choice! Ideal for Trolls fans aged 5 plus, it’s an ace gift for creative kids – or anyone who loves mermaids.\nThe DJ booth measures over 3” (8cm) long, 1” (3cm) high and 1” (3cm) deep, making this underwater playset the perfect size for creative play.\nPlay begins straightaway since no batteries are required for this Trolls playset. Great news for Trolls fans who love to use their imagination to tell the story – not batteries!\nNow even younger builders can enjoy the sense of achievement from building independently with digital Instructions PLUS, available in the free LEGO® Life app.\nEach LEGO® Trolls World Tour building kit for kids encourages children to role-play scenes from the DreamWorks Trolls World Tour movie, boosting creativity.\nLEGO® building bricks meet the highest industry standards plus our own quality criteria. This ensures they are consistent, compatible and connect and pull apart easily every time.\nAt the LEGO Group, we drop, squash, twist, heat, bend, scratch and stretch LEGO® bricks and pieces to ensure they meet the highest global safety and quality standards."},{"theme":"trolls","themeUrl":"https://www.lego.com/en-us/themes/trolls","productUrl":"https://www.lego.com/en-us/product/rainbow-caterbus-41256","description":"The LEGO® Trolls World Tour Rainbow Caterbus is here! Trolls fans will have so much fun joining Poppy, Cooper, Cloud Guy (and 3 cloud babies) for a journey in this amazing Caterpillar bus playset inspired by the Trolls World Tour movie. They can build all the cool elements of this detailed set and then recreate their favourite scenes from the movie. There’s so much going on in this feature-packed set. Kids can have fun waiting at the toy bus station. Then, when the caterpillar bus arrives, they can pop all their Trolls figures inside for a ride. With Poppy and Cooper Troll minifigures, plus four buildable brick characters – Cloud Guy and his three cloud babies - there’s plenty of opportunity for creative play. If you’re looking for Trolls toys for kids who love Poppy and her pals, LEGO Trolls World Tour collectible toy sets are a great choice.\n\nTake Trolls fans on an exciting journey as they join their favourite Trolls on the Rainbow Caterbus. The fun begins with the build but lasts even longer as they role-play scenes from the new DreamWorks Trolls movie.\nWith 6 Trolls characters, there’s lots of opportunity for pretend play as Poppy, Cooper and Cloud Guy and the cloud babies have fun at the bus stop before jumping into the Rainbow Caterbus.\nKids will love seeing the moving eyes and wheels on this kooky caterpillar toy bus. There’s lots of fun at the bus stop too with a felt flower, swinging seat and a bar so Poppy can swing from her hair.\nLooking for cute creative gift ideas? Well a caterpillar toy bus is certainly different, making this fantasy playset a great choice! Ideal for kids age 6+, it’s a fun build for anyone who loves play vehicles.\nThe Caterbus measures over 5” (15cm) long, 2” (7cm) high, 3” (8cm) wide, and when combined with the toy bus station creates a set perfect for imaginative play.\nThere’s a new way for LEGO® fans to get building: with digital Instructions PLUS! Available in the free LEGO Life app, it’s LEGO building for the digital age with cool tools to help young builders!\nThe LEGO® Trolls World Tour range of collectible toys lets Trolls fans build their favourite scenes, play with Trolls characters and recreate stories from the Trolls World Tour movie."},{"theme":"trolls","themeUrl":"https://www.lego.com/en-us/themes/trolls","productUrl":"https://www.lego.com/en-us/product/lonesome-flats-raft-adventure-41253","description":"Fans of the Trolls World Tour movie will love this awesome LEGO® Trolls World Tour Lonesome Flats Raft Adventure (41253) playset. With a floatable raft, stage and jail, this LEGO 4+ set is a fun way for youngsters to learn to build. Inspired by the movie, kids can play creatively with these awesome Trolls movie toys and Trolls minifigures. Packed with collectible toy features, including Trolls characters, the musical strings from the movie and more, the LEGO Trolls World Tour universe offers exciting play.\n\nFloating fun with raft, stage, jail and more. Let young Trolls fans recreate scenes from the Trolls World Tour movie as Poppy introduces pop music to the world of country music.\nCreative role-play is easy with this awesome Trolls playset. There are 3 minifigures to help kids act out the story, plus lots of hair accessories and features for imaginative play.\nKids will love discovering all the things they can do with this cool set. With a spinning dancefloor, floatable raft, and the collectible string to find, there’s plenty of fun, long after the model is built.\nLEGO® 4+ sets are a fun way for youngsters to learn to build. This set is ideal for kids who love Poppy toys, Trolls movie collectibles, or anyone who would love creative play with a toy raft!\nThis cute toy set (41253) is just the right size for imaginative play and storytelling; the raft measures over 6” (16cm) long and 3” (8cm) wide.\nAs well as printed instructions, this set has digital Instructions PLUS. Available in the LEGO® Life app, this makes the set super-easy to build, even for young Trolls fans.\nWith each LEGO® Trolls World Tour set, kids can recreate exciting scenes from the Trolls World Tour movie. It’s a great way to boost creativity as they join Poppy, Branch and their Trolls friends on their journey.\nWhen it comes to kids’ toys, quality is so important. That’s why LEGO® building bricks are thoroughly tested to make sure they always meet the highest industry standards."},{"theme":"trolls","themeUrl":"https://www.lego.com/en-us/themes/trolls","productUrl":"https://www.lego.com/en-us/product/poppy-s-carriage-30555","description":"Treat little Trolls fans to a journey aboard Poppy’s insect-powered carriage. They’ll love moving the cute insect legs and can discover lots of accessories in the chest!"}]