[{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/botanical-accessories-40376","description":"LEGO® fans can create their own garden with this fun and updated LEGO xtra Botanical Accessories Set (40376). This charming playset includes a variety of LEGO elements and buildable items, including 3 trees, flowers and plants that can be customized for spring, summer, fall and winter, 2 fences and much more. Kids will love using their imaginations to bring garden-based adventures to all their existing LEGO® sets.\nKids will love creating their own special gardens with this LEGO® xtra Botanical Accessories Set, featuring a customizable tree, flowers and plants, foliage elements for all seasons, 2 fences and 2 small tree elements.\nThis garden playset can be enjoyed by kids on their own or with friends and opens up endless play opportunities when combined with other LEGO® playsets in their collections.\nA fun and cute gift for kids aged 6 and up, this 32-piece construction set comes with simple-to-follow instructions so young builders can put it together with ease and confidence."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/lego-xtra-sea-accessories-40341","description":"Add an ocean theme to your LEGO® creations with this LEGO xtra 40341 Sea Accessories set, featuring shark, parrot and fish figures and a selection of accessories including an oar, harpoon, surfboard and flippers. Also includes an opening seashell, empty barrel and a chest for storing the smaller accessories included with this set.\n\nLEGO® xtra Sea Accessories set includes a surfboard, opening shell, barrel, oar, harpoon, opening chest, treasure map and binoculars, plus shark, parrot and fish figures and a selection of LEGO elements.\nBring new ocean-themed adventures to existing LEGO® sets.\nLEGO® xtra accessory sets are delivered in a sealed plastic bag."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/sports-accessories-40375","description":"Kids will love this action-packed LEGO® xtra Sports Accessories Set (40375). This fun playset includes an array of LEGO sporting equipment, including hockey sticks, goals and a puck, roller skates, a buildable archery target and bow, skis and ski poles, minifigure helmets and a trophy element to inspire hours of competitive play. Creative youngsters will be thrilled with the chance to introduce some sporting fun and adventures to their existing LEGO sets.\nKids can recreate the excitement of several cool sports with this LEGO® xtra Sports Accessories set, which features buildable equipment for hockey, skiing, roller skating and archery, plus a trophy for the winner!\nThis awesome set is suitable for both solo play or competitive sporting fun with friends, and immediately opens up a world of exciting new play options when combined with other LEGO® sets.\nA wonderful birthday or Christmas gift for kids aged 6 and up, this 36-piece construction set comes with easy-to-follow instructions so young builders can assemble it with speed and confidence."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/xtra-chinatown-40464","description":"Add a Chinatown theme to any LEGO® set with the LEGO xtra Chinatown (40464) collection. There’s a hanging lantern, stone lantern, portable lantern, buildable bamboo, red fence elements, a box with 3 toy fireworks and a round table with a teapot and teacups. An inspiring selection of accessories for imaginative Chinatown-themed LEGO adventures.\nThis LEGO® xtra Chinatown (40464) set includes a hanging lantern, stone lantern, portable lantern, box of 3 toy fireworks, bamboo, red fence elements and a round table with a teapot and teacups.\nBring a Chinatown theme to any LEGO® playset with this 35-piece construction set, complete with easy-to-follow instructions for younger builders.\nA wonderful Christmas, birthday or any-other-day gift for LEGO® fans, aged 6 and up."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/xtra-food-40465","description":"Here’s an exciting set for kids who love to serve up yummy LEGO® treats. This LEGO xtra Food (40465) playset is packed with fun food accessories for imaginative play. There’s a toy stove with a pot and frying pan, 2 fried eggs, baguettes, hotdogs, pretzels, melon slices and bananas. And with ketchup and mustard elements, plus 2 plates and 2 glasses for serving hungry customers, there's endless foodie fun on the menu for creative kids!\nThis LEGO® xtra Food (40465) set includes a toy stove, pot, frying pan, 2 glasses, plates, fried eggs, baguettes, hot dogs, pretzels, bananas and melon slices, plus ketchup and mustard elements.\nBring a fun food theme to any LEGO® playset with this 36-piece construction set, complete with easy-to-follow instructions for younger builders.\nA wonderful Christmas, birthday or any-other-day gift for LEGO® fans, aged 6 and up."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/lego-xtra-brick-stickers-853921","description":"Bring extra-realistic details to your LEGO® creations with this new-for-January-2019 LEGO xtra 853921 Brick Stickers set, featuring 5 sticker sheets with a huge choice of town-style stickers, such as clock faces and road signs, plus a selection of cool LEGO elements to get your town started.\n\nFeatures 5 town-themed sticker sheets, plus 12 LEGO® town starter elements.\nEach sticker sheet measures over 5” (14cm) long and 5” (10cm) wide."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/bicycles-40313","description":"Strap on your bike helmet and hit the road with the speedy LEGO® xtra 40313 Bicycles pack! This set of items features 2 different bicycles with lights and kickstands and a skateboard, plus 2 bike helmets, a ball cap, letter, pizza box, umbrella, a backpack and 2 bike racks. Combine and use the LEGO xtra accessories with any LEGO sets, to enhance children's play in any way they can imagine.\n\nThis fun pack features 2 bicycles with lights and kickstands, 2 bike helmets, 2 bike racks, a skateboard, letter, pizza box, umbrella, ball cap and a backpack.\nLEGO® xtra packs are compatible with all LEGO sets."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/traffic-lights-40311","description":"Add some order to your city streets with the awesome LEGO® xtra 40311 Traffic Lights pack! This set of items includes 4 buildable traffic lights, plus a wheelbarrow, trash can, broom and trash elements. Combine and use the LEGO xtra accessories with all LEGO sets, to enhance children's play in any way they can imagine.\n\nThis fun pack features a wheelbarrow, broom, trashcan with lid, 2 leaves, bottle, banana and 4 buildable traffic lights.\nLEGO® xtra packs are compatible with all LEGO sets."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/lego-4x4-brick-magnets-classic-853915","description":"Add a splash of color with this LEGO® Iconic 853915 4x4 Brick Magnets Classic set, featuring 4 LEGO 4x4 brick magnets in classic yellow, red, green and blue colors. Attach them to your fridge, locker or any other magnetic surface to bring some classic LEGO magic to your home.\n\nFeatures a set of 4 classic-colored 4x4 LEGO® brick magnets in yellow, red, green and blue.\nAttach them to your fridge, locker or other metal surfaces.\nBring a touch of classic LEGO® color to your home!\nEach magnet measures over 1” (3cm) square."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/streetlamps-40312","description":"Shine some light on your city streets with the fun LEGO® xtra 40312 Streetlamps pack! This set of items features 2 tall streetlamps, 2 shorter lamps, a lantern, newspaper stand with paper, trash can, camera and a bench. Combine and use the LEGO xtra accessories with any LEGO sets, to enhance children's play in any way they can imagine.\n\nThis fun pack features 2 tall streetlamps, 2 shorter lamps, a lantern, newspaper stand with paper, trash bin, camera and a bench with phone.\nLEGO® xtra packs are compatible with all LEGO sets."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/road-tape-854048","description":"LEGO® fans will be thrilled to stage exciting action and races with this cool Road Tape accessory set (854048). Roll out the grey tape featuring road markings, tire skid marks and grass effects, and kids can create fun stories with it and 8 elements, which include a speed sign, traffic cones, traffic light and moped. The set can be combined with other LEGO® sets, so kids can race all their vehicles along the tape.\nYoung builders have all they need to stage actions scenes and races on the road with this cool accessory set featuring a road tape and 8 elements.\nThis is an awesome birthday or Christmas LEGO® gift to inspire kids aged 6 and up to use their imaginations, and comes with simple instructions to quickly get the show on the road.\nThe tape measures over 3” (8cm) wide and can extend to as much as 15m (49ft) long; more than big enough for LEGO® fans to stage stories and thrilling races on the road."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/water-tape-854065","description":"LEGO® fans will love bringing the sea to life with this awesome Water Tape accessory set (854065). Roll out the blue tape, featuring ripple and wave effects, and kids can immediately create fun stories from the sea with it and 10 elements, which include a frog, fish, crab, seaweed and raft. Imaginative youngsters will be captivated for hours.\nYoung builders have everything they need to stage fun stories from the sea with this cute accessory set featuring water tape and 10 elements.\nThis is an enchanting birthday or Christmas LEGO® gift to inspire creativity in kids aged 6 and up, and comes with simple instructions to help quickly kick-start the role-play fun.\nThe tape measures over 3” (8cm) wide and can extend to as much as 15m (49ft) long; more than big enough for youngsters to play out adventures from the sea."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/food-accessories-40309","description":"Play in new and yummy ways with the fun LEGO® xtra 40309 Food Accessories pack! This set of items features a range of foods, including a turkey, croissants, ice creams, fruits, vegetables and different sweet treats, plus a crate and money bills. Combine and use these LEGO xtra accessories with all LEGO sets to enhance children's play in any way they can imagine.\n\nThis fun pack features 30 food accessory elements, including a crate, turkey and 2 each of chicken legs, fish, ice creams, grapefruit slices, bananas, croissants, carrots, money bills, cookies/muffins, chocolate bars, broccoli and cups.\nLEGO® xtra packs are compatible with all LEGO sets."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/botanical-accessories-40310","description":"Bring nature landscaping to life with the fresh LEGO® xtra 40310 Botanical Accessories pack! This set of items has a garden-related theme, featuring trees, plants, fencing and colorful buildable flowers. You can also combine and use them with all LEGO sets to enhance children's play in any way they can imagine.\n\nThis fun pack features 24 botanical-themed accessory items, including trees, plants and bushes, fencing rails, leaves and buildable flowers.\nLEGO® xtra packs are compatible with all LEGO sets."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/road-playmat-853840","description":"Stretch your imagination and playtime with the help of this LEGO® xtra 853840 Road Playmat pack, featuring 2 laminated, double-sided playmats with printed graphics, 2 buildable connectors and a shovel play-starter element to do some digging on your roads. The double-sided pieces let you create 4 different settings. Combine and use the LEGO xtra accessories with any LEGO sets, to enhance children's play in any way they can imagine.\n\nFeatures 2 laminated, double-sided playmats with printed graphics, 2 buildable connectors and a shovel play-starter element.\nPlaymats each measure over 9” (25cm) square."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/sea-playmat-853841","description":"Expand your playtime to the beach with the help of this LEGO® xtra 853841 Sea Playmat pack, featuring 2 laminated, double-sided playmats with printed graphics, 2 buildable connectors and a crab play-starter element. The double-sided pieces let you create 4 different settings. Combine and use the LEGO xtra accessories with any LEGO sets, to enhance children's play in any way they can imagine.\n\nThis pack features 2 laminated, double-sided playmats with printed graphics, 2 buildable connectors and a crab play-starter element.\nPlaymats each measure over 9” (25cm) square."},{"theme":"xtra","themeUrl":"https://www.lego.com/en-us/themes/xtra","productUrl":"https://www.lego.com/en-us/product/park-playmat-853842","description":"Take a break in the park with a little help from this LEGO® xtra 853842 Park Playmat pack, featuring 2 laminated, double-sided playmats with printed graphics, 2 buildable connectors and a snake play-starter element. The double-sided pieces let you create 4 different settings. Combine and use the LEGO xtra accessories with any LEGO sets, to enhance children's play in any way they can imagine.\n\nFeatures 2 laminated, double-sided playmats with printed graphics, 2 buildable connectors and a snake play-starter element.\nPlaymats each measure over 9” (25cm) square."}]